{"reviewTitle":"Great TV for the price!","reviewDescription":"I needed a second TV for my living room and I wanted one around 40 inches. This TV is excellent! This TV is full HD, not LED. LED TVs show the picture on the screen the same from any angle. HD tv's tend to fade the picture on the screen as you watch it from other angles. So when I start to walk away from the TV and look back at the picture, it looks almost whited out. But sitting right in front of it, it's excellent picture and sound quality. Plus it's Samsung! I highly recommend this TV!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1709510400000}
{"reviewTitle":"Great Product","reviewDescription":"Bought this as a gift to my Grandson & He loves it for his room.Works great ,good picture & sound","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"Best TV ever!","reviewDescription":"This is the best TV I have ever owned. I can add all my streaming services to it without having to buy a fire stick, it comes with a ton of free channels, the color and picture are very clear and the price was extremely fair. Highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Great Monitor for My PC!","reviewDescription":"I bought this as a computer monitor for my Windows 10 PC and the image is excellent!  However, here is a longer-than-necessary note about a BIG negative experience I initially had, thinking (mistakenly) that it was the fault of this TV.  Several days ago I was shocked to discover that whenever a typical alert happened on the computer such as \"printer out of paper,\" etc., there wasn't just a little chime that emanated from the TV, but an ear-splitting blast of sound!  I've never experienced this before.  My ears actually hurt from the sound blast.  Looking for a solution online, my search brought up the \"best\" suggestion which was to go to Settings > Sound > Expert Settings > Sound Feedback > OFF.  But... that did NOT shut it off.  Then, when I hit the MUTE button to temporarily eliminate the problem, there was an annoying SPEAKER SLASH icon that continual flashed on the screen.  Now, here comes my confession of folly, my big \"duh moment.\"  I finally checked the settings on my faithful PC and realized that, for some reason, my PC's audio setting had jumped to 100%.  I'm so glad I checked this because it had never been a problem with my previous monitor -- a 70\" Vizio that had to be replaced because of dying pixels that were creating large dark shadows.  SO... after adjusting the PC's audio settings, all is now PERFECT.  It's odd because I never tampered with the PC's audio settings.  Therefore, if you have this same problem of ear-splitting noise explosions erupting from your Samsung TV, maybe this story will provide your solution.","isVerified":true,"ratingScore":5,"reviewReaction":"46 people found this helpful","country":"United States","date":1663891200000}
{"reviewTitle":"I would definitely buy it again!","reviewDescription":"Great quality❤️","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"Easy set up","reviewDescription":"Good price for a spare room tv. WiFi works great and simple to set up.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Beautiful picture and quality sound","reviewDescription":"A picture is beautiful, the size, perfect and easy to understand all features with a little practice","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Extremely pleased with my new Samsung TV .","reviewDescription":"Good choice on my purchase. I Love my new Samsung TV and extremely pleased with the services received from Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"Advertised as \"USED\" but good as \"NEW\"","reviewDescription":"We bought this to replace an identical set that was damaged by our cat :-(  As it was advertised as a used (display) item missing the feet, I figured since it was the same model as our recently damaged set, I could just remove the feet from the old set and affix them to this one, and yes, that worked!  We also drilled a hole through one of the plastic feet and put a screw through it into the cheap table we use as a stand so it can't be knocked over again.  PURRRRFECT!!!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"TV","reviewDescription":"Entire screen was cracked upon arrival","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Nice TV","reviewDescription":"Picture is clean and clear. Sound is good. Setup was easy. Only 2 HDMI was a drawback, needed to purchase an RCA adapter.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"This is a newer model smart TV","reviewDescription":"I replaced a complete voice control Insignia TV with this Samsung TV.  I have to say that although the voice control did work on the other tv, it sometimes took two or three tries to get it to do what I wanted or to tune to the station I wanted.  This particular TV has numbers on the remote which at this point in time is still easier than voice control.  The picture is 1080p and is sharp and clear.  I only use it sometimes and so far it defaults to Samsung TV channels when you turn it on.  Would rather have it default to my cable channel connection and channels. Oh well, maybe I will have to read the manual.  Most of the Samsung TVs you see for sale are an older model from 2018.  This is newer and smarter.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1710547200000}
{"reviewTitle":"Samsung 32”","reviewDescription":"I replaced my old Samsung with this smart tv. The picture and sound are very good. The only problem I had was trying to get tech support. Somehow, when trying to register it, I pressed something wrong and my account went to a European country that put my first name and a random last name associated with my USA email address. Then I tried to fix it and got locked out. After 3 texts to support in which they said the wait time was 3 1\/2 hours because there were 514 customers ahead of me. After 5 hours, I gave up. The next day I waited hours again and support said they cannot handle anything in Europe. When I texted Europe, they never responded. So I contacted USA again and was told to call my cable provider. To register a Samsung product??!!??The problem with this is that I bought an extended warranty which is probably worthless without a registration.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"4 star tv, 1 star power cord","reviewDescription":"We have several Samsung tv's, and are happy with all of them.  This was the cheapest one we've every bought, and we can tell the difference.  It takes a second or 2 when you choose menu items or change channels, I presume from a lesser processor.  The sleep control is buried in menus, a nuisance since this is in our bedroom.  I had to go to the hardware store to buy screws for the wall mount bracket, typical.  The cord is only 4' long.  I had to go buy a short extension cord.  That's getting pretty chintzy, even for an entry model.  And more important, the cord does not plug in well.  We had trouble setting up the tv until we realized the cord was not making a good connection.  We had to tape it in place where it plugs into the back of the tv.  I don't think that's a common problem though, I didn't see it in any other reviews.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"Value for money","reviewDescription":"I have this TV in my office. Perfect size and the quality is just fine for my office needs.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Rv tv","reviewDescription":"The quality of the picture is nice set up was easy","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"SIZE","reviewDescription":"Tv is not 40\" as it says on box. It is 42\" and does not fit in cabinet","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"It's 36 inches","reviewDescription":"I like the quality but the size isn't as describedTape measure says 3ft","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Samsung Smart tv","reviewDescription":"The picture quality is excellent. Navigating using the remote needs improvement. The tv has slow response time and the remote is small. If your fingers don't move as quickly as they once did this can be a problem. It is not the most user friendly tv I have owned and am still learning about all the features. For a low priced tv it is a good deal. Adding the DVD player was easy. I don't have all the channels that were on the old Samsung but it comes with a built in menu guide with many channels. Directions that came with it were very basic.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Ok","reviewDescription":"Very good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"I hate this tv","reviewDescription":"If I had known what I know now when I first purchased this TV, I would have slapped myself silly.I don't like this TV at all. There are too many buttons on the remote which means you accidentally hit what you don't want instead of what you do wish to have. The TV itself it has limited customizable ability. While you do get some free TV channels through the Samsung TV plus option and they're on the guide you can unselect \/ delete channels of stuff you've never going to watch. I don't speak spanish, I won't be watching any of the Spanish speaking channels for example.I strongly dislike the fact that I am stuck with apps for channels that I will never watch, that I will never pay for. I cannot delete these, as they are \"basic default apps \/ channels\". This is my TV I should be able to control what is on it. I've had other smart TVs, different brands allow me to customize 100%. This option is a joke. Also in the advertisements when I purchase the TV, it advertised that I can speak commands into my remote to do things such as change channel, volume, etc. B*******! One of the selling points that I was interested in reasons I bought this particular TV was for that option. It does not exist! They make you sign up for a Samsung account, nothing new there, everybody's got to know your business.But it does nothing! Nothing!! All it does is allow you to log in on the stupid TV. This is a joke, $250 f****** joke! I have never in my life wanted to drop kick a TV brand new out of the box so freaking bad as I want to with this one. I hate this TV! I hate the remote that came with it. I don't need 50, 000 buttons on a remote!Navigating features on this TV, like getting to settings or to the app section is a royal headache. Samsung needs to take this TV and put it where the sun don't shine. What a rip off!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1651104000000}
{"reviewTitle":"Go Bigger for a Better Set","reviewDescription":"All about this tv was OK until we tried to connect to streaming. Its memory was  limited and extremly slow to load. For non-streaming, seems to be an ok \"second\"  set .For a primary, we had to go bigger to a Samsung  43-inch which works great. Also the legs were flimsy and holes were hard to match to attach them. Picture and sound were good, but not so much otherwise;","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"BAD connectivity issues BRAND NEW","reviewDescription":"** Buyer Beware ** Update: 10\/2023 I am still have connectivity issues. Everything is correct and the tv will just not connect. Eventually, days later, sometimes a week it will start working again only to disconnect randomly and start its BS again.—Four months from date of purchase and I have already had multiple issues with wi-fi connection. I have ZERO issues with any of my other devices including another older model of this same tv. It will be connected and then just disconnect and not reconnect no matter how I trouble shoot. Of course I am past the return window.Buyer beware.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"DIFFICULT TO SET UP, DIFFICULT TO CONTROL","reviewDescription":"This is the least satisfying purchase I've made on Amazon since its inception. I purchased it because of the large number of 5-star reviews. Frankly, I don't get it. The TV arrived with the wrong remote, was difficult to set up, and is the least manageable TV I've ever owned. Its search capability gets a big fat F. When you do bring up a few options, you have less than 3 seconds to make a choice before all the options vanish from the screen. The remote is ridiculously complicated and hard to use. Most remotes have a single marked button for PAUSE (click it once to pause and a second time to un-pause). This remote require the use of 2 keys to do the same job. I could go on and on about the endless problems with this TV. The first week I had it I had to spend $130 on technicians to come out and resolve issues. Despite all the positive reviews I would NOT recommend this TV.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1682467200000}
{"reviewTitle":"So difficult,  no manual","reviewDescription":"I bought this TV because I like my Samsung phone and with my LG flat screen TV I am able to screencast straight from my phone onto my LG TV with no hot stick no fire stick or anything else just the phone and the TV I thought for sure that a Samsung TV would have the same feature since it was a Samsung phone I was working from but this new TV does not even have that feature also they don't tell you in the reviews this TV is several years old and is mediocre picture best, disappointed and would probably not buy again","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691971200000}
{"reviewTitle":"Not the Size","reviewDescription":"This tv is 29” wide and 17” in length but advertised as a 32” television. Diagonally it is 31.5”. I bought this because it is to fit in a specific place in the RV that is made for a television. This is even too small for the RV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Manufacture warranty is a fiction","reviewDescription":"The tv did work for rlrvrn month, later failed. I did call warranty and was advised to do several adjustments and connections. None worked after several trials. Samsung advised me to ship the tv to them and pay return shipping cost, if fixed. An alternative was to buy much more expensive replacement ( about $600) with 20% \"reduction\" . So much for the \"warranty\" -- do not believe in promise. The additional warranty did not apply since the failure did happen before one year anniversary!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Picture quality is washed out.","reviewDescription":"Price was right but still experimenting with picture quality options to possibly enhance the color richness of the picture.  It, so far, washes people's skin tone out to a bleached, pale white appearance.There are 4 picture quality options, but none have remedied the problem.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700611200000}
{"reviewTitle":"The feet are terrible, the picture too.","reviewDescription":"The little feet are very hard to install because you hade to blindly drop the screw into hollow bottom of foot. Then, no matter how hard or continuous you screw, they never tighten up. I have put together many things and these were useless. They spray out too so not great w limited space.  BUT, the WORST part was the picture. I did not expect a lower end TV to have OLED appearance, but the lack of clarity and using any of picture types (there are three) was astoundingly bad! The old Samsung we were replacing had WAY more brightness and clarity. No matter what we tried in balancing it out with all the other adjustments it had did nothing. It is a terrible TV. We only got it thinking a bigger screen that had more state of the art features would be nice for our mom. Forget this TV. It is worse than ancient ones. Like 70s.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1678579200000}
{"reviewTitle":"SOUND SOMETIMES BLASTS & REMOTE IS TOO SENSITIVE","reviewDescription":"This replaced a Samsung I had and loved for several years. Unfortunately, the newer version occasionally blasts the sound when I turn it on. Not good in an apartment building. I have to unplug the TV for a minute or two and plug it back in. The remote is way too sensitive, and will sometimes jump many channels when I only want to go one or two. Too late to send the TV and remote back. Purchased in May 2023; replacing it December 1, 2023.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"The Remote kills this TV","reviewDescription":"Setup for this TV is an unbelievable pain. It's a TV. Why complicate a simple device? Every time I turn on the TV, I get Gorden Ramsay and kitchen nightmares. Why? It is not desired by me. Other TVs present a menu. This does not. Starts a show running and takes a long to to stop it. When it does stop, I'm in slow motion Samsung TV streaming. I'm missing the old tube TVs. Once on, they worked without a myriad of issues.The remote's buttons are small. It reacts slowly to input. Pressing a button on the remote often cause double and triple input. Especially noticeable when scrolling. I can't tell if the remote recognize the button I pushed or not which creates problems not expect with a TV set. In short, I hate everything about this TV.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1711670400000}
{"reviewTitle":"It was a nightmare or so it seemed !","reviewDescription":"I gave it three  because the Samsung setup drove me nuts. Why do I need an account with Samsung?It started off OK but slowly turned into frustration. I plugged in the Name and Password for mi internet Wi-Fi and it started downloading something. In a few minutes  I thought it was finished downloading  what it needed  and s I started filling in the prompts .It was weird sometimes  I would have to retype for some reason or other but eventually  I thought I was done . But no  Samsung wanted me to go to some website and prove I was a real person I guess. The link they gave me didn't work so I tried  a few different web browsers thinking maybe my favorite browsers  were the problem. That wasn't the problem. It turned out the link the gave me had a few extra characters. Once I removed them I was able to get to the website.  At the website they asked me for an email  and they sent me a code . and I had to type them  in my TV.Well I never  ever got a Samsung code I kept asking for new codes never received one.  After all that my wife all of sudden said  \"\"I got a picture\"\"  Things got a little bit better after that.My wife and I spent  a good three hours with the TV just to get our cable channels  This is my third 32 inch Samsung  TV The first two were fine this one was a hair puller. .I was  just about ready to return it when TV started working.  I never did finish setting up that Samsung account but the TV is working fine. I don't know for sure but I think I after connecting to the internet and let Samsung just download  the updates or whatever I think the setup would have gone a lot easier.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"Wants too much information","reviewDescription":"Typical Samsung, they want you to give up all control to them in order for you to have a smart tv.  Really bad.  I cannot obtain apps for PBS Passport or Britbox without agreeing so I do not have any additional apps that did not come bundled like Netflix and Prime.  My Amazon Fire Insignia, owned by Bestbuy stopped captioning after 13 months so I tried this Samsung.  I require captioning for my deafness, so it is a big deal.Stuck with sucker.  I had to add a optical converter to be able to use headphones, since this model does not have a headphone jack, but it does have an optical jack.  Overall, not happy with unit.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"TV great. Remote sucks","reviewDescription":"This tv does not have the standard Samsung remote.It is a worse remote than the hotels I stay at when I travel for work.My biggest complaint is you have to press 11  buttons to set it to turn off after you fall asleep.It is quite the sequence and the surrounding buttons are sensitive and commonly get pushed during the process.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Resolution - Bluetooth Not Showing Up & WIFI Not Working\/WIFI Cutting In And Out","reviewDescription":"Resolution - Bluetooth Not Showing Up & WIFI Not Working\/WIFI Cutting In And Out:After updating software, resetting the tv, network settings, and infinity router more than 10 times each, trying to get this to work, and doing other things, like unplugging power for 60 seconds, and holding power button down at the tv, and NOTHING WORKED! I found an amazon review, that talked about how these tvs have issues because they were programmed or whatever in another country...They said the factory reset worked for them, but it didn't for me. I'd seen other people talk about resetting the tv through a special hidden service menu, and I did that many times as well, but nothing worked. Anyway, while looking at the special service menu, I thought I would try something, to see if I can get this tv “unstuck” from whatever country it was programmed in... I did the following steps.***For bluetooth issues, you can follow steps below, and under MRT OPTION, you will see BT SUPPORT, select it, and set this to ON, and you should see bluetooth speaker list show up under sound settings***-Turned off tv-Then push Mute, then press 1, then press 8, then press 2 on the remote (make sure the red power light at the bottom of tv blinks each time you push each button, so you know it is taking input)-Then I powered on tv-It takes more than a few seconds for the special menu to pop up, and lets you select entries (see screenshots to see what service menu looks like and setting changes I made)-I selected OPTION, then went down to MRT OPTION, then selected Region, and changed it to KOR (all this will be done with the arrow buttons on remote, the middle button and return button)-Also, under MRT OPTION, I went to NETWORK SUPPORT, and set it to wifi_int_only (I don’t know if this helped but I figured if I set to wifi only, that it might also help get it “unstuck”)-I powered off tv, and then back on and checked wifi settings, and of course it wouldn’t pickup anything because it was set to wrong REGION-I powered off tv, and pressed the MUTE, 1, 8, 2-Went back in and changed REGION back to USA and NETWORK SUPPORT back to wifi_int-I powered off tv and back on, and mine picked up my wifi right away; if yours doesn’t just go in and set to wifi and all should work***BTW, If you are like me, and turn off your wifi router at night, make sure to turn it on and let it get its connection, before turning on tv, or else, you may have to go through steps above again, setting region to kor, etc! It's happened to me twice, so i just turn on router, let it get its connection and then tv works smoothly***","isVerified":true,"ratingScore":3,"reviewReaction":"60 people found this helpful","country":"United States","date":1663718400000}
{"reviewTitle":"Good picture but lacks enough hdmi ports","reviewDescription":"The TV is good: it has a good picture quality and adequate sound.  I gave it three stars for two reasons: the feet need to be either heavier or wider for better stability and the unit lacks enough HDMI ports.  I have a VCR and cable receiver box that are plugged in but I need another port for the sound bar.  There is room; not sure why it did not include three ports.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Not intuitive, not good for cable","reviewDescription":"Too difficult to find and keep setting for cable TV. Would like easier language choice, want English not Spanish. How to find selection button. No voice control in remote. Now using two remotes-one for TV one for cable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Good Picture - Cumbersome Firmware","reviewDescription":"This TV is good for the price .  The picture quality is very good, not great, but definitely acceptable for the price point.  The Audio is clean also, I use a sound bar, but it is nice to have decent audio within a TV this small. If not for the imposition of Samsung to force the \"smart\" features upon me, I would have given it another star.My biggest complaint about this TV is getting through the setup.  I don't want yet another smart phone app nor do I want the packaged SAMSUNG bloatware.  I use the TV with a ROKU, I wanted to hook it up to HDMI and be done with it.  I don't want yet another interface or any of the SAMSUNG Apps and I wasted 30 minutes figuring out how to bypass all that.It comes with Smart Hub defaulted to on but it is not obvious.  So every time you start it it asks you to agree to terms and conditions even if you disable the network by skipping past that.  It really tries to get you to connect to the internet.  Seems to be pretty \"smart\" when it makes business sense but not so much for the user.  A TV should first be a TV, if people want the \"smart\" features, they should be given a choice to setup that way.I do like that the remote has a source selection button.  Once you get past all the setup inconvenience and you disable smart hub from starting each time, you can use it as a TV and quickly switch between input sources .  Newer versions of SAMSUNG and other TVs make you go to the menu to select your source which takes too much time.I don't know why SAMSUNG (and others) offer an abundance of streaming channels with poor content.  I don't see this as profitable nor useful.  As a user I want to quickly find quality content.  I think manufacturers should package ROKU or Fire Stick and standardize content management vs. inventing their own.  I believe it would save on overall cost and simplify navigation for users.  Numerous content managers is adding too much complexity and I think this is a case where open competition is adding to overall cost and decreasing efficiency.","isVerified":true,"ratingScore":3,"reviewReaction":"33 people found this helpful","country":"United States","date":1671148800000}
{"reviewTitle":"VESA screws are M8 and 20-21mm long; UPDATE: NO SLEEP BUTTON ON REMOTE!","reviewDescription":"UPDATE: Everything seemed fine until I went to settle down for the night and discovered that there's NO SLEEP BUTTON ON THE REMOTE for this Samsung 43\" TV! I think they're giving up space for useless app buttons that would be much better served with a sleep button. Downgraded rating to a 3 because of this one thing. The sleep function is buried waaay into the menu, and when you're drowsy and want to re-set it, you'd have to wake fully in order to get through the menu. Very, very bad design. Sadly, it seems that most of the manufacturers of 43\" TVs (I don't know about larger ones) have abandoned the sleep button, so I haven't been able to find any alternatives. Fortunately, I saved the remote from my old Samsung TV which DID have a sleep button, and it works--not as nicely as it did with the older TV--but it does at least get you down to the sleep function of the TV without having to drill down through the menu. The Samsung Store on Amazon has a universal Samsung remote that's supposed to have a sleep button on it (the picture doesn't show one). So I ordered it and we'll see if it has the sleep button and if it works with this new TV. Very disappointed that this one item could downgrade an otherwise great TV.-----------------------------------We purchased a swivel table mount for this TV, and the VESA screw holes are really big--so much so that the table mount didn't come with screws that large. Picked some up from the hardware store, but couldn't use any washers because no washer will go around the screw and still fit in the hole on the back of the TV. It's not a deal-breaker, but I'd have preferred to put the washers as well.As far as performance, I've been buying Samsung TVs for years and have always been pleased. I expect to be the same with this one.","isVerified":true,"ratingScore":3,"reviewReaction":"21 people found this helpful","country":"United States","date":1681776000000}
{"reviewTitle":"Great picture. Poor design on stabilizers that hold the TV up","reviewDescription":"Great picture. Fair sound quality.  The cheap plastic feet were difficult to attach. The tiny screws through  a long slot. One side could not be secured tight enough  to hold the TV. The TV is now held up by books!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Great customer service!","reviewDescription":"Have been using it for only 2 days and it's working fine. I very much liked that Samsung has free customer service to help me get started. I didn't understand what to do to get the TV running, but they helped step by step. And when I called, the wait time to get help was not long! Because of the good reputation of Samsung and their great service, I will buy Samsung again!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Great option for Cable Cutters !!!","reviewDescription":"When my TV provider wanted to increase my already high monthly bill ($249) by $20, I decided to cut the cable. But, I needed to buy a couple smart TV's that have internet connectivity. These Samsungs are great for the bedrooms. Excellent picture and they will pay for themselves quickly, because my streaming bill is $118 \/ month. Very impressive quality and features for under $200.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"A Solid, Simple Telly","reviewDescription":"I need to mention the first time we got it, I can only assume some clown tried to steal the new TV we ordered and gave us a completely broken, used, different (smaller) sized TV in a box advertising what we ordered. But the box even looked worn. And even the parts, like the legs you have to screw on were all different.Thankfully we have good experiences with Amazon customer service. So aside from that experience and upon receiving the true Samsung 40 in, I *really* like it. I have always been a 100% LGTV buyer. And maybe all brands have this feature now, and I’m behind, but they have this Samsung TV Plus feature and it’s like free built-in cable. But it’s not regular cable, which to me is the worst. It’s very nuanced channels, like one channel seems to just play old Baywatch episodes. There’s a Bob Ross channel. They have 3-5 crime channels, and they play the best of true crime from 80s- early 2000s, such as Forensic Files, the original Unsolved Mysteries, The New Detectives. The commercials are quick or there is just silence with a “we’ll be right back” image. This is so up my alley. I hope it always has this feature.Also it’s easy to connect to all your other streaming accounts","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1627430400000}
{"reviewTitle":"works good","reviewDescription":"nice tv","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Well worth the money","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1701561600000}
{"reviewTitle":"Samsung smart tv","reviewDescription":"This is easily the best smart tv on the market","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"Excellent","reviewDescription":"Quick delivery, excellent picture.  Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"product as advertised","reviewDescription":"whether it's buying, canceling, returning, or service, you can't do better than Amazon.Amazon should change its name to AMAZING","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"Awesome TV","reviewDescription":"Love this tv- picture quality and the free Samsung tv channels are good. Just wish it had msnbc channel.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Works great as advertised!","reviewDescription":"Works great as advertised! Recommended","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Smart TV","reviewDescription":"I needed a new TV because my old one didn't have streaming capability. It's very nice and has a great picture. I can stream all I want.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Good purchase!","reviewDescription":"I'm using this unit as a monitor for my PC ... overall pleased with the results!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"#1","reviewDescription":"The only thing is no sleeep timer, other than that best set I have had.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"A real quality small room tv for the money","reviewDescription":"Samsung delivers on a bedroom or office smart tv for a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Fits the space I have","reviewDescription":"Good picture quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Good buy for the money","reviewDescription":"Used in a guest room. Has a good picture.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Great tv","reviewDescription":"The sound and picture quality is great.  Samsung makes a great TV.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Excellent Picture Quality - SMART TV Connects to WIFI Internet","reviewDescription":"Was concerned about obtaining a sufficient Internet connection. After plugging in a WIFI extender in the room, SMART TV work very well.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"I Can See Clearly Now","reviewDescription":"Good television simple good price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"Samsung tv","reviewDescription":"Beautiful,bright picture.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Not happy , pitcher is good  , now tv  goes black screen?","reviewDescription":"It’s a nice little TV lightweight which is really good because I fractured my back and it’s movable easily except the HDM and other slots to put other components on there are only two ports. The reviews on the control part was that most everyone did not like the controls. I kind of agree.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"To sensitive","reviewDescription":"Like it the only thing it’s to sensitive the on  off buttons it shut off continuously even if you barely touch it","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Great Picture, Terrible Sound Quality, Poor Quality Stand\/Feet","reviewDescription":"The picture quality is wonderful, and it has perfect color balance without having to adjust it yourself. Setup is a breeze as it does everything for you. Remote works well. The price is a bargain and it arrived early and in perfect condition.The drawbacks:Imagine the sound of grandma's old single speaker 1950s tabletop radio she kept in the kitchen. This TV sounds similar, but not as good. It's tinny and weak, even at full volume. We tried all the fixes and none of them worked. I enjoy the nostalgia of vintage electronics, but not in a brand new TV. Solution: We will purchase a sound bar or speakers for it. Second problem is with the stand\/feet. They're made of flimsy plastic and poorly designed so that every time you so much as breath near the TV it pitches forward. Solution: For a temporary fix we duct taped the feet down to the console table until we can order a stand for it.If you're going to buy one of these, order a stand and the sound bar or speakers at the same time. At this price, it will still be a bargain.","isVerified":true,"ratingScore":4,"reviewReaction":"42 people found this helpful","country":"United States","date":1670889600000}
{"reviewTitle":"About as good as it gets.","reviewDescription":"The sound is a bit quirky. LOUD sometime on power up.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Good solid TV with lots of features!","reviewDescription":"Solid Samsung TV with plenty of smart features. Have been able to connect my PC \/ Mac and phone to it for streaming. Already has the important apps like Netflix, Apple TV, Hulu, Alexa.. was really easy to connect and go with it.","isVerified":true,"ratingScore":4,"reviewReaction":"19 people found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"Update;Old Samsung problem Wi-Fi won’t stay connected or hangs","reviewDescription":"I have to update my review on this TV. I had to literally unplug it several times because I kept losing the Wi-Fi but for some reason it just stopped happening. And it was not my Wi-Fi because I would always verify it was not my router that went down. I am Not a technical neophyte. 😁This is the second Samsung TV that I have bought that has a Wi-Fi problem. Do not buy Samsung smart TVs if you wish to use the Internet Wi-Fi. And of course now that I’ve noticed it it’s past 30 days to return .Update: I spoke to Samsung customer support and he asked me to do a soft reset of the TV. By that he meant for me to leave the TV on and unplug it and leave it unplugged for 30 seconds. I did so by unplugging the plug from the TV itself, waited 30 seconds and plugged it back in. My apps that were hanging are no longer hanging. I will see if this happens again. If I have to do this very often I will be calling them back.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1664150400000}
{"reviewTitle":"Nice clear and bright picture, but I had a few niggles with the settings.","reviewDescription":"This tv has a good quality picture if you are looking for full HD.  I was glad to find it because I don't like the look of 4K tv pictures.  Too much detail doesn't leave enough to the imagination and makes everything look fake somehow.My problem with this tv was there wasn't any setting for changing the resolution down or up. And the output to a sound bar disable the TV;s sound control.  I had to use the sound bar control to change the volume.Maybe a better quality sound bar would link up to it better, but the one I bought with it had to be returned because it only worked for about 10 minutes.  It was another Samsung product that sounded great for 10 minutes, but then refused to power back on.  Maybe it got dropped in the mail and something came loose inside.The viewing angel on the tv is good and the tv itself has pretty good sound, but lacked bass.  That is why I bought a sound bar, because it had a remote wireless subwoofer.  But that didn't work out.","isVerified":true,"ratingScore":4,"reviewReaction":"26 people found this helpful","country":"United States","date":1663372800000}
{"reviewTitle":"Nice flatscreen.","reviewDescription":"This pretty much does everything I need it to do and it is the perfect size for my environment.  The only minor drawback: no Bluetooth or audio out.  So the built in speakers are the only way to listen to it.I use YouTube, Amazon Prime Video, Netflix, Apple TV, PLEX and the USB port on it.  I also use the wired Ethernet on it.I am extraordinarily happy with it.","isVerified":true,"ratingScore":4,"reviewReaction":"18 people found this helpful","country":"United States","date":1680307200000}
{"reviewTitle":"Sound","reviewDescription":"Nice tv for a bedroom. Sound needs improvement.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"TV does a fine job, just don't be in a hurry to do it","reviewDescription":"I've had many Samsung TVs and we bought this one for use as a lobby display. The only thing it needs to do is mirror a computer's screen for an ongoing, looping presentation. It took three firmware updates before the option to connect finally appeared, and since then it has worked normally. The screen quality is just fine for this use and we don't use any audio so I can't comment on that. The Smart Hub works well enough, but seriously, have a calming cup of tea with you while doing the setup. It is SOOOOO SLOOOOOOWWWW. Menus respond slowly, apps launch slowly, remote connections start slowly, etc. That said, it's a decent deal for the price, just remember to put in all available firmware updates to enable key features, and be patient with it.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1651622400000}
{"reviewTitle":"Not blue tooth compatible","reviewDescription":"Great picture fair sound not bluetooth compatible totally disappointed","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"Minor issues","reviewDescription":"Was initially hesitant about purchasing this tv because of all the negative reviews but have had two Samsung tv's and they have both been great.  The remote leaves a lot to be desired as the buttons are small and still haven't gotten used to it after 5 weeks. The apps are small and difficult to read. The picture is great now but took some time to get it right. The blacks were to dark and made the whole picture look dark. Almost sent the tv back because of this. The secrete turned out to be finding the control for adjusting the white balance, which wasn't listed with adjusting the brightness, contrast etc. You need to go to expert settings and scroll to white balance. Hope this review is helpful.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1651968000000}
{"reviewTitle":"Great TV Crippled by its Lack of Analog Sound Output Connector","reviewDescription":"TV has a good, vibrant 1920x1080 display with no dead or off-color pixels. Other resolutions not tested.My only gripe is the lack of an audio-out that would allow us to control our external speakers and subwoofer via the TV's volume control. The manufacturer must surely know that this size TV is generally too small for modern living rooms, where digital-input audio equipment is most likely to be found. In our home, this TV is wall-mounted in the kitchen where there is no room for a digital-to-analog converter.I just never imagined that a TV without \"speakers\" connectors would be sold, so I didn't check for that before buying it. My bad. (I also have a new computer with no diskette or CD-RW\/BluRay drive for exactly the same reason.)TL;DR: Buy this if the crappy internal speakers is OK with you. Otherwise, pick another TV.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1646956800000}
{"reviewTitle":"Volume problems","reviewDescription":"The volume is erratic. Sometimes when first turned on the volume needs to be adjusted way above normal settings, and sometimes when turned on the volume is so loud I expect the speakers to 'blow!'I called for assistance and they just said to unplug for a few minutes. That worked, but did not solve the problem, lonhterm.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1679184000000}
{"reviewTitle":"a most miserable remote control","reviewDescription":"It is an older make smart TV...remote is abominable.  Control buttons are small, way too close to each other.Navigating through the TV menu is tedious to say the least.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1687219200000}
{"reviewTitle":"Good TV, but…","reviewDescription":"Good TV , but no Bluetooth!","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"Lasted less than a year","reviewDescription":"Bought this TV from Amazon in April 2022.  Died in February 2023.  It was made in Viet Nam in October 2021.  Samsung said it was out of warranty, and it would be cheaper to replace as opposed to repair..  Until it died it was a great TV.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1675987200000}
{"reviewTitle":"Great TV. Lousy TV feet","reviewDescription":"I love this TV but disappointed in the TV’s feet. They are clearly not designed to be place a TV. I had to prior a book underneath to keep the TV a from falling forward.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1678838400000}
{"reviewTitle":"Overall Good Quality TV","reviewDescription":"The remote and the placement of certain buttons seems a little unnatural but overall it does what it needs to do. Occasionally I do find I have to press buttons more than once. If you're not easily annoyed it may not be too big of a deal. The TV I received actually is 36inches in total length (I had chosen 40in) which I found to be odd, but it was purchased to be used in my bedroom so the size is not a huge problem. I'm planning to buy a 50inch for the living room. Overall good quality. Good picture. It also dims into night mode if the lights in the room you're  in are dim or off so that's  a nice smart feature to have. Pleased with my purchase just surprised by the size I received. It's sitting on a stand that's about 59in.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1633651200000}
{"reviewTitle":"Finally a TV that works","reviewDescription":"I just threw out a Fire TV which was garbage from day 1 and Best Buy was no help at all in getting it fixed. This Samsung is doing a great job so far. It doesn't shut off after 15 minutes of viewing which is a huge plus when watching TV. The Fire TV shut down constantly no matter how many updates, and reboots I did.So if you like to watch TV for more than 15 minutes at a time, and you aren't looking for a lot of extra features, like Bluetooth, etc this TV is for you.","isVerified":true,"ratingScore":4,"reviewReaction":"29 people found this helpful","country":"United States","date":1666224000000}
{"reviewTitle":"Other brands are cheaper and eisier to use.","reviewDescription":"Excellent sound and image but you can only control the tv thru the remote and it is very ackward, you hit just one wrong buttom and you lose everything you had being doing before; I would not recommend to others. The saler was excellent everything arrived fast and in perfect condition.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1544140800000}
{"reviewTitle":"Great picture \/ terrible sound","reviewDescription":"Bought this for aging  Mother-n-law who is somewhat hard-of-hearing!.Couldn't make it loud enough, even at max volume for her to hear it -Returned it for a lesser manufacturer brand who had more \/ great volume .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1581465600000}
{"reviewTitle":"Beware sound was fine and now is bad.","reviewDescription":"What options are there for improving the sound, other than just replacing the tv itself?","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1637452800000}
{"reviewTitle":"It's a Samsung Need I say more","reviewDescription":"ok, I bought this tv some time ago and I had it on all night and it blew. It doesn't work anymore and I am so dissap[ointed that a Samsung broke so soon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607299200000}
{"reviewTitle":"Picture wasn’t as good as the same model I had 6 years prior","reviewDescription":"Disappointed that the same model from 6 years earlier was a better picture than this newer model.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1629763200000}
{"reviewTitle":"Nit my best purchase on Amazon","reviewDescription":"The picture quality is great! The on and off switch does not work 1\/2 the time I need to unplug it to reset. Need to find out about warranty.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1590364800000}
{"reviewTitle":"When it works it's great...","reviewDescription":"Recently started having an issue where I'll get the sound but no picture. Have to power cycle the unit to get a picture. Week past the return deadline means I'm stuck with it.","isVerified":true,"ratingScore":2,"reviewReaction":"103 people found this helpful","country":"United States","date":1539561600000}
{"reviewTitle":"The remote is awful!!","reviewDescription":"Just hate the remote… It has 1000 buttons and it doesn’t light up. Also having trouble getting the sound to go through my cable remote.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1598745600000}
{"reviewTitle":"Setup","reviewDescription":"Horrible to set up","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644796800000}
{"reviewTitle":"Don’t buy this TV","reviewDescription":"Terrible product!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649462400000}
{"reviewTitle":"Every picture profile except movie (which looks good to me) is total crap and not enjoyable to watch","reviewDescription":"I'm a truck driver so I have this up in my truck connected to my wifi Hotspot. Good picture, and I'm pretty picky about TVs. Vizio have crystal clear picture at this price range but Samsung has superior color in comparison. The picture only looks good on movie mode, it custom mode. Other than that though, it looks like total crap, like water color painting. Movie mode is very good though.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"Volume control problems.","reviewDescription":"I have had several instances of volume control failure resulting in either very high blaring volume or very low volume audio.  I will be contacting the Samsung service center.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1664841600000}
{"reviewTitle":"Lacks adequate picture color control.","reviewDescription":"Poor sound quality and picture color controls are inadequate.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1672444800000}
{"reviewTitle":"Disappointed with Direct TV Now on this Samsung TV","reviewDescription":"I purchased this Samsung TV because it lists built-in support for the \"Direct TV Now\" streaming app. I was expecting a more polished, seamless integration of streaming TV but discovered the app remains in beta on this Samsung device, and found it to be an inferior experience compared to \"Direct TV Now\" on an Apple TV. Specifically \"Direct TV Now\" was slow to load, slow operating, and the picture remained pixelated longer. Basic functions while operating the App do not intuitively correspond to the Samsung remote contributing to a confusing experience; pressing channel up\/down doesn't work (you press left and right arrows instead to change channels); pressing Guide instantly exits the app and presents the Samsung guide.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1550880000000}
{"reviewTitle":"It's OK","reviewDescription":"Great little secondary TV. We got this for my daughter's room. She is not much of a TV watcher, but occasionally she likes watching YouTube videos or Netflix. I figured this would be a better alternative to her watching videos on her phone or laptop,","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643760000000}
{"reviewTitle":"Not for Xfinity streaming","reviewDescription":"Be aware. This is a great deal on a TV, but it’s an older (2018) version and the software doesn’t support the xfinity streaming app.  You will still need a streaming device. Xfinity recommended Roku to me.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1648771200000}
{"reviewTitle":"Not the best Samsung TV I own... remote is overly complex and interface feels too complicated","reviewDescription":"I bought this TV for my mom because the Samsung I have at home is simple and has a very straightforward interface and remote.  THIS Samsung has a much less intuitive remote control, and that makes the user experience a bit harder.  Good value, but I wish it had a better remote!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632700800000}
{"reviewTitle":"Poor remote & more","reviewDescription":"Picture, auto dimming feature & volume good. Used as a bedroom tv; after changing settings for menu screens to dark I decided to keep, otherwise way too bright for nighttime use. USB input was high on my required list, but it does not play AVI files, some MKV files have no sound. Biggest disappointment is the remote: select button not easily distinguishable via Braille, buttons small & abundant. Menu & navigation is easy to mess up requiring a do over. Menu screens require multi buttons to ‘exit’ after selection. Sleep timer needs a 90 minute option (30-60-120-180). Disappointed but competition for this size TV with same options is nil.","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1558483200000}
{"reviewTitle":"No audio output jacks.","reviewDescription":"Speakers face backwards of course, so you want an external amplifier-speaker system.  This TV set is great in all respects except that it does not provide the demodulated audio  (typically pin jacks on the back panel) for that purpose.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1641945600000}
{"reviewTitle":"Underwhelming","reviewDescription":"The TV set up easily and quickly connected to my WiFi signal, but I find it very slow connecting to YouTube or YouTubeTV.  It streams slowly, thereby affecting the picture quality and causing frequent pauses.  I have two Sony tv’s which perform much better and have superior picture quality.  Samsung, I’m disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1628294400000}
{"reviewTitle":"Unless you have wifi, you don't have any smart features.","reviewDescription":"I bought this for my camper so that I had seamless connectivity with my Samsung smart phone. When camping we have to rely on cell towers to watch the news and get email\/internet There is no wifi when camping, non of the smart features I would have liked to have between the phone and the TV work. At least now I don't need any third party software to get the TV to go into screen mirroring instantly with the phone. That was 99% of what I was trying to achieve. The picture is poor. I bought a 32\" Phillips TV from Wal Mart for much less and it's picture and performance is way above the Samsung.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1607299200000}
{"reviewTitle":"WHat is Samsung think!","reviewDescription":"I am a long time Samsung fan and this tv was to replace and older Samsung 720I, my first one quit working after a couple of weeks, no picture or sound. I inquired about a replacement, which they did, however lied about shipping it back to me. I did my part and had it picked up in less than 24 hours, called and emailed the supplier that it had shipped, he told me that they would expedite the delivery, not! It took 5 days to receive and never sent a tracking number. As for the TV, I expected a great tv, but this one, like the other one, has a decent picture, not what I would call HD, the setup was very easy, the sound is fine. It is a disappointment and I should return this one and get a Sony.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1545350400000}
{"reviewTitle":"Poor quality","reviewDescription":"I had a Samsung Smart TV that was hit by lightning.  I replaced it with what I thought would be a comparable TV.  The remote is terrible, the sleep timer is inconvenient, the color is almost impossible to set.  There is nothing about this unit that is as nice as my previous unit except it was cheap.  I was very disappointed in my purchase.  Had it not been for a guest room, I would have returned it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629936000000}
{"reviewTitle":"Slow like 95 Microsoft computer","reviewDescription":"Honestly, some of the features saved this product from getting a lower review, BUT with that being said...THE LAG IS TERRIBLE. You'll think the TV didn't get your input from the controller but it did...it's just as slow as a 95 windows buffering a YouTube video. Picture looks great though. Oh, and WHY is the sleep timer options either an hour or two? Where is my 90 minute option? Movies are usually 90 minutes, so it would make sense that you would include that in the timer options...idk","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1624838400000}
{"reviewTitle":"backlight and brightness aree very poor","reviewDescription":"don't like the backlight and ESPECIALLY the BRIGHTNESS....haven't decidedn if i will return this or not...My 15 year old polaroid finally crapped out, but it had a much brighter picture...i have this  samsung in my wood shop in the exact same location and i have to have two more flourescent lights on to even come close to what the polaroid picture was  !!!!!!!finally decided to return it....bought a vizio for less money and it is much much much better...could adjust everything about picture.....on samsung could not adjust anything","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1617148800000}
{"reviewTitle":"ok.","reviewDescription":"The sound and picture are good, but for me, I wish the antenna scanning function had the ability to manually scan for a channel. The tuner is good for reception and I don't much pay attention to other functions. I don't use online services so I skipped that setup. Now, every time I hit exit on the remote, I get a pop up saying to set that up. It's annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1633996800000}
{"reviewTitle":"Not my old Samsung","reviewDescription":"We have had trouble with this tv not turning on right.  One day, it just wouldn't turn on at all.  Luckily, my IT guy at work told me to unplug it (we have one at our Library that is the same model)....it worked.  Then, last week, the screen turned a funky shade of blue.  Turning off then on didn't clear the problem but unplugging it did.  Sometimes the sound doesn't come on with the tv.  I don't know what's up with this model but it definitely isn't my old Samsung.  Not satisfied at all.","isVerified":true,"ratingScore":3,"reviewReaction":"201 people found this helpful","country":"United States","date":1533600000000}
{"reviewTitle":"Great picture but…","reviewDescription":"It has a fantastic picture but the sound quality is awful. The remote has dedicated buttons for Netflix and prime video but the design is poor at best. Buttons are small. A bonus with the tv is Samsung Tv Plus which is live tv. Navigating from the home menu is tedious as is adding apps. I would not buy this tv again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634688000000}
{"reviewTitle":"Not up to Samsung standards.","reviewDescription":"I bought this because of the physical size. I have a limited space for it.First thing i ran into was only 2 HDMI ports. I had to buy a switch. Second, the only audio out is optical. Since my wife listens to her Bose speaker and i with my hearing aids i had to buy a splitter. Also no Bluetooth.The main issue is that for whatever reason, lip-sync keeps changing.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"Speaker is crackling","reviewDescription":"TV showed up in an undamaged box. Assembled legs and plugged in. Picture looks good as expected. Unfortunately the sound is junk. Suspect cracked speaker as all that is heard out of the right side is a crackled resemblance of what should be sound","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646784000000}
{"reviewTitle":"Samsung can do better","reviewDescription":"The tv look is amazing sleek and light. My problem is with the apps. In order to work it you have to download an app with is ironic since it’s missing my favorite apps and I would have to get an Roku device to get my favorite apps smh.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671321600000}
{"reviewTitle":"Samsung favoring their own streaming content","reviewDescription":"What's with manufacturers sacrificing the quality of their own hardware in order to try to establish their own streaming services?  The FIRST option every time we turn on the TV is \"Samsung TV\" which isn't really TV at all as we think of it, it's Samsung's darn streaming service.  Worse, if you are changing inputs and don't move fast, it will default back to \"Samsung TV\" again.  Fine if you want to offer that service, but it's another thing to put it as a barrier to getting to the services a household most likely uses - i.e. an HDMI input or broadcast.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630281600000}
{"reviewTitle":"I wouldn't buy it again.","reviewDescription":"Picture is ok, not as sharp as I was expecting. I didn't realize this was a model from a couple of years ago. Can't use my soudbar with it, don't know why no audio output, and won't work with optical cable, or RCA. Not good for casting from mobile or laptop, keeps saying this TV only casts to selected video, I have to go through Fire stick or Chromecast,which sucks, I usually just use HDMI directly to computer which is a big pain. I wish my dog hadn't broken my 40\" Insignia. Samsung quality has gone way downhill recently. Worst remote control I've ever used, not very user friendly.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1625788800000}
{"reviewTitle":"Tv is great but the remote stopped working after a month","reviewDescription":"Tv works as expected and we enjoy the smart feature but the remote completely stopped working after a month. Tried new batteries and the troubleshooting guide with no luck. To my knowledge, nothing happened to it. Now we’re having to purchase another remote after having the tv for one month. Very disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1657929600000}
{"reviewTitle":"Unimpressed","reviewDescription":"I'm so underwhelmed with this Smart TV performance, that it should be ranked lower ratings! Let's start with the audio quality: even with adjusting the factory sound, the sound quality still mimics an AM radio station!Second, the remote control barely works, especially when batteries were replaced! Third, preloaded channels are the pits, but what is more irritating is the SMART TV makes it very difficult for the user to change viewing platforms using the remote! It often takes me up to 7minutes just to obtain access to my Hulu account because my remote doesn't work, forcing one to view the Samsung screen with those awful preloaded channels!This item will definitely be returned...I am not impressed!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1618358400000}
{"reviewTitle":"Read comments.","reviewDescription":"What I did not like was that when it was connected to wifi with the cable connected, we could only stream or was stuck with Samsung’s useless offering. There was no option to watch our 89 fiber optic channels. After a few colorful metaphors, I figured out to I had to turn off the wifi.  So much for a “Smart” Tv. Would not buy again.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1648944000000}
{"reviewTitle":"Good Picture. Poor Sound Volume.","reviewDescription":"The picture is excellent, but the sound not so much. Turned all the way up to \"100\", whatever that means, sometimes the audio is barely audible. Watching some movies it's almost impossible to hear and understand the dialogue. And with musical performances, it's even worse. The one thing that can be said is that even turned up all the way, there is no distortion. But that doesn't make up for the lack of volume.(EDIT) The sound issue has just become more and more annoying. Watching movies is a pain. In order to hear the dialogue in most movies the volume MUST BE turned up to 100. And sometimes that's not enough! We've resulted more than once to turning on captioning Just So we can know what's being said. This is VERY ANNOYING! We never had that problem with the TV this one replaced. If we could send it back, we certainly would!","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1563235200000}
{"reviewTitle":"Great while it lasted, but you'd be wise to purchase the warranty.","reviewDescription":"Bought mine April 18, 2021 and it worked perfectly great until September 14, 2022. Now there's no sound from the speakers. They won't repair items under $500 so they called it a loss and credited my account to buy another.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1663200000000}
{"reviewTitle":"Bad quality","reviewDescription":"I have always bought Samsung products I believe in them highly. However, this television set had a very boxy sound that would come and go and then all at once it is so boxy now that you can't understand what anybody says. I requested a return from Amazon on the 16th of May and still have heard nothing back!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653696000000}
{"reviewTitle":"Great TV as long as your viewing it right in front of the TV","reviewDescription":"If you try to watch this TV from the side the picture is terrible (which I sometimes do because it's in my kitchen and try to watch from the side while I'm doing dishes). It's contrast and brightness is hard to watch. white images look yellow.  I returned in about a week. Otherwise viewing from the front has a great picture.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1647216000000}
{"reviewTitle":"Great picture","reviewDescription":"Great picture. It is preloaded with apps. It would not allow me to add my tv provider.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1685491200000}
{"reviewTitle":"Can’t go wrong with Samsung","reviewDescription":"I’ve had Samsung tvs for a long time.when hanging up my fams new 80inch Samsung they were able to use the same screws the wall mint came with, Not true for my mew 40inch. I have the bracket to hang up the tv damn screws are to small for the holes in tv. Disappointed ☹️","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1676160000000}
{"reviewTitle":"Good picture","reviewDescription":"The remote is not very easy to use","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1684454400000}
{"reviewTitle":"Sleep mode is difficult.","reviewDescription":"Great TV. picture and features are super except the Sleep mode is difficult. Older units have a sleep button on the remote not this one. It take several step to set the sleep timer so it makes it not user friendly.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1673654400000}
{"reviewTitle":"Delivery was fast and efficient!","reviewDescription":"Tv came fast and was in perfect condition. Personally I love the picture of Samsung tvs and they are reasonably priced!","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1682467200000}
{"reviewTitle":"Good tv remote could be better","reviewDescription":"The tv has a good picture quality and is easy to use. The remote doesn't have lighted keys nor voice control so it's not easy to use if you're sight impaired. Linked to Alexa but there's not many commands available.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"Great picture, not the best placement of connections","reviewDescription":"This is generally a pretty good TV so far; I've only had it for a couple of months. The reason I didn't rate it 5 stars is due to the fact that many of the connections are covered by the mounting plate. I think this would be the case with any mounting product. Once the plate is mounted to the rear of the TV, it's very difficult to access the optical cable connection. Seems like a pretty dumb design flaw especially considering that the optical cable is included with the TV. The HDMI cables are still accessible with the mounting product I used and would be with most others. The Antenna\/Coax is also still accessible, and I'm only connecting those two cables. If you wanted to connect more items and use a mount it might not work well. Otherwise it's a good TV with a great picture and easy to use functions. If you only need the HDMI and antenna connections you should have no problems.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1600300800000}
{"reviewTitle":"Great TV","reviewDescription":"If came earlier than expected, but that's not a bad thing. This product is easy to lift (do be careful since modern TVs tend to be easy to break), easy to understand and use. The picture quality is very good and I've chose to not use the smart TV section for now since I have a Roku streaming device. I would personally recommend this product and for anyone still iffy about buying a TV from Amazon, I say go for it.","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1664150400000}
{"reviewTitle":"Sound and Smart features aren’t great","reviewDescription":"I purchased this tv because I have confidence in Samsung TVs. The two things I don’t like about this TV are the sound quality and the smart features. The *sound quality is a HUGE step down from the Samsung 42” which has incredible sound. This (32”) model is just tolerable and won’t give and low end response. I know that you can’t expect much in the way of internal speakers, but this TV REALLY misses the mark.The Smart Features aren’t great either due to a poor interface but like the sound quality,  they are tolerable.Good enough for the price I paid, but I guess I expected a slightly better product.*note that I am an audiophile and former music engineer\/producer, so some people might not notice the sound quality.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1622851200000}
{"reviewTitle":"Excellent for the price","reviewDescription":"I got this to show my digital artwork, which it does admirably. It has brilliant color and good resolution. My digital painting has improved simply by being able to see my work at the size intended.It comes with Samsung free TV, which I was not expecting. But, as with most cable,  satellite, etc., lots of shows, nothing to see. I was surprised at how smart smart TV is. It has many features I will probably never use, but as a 'picture frame,' I love it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1648425600000}
{"reviewTitle":"Return","reviewDescription":"it was to small fro us.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Beware the Web Browser","reviewDescription":"Not a bad TV for the price.  Picture and sound quality are quite good.  Navigating the channel lists are cumbersome, and the TV doesn't have nearly the options that our old non-smart TV had for customizing the picture, sound, and selecting channels.  On using the built-in web browser, I logged into Facebook, and within 24 hours my Facebook account which I'd had for 15 years was stolen.  I won't be logging into any of my online accounts, but use the browser for general surfing only.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Will not download terms of service; doesn’t work without it","reviewDescription":"I received the TV today and will return asap.  In order to use the features I bought this tv for (to use the apps and spectrum service) you must download the terms of service.  I connected my internet just fine, yet when I attempted to download the terms of service it said my internet connection wasn’t stable and it quit.  My connection is 200 mbps.  I went through 4 wifi routers.  I went to the neighbors.  I tried a wifi hotspot.  6 total internet connections and none of them are good enough for this television.  All of my devices run just fine on my internet, yet this TV is so advanced that it can’t?  So I called Samsung customer service.  They wanted the error message and when I told them they said nothing is wrong with the tv, and that my internet doesn’t work.  Can you imagine?  To make a tv that is the only electronic device I’ve come across in decades which I can’t get to work with my internet?  Yet it isn’t their fault.  So I’m returning it and will never, ever purchase a Samsung anything ever again.EDIT:I've changed the review from a 1 star to 3 stars as I figured out the issue.  Samsung customer service was no help, and I took to the internet to see if others had similar issues.  There was no shortage of people who had the same issues I did, however I couldn't find a solution.  After a few hours of searching and reading, I came across a post which stated that the reason for the internet issue is because the TV was originally set up in another country, and the TV won't connect to Samsung if a different country than the original is detected.  To get around this, one must 'reset' the TV, which is an option deep into the settings menu.  I did this and was able to successfully set up the TV.  This should be an easy fix for Samsung, and certainly a troubleshooting step, however it's not.  Their answer is simply \"your internet doesn't work, get a better internet connection.\"  Unacceptable they have this flaw, unacceptable they don't acknowledge it, unacceptable I have to go deep into internet research to fix it, and unacceptable you can't use basic functions of the television because they gate keep it.","isVerified":true,"ratingScore":3,"reviewReaction":"15 people found this helpful","country":"United States","date":1650931200000}
{"reviewTitle":"CAn't add apps","reviewDescription":"A pretty good TV other than you can't add other apps to it, yes Amazon Prime & Netflicks are included on the remote but if you want something besides what came from the factory you're SOL.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"BUYER BEWARE.  Why don't they show the apps in the pics??","reviewDescription":"No HULU. If you want a Smart TV, this is not the one.Just arrived today; set it up, signed into wi-fi, etc. Hulu is NOT pre-loaded so went to apps settings. Hulu is not available. Called customer service - HULU IS NOT COMPATIBLE. WITH. THIS. MODEL. What?!?! Sooo, this is an elementary-school smart TV. NOT college or even high-school smart TV.  I didn't know there were levels; either it is or it is not Smart. The TV comes with 15 apps pre-loaded; additional 46 apps are available for download (some free(?)), some free-Trial, most paid subscription. A small enough catalogue they could list them all in the description - but they don't. Picture and sound are average; remote has lots of buttons; more than my other TV's. Kinda like that. Just wanted a smaller-than-me (less than 50 inches) Smart TV for this space.option 1 - return this TV and buy a bigger oneoption 2 - purchase ADDITIONAL component (firestick, roku, etc)option 3 - We CAN cast our phone (which DOES have Hulu) to play over the TV.This review is written 2 hours after opening the box.","isVerified":true,"ratingScore":3,"reviewReaction":"650 people found this helpful","country":"United States","date":1614816000000}
{"reviewTitle":"Great Picture; Serious Sound Problems","reviewDescription":"3 stars because we had to return this model TV two times due to sound malfunctions, but the picture is great.  Also, the TV is easy to set up and choose options.  The sound issues were just unreliable.  I see others have mentioned sound issues, too, in the reviews.  On the first one we got, sometimes we would have to turn the sound up to 99 to barely hear it; unplugging it seemed to correct it. On the second one, the sound would suddenly blast and voices would be garbled.  Changing the sound settings made no difference. If you are looking for a 32\" (rare to find), and don't mind unplugging it when the sound misbehaves, it might be a good buy for you.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Overall Good Picture","reviewDescription":"REMOTE CONTROL IS HARD TO USE ! LIKES TO JUMP AHEAD A BUNCH ! UNABLE TO JUST GET ONE OR TWO CHANNELS .......... JUMPS WAY AHEAD !!!!!  Of where ya Want to GO !","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"color is dark","reviewDescription":"besides the dark screen, its a great TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Sound Quality","reviewDescription":"I have had this for 2 years and the sound would change volumes.  Finally in 2024 the sound was gone.  Repairman suggested a sound bar.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Nice","reviewDescription":"Clear optics Well see about Durability","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Good TV Bad Remote","reviewDescription":"The TV, on its own, is very good for this price point.The remote, on the other hand, is outdated along with the operating software in the TV. The software is not intuitive at all and the clunky remote only makes navigating to what you want to watch worse. The process to connect a phone to hot spot it is ridiculous.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678233600000}
{"reviewTitle":"First and last Samsung for me!","reviewDescription":"Great! It's a \"smart\" TV. But I have had to do a factory reset on it twice because the sound suddenly went to max volume and could not be turned down. And I absolutely detest the remote control. The least intuitive and ergonomic remote I have ever used. Should've known better after seeing many Samsung cell phones at work swell and crack or pop the backs off. Never had that problem with Motorola or Apple phones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677283200000}
{"reviewTitle":"They don't make TV's like they used to","reviewDescription":"I had a Samsung for 14 years, bought in 2018  and had to be replaced (picture blew out), so I bought this one.  I'm astounded at how cheap it is, the LED lighting is too bright, colors \"too\" enhanced - seem surreal, and the puny feet to the TV are crooked and so I have to prop them up with magazines.  There's also a big glare that I can't get rid of.  Generally all TV's made today are marketed as \"the clearest picture ever,\" but the LED and QLED lighting actually work to burn out your eyes - my eyes are exhausted after just a few hours of watching this TV.  I'm at a loss as to what to do -- I can't find any TV's that don't offer LED (light-emitting diodes) technology, which is just awful and hard on the eyes as I mentioned.  Way over-priced as well.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1641600000000}
{"reviewTitle":"Sound is a problem","reviewDescription":"I nearly returned this due to the unstable sound and volume. These can be improved upon in Settings but the default setting was quite unstable and unsatisfactory.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"remote control is terrible! cumbersome to say the least and, especially,","reviewDescription":"at night, and I even, FYI, wear prescription reading glasses, have a night light, yet I still can't fumble through this, again, cumbersome, non-neon capable, seems to only exist for itself rather than for me, the user, remote \"control\" (?)","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1681084800000}
{"reviewTitle":"Remote needs improvement","reviewDescription":"The remote is outdated and not user friendly. Picture is great and amazing free TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690502400000}
{"reviewTitle":"Overall, good TV","reviewDescription":"Bought this TV 4 years ago to the month. It did well being on 98% of the time. It bit the dust with the Black Screen Death. All attempts to revive it failed (soft and hard reset, checked all connections, etc.) Sound is still good though (with the sound bar, of course).  I think I'll move up to the M Series.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1674086400000}
{"reviewTitle":"Good when not glitchy","reviewDescription":"This is a good tv for what I needed it for, but too darn glitchy. Fortunately I was able to find the fixes online, but still. I have the TV hooked up to HDMI so that I can get Xfinity and I also have an old school Blu-ray player connected. I find at least once or twice a week I have trouble with any any of the sources including Netflix and the other applications. I find that simply unplugging for 10 seconds and plugging back in fixes this issue but it's still annoying and unnecessary. With the Blu-ray player sometimes that doesn't work so I have to do the same thing. Other than those annoyances it's a good TV. I have it in my basement and watch it every morning when I work out. It's just the annoyances of having to fix those glitches that are totally unnecessary.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1636588800000}
{"reviewTitle":"Good picture but not that smart","reviewDescription":"The picture is good but the setup was not easy and the smart part was poor.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Had to send the first one back","reviewDescription":"Had to send the first one back. The screen was black and we could not get it to work even after consulting a professional videographer. The second one worked but no screws were included in the package. My husband spent hours going through his supply to finally find 4 to mount the tv onto its legs. Still haven't figured out how to use it but I think that will come. 3 stars maybe","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1671840000000}
{"reviewTitle":"Very Good Value; Remote Could Be Better","reviewDescription":"My only criticism of this TV is a minor one: the remote is a little challenging for my fingers. I often hit the wrong button.But the TV itself, from the quality of the images to the ease of programming, I love! Super simple to get started right out of the box. Good quality, fair price. Maybe get the next larger size next time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1615507200000}
{"reviewTitle":"Good TV for the money","reviewDescription":"The TV has a good picture and is easily operated. For the money, it's a good value. I will mention that I was disappointed in the shipping process. it took over 10 days for the TV arrived and finally received message that the first shipment was damaged. Amazon was good about customer service.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617753600000}
{"reviewTitle":"Remote Doesn't Work All The Time","reviewDescription":"I have had this Samsung TV for a few weeks and the remote didn't work last week.  I replaced batteries, and once again today the remote did not work.  There is no other way to turn on the TV, so I need a new remote.  Otherwise, if it turns on, it has a very nice picture.Please send a new remote for this TV.Thank you.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1608768000000}
{"reviewTitle":"Broadcast onlu","reviewDescription":"Only use the tv for broadcast. So I can’t comment on the smart features. Picture is beautiful, remote work great","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1654387200000}
{"reviewTitle":"All good except streaming.","reviewDescription":"Tv works fine, only problem is with streaming from Hulu. A few times a day it totally shuts down and you have to start the program over. Picture is of good quality, good sound, color is good. Easy to set up.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1627344000000}
{"reviewTitle":"Smaller Than Advertised","reviewDescription":"Was expecting more real estate with this TV.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1657929600000}
{"reviewTitle":"Hardware problem.","reviewDescription":"Legs to far apart for my TV stand.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1657670400000}
{"reviewTitle":"Great picture quality","reviewDescription":"Thanks the Samsung is great. I love the picture and sound.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656547200000}
{"reviewTitle":"Remote difficult for use.","reviewDescription":"Remote kinda difficult to use.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1664064000000}
{"reviewTitle":"Good value for the price","reviewDescription":"Liked everything but the remote's small buttons. Cumbersome design.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1661299200000}
{"reviewTitle":"Good price, great picture.","reviewDescription":"It's a beautiful picture quality. Sound is great. Occasionally it \"blinks,\" and goes black. I'm not sure if that's Netflix or the TV. Love the use of apps. Comes preloaded with Netflix and Prime Video. Yay. Perfect size for an RV bedroom. One thing I noticed, which is not the TV's fault, is that if you are using a jetpack for internet (due to being in an RV,) you cannot use Prime Video most of the time due to the streaming being too high a quality for (Verizon) streaming. I would recommend getting a 720p, as adjusting the quality of the streaming in Prime on this TV appears to be impossible. Also, who makes a remote without back lit buttons in this day and age? I have to turn on the light at night to use it...uncool Samsung.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1610409600000}
{"reviewTitle":"Good value","reviewDescription":"Great picture and sound.I wish it had voice control on the streaming channels. You have to buy an Alexa product.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1676505600000}
{"reviewTitle":"It's ok","reviewDescription":"I'm never happy that I need to have a small TV. At first I had trouble using my sound bar with this TV. Then discovered how to make this happen all the time. I wish there were more instructions included with today's electronics, but I am lucky to have a relative who teaches at MIT. Not everyone has this benefit.By the way, I had to buy this TV after 6 years of having another Samsung which developed a bright backlight shining out on everything I watched. Something broke!! I  was happy with that old TV but needed to buy this new one. I hope this one lasts for more that 6 years!! Oh well!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1626134400000}
{"reviewTitle":"My old remote works too","reviewDescription":"My old Samsung remote works great w\/ the smart TV. It only lacks the \"GUIDE' selection. The redefined interface is annoying at 1st but is kinda fun once ya catch onto the added complexity. The initial hours learning all this newness pays off with the feeling of conquering a software demon.But I do miss some of the simpler remote functions that were lost in transition. se la vie","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653955200000}
{"reviewTitle":"Love the TV and streaming and don't use the remote or smart features.","reviewDescription":"I had a Samsung TV which was perfect for 11 years until it was knocked over and the port was smashed.  I got a smart TV because that was all that was available.  I use the smart TV for TV and streaming only.  I use the cable remote with it.It has a beautiful clear picture, works great and was priced very reasonably.  Samsung's good.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1658361600000}
{"reviewTitle":"Put a sleep button on the remote!","reviewDescription":"Picture is great, built in speakers are surprisingly decent, but for the love of god, put a sleep button on the remote! It takes at least 10 button pressed to turn on sleep mode in the menus\/settings.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1664582400000}
{"reviewTitle":"Use the remote.  App doesn't work.","reviewDescription":"Easy set up.  My dresser was too narrow for safe use of included stand.  You need a surface with minimum width of 35 inches.  I did not find anything in any of the information that included this information.  Also, don't waste your time installing the app; this television is not supported by it.Picture is great, and adding on line streaming services was easy.  You still need a dongle; stay away from Roku if you have youtube TV... Not supported.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1633392000000}
{"reviewTitle":"No carga","reviewDescription":"Hasta ahorita no e podido aceptar los términos y condiciones, si no se puede en el transcurso de la noche, tendré que cambiar mi calificación a 1 estrella, porque no puedo usar ninguna app.Actualización!!!Ya pude conectarla, esta trabajando bien junto con sus apps.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1650672000000}
{"reviewTitle":"Good product from Samsung","reviewDescription":"I love Samsung products so my electronics are mostly from them. I like the TV,it's very lightweight, the sound is perfect but the picture is not as clear as my other TVs. Overall it's a good investment and I would recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1651104000000}
{"reviewTitle":"Great value","reviewDescription":"Exactly what I was looking for in a bedroom TV, perfect size, everything works great. It does feel like if you're not careful it could tip over, but we have it inside an armoire so I know it's safe in there from kids and cats. Remote is great too, accidentally got mixed in with some laundry in the washer and it still works!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651017600000}
{"reviewTitle":"I like this tv","reviewDescription":"Took me a while to set up but I did it without stressing out. I am not technically proficient. Still I did it. I like the tv very much.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633478400000}
{"reviewTitle":"Good buy, price was right 👍","reviewDescription":"Initially bought this because Samsung and it's hub are one of the few that allows you to download the Spectrum app, Roku and firestick doesn't anymore. I ended up dumping spectrum and getting a firestick, very happy with the picture and sound.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1620345600000}
{"reviewTitle":"Good for the bedroom but wouldn’t use this in my living room","reviewDescription":"I don’t have cable, only streaming services so my only real complaint is that it always comes on to TV Plus which I don’t want to watch. There doesn’t seem to be a way to set the default to another steaming service. That doesn’t happen with my other Samsung in the LR.Also, not sure why they took away the option for 90 minutes when you use the sleep function.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1578787200000}
{"reviewTitle":"Great picture","reviewDescription":"Great picture but poor sound. I had to buy a sound bar for quality sound. Samsung is a great product. The TV was not expensive so that may explain the poor sound. I use it in my kitchen. I would still recommend buying for like the kids room or kitchen.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610496000000}
{"reviewTitle":"Eexcellent tv quality both image and sound recommended 100%","reviewDescription":"excellent tv quality both image and sound recommended 100%","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651190400000}
{"reviewTitle":"Good picture","reviewDescription":"I like the Samsung UN32N5300AFXZA 32 tv. The only thing that is not good is the sound - but I have not seen a led tv that I like the sound. I bought a soundbar to improve the quality of the sound.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617062400000}
{"reviewTitle":"I truly enjoy this TV, except for one thing!","reviewDescription":"The picture quality is very good. Once in-awhile I see lines across the top of the screen. Also every now and then the TV speaker sound is distorted. If I fast forward or go back a second, it clears it up. Other people have also complained about this problem.  In general, the sound quality is also very good. Not sure where this sound distortion is coming from.  I must contact Samsung.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1548115200000}
{"reviewTitle":"Has limited streaming options","reviewDescription":"It doesn’t have the Huñu app or the Turner Classic Movies App. I ended up having to buy a Roku stick to get the apps I wanted from the set..","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1628467200000}
{"reviewTitle":"Nice set albeit small picture size","reviewDescription":"In many ways a great bargain - the one significant detracting issue is that when viewing in standard mode individuals are slightly distorted (stretched); viewing in 4:3 corrects the issue but the picture occupies only about 65 % of the screen.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1615939200000}
{"reviewTitle":"Cannot figure how to access smart features so","reviewDescription":"Easy assembly, easy hook up but complex e-manual located after I ignored the wrong Samsung site address listed on the Samsung paperwork enclosed with tv","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632355200000}
{"reviewTitle":"Make sure you know how to adjust DNS settings","reviewDescription":"The Samsung servers seem to only like google DNS servers for activation and app download. If you get this tv you may have to manually adjust the DNS server to 8.8.8.8 or 8.8.4.4 in order to download the TOS and apps\/complete setup. Otherwise seems decent so far.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1603152000000}
{"reviewTitle":"This is a 2016 or 2017 model. I didn't know this when I ordered it.","reviewDescription":"I was in a hurry when I ordered this TV.  It was a good price so I just ordered it without checking when it was made. The TV is OK but my old TV had a much better picture and it was 12 years old.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1617580800000}
{"reviewTitle":"Don't buy it!","reviewDescription":"I like that it fit my budget perfectly. But you really do get what you pay for. I'm hoping to return it and get a better quality television.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635465600000}
{"reviewTitle":"Not impressed at all..","reviewDescription":"The remote is very difficult to maneuver thru..not user friendly...not impressed with it...or the TV..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1654560000000}
{"reviewTitle":"Samsung product wasn’t the issue","reviewDescription":"Product came damaged","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1674172800000}
{"reviewTitle":"The TV was broken when we received it","reviewDescription":"The TV was broken when we received it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1665792000000}
{"reviewTitle":"This TV is basically a Samsung advertisement Every Single Time you turn it on.","reviewDescription":"I am really upset, every time I turn on the tv my ears are insulted with Samsung advertising and shows I don't want, and can't get rid of it.  I did not pay for advertising! tv, I am returning it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1618012800000}
{"reviewTitle":"Would not purchase again","reviewDescription":"The color lightens and darkens on its own.. It could be very annoying","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1658448000000}
{"reviewTitle":"Disappointing","reviewDescription":"No threads to mount on wall","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1660176000000}
{"reviewTitle":"Dissappointed","reviewDescription":"The sound quality is bad. The screen shakes almost every day. Sometimes everything is in black and white.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641168000000}
{"reviewTitle":"Should have purchased an LG!","reviewDescription":"Doesn't function well at all with YouTube TV streaming","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1694736000000}
{"reviewTitle":"Seven months into my new TV and not happy","reviewDescription":"Could have been happy with it, overlooking little things that were annoying or troublesome, but in less than 7 months the remote is functioning poorly.  Waited on a chat line with Samsung for over 40 minutes and after writing back and forth and the rep providing some suggestions, he said I was chatting with Malaysia and suggested I go to another URL for the U.S.  Malaysia?  Why?  I listed my address as Brooklyn, New York.No help at all and stuck with a set that's less than a year old and a remote control that only operates intermittently.I thought Samsung was the way to go.  Guess we all make mistakes.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644796800000}
{"reviewTitle":"Terrible viewing angle. I would not buy this TV again.","reviewDescription":"I'm a better than average picture quality critic. Once a TV studio engineer. Have not been able to get decent picture quality. Viewing angle is horrible. It was cheap enough....and fit my spot in the kitchen. All functionssuch as wifi work fine. I have it hardwired now but wifi works well. Sound is as good as you would expect. My main complant is the viewing angle. A couple feet off straight on is bleached out.Would have liked a do over on this purchase. It replaced a 32 inch Sharpe Aquos than was a 100 times better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1654646400000}
{"reviewTitle":"False advertisement","reviewDescription":"It does not have Amazon Alexa as advertised and the technicians \/ customer service will hang up in your face. I returned this tv .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686096000000}
{"reviewTitle":"Remote","reviewDescription":"Remote control is terrible. Won’t buy again because of this . No voice control.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"The worst remote on the market","reviewDescription":"This TV just wasn't for me.  I'm one who has a remote control memorized totally in a day or two but this one is very hard.  I'm sure I could have bought a Universal remote but called Amazon service for help (chat).  They were so very thoughtful and wanted to make it right. So, for me, it's back to the drawing room for a really Smart TV.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1668297600000}
{"reviewTitle":"Set up","reviewDescription":"Lost WiFi, reset to WiFi now seems impossible. It won’t accept wifi password. It only accepts a very short password. Mine doesn’t fit… I tried factory reset but that doesn’t work either. Now it’s uselessDon’t like the remote either. Buttons are way too close. Annoying when you hit exit button by mistake","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677283200000}
{"reviewTitle":"Very low volume even at max setting.","reviewDescription":"Very low volume even at max setting seems common with this model thru reviews.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690156800000}
{"reviewTitle":"TV is garbage. Stay away.","reviewDescription":"This TV has been a total disappointment. Nothing \"Smart\" about it. Not user friendly to set up and maintaining a streaming connection has been almost impossible. It's going back. I strongly recommend finding another model.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680998400000}
{"reviewTitle":"Great picture, horrible connection to internet!","reviewDescription":"I was so excited to get my new TV. My old one was smaller and a 2015 model which I couldn’t stream my “channels” like CBS on the Amazon Prime Video app. Love the picture on it, as well as the size. I can access my CBS channel now through Prime Video but that’s only when it connects to the internet.Which is what brings me to my low star review. This TV does not connect to my internet well at all! My older model connected WAY better and I’m actually tempted to just start using it again and returning this one. Also if I try to do Airplay from my MacBook onto the screen while using Prime Video it won’t let me.I’m supper bummed I was really looking forward to being able to stream my shows in my bedroom with ease.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1608508800000}
{"reviewTitle":"Great TV","reviewDescription":"Great tv, good color and comes with Samsung TV plus channels for free if you have internet connection with wifi and easy to connect.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Quality","reviewDescription":"Like","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Great flatscreen TV!","reviewDescription":"The quality is great, and very easy to use!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700006400000}
{"reviewTitle":"Just missing voice control","reviewDescription":"Great TV for the price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700006400000}
{"reviewTitle":"Hard to find size","reviewDescription":"Bought for my camper. 40” was perfect. Lucky to find the size to fit in a smart tv","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Works Great! I enjoy watching on this tv!","reviewDescription":"This tv worked, and has good sound. Easy to set up. It appeared brand new, with no scratches of any kind. I’m pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Easy setup","reviewDescription":"TV was easy to set up (even for an old woman!). Received it 2 days after I ordered it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1698278400000}
{"reviewTitle":"Great Purchase!","reviewDescription":"As a gal I thought hooking it up would be complicated and it wasn't. Extremely light in weight, easy to set up, no tools required, runs great and great picture. With their remote you only need that remote and no others. Would definitely purchase again.","isVerified":true,"ratingScore":5,"reviewReaction":"24 people found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Samsung TV","reviewDescription":"Great resolution sound quality excellent. Only trouble we had was bolt placement for wall mount configuration different from TV it replaced. Adaptation was limited","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"Very good TV","reviewDescription":"It works very well and it arrived safely. It was easy to set up and the picture quality is very good.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1698537600000}
{"reviewTitle":"Excellent 32\" tv for the price (Broadcasting greyed out problem solved)","reviewDescription":"First of all at first I wasn't to impressed with this Samsung until I began tweaking the default settings on the video.  For a 2018 model tv still using component inputs as part of the source selection, I was beginning to wonder.  Local live over-the-air broadcasts along with the Amazon fire stick looks fantastic.Now for the part that drove me crazy and I noticed others having that same issue.  Trying to scan the tv for over-the air channels.  When input selection is set to 'Tv', all I received were Samsung channels and wasn't able to find the method for this tv to scan local channels.  Do a YouTube search for 'How To Fix Broadcasting Grayed Out on Samsung Smart TV' by Juan Camacho.  The video is 2:20 long and it does work.  I'll update in a few weeks.","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"Can’t go wrong with a Samsung!","reviewDescription":"This Samsung LED 40” SMART TV  delivers a quality picture with great sound. The remote though is complex to navigate and the buttons to control the television are on the bottom and SMALL compared to the other buttons on the remote.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Good 40 inch TV.","reviewDescription":"It’s a Samsung product. Works like it should. I’ve never had a problem with them.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Nice tv for bedroom","reviewDescription":"Great picture, mediocre sound, and terrible remote control… wish it had the newer smart tv remote .","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"The tv picture quality is very good. Not as good as my UHD Samsung, but ok.","reviewDescription":"There is nothing wrong with the tv. Picture is fine everything works good except the APPS. I bought thistv so I could add the PBS apps and other apps. But I could not figure out how to load the PBS APPS.But I did figure out about the Samsung Plus Apps.  A whole lot of channels to watch.So this tv is a keeper now.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1698537600000}
{"reviewTitle":"Great TV","reviewDescription":"Work really well easy to set up","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"EASY SET UP and GREAT QUALITY FOR THE MONEY","reviewDescription":"Easy set up, convenient, fantastic picture quality and color, and bonus features! 😊😊😊😊😊","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"Samsung TV","reviewDescription":"I like Samsung smart TV. They have built-in.  I like it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Always get 1080p HDTV","reviewDescription":"Manufacturers still sell 720p HDTVs, but as a minimum, I would always get a 1080p Full HDTV like this Samsung because you can really tell the difference up close and the price difference is minimal. Picture is flawless. You also get access to Samsung TV Plus for cord cutters which you can only get on a Samsung TV.","isVerified":true,"ratingScore":5,"reviewReaction":"24 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Ads Ads Ads","reviewDescription":"Great TV.. but they designed the remote control to take you to their Samsung channels.. Ads Ads Ads. I have had thus tv a year and this is my second one. TV is great.. side loading apps isn't terrible but needs work... and my biggest gripe is this damn remote control.. I just hate it.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1698537600000}
{"reviewTitle":"Ok features, Video failed","reviewDescription":"Within 3 months of owning the TV, the video went out.  It seemed like a software issue.  We had to send it in for warrantee.  We had to pay for a box, Samsung covered the shipping cost.  Took forever to get it back to us.  Not a great experience.  Hoping that it works long term.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1612828800000}
{"reviewTitle":"Defective product looking to get it replaced","reviewDescription":"TV volume is not worki g properly. TV keeps blacking out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673308800000}
{"reviewTitle":"A little bummed about my choice....","reviewDescription":"The one I purchased was the exact same Model that went bad after having it for less than 3 years. I needed a quick replacement and realized when I opened the box that it was the same one I had to replace\/recycle. I only hope that it lasts longer than two years.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1621123200000}
{"reviewTitle":"Slow Refresh Rate","reviewDescription":"Noticed that the picture quality was not as good as my old TV.  Turns out this one has a very slow refresh rate.  Ended up returning this one.The post should have clearly stated the refresh rate in the description.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1629331200000}
{"reviewTitle":"You get what you pay for","reviewDescription":"The picture looks great but the sound occasionally becomes staticky.  I’ve also had to reset it several times just to get it to turn on.  I guess I got what I paid for but knowing what I know now, I’d pay the extra get a get a higher quality TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618617600000}
{"reviewTitle":"Bad picture","reviewDescription":"The picture on this Samsung TV is not clear. It is not a clear, sharp picture. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663632000000}
{"reviewTitle":"Will not connect to %G.","reviewDescription":"Will not connect to 5G","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1674777600000}
{"reviewTitle":"Missing parts.","reviewDescription":"TV came without screws for stands. Very annoying.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"Drops internet connection","reviewDescription":"Disconnects from WiFi non-stop. I can’t recommend this product. After looking into this issue it’s a very common problem with no current fix. I haven’t even had it a month and it’s dropping connection daily now.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1632182400000}
{"reviewTitle":"No audio out","reviewDescription":"This TV has way to play sound from something other than the TV's speakers. No audio jack, no Bluetooth, nothing. I was completely shocked that they couldn't even put an aux cord jack or something. Completely ridiculous.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1628985600000}
{"reviewTitle":"Able to Link Optical Audio Output to RF Headphone System for Hard-of-Hearing","reviewDescription":"I am going to address just this one aspect since solving it was not as simple as I had hoped. I already had a Sennheiser RF transmission headphone system that accepted analog audio input from an older Samsung TV. This model TV, like most, no longer provides analog audio output. So I purchased an analog-to-digital converter, also from Amazon, made by Techole. Here is what I had to do to get it all working: (1) As other have written, notice that there are almost invisible flexible protective coverings on both ends of the optical cable provided with the Techole adapter; you will need to scrape these off using your finger nail. This then plugs into the optical audio out port in the TV and the in port in the converter. (2) You will need to locate in Samsung settings, under Audio and then Expert Settings the two entries related to HDMI and switch them to the PCM option. (3) I used the red and black (importantly, not yellow, which is video) RCA input jacks in the hard-wired cable to my Sennheiser to connect to the output of my Techole adapter; other means of connecting (e.g., using a headphone jack) should also work. (4) With this done, I could hear audio through my Sennheise headphones whether or not the TV was in mute mode and whether I was using conventional TV input from my Verizon box or separate input from my Samsung BluRay\/DVD plalyer. The problem was that I could not hear through the headphones if I had selected an alternate source (Netflix, Amazon, etc) from the TV itself. After an extensive chat session with Samsung support, we finally found that if I disconnected the TV power from the wall and disconnected all connected cables and then reconnected and powered up the TV, all worked fine. Good luck.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1620086400000}
{"reviewTitle":"Very Happy With This TV","reviewDescription":"I am very happy and impressed with this TV.  We have been using ours for a few months in the kitchen area, and it has performed flawlessly.The picture quality is great!  It is sharp, bright, and very natural looking.  I think the 1080P feature helps too, and is worth the slightly higher cost of this TV over comparable models.  But a great picture requires a little extra initial work.  When setting up any TV, you'll find that there are many picture adjustment options; some are on\/off, some are selections, and some are ranges.  Yes, it's a little tedious, but take the time to go through each option and set it to what looks good for you.  The effort is totally worth the enhanced enjoyment of your TV viewing.The sound quality of this TV is also excellent for its size.  Conversations are crisp, music is pleasant, and the volume can go up much higher than I would ever want.  Remember that you are listening to the built-in speakers of a relatively small television, so don't expect the same sound quality as you get from your Dolby 5.1 surround-sound entertainment system!Other reviewers have complained about WiFi connectivity problems (connections lost), but we have not had this problem.  Perhaps it's a function of signal strength or modem brand?We are very happy with our purchase of this TV, and I recommend it highly.","isVerified":true,"ratingScore":5,"reviewReaction":"38 people found this helpful","country":"United States","date":1661644800000}
{"reviewTitle":"Perfect for small family room","reviewDescription":"Nice picture, easy to get to cable .Great for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Great TV Complicated Remote","reviewDescription":"Love the TV, don't like the remote! Smart features are nice, but don't like the fact that you can't turn on the TV without it automatically accessing Samsung TV Plus. I'm using YouTube TV and although the TV does have a setting to access the app you were using when you turn off the TV it only works with just a few of the preloaded apps. So, you have to select the app you want each time from the Smart Hub. Not a huge deal, but it is more cumbersome than I'd like. Will probably load my Roku device at some point and just use that.Many have stated that this TV doesn't have the ability to mount on the wall or from a TV mount. That is not correct. It has 4 screw holes in the back to mount a standard 100x100 mount. Was very easy to mount in minutes. Just remove the screws from the TV that are there when you unbox and use the supplied screws from your mount.***01-06-23 - Update to review. Sending TV back, the picture in a dark room is very washed out and attempts to make picture changes didn't improve the picture. Not sure if it's just this TV or inherent in this model. Will continue my search for an acceptable model for our bedroom. Disappointed!!","isVerified":true,"ratingScore":5,"reviewReaction":"41 people found this helpful","country":"United States","date":1672444800000}
{"reviewTitle":"Good tv","reviewDescription":"Delivered in good condition. Still working great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"good price","reviewDescription":"good value","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"T.V. has a Brilliant Picture!","reviewDescription":"Like I said T.V. has a brilliant picture and everything works well.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"No batteries","reviewDescription":"No batteries in for remote. Need AAA  atteries","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"gift","reviewDescription":"A gift for my Sons home office. He is very satisfied with this TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Great TV For The Money","reviewDescription":"Love the television.  Good buy for the low cost and would buy again!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Always happy with Samsung","reviewDescription":"Samsung is always my favorite TV, this is my third Samsung TV. It gives good quality pictures and sounds, never disappointed me.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Great picture quality","reviewDescription":"This TV is the second that I purchased from Samsung and have been very pleased with the picture quality on both.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"I love this TV.","reviewDescription":"I don't write too many reviews.  This is my 3rd.  I really do like this TV.  I bought it as a back up for the identical model from 2018, in case it goes bad.  I bought it at Costco and it still works.  There were some issues with picture quality.  When you turned it on it looked pretty good and in a few minutes the overallscreen just kind of became darker and stayed that way.  I got used to it.  I just watched it through a component and that made it a little brighter.  This new one is very bright and it stays that way.  I think they've added some improvements to this particular model.  I kind of freaked out trying to start it up, I'm not too technically inclined. The picture and sound options are a little different than the 2018 model.Those are the only ones I've messed with.  But I got the picture to my liking, so I'm happy with it.So if you're one of those people who like watching a 32 inch tv screen, this is a pretty good tv.  And I don'teven watch HD channels.  The back panel is the same as the 2018 version.  I'm not sure I'm going to usethe smart features so, I didn't rate them.  Well I'm done here.  all the best, chris","isVerified":true,"ratingScore":5,"reviewReaction":"54 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"The quality.","reviewDescription":"I used it for an updated version of having a good TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Good price","reviewDescription":"Would recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Great Product","reviewDescription":"This monitor was very easy to install. It has a very sharp screen. I'm very happy with it, a month after I installed it!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Clear and Sharp picture","reviewDescription":"Nice TV with clear picture.  Easy set up to watch TV","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"good quality at a reasonable price","reviewDescription":"Wanted a basic televisionno interest in streaming","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Great TV","reviewDescription":"This was a Black Friday purchase that I’m very happy with!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"The.picture is clear","reviewDescription":"Entertainment in my den\/.office","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Great tv for 2nd use","reviewDescription":"I had a little trouble setting up but finally it was all set.  The picture is awesome and sound as well.  I have a big Samsung I bought several years ago and love so I wanted to stay in the family.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Good Purchase","reviewDescription":"Came safely in the mail.  Had it for over a month.  Great purchase so far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"great TV but","reviewDescription":"the TV is great but the remote is unresponsive and ass backwards.  update I bought a ge universal remote here and it works great 😃","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Great TV","reviewDescription":"I setup the TV and all looked great.  Had an issue with the legs being to far appart for my 2' wide table it sits on; however, expected such and ordered a stand from Amazon as well.  Gread picture, good sound, and the brains of this TV is exactly what I expected from Samsung (outstanding).","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1699142400000}
{"reviewTitle":"Love it","reviewDescription":"It’s fitted perfectly for my bedroom cabinet and the pictures are beautiful . Thank you","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Quality","reviewDescription":"Great picture and sound. It probably is easy to set up and put the legs on but I needed help because I’m not very handy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Returned only because my son needed for gaming too","reviewDescription":"I like Samsung and my son brought me the correct model for gaming and viewing movies programs.I will always by this model good luck with them every ti.e I owned one. This model is a Christmas gift from me.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Modern smart tv","reviewDescription":"I am not the technician in the family. Husband seemed to easily set the TV up with necessary wifi, antennae, sound bar. I am easily able to navigate Netflix, live TV, prime tv and hulu. There are all kinds of other options like paramount, youtube, etc.  We like the 55inch size. Picture quality is great.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Samsung","reviewDescription":"Great value.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Makes a GREAT monitor for those who need a lare screen","reviewDescription":"Visually impaired?  This could be the answer.  I am not but I like a big monitor and, in fact, I am writing this review using it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Tv","reviewDescription":"Great picture quality but sound not so","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Good","reviewDescription":"So far so good","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"It’s OK","reviewDescription":"It’s not the slimmest on the wall, but seems to work well for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Only one wall mount works with this TV","reviewDescription":"And Samsung no longer makes the wall mount for this TV - luckily I was finally able to find one on Amazon  https:\/\/www.amazon.com\/dp\/B07W19B9NK?psc=1&ref=ppx_yo2ov_dt_b_product_details  and even bought a used one that had everything I needed in the box including poor instructions.The TV is good, but as other reviews have pointed out, the sound quality is poor.  For just normal viewing, I have to crank the sound up to 40 or 50 to hear it.  I may have to eventually break down and buy a sound bar for it.  The TV set up was easy and I moved my Firestick onto it seamlessly.  But the back of the TV is not flat which renders all wall mounts sold useless except for the one in the link.  The price is good for the TV.  I just hope it lasts.  Fingers crossed.","isVerified":true,"ratingScore":4,"reviewReaction":"33 people found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Installation","reviewDescription":"This is a very nice TV. Installing the legs\/feet was a challenge. They did not go on very easily","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Excellent TV, needs a small gadget to use bluetooth.","reviewDescription":"It is four stars only because you need an additional gadget to set up bluetooth. The rest is top-notch.I have this TV for couple weeks and love the picture quality, the size of TV, and the price. Being Samsung TV, it has tons of Samsung TV channels, plus I use smart TV apps, and a few local TV channels I receive with a small indoors antenna (I have no cable TV subscription).It took to time to set it up, Wi-Fi connection did not work and I use ethernet, but I guess it is caused by the router being in another room.I am close to illiterate in tech gadgets and I am not paid to promote other Amazon products.I like to use headphones, but this TV has no bluetooth in it. If you go to TV settings - sound, it says something like HDMI-ARC. After googling all these mysterious words and reading answers about this TV, I bought \"HDMI ARC Adapter Audio Converter\"https:\/\/www.amazon.com\/gp\/product\/B0791CFGY1\/ref=ppx_yo_dt_b_asin_title_o00_s01?ie=UTF8&psc=1I already had (also bought on  Amazon) bluetooth transmitter receiver, and bluetooth headphones.https:\/\/www.amazon.com\/gp\/product\/B09DD33SDD\/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&psc=1https:\/\/www.amazon.com\/gp\/product\/B09JGF23V3\/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&psc=1I paired these headphones with bluetooth a few days ago (they said \"paired\" but had no sound).I connected the converter to the HDMI ARC in TV via HDMI cable, and also to USB in the TV as power supply. Then I connected the converter to the bluetooth transmitter via audio cable (red and white cables), and got a great sound in my headphones.I had the TV connected to a soundbar via optical cable. Now I can use only soundbar (ot TV speakers without the soundbar), only bluetooth headphones, or both at the same time.The sound quality is very good. If you are looking for the best listening experience (bass, various music etc.), I can't answer because I was looking for a good quality sound via headphones and I got it.Overall, I highly recommend this TV.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1645401600000}
{"reviewTitle":"Good tv, remote has too many buttons","reviewDescription":"Tv works fine, no complaints. Remote has 1,000 buttons so is hard to navigate in a dark room, most are unnecessary. Probably because it’s a basic tv but our other Samsung tvs that we spent more on had a streamlined remote that was significantly easier to use. Overall, I can get over the remote issue.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Good for a spare room or bedroom, built in speakers audio quality could be better.","reviewDescription":"Good choice for use in a spare room or bedroom. built in speakers audio quality could be better. If you don't opt in on the Smart TV features and data collection you are constantly annoyed with a pop up on power on or exiting from different programming options encouraging you to turn on the Smart features. Why would you not want to turn on Smart features? Perhaps like me you do not want to share your TV usage data with Samsung and 3rd party affiliates.  Even with Smart features disabled when you have connected to your home network via Ethernet cable or WiFi you can access shared hard drives on devices attached to your home network. I did not have to enter the userid and password Windows 10 usually requires to access these shared devices between Windows computers. Was able to access the external drive attached to my home router without entering a userid and password, not sure how this magic is happening. May be a security concern for some. The dismal audio quality from the built in speakers reminds me of what I heard watching my parents 1964 vintage Zenith 19 inch black & white TV. Audio quality might improve if you use a soundbar. Was hoping to test it with a pair of good quality amplified computer speakers however the only audio output options are an optical cable or HDMI ARC connection. No Bluetooth. HDMI cable not included with TV. Only cable included is the power cable. Remote control is easy to use and includes numerics making it easy to select off the air channels. Was able to easily configure the remote for my DIRECTV Satellite receiver to control TV power on\/off and volume. When turned off a RED LED is illuminated on the bottom right of the TV bezel which may be annoying to some insomniacs.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1646956800000}
{"reviewTitle":"The stand could use a lot more stability.","reviewDescription":"Picture is good but sound needs a sound bar or amplifier for improvement.  The stand, such as it is, needs improvement.  It is not very stable.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Quality smart tv","reviewDescription":"I returned a popular smart tv that had a problem with audio synch that could not be fixed by calling the manufacturer. I carefully repacked in the original box. Amazon return policy is excellent. I then ordered thisi Samsung model and saved $40. This Samsung has a much better picture quality and overall much better than the brand I returned to Amazon. Before setup, have your wifi password available. Setup is a little tricky. Carefully go thru the steps. Don’t rush. During the setup you can add apps to the preloaded lineup. You can select Hulu, Utube, travel and others to the standard lineup that are listed when you push the home button on remote. During setup you have to setup a Samsung account which I found annoying. They strongly encourage you to get an app for your phone that cost me $20 and found it to be of little use since my iphone mirroring feature did more. Do not get it,  its a waste of money. Somewhere on the main menu look for a sub menu that has apple play option and switch to on so your iphone mirroring will work. Also there is a smartcast setting that may work with android phones. Phones must be using same wifi as tv. I had a problem programming the xfinity cable box remote for tv volume\/power control. I moved the cable box from blocking the lower right corner of the tv and it worked. The Samsung remote has large number keys prominently displayed at top of remote that you rarely use while some of the often used keys are smaller and not well placed. There are a,b,c,d colored buttons that seem to have no function.  In settings for picture and audio control there are a few choices for preset settings. You cannot select individual color, brightness, bass, treble etc. I was ok with the picture selections but would like to add more bass to the sound but cannot. Overall, its a very good smart tv at a great price. Update. After almost 2 years still a great tv. Recommend getting a Roku streaming device with TV controls ($40) for easier and faster use than the Samsung remote.","isVerified":true,"ratingScore":4,"reviewReaction":"58 people found this helpful","country":"United States","date":1626393600000}
{"reviewTitle":"Best TV I ever ordered.","reviewDescription":"This TV only needs a tiny attena to watch over so many channels for Free. U can buy tiny attena from Amazon","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710720000000}
{"reviewTitle":"This set has the best picture","reviewDescription":"I haven't gotten to use all the features but I expect they will not disappoint me.  This is the first Samsung I ever owned. At this point I cannot imagine ever owning any other brand.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Love it!","reviewDescription":"This tv is so nice! Now I want one like it for my living room!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Love it!","reviewDescription":"My second Samsung. Great picture & great features. Don't need my firestick anymore.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Beautiful Picture","reviewDescription":"Picture is bright, colors are brilliant.  Will purchase another!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"It’s great","reviewDescription":"I use it everyday","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"That it works good","reviewDescription":"Everything is fine","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Great product","reviewDescription":"Worked great until I dropped it great picture","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Wo4ks great","reviewDescription":"Easy to set up","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Wall Mountable and here's proof...","reviewDescription":"For anyone having a question answered positively, A picture is worth a thousand words so I took 4 pictures equaling 4,000 words of proof that this great brand Samsung TV is definitely wall mountable and with No Hassle at all. There are 4 flat head screws on the back where there is a bulge in the back cover where the electronics are in. Simply remove the 4 metric flat head screws and lay your wall mount bracket over the holes to line them up appropriately  and replace the screws. Only issue I had with it was the flat head screws were too small in diameter and slipped thru the holes in my wall mount bracket so I simply put a washer on each screw and BINGO... There you go. If the factory screws are too short for your wall mount bracket, simple go to and hardware store and they will match up the threads for you with a longer screw, but be careful, Do Not use a replacement screw that is much longer than the original.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"good product at fair price.","reviewDescription":"simple to set up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Nice small TV","reviewDescription":"I love this TV. It allows you to connect HDTV through the back coax connector. The pic is very clear and crisp. Sound is loud enough. Great size to have in a small place. I recommended. I do think I should have gotten the 40” though. Thanks","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"What a deal !!!","reviewDescription":"great TV at a great priceI do not know how the supply chain can deliver a product of this quality at such a super low priceBUY ONE!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Good quality in a smaller TV","reviewDescription":"I wanted a TV to wall-mount in my bedroom where I have limited space. I was a little surprised to learn that it's actually getting difficult to find a top-quality TV in a smaller size these days - this Samsung was about the best we could find in a 32\" model. Still, despite it's small size, it does have all the essential features, as well as a very good picture quality.The TV itself is very light weight and was easy to wall mount. I used an articulating arm mount that lets me tilt and position the TV any way I want, and the light weight helped make this easy. The TV remote is the same as other recent Samsung TV's use, so if you're used to the layout, it will seem very comfortable to you.This is a \"smart\" TV, meaning that it has apps for things like Netflix, Amazon Prime Video and many others available. With a fast internet connection, you should have no trouble watching whatever you like through the TV, even if you're a cord-cutter. It's probably a small thing to most people, but I also appreciate that the power draw - especially when the TV is off - is very low.I'd rate the picture quality as very good overall, with a nice bright picture that's sharp and contrasty with most content. Black levels are good, and about the only thing I notice is a certain \"harshness\" that's common to lots of TV's these days. I admit, I was a plasma holdout, and now my main TV is a 75\" OLED just to avoid this issue, so I may be a little more sensitive than most.Overall, if you need a good quality smaller Smart TV that's still capable of putting a nice quality image in front of you, then this Samsung is definitely worth a try.","isVerified":true,"ratingScore":5,"reviewReaction":"690 people found this helpful","country":"United States","date":1530921600000}
{"reviewTitle":"Samsung is Good!","reviewDescription":"I just had a Samsung 40 inch go out after 5 -6 years with lots of use... The screen went dead,m you could still hear sound. This is the second one the screen has gone out on in the last 10 years... My guess it is planned obsolescence the name of the money game to get us to buy more... My first one was a 39 inch and it was replaced under the first year warrantee and is still going strong??? How long I do not know... It looks like Samsung has discontinued its 40 inch screen line! I have 3 areas that will only take 40 inch screens...  I may have to buy something other than Samsung when the next on goes bad?Otherwise, for the cost it is prorated at about  $40 dollars a year to have their tv's so far for all three... I'm now checking out different manufactures for 40 inch HD tvs...","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"Great TV - set up very fast!","reviewDescription":"Bought this Samsung TV to upgrade in my living room.  It shipped fast, was in new good condition no issues and set up was very easy!  I am very happy with this product.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Samsung TV","reviewDescription":"Vary nice smart tv. Super simple to setup and it comes with Samsung tv plus for free. A TON of channels. Picture quality is outstanding sound quality is pretty good too.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1705190400000}
{"reviewTitle":"Excellent 40 inch television","reviewDescription":"I purchased the 2019 television because it was priced well, and is quite suited for my needs.The Samsung band name attracted me, since that company has high quality.  The picture is excellent, and the setup went smoothly, even though I had to go through multiple levels of security to get registered.The product is a great value.","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1703116800000}
{"reviewTitle":"Just what I was looking for","reviewDescription":"Needed to replace my 14 year old 26\" Samsung flat screen TV .... which was still working just fine ... with something that was: a little larger, fit into the same space, was more energy efficient, would not FORCE me to use the smart TV features (and get tracked even more than I already am), and had a better tuner (yes, we also do some over the air broadcast watching). This model fit the bill. It was a great price, of course a solid brand with excellent reviews, fit the same spot without a complete rearrange of the living space, let me plug in my Roku and never miss a best, and seems to use about 1\/4 the electricity of the old LCD screen. I can't comment on the internal speakers, since I have it wired to my soundbar\/theater speakers. In short, it's pretty much perfect.","isVerified":true,"ratingScore":5,"reviewReaction":"27 people found this helpful","country":"United States","date":1691798400000}
{"reviewTitle":"Samsung never fails","reviewDescription":"For a happy family, make sure everyone has their space for the own small tv! Money well spent for our daughters playroom! We always buy name brand when it comes to our TVs. Great quality everytime!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"NO LEGS FOR TV","reviewDescription":"NO LEGS FOR TV!!@!!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688860800000}
{"reviewTitle":"Sound blew out","reviewDescription":"The sound blew out after only 4mos. And Joni don’t blast the volume up so other than it being poor quality there is no reason this should have happened. I ended up buying a sound bar instead of a new tv","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676160000000}
{"reviewTitle":"Picture is dark and sound is gargled","reviewDescription":"Worst tv ever. Worked good for two days. Yesterday the picture started to get darker and brightness is on max and won’t adjust. Turned it on this morning and the sound blasted and is so gargled it can’t be understood. Adjusting it doesn’t do anything to help. The worst part is that we are in a motorhome 1400 miles from home and now need another tv not a Samsung.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1671408000000}
{"reviewTitle":"This TV Failed after 2 Years","reviewDescription":"It worked fine until it failed, now it won't power up.  DISAPPOINTING, to say the least!!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683590400000}
{"reviewTitle":"Not worth it","reviewDescription":"Picture gets dark for no reason, sound is muffled at times","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1685059200000}
{"reviewTitle":"Not Alexa enabled","reviewDescription":"I expected this tv to be Alexa enabled by the way listing was written. It is not Alexa compatible.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1683417600000}
{"reviewTitle":"Worked Great Until it Died!","reviewDescription":"I used this primarily as a 1920x1080 computer monitor with my laptop, and occasionally for TV and Netflix. I loved this monitor with its crystal clear display and its bright color display, but 26 months after I bought it, it died. It would cost $200 to get it repaired, so it does not make financial sense to repair it. It was a great monitor, but it should have lasted at least five years, not two.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1667520000000}
{"reviewTitle":"I am not satisfied with this TV.","reviewDescription":"It doesn't have bluetooth, the picture quality isn't all that great, and the sound quality is terrible.I bought a soundbar, and the only way I could hook it up was via the optical connection, it also doesn't have a 3.5 jack.  I should have spent a little bit more. You get what you pay for.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1670457600000}
{"reviewTitle":"Cannot download Xfinity Stream app","reviewDescription":"Overall, a very nice TV, but a recent update to the operating software makes this model now unable to download and install the Xfinity Stream app.  We have an older production run of the identical model number which runs Xfinity Stream OK as do two other Samsung sets - one larger screen and the other smaller.  Samsung tech support did a full reset and update of the set online to no avail.  Since running Xfinity Stream was a primary need for this set, we returned it and ordered an Amazon Fire Smart TV, which both Amazon and Comcast say will run Xfinity Stream.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646784000000}
{"reviewTitle":"Great quality, serious flaws","reviewDescription":"Picture quality is great. Input lag very noticeable, and remote has no voice search to make up for it. Can't get certain streaming apps (such as Crunchyroll, AMC+), and streaming from the browser is frustrating due to the input lag. Video and audio stutters are a recurring issue after the TV has been on a while. Also, used to stream a fire stick on a very old tv with no problems, on this TV there is severe video and audio lag when using the fire stick. Expected better for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1655856000000}
{"reviewTitle":"Quality product, but with some annoying omissions","reviewDescription":"The good: the actual TV. Picture quality is good, and it’s pretty user friendly. The bad: sound is weak, and the only output is optical so if you want to connect it to a wired system you need to buy an optical to RCA converter. Not expensive, but a 3.5 audio jack shouldn’t be too much to ask. It also doesn’t have Bluetooth, so that’s literally the only option unless you have Wi-Fi speakers. The remote is VERY cluttered - fortunately my old Samsung remotes work and do all the tasks I need. Lastly, the stand is pretty bad, so if you need to angle the TV up or down, well, you’re not going to! All in all a good quality smart TV for the price, but with some unfortunate hassles.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Samsung 32 inch smart tv","reviewDescription":"Feet very hard to install. You can not adjust tv to 16.9 ratio. Or movie mode. Only has standard option working. You loose a lot of the tv viewing size. Remotes buttons are very similar, so have to have light on to use. I usually love Samsung products, but this is a miss for me. It was for a bedroom use. Picture quality is good, just viewing size smaller than my last Samsung I had, but did not have wifi, so I opted to buy this. Don't know why it has options you can't use.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Remote horrible","reviewDescription":"24 hours after receiving… not happy. As a older person the blasted remote is horrible. Still trying to get the picture size set using custom option.The picture is great I just need it to move up so I can read info on ESPN that is on bottom of screen. Trying to get info on remote and tv is not user friendly. Going to need one of our grandkids to come fix the screen size.  My smart TV makes me feel stupid.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"A smart tv for a technically challenged purchaser..questionable choice","reviewDescription":"Size, weight, picture quality all good, sound ok for price. Amazon referred me to a samsung expert who was very difficult to understand even after repeating words or phrases more than once; eg..until I checked every label on the remote I had no idea he was referring to \"setting.\"  He did get annoyed after my constant asking him to repeat a direction. He then would repeat but he would give me 3 or 4 directions, one after the other which made it even more frustrating for me to follow and frustrating for him having to repeat so many times. He did insinuate my inability to follow his directions was my problem not his. Disappointed that no printed manual comes with set even though some form of e manual is available on screen. Still cannot access basic channels Verizon said are available as before from the same cable box hooked up to set HDMI. Samsung agent could not help me with that problem. After his frustration and mine, we were disconnected. I experimented with the remote and realized many things I could access from the remote and still more that I could not access. Think I will really enjoy the TV if I can find some help online, from friends or acquaintances more technically savvy than I, or hopefully from some samsung webpage. Also not sure what free choices I have and which require membership with fees (or are there apps that require membership but no fees.  I admit, I am not smart enough to meet the challenge of my new TV.","isVerified":true,"ratingScore":3,"reviewReaction":"179 people found this helpful","country":"United States","date":1614470400000}
{"reviewTitle":"What did I miss?","reviewDescription":"I never owned a Samsung television but when I saw the price, I decided to give it a  try. It's the worse mistake I have ever made when purchasing electronics. I'm no expert, but I keep wondering what did I miss? I had no idea I would not be able to get local channels or hook into cable channels using my provider, which is DirecTV.  I am floored and am wondering whether it's worth it to return the television.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"Good tv, terrible interface","reviewDescription":"We have You Tube TV and trying to get it to work on this TV was a nightmare. It doesn’t come as one of the included apps. There are a number of SmartThings lookalike apps on the App Store, so finding the correct Samsung one is tricky. The remote doesn’t work very well and the setup is the worst I’ve seen on a tv. We finally did a workaround using the iPhone that is a bit cumbersome but it works. The TV itself seems okay, but if you use YouTube TV I’d opt for a different model.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"Good and bad.","reviewDescription":"The TV has a good picture. The remote they gave me was useless. The majority of buttons I pressed did nothing. Also there was no mention of a soundbar. Didn't realize I needed one until I received the TV. I have the volume at least eighty to hear anything. I went back the site and it took three clicks before I saw the soundbar.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697846400000}
{"reviewTitle":"Good TV, lacking a few things","reviewDescription":"Firstly, the picture quality is great. But in this day and age, MOST tv's are of comparable quality to each other. I don't see the hype to get a 4k or other expensive tv's unless you're really into sports. I've seen movies on these expensive tv's and I hate that it changes the movie movements and gives a completely different experience.Now to the issues I got with this TV. First, the mandatory setup with samsung SUCKS! Who wants to open up a tv box and be forced to setup a profile and connect to wifi? What if I got a firestick, which I do, and just wanna use that? What if I just wanna use my antenna? This was  BIG turnoff. Glad it was just for my mom. I would surely return it. Also, in this day an age, tv's should come with a wall mount. It's just a few dollars extra, and shouldn't be optional at this point.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"samsung tv","reviewDescription":"The TV price was too good to be true, but you get what you pay for no capabilities for a head set and no sleep mode button when I go to sleep like to have TV shut off but they did not have the capacity but over all its a work horse and the picture quality is decent.  But if I want more I will have to pay minimum price $1000.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"Parts missing","reviewDescription":"TV arrived as scheduled. Unfortunately, the mounting screws and leg covers were missing. Had to go to hardware store to get the correct screws to mount the legs. Not what I would call the best situation even for prime day deals. The leg cover plates would be nice but not necessary.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"2 months and the sound is wacked","reviewDescription":"Not used much and two months bought from amazon and the sound is wacked just junk. Now I'm stuck with a piece of junk.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1667606400000}
{"reviewTitle":"No Bluetooth","reviewDescription":"It shouldn't be called a smart TV if it doesn't have Bluetooth","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679184000000}
{"reviewTitle":"horrible volume!!!","reviewDescription":"Very disappointed with the volume for this TV. This TV bought for my elderly mom who doesn't hear so well but loves her TV's.  Cannot believe the loudest volume on this device cannot be heard well by her across an average size living room.  If I hadn't disposed of the box so quickly, I would definitely be returning it.Otherwise, the picture is beautiful, nice HD.  Remote easy enough.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1599264000000}
{"reviewTitle":"No bluetooth","reviewDescription":"How is it that in 2021, Samsung - who is a leader in technology - sells a tv that has no bluetooth? The picture is great, the sound is great, but the lack of bluetooth makes this a huge fail.","isVerified":true,"ratingScore":2,"reviewReaction":"250 people found this helpful","country":"United States","date":1617667200000}
{"reviewTitle":"Bad set up design","reviewDescription":"Set up to use as a television should be easy. This one is frustrating. I bought it to be entertaining, and do not need it to talk to my refrigerator, dish washer or dryer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651881600000}
{"reviewTitle":"Doesn’t stay connected to wifi","reviewDescription":"I have to reconnect this TV every single time I go to use it. It’s the biggest pain in the butt and not at all worth it. Sound and picture suck too.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647302400000}
{"reviewTitle":"Bass audio blowing out speakers.","reviewDescription":"Can't control bass on audio setting...rattling.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676851200000}
{"reviewTitle":"Not the same quality as my 15-yr old Samsung.","reviewDescription":"Had to call on a couple issues, so far.  Customer service has been great.  TV does a lot of \"buffering.\"  Seems to be made much more cheaply.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647043200000}
{"reviewTitle":"Inferior sound quality. I ended up buying a new tv (different brand)","reviewDescription":"Everything is OK, except sound quality. My $50.Trans Smart speaker i s much better than the TV's sound. I expected more from Samsung.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653955200000}
{"reviewTitle":"Streaming failure startup issue","reviewDescription":"Tv will not turn on next day after having used streaming and apps. Have to unplug, wait 30 seconds (or more) or more, plug back in and turns on fine. There’s a direct correlation between using streaming features and not turning on. When only using cable service, seems to not have this problem. Concerned this issue may worsen over time. Also disappointed that its not Bluetooth and has no earphone jack!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1572048000000}
{"reviewTitle":"Audio problems","reviewDescription":"Audio cuts out in the middle of watching things. Turning the tv off\/on does not fix the problem. I’ve had to reset the tv by unplugging it, waiting 30 seconds and then plugging it back in. The Self Diagnosis option in Settings does nothing to fix this. Good luck getting help from Samsung.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686268800000}
{"reviewTitle":"TV stuck in zoom mode and Samsung won't honor warranty","reviewDescription":"This product failed after a few weeks of being installed.  The TV is stuck in a full zoom mode and Samsung won't honor their 1 year warranty.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"Bad sound quality, and you have to register with Samsung to use it","reviewDescription":"I thought this TV was overrated. The setup instructions tell you to download an app and register (I have to become a commodity to turn on my new tv?), and in the middle of that there's an affiliate detour that tries to trick you into purchasing a subscription for something you don't need. Escaped that trap and turned it on, and quickly realized that good quality sound is not included, you have to buy a soundbar or some external system. It's a ripoff.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1680220800000}
{"reviewTitle":"On\/Off Power (Red Light Indicator) Defective\/Inoperable","reviewDescription":"I purchased this Samsung TV to replace an identical Samsung TV that had quit working (black screen) after only two years of use.  This replacement Samsung TV stopped working after only 5 days!  I notified Amazon and a replacement is on it's way, but I am not very hopeful that the next replacement will be any better.Basically, the red power light which is on when the TV is not in use, will start blinking intermittently, (indicative of a faulty power module), and then the screen goes black and the TV cannot be powered on.I have always liked Samsung TV's, going back twenty years or so, but these last two Samsung TVs have really disappointed me.  If the replacement TV doesn't hold up, I will move on to a different brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648080000000}
{"reviewTitle":"Not technological advance","reviewDescription":"The picture is always dark.I could not figure out how to connect the TV to my phone. I kept the TV because it was too much of a hassle to return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"Shipped without pertinent screws for feet.","reviewDescription":"As a smart television, i think it has a lot of neat features as someone who has a galaxy smartphone \/ Samsung account. However the ball was dropped heavily in the fact that the 4 screws meant to secure to feet to the television did not ship with the product. I currently have the feet taped to the television in order to have a working unit until further notice.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"Monster to set up.","reviewDescription":"I have comcast xfinity for my provider. I wanted a simple TV that I can plug in and use. I have a bluetooth headset that I want to install and my old TV could not do that. I saw this set is a new smart set and took that to mean I can use the headset with it. The problem is I can't even get my xfinity to work with it. It comes with it's own Samsung plan and channels.The workaround to install xfinity is long and hard. After two days I still don't have it working.I thru the box away all ready so shipping it back would be too hard so I am stuck with it. I am seriously thinking of just tossing it in the trash and get the old TV out of the closet.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1635638400000}
{"reviewTitle":"Does NOT have bluetooth capability! Not so smart...","reviewDescription":"For a modern \"Smart\" TV, it sure was sad to learn that this TV doesn't have the basic, frequently necessary function of Bluetooth. Unless the sound system you are connecting to is WiFi (most aren't), you'll need to spend a hunk of more money so you can connect this TV to sound. Or you can go with a lot of wires stringing about... Samsung, you can do much better!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678924800000}
{"reviewTitle":"You can't get all app channels with this tv","reviewDescription":"The remote buttons are tiny and too close together so you are constantly accidentally pushing the wrong button if you aren't watching your fingers. You can't get all of your normal apps on this TV without buying an Amazon cube or roku style device. So disappointing. The sound and color are low so make sure you go into settings at adjust them first.  I would have returned it for a different tv but I missed my window by 5 days and didn't save the box because who needs to return a brand new TV. So disappointing for an old lady not to have her channels.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1660176000000}
{"reviewTitle":"Disappointed!","reviewDescription":"The light is showing by the top middle of the frame. I went with Samsung, even though it costs more than other brands, because we’ve always gotten their TVs with no problems but they’ve seemed to lower their quality since I’ve last purchased one.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1684368000000}
{"reviewTitle":"I thought my old tv was bad","reviewDescription":"I like the quality of the tv. Customer service was fantastic. I have a couple of serious issues and a lot of ticky-tack fouls, but I have only had it working for three hours maybe something will change. If you hit a non-letter key while entering your username, you start over. The paper user guide that comes with it is worthless: there are no instructions on using the tv in it. I know it seems obvious, but the start-up manual does not tell you to plug the tv into power. The tv rejected my attempt to register it during set-up then refused to recognize my wireless internet. Customer service was fantastic, spent a hour helping me get through the mess. The menu is about 11 icons on the bottom of the screen. Most of them are subscriptions. Could not find a way to either delete them or to more the channels I want to the left so I don't have to click umpteen times to get past the ones I will never buy (Netflix, Disney, etc). When setting up, the skip button does not work; you have to click the next step number. Privacy Settings are ridiculously complicated; I gave up trying to figure out how to change them. Manual is useless in that regard (and just about every other regard as well). Adding a channel does not add it to the menu; you have to do that manually. Channels are considered apps; use the app button to add one. But after you add one, when you click the add button to add another, it takes you to the channel you just added, NOT to the add apps screen. Powering off and on worked sometimes to get back to the add apps screen but not often. Screens time out way too fast. Frequently the Home button doesn't, and you are left trying to figure out how to get out of a submenu on your own. With some items on the menu bar (like Disney), it is difficult to tell which icon is selected; you have to move the selection to figure it out. The on-screen keyboard is really screwy. Click a letter and a checkmark covers the letter to the left. If that is the letter that you want, you have to move left twice: once to the letter, which clears the check mark, and once to select the letter. Frequently the letter that is selected changes to a different letter when you move the selection, then changes back when you move the selection again. Frequently when you click the Setting button, the Settings screen does not open leaving you wondering what to do; actually the first couple times it happens, you don't know that anything is wrong, so the instructions, if you found any, appear to be wrong. I didn't find any info on the remote control, like what the PRE-CH and A, B, C, and D buttons do. That's enough; you get the idea. OK, I hate it so bad that I have to continue. The user interface is aweful. They are so busy trying to get you to watch the channels they want you to watch it becomes a chore trying to watch your channels. I have the Newsmax channel on in the background 4 to 6 hours a day. Every day I have to search for it. When I find it, they offer me Newsmax on Haystack. When I select Newsmax, one more time they offer Haystack. When you move the selection, I mentioned it above, it is hard to tell where you moved it to. While you are trying to find it, the thing times out, takes you somewhere you don't want to go, and you have to start all over. If I could afford it, I would toss the thing; I'm 74 years old and on a limited budge. I guess I'm stuck with this thing for the rest of my life. :(","isVerified":true,"ratingScore":1,"reviewReaction":"72 people found this helpful","country":"United States","date":1646265600000}
{"reviewTitle":"Good TV ruined by worst Remote Control on Earth.  One star for Crap manual and support .","reviewDescription":"Don't count on Plug & Play with this \"Smart TV\". It makes you log in with a Samsung Account first. Don't have a Samsung Account cuz this is your first Samsung TV???Well prepare to spend up to an hour of your time trying to negotiate the On Screen Instructions cuz there is no printed manual to show you how to set up an account and the on screen instructions are confusing and inconsistent in language.User Name = email address.Bet you didn't know that?Menu pushes you to download the mobile App which is nothing more than a way to get to sign up for a paid subscription to Samsung, another source of income for an already expensive TV.Don't download the APP cuz you'll just delete it as soon as you realize you have to pay for it.The whole setup was so frustrating I looked for contact infor for Samsung I could call. There's no dialup help for new buyers, only an email that promises to respond to your Samsung Account. Oh, you don't have an account right?I then called Amazon Product support and spoke to a very nice man in Capetown, South Africa, I kid you not. He was very nice but only recommended I try to set up another Samsung Account to start over. I was gonna do that anyway, so no real help.If I knew all this before, I would buy another brand just for an easier set up and a remote control that is a confusion of buttons. I want one just like my DirecTV remote. Simple and direct.Samsung has zero support, terrible remote, no manual, up sells their App.I did eventually get to watch a very beautiful picture tho.If I had it to do over, I'd get another brand with better support.","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Updated for the 3rd time. Fix the closed captioning issue!!","reviewDescription":"My old 32-in Samsung started having lines through it and acting weird so I bought this for myself for Christmas 2022 and decided to get a larger size. I love that it has more antenna channels than my old TV could find and the awesome bonus Samsung TV plus channels makes me feel like I have cable! LOVE IT!! After 2 weeks I came home and turned it on and the sound was very muffled so I called customer service and all I had to do was unplug it for 30 seconds and plug it back in. I am happy with it! I just hope there's no more issues with the audio because I saw a lot of reviewers talking about that. The remote is smaller than my other ones which is kind of a pain in the butt and I have small hands. So I use my older remote for certain things. Otherwise very pleased and thrilled that it has all the apps (even hulu!) except the CBS app and regular Paramount so have to use my roku on my other TV for that.Update oct 2023 so like many were saying about the audio it occasionally  BLASTS a muffled hot mess until you unplug it for a few. I ended up getting a soundbar which definitely helps me hear the TV better without blowing out the speakers. I dropped it down to a 5 star to a 3 because of the audio, the closed captioning and the auto smart hub feature. Every time I set up closed captioning it disappears again.. plus the smart hub auto runs even though that is always turned off.. I should not have to unplug my tv every single day or multiple times a day to get the closed captioning to stay on and auto hub to not pop up. I read that it's some kind of a bug in the code or something all I know is it's annoying. Even with the Soundbar I still like to be able to read what is being said so I don't have to rewind on an app or so I don't miss something on live tv because sometimes I don't understand what people are saying. Samsung do better with the closed captioning and make sure your settings stick!Updated December 14th 2023. I am so sick of the closed captioning issue I downgraded to a one star. Why is everything new crap?","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1672012800000}
{"reviewTitle":"Does it work?","reviewDescription":"I bought this on sale at Amazon during the Christmas holidays. It came when promised and I set it up with the help of the cable guy. I wanted to make sure I didn't screw it up. The picture, sound, and size were better than what I had expected. For five days I was in bliss. This was going to be a good year. All my favorite show would be a joy to watch. On the sixth day in the morning, I tried to turn the TV on with the cable remote. The cable box came on, but the TV did not. I tried the remote that came with the TV. Nothing. I tried again with the manual button and got nothing. I sent it back for a refund. Then I ordered another one just like the first. What would be the odds of two TV's doing the same thing? ( I really could have used Mr. Spock.) I set it up and it worked great. The next morning the same thing happened. This time I unplugged it, waited 30 seconds and plugged it in again. It worked. I called Sam Sung and spoke to an agent and told him everything. He said that the TV was making an adjustment and to give it a week to see if that would correct it and to call back if it happened again. Well, it happened again. This time he wanted me to unplug it and wait for 60 seconds, replug it and see if it happens again. If it does it again I'll speak to a supervisor. The model number isUN32N5300AF. I try to be patient with people and let them solve problems that come in front of them. I'm retired and I'm getting old. Some people may think me a fool, but I believe in giving people a chance. However, I can only go so long then things must change for the better. I hope this will help people in their choices. I hope you have better luck than me.","isVerified":true,"ratingScore":1,"reviewReaction":"515 people found this helpful","country":"United States","date":1548201600000}
{"reviewTitle":"Freezing Update","reviewDescription":"Purchase this Samsung 32 inch smart tv not even a month ago and it just constantly freezes, its undated with the latest 2501.1 upgrade, you can cycle the set for 30 second to 10 minutes and it still hangs and then freezes and for what ever reason it freezes on certain hd channels more than none hd channels.So much for smart tv's for me im returning this thing asap'11\/27\/23 Update,.. connected with Samsung tech support. the tech remoted my set, and without doing a reset, (undoing all my setting) the set hasn't frozen once,.. Caution' its only been accouple hours and i don't like leaving negative reviews, so i'll stay with this for a month or so, just to be fair to the brand'","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Poor Management","reviewDescription":"I Purchased this TV and it was sent to me directly from Samsung Store. I opened the box and the first thing I noticed was the remote and the power cable was no on the original package. There was no package for those two items a all.  That's when I realized the TV was used. I didn't bather taking it out. Right away started the return proceeding and I want it to send an email to Samsung regarding this outrage situation. I need the TV but I don't trust them now. If I decide to purchase another, I'll need the guarantee it won't be a use one. I can't rate the quality of the features, because I didn't get a chance to use it.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Software Crashed and Service is Fully Lacking","reviewDescription":"After only six months of use, I turned the television on to find what I am told is a USB icon. Customer service indicated I had exhausted all possible fixes and they would escalate the issue and I would be contacted in 24 to 48 hours. After six days, I called back and was told it was never escalated (despite written confirmation that it was done). Now, I am being told I need to take it to a service place an hour from my house. I am already three hours into trying to get this repaired. Two round-trip drives to drop it off and pick it up would add four hours to the time I am spending on this. So after one week and too much of my personal time, I am cutting my losses and will simply purchase any other brand television.I dealt with Samsung customer service regarding my refrigerator and between these two experiences, I cannot suggest strongly enough to avoid this brand at all costs.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1690848000000}
{"reviewTitle":"Horrible TV for streaming","reviewDescription":"I so wanted this TV to be my bedroom TV but it is horrible.  It defaults to SamsungTV which has nothing I want to watch.  The remote is cumbersome and I can't get around using it because to get to YouTubeTV I have to do several actions with it.  It will not restart directly to the last app it was tuned to although it has that as an option in settings - it just does not happen.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"No USER GUIDE !","reviewDescription":"I followed the instructions to download a USER GUIDE, but it directed my search to BEST BUY which now owns Insignia. Nowhere on the Best Buy web page is there a link to download manuals. I started a dialog to and was constantly told that someone would assist me. Finally, it timed out. I tried again and was given a link with instructions to download a file that was 45 MB on my computer and then download a program that would uncompress the 45 MB document. Unwilling to uncompress a huge document onto my computer, I gave up. I do not buy another Insignia or Best Buy product.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Broken tv","reviewDescription":"Both the initial tv i bought and replacement tv were damaged. I decided it was better to get a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"The actual screen size of a 40 inch television is only 34.9 inches.","reviewDescription":"The fact that is not clearly written  that if you buy a 40inch television the actual screen size diagonally is only 34.9 inches.  This is so wrong, the product information should clearly let the consumer know what is the actual screen size in the first paragraph.  It’s times the consumer get some respect from the manufacture and get what they are paying for.  What a shame that this deceptive practice is industry wide.  Why is this information buried?","isVerified":true,"ratingScore":2,"reviewReaction":"15 people found this helpful","country":"United States","date":1619568000000}
{"reviewTitle":"Not Bright","reviewDescription":"I love Samsung televisions and have had a few but this model is not bright even after adjusting the brightness. I'm on the highest setting.  I'm very disappointed with this TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673308800000}
{"reviewTitle":"LOVE samsung, but not this!!","reviewDescription":"FIRST of all, Box came re-taped! We were on vacation, so by the time we got home to set this up and opened the box, we realized there are NO FEET in the box!! We literally could not set this tv up on our console... we will now have to mount it on the wall or return it. SO DISAPPOINTED!! Seems like Amazon purchases are getting worse and more careless. Will NOT buy again... :(","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1628294400000}
{"reviewTitle":"Not so good. Not even close.","reviewDescription":"This TV worked well for about a month and then it would not go on when we use the remote. I tried unplugging it and plugging it back in and it worked. It's a good TV if you don't mind unplugging and plugging it in again. Well it just keeps getting better all the time. I received an update the other and it felt it needed to be set up all over again. It went ok until it asked what language I spoke and now 3 days later I still cannot select my language. So I have no working TV. I am so sorry I wasted my money on this tv.","isVerified":true,"ratingScore":2,"reviewReaction":"19 people found this helpful","country":"United States","date":1541376000000}
{"reviewTitle":"The Sound Sucks!","reviewDescription":"Every time there is a loud sound in a movie, it makes a boom sound, a horrible sound that stays with the movie for minutes. We tried getting a sound bar to help it out but nothing helped! I wouldn't recommend this TV to anyone!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1656460800000}
{"reviewTitle":"Very flimsy stand--likely to tip over","reviewDescription":"Had to return. Surprised Samsung would put out a product with this extremely flimsy stand--an accident waiting to happen","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1676419200000}
{"reviewTitle":"Not so smart TV","reviewDescription":"I bought this TV to add Apps because I have a 58 inch Samsung that you can get them and antenna on.  All that I am able to get is the same channels that I was getting on a Firestick.  The old TV I replaced at least would get antenna TV.  Very disappointed with this product.  I should have returned it before the time ran out to send it back.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1623888000000}
{"reviewTitle":"Very slow.","reviewDescription":"Screen is extremely fragile and it takes forever for the channels to change.So what idid was cut a piece of plexi glass the size of the screen and fixed it on there with tape ,now I can throw almost anything at it and I don't have to worry about it breaking!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647907200000}
{"reviewTitle":"cablecutters only","reviewDescription":"i stiil watch  majority of shows via cable (mostly sports) and this unit has extremly poor compabiity with my system. Its okay when I use it for NetflIX\/Amazon Prime or HULU but anything else it is clunky and mult-step. Remote is not compatible with my system so now I have the cable remote and the Sansung remote for volume--my LG was able to fully integrate both and that is what I would recommend. SAMSUNG provides thier own cable shows a wide selection but I would generously catergorie those shows as the D list","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1603497600000}
{"reviewTitle":"My Remote Control is a Riddle","reviewDescription":"I have to do everything but stand on my head to make this remote control work.  I've replaced the batteries, I've tried pointing it at every angle.  It has no sweet spot (I could live with that), but there is no rhyme or reason as to how to point this remote at the tv to make it work.  Please help!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1627516800000}
{"reviewTitle":"Good Product","reviewDescription":"Picture is very sharp.  My only quibble is that the color fades fast as you move off-axis.  This really only affects the picture if you are sitting VERY close to the TV and off to the side, or looking at it from an angle in passing; like from a doorway.  From any normal viewing angle it is excellent.  Shipping was excellent.  The TV arrived two days ahead of schedule.  Very satisfied so far!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620086400000}
{"reviewTitle":"Sound quality blows","reviewDescription":"The picture is great. The apps are great. Everything is great but the sound quality is poor. I have to crank it up to 75 or so to be able to hear what they’re saying (and I’m not hard of hearing). I also turn on closed captioning. I have another (larger) Samsung that is great. However, I wouldn’t purchase one again.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1634342400000}
{"reviewTitle":"Nice device but you may not like the TV plus interface","reviewDescription":"A nice looking picture for the money BUT If you still subscribe to cable you will find the Samsung \"TVplus\" app a pain in the neck - a cluttered screen that is hard to navigate and full of commercials you don't want to see.  We found the easiest (maybe the only) way to navigate around it is to use the Samsung remote for on-off and settings and your cable remote for everything else (you'll have to on-off that too).","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1616976000000}
{"reviewTitle":"Not loud enough","reviewDescription":"Size is good picture is ok, but sound very low even on max, I can’t hear what ppl say in the movies, have to put subtitles (( kinda annoying","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1658102400000}
{"reviewTitle":"Great TV WITH HULU but poorly made remote","reviewDescription":"Great TV that absolutely has HULU. I don't get the people saying it doesn't. The downfall with this TV is, the remote is the most poorly designed piece of alleged technology I've ever seen. It could not be harder to use if you had to hold angry bees while navigating the apps.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1637020800000}
{"reviewTitle":"Good product for the price","reviewDescription":"The remote is so cluttered that it is hard to use. The arrow On the Internet is hard to control.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1659916800000}
{"reviewTitle":"Not as bright as expected","reviewDescription":"Works great.  Actually uses my 5Ghz WIFI.  Remote batteries INCLUDED. Did not have to scan for local channels.  It found all of those on its own!I use this primarily with my Xfinity box. Somebody asked why I did not just get a monitor.  HDMI monitor with sound would have been more than this TV,  Go figure.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1618963200000}
{"reviewTitle":"It was maybe an inch longer on the outside frame than my previous 32\" Samsung.","reviewDescription":"I had some trouble with the setup ...  I have to laugh about it now, but make sure your cable box is turned on or you won't connect to anything-  even the WIFI.  There's a lot of extras that comes with the Smart functions - I'm still looking through everything available.  Great picture, big improvement over my 720 pixels, although I didn't realize it was a 60 hertz frame-rate when I ordered it.  1080p is perfect for a 32\" flat screen; I honestly wouldn't bother with the 4K or higher on this size screen.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1589587200000}
{"reviewTitle":"Great TV for the price","reviewDescription":"I expected to have to jump through hoops to get this tv set up with my external antenna and my Amazon Fire TV system but was pleasantly surprised at how easy it was. The picture is excellent and the remote works great even with my fire setup. The only complaint is that there is no easy way to use Bluetooth headphones with the set. It can possibly be done but requires you to purchase an adapter from optical to RCA.If you are looking for a second tv and don't need a headphone connection, this is a good one to look at","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1545004800000}
{"reviewTitle":"It was almost prefect","reviewDescription":"Overall I like this TV. One of the 'picture mode' settings did not work correctly, but, since it was one I did not want to use, I kept TV instead of returning it. I did not want to go through the trouble of sending it back and maybe getting one that was worse. TV still has 1 year warrantee I can fall back on if necessary.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1615161600000}
{"reviewTitle":"3 months now the sound isn’t working","reviewDescription":"I was a huge fan of this TV despite some of the reviews. I didn’t mind that it isn’t Wi-Fi or Bluetooth able. And I was going to recommend to a friend because I felt it was responsible priced. However today the sound is completely out and I hope I’m able to return if not total money wasted on what I thought was a good deal. If I can figure out what happened to the sound I’ll revise me review. Buyer beware","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647734400000}
{"reviewTitle":"No bolts for the legs of tv","reviewDescription":"Thank goodness I had ordered a tv stand in case the legs would not work on top of the dresser the tv has to set on.  The base legs for the tv were in the box, but the screws to attach the legs to the tv were not in the box.  Samsung asked me if I needed the screws and I had to explain that when I buy a new tv, the hardware to put the legs on is a vital component.  In 7-10 days I should have the screws for the original legs for the tv.  Any tv is useless without being able to get it to stand upright!  :(","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1619136000000}
{"reviewTitle":"Can’t mount it. Garbage remote.","reviewDescription":"First thing I noticed is how horrible the remote is. I should have read more reviews because many reviewers stated the same thing.I can get over that because this tv was going in my bathroom so I won’t be using it nearly as much as the others. What I can overlook is the fact that there aren’t any holes to mount the TV. One reviewer said that there is a certain Samsung mount that can be used but I didn’t see anything that made me thing mounting is an option. In this day and age, no tv should ever not be able to be mounted.As to the picture quality I have no clue because I’m sending it back because it has to be mounted for my particular use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1603411200000}
{"reviewTitle":"Decent TV.  Remote is hard to use.","reviewDescription":"I purchased this unit due to the tight dimensions I had to work with.Overall the picture and sound are good and the streaming Samsung TV channels are a nice plus at no cost.The remote is very difficult to use and the buttons are very small.  About to abandon all the features and plug in a Fire Stick with TV controls.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651968000000}
{"reviewTitle":"Why is sound muffled","reviewDescription":"All of a sudden the sound is muffled on the TV. I turned it off and then turned it back on. It seems to be working better now. Anyone else ever have this problem. Annoying and we just got it! If this happens again it’s getting a ticket straight back to where it came from.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1657238400000}
{"reviewTitle":"Sound muffled after 3 months","reviewDescription":"Great tv for first 3 months but then the sound is just horribly muffled.  No reset or anything corrected it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681948800000}
{"reviewTitle":"does not work with Alexa - it's a 2015 model!","reviewDescription":"This is a 2015 model, according to Samsung, not 2019 as Amazon falsely claims.  As a result it doesn't work with Alexa.  Amazon shouldn't be selling 7-year-old TVs without telling customers that.Image is good, sound is OK, so I gave it 2 stars.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Died within a year...","reviewDescription":"Bought this while we were having our kitchen remodeled.  Didn't actually take it out of the box until almost 2 months after Purchase.  Less than a year of it being up, it has stopped powering on, or showing any sign of life.  Have no way of contacting g seller since I'm past the support window from Amazon, so I'll have to go through samsung direct, but I doubt I'll get anywhere","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1637712000000}
{"reviewTitle":"Misleading answers wit this TV being compatible with Peacock.","reviewDescription":"I ask a amazon question asking if this TV could get the new tv streaming app peacock? I got 3 answers from Amazon customers or salesman saying yes it does. However, when I received the tv and tried to search and add the app. I didn't see it and also, did my own research and saw that Samsung TV are not compatible with Peacock. I am very disappointed in the answers I got, and the fact that they were wrong is very misleading. So, I don't know who really answers those questions, but I hope this doesn't happen again.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1618963200000}
{"reviewTitle":"no Bluetooth","reviewDescription":"It does not have Bluetooth capabilities.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"Okay, but with a few issues","reviewDescription":"TV for the most part is decent enough.  I only bought it a month ago and I notice that black colors can appear blotchy.  Not sure if that's a streaming quality thing or the TV itself.  I have a good connection and many streaming apps and some places it happens and others it does not.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"PITA to setup with just ethernet","reviewDescription":"You have to add an app to your phone to even setup the TV if you are just using ethernet. Then there's account to set up codes flying to your email and another phone for some reason. Just a mess setting up. Big giant turnoff. Never had to use an app or any of this crazy crap for older smart tvs. They must want to sponge up all kinds of info.  First day so I won't comment on how well everything else is. I was about to throw this thing out the window and buy a vizio.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681430400000}
{"reviewTitle":"color","reviewDescription":"color is NOT good at all","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"Sound comes in and out","reviewDescription":"So dissapointed 😞 we've had this TV just under a year and the sound ocassionally goes in and out! Our last samsung lasted an incredible 15 yrs no issues. Not what I'd expect from.a.samsung product. Unfortunate.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"Great picture+ sound, janky controls","reviewDescription":"The remote is awful, and power cannot be controlled by HDMI devices (Roku etc), the Samsung Smart TV functionality is absolutely horrible, slow and frustrating, so Roku is a must","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695168000000}
{"reviewTitle":"Not what I expected...","reviewDescription":"First, this tv doesn't have the most basic apps like VH1 and MTV. I am sure there are more but those are the two that I quickly noticed.Second, this tv feels like a first generation smart tv. The remote is slow to respond and the different features, settings, etc. are not easily located. Point is, the tv's features are very clunky.Third, the remote is not great. Only because its buttons are not placed in a user friendly way.Fourth, to get quality sound, you have to go to about 40 or 50. That's unfortunate because the tv's last sound interval is 100.I wish this tv was more plug and play, but I've had it for a week and I'm still trying to get used to where things are, its speed (lack thereof) etc. Thankfully, I still have my Roku Stick that I can plug into once I've had enough of trying to figure it out.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1661126400000}
{"reviewTitle":"Unsure","reviewDescription":"This tv is ok.. but it has its issues.. one being.. it drops the volume.. nothing no volume.. I have to shut it down reboot my cable box.. turn everything back on to get volume.  I would rate it a 5 out of 10.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"No Soundbar","reviewDescription":"Tried attaching 2 different soundbars; TV doesn't support bluetooth, and neither optical nor HDMI ARC worked with either soundbar.  Built-in speakers are all you get.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1688947200000}
{"reviewTitle":"Could be better","reviewDescription":"Unfortunately, I have received this TV broken - the screen was severely damaged, and I had to return it. Ordered a replacement from Walmart, which arrived in 2 days with free shipping! Overall, its a good TV with a very decent picture and sound quality for a small set. Also, it is one of the better TVs of this size, and it is very easy to mount in a small space. However, there a few things to consider before buying it. First, it appears to be overpriced. For $40 more you can buy a 50-inch Samsung smart TV, 6-series, which is much better then this one in every possible way. Second, the speakers are relatively loud, but the sound is a little distorted - somewhat metallic and unpleasant. Third, the picture is very bright, but the colors and contrast are not quite realistic. Perhaps the greatest disappointment is a not so smart (and somewhat irritating) \"smart\" component. Whereas the TV comes with preloaded applications, the setup is not user friendly, and Samsung does allow for any meaningful customization. Moving from one application to the next, changing channels and viewing guides is much more difficult compared with streaming devices, such as Roku. Also, there are almost no additional applications, which can be downloaded from the Samsung store. I have another (older) Samsung TV, which works much better for streaming Internet content than this one (with a Roku streaming stick, which can be purchased for $30-45). One advantageous feature is an inbuilt browser. However, it's is hardly usable without a keyboard and mouse.","isVerified":true,"ratingScore":3,"reviewReaction":"18 people found this helpful","country":"United States","date":1543622400000}
{"reviewTitle":"Great picture, horrible remote","reviewDescription":"TV was a little smaller than expected. I should have ordered the 37” model. Setup was not that easy. You can either do it from the tv or using their app. I tried both. Connecting to the internet was fine. The setup process was a little annoying but I finished registering all apps in about 20 minutes.The sound is a little low, but it’s a small TV.Don’t get me started on the remote. I’ve seen better ones at the Dollar store. (See pic) The buttons are ridiculously close together so you are going to push the wrong ones. A real pain during the initial setup process. And I’m sure I will cuss when trying to change the channels at night in my bedroom. I will look for a replacement later.I have this TV connected to my Media Server which by the way was a pain to connect. There is no menu on the TV to do this. I had to go to my server, and force a video (casting) to play on it before the TV finally gave me an option to allow the menu to be pinned to the home page. I did not have any of these problems with my Samsung 55” tv I bought several years ago. I guess you get what you pay for.","isVerified":true,"ratingScore":3,"reviewReaction":"27 people found this helpful","country":"United States","date":1597190400000}
{"reviewTitle":"It Blew up","reviewDescription":"I turned it on, went into the next room, heard a series of crackling then a loud pop and some smoke out of the back of the TV and now it's dead. Thirteen months - Awesome :(","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"SERIOUSLY!!!! DO NOT BUY THIS AWFUL TV!!!","reviewDescription":"DO NOT WASTE YOUR MONEY!!! I WISH WE COULD RETURN THIS GARBAGE!!!! We bought this TV to replace our 10 year old Roku. Our Roku works better than this awful TV... There’s not much to say about the smart features (except that they’re incredibly annoying), but for some reason, Hulu works just fine but Netflix, Prime, Plex, and Disney Plus all constantly get stuck buffering or the sound just cuts out out of no where. You’re forced to constantly back out of the video and replay it (literally almost every 30 seconds) because it never stops buffering\/sound never comes back unless you force it to stop and restart. If you search the issue, it’ll just blame your connection. We’ve trouble shot our internet and have no issues with our connection. Our Roku still plays all streaming sites with ease. Only the occasional buffering. Picture quality is nice but I’d rather less picture quality if it meant I could actually watch my shows all the way through without issues. Long story short - we should’ve gone with another Roku. Buy yourself a Roku.... I wish I listened to the negative reviews on this but we were too excited for a “smart TV” and now we’re stuck with a $200 piece of garbage. Currently have it sitting in storage.... what a waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1616544000000}
{"reviewTitle":"Bad tv","reviewDescription":"TV doesn't work properly","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Defective","reviewDescription":"Sold as a brand new 2019 model. Totally defective. Sent back to Amazon for refund.They have honored their return terms.Amazon has always been so very fair with me","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Don’t waste your money.","reviewDescription":"I absolutely hate this TV. I wanted an inexpensive smart TV with a smaller screen. Before I bought this, I had a Samsung with a FireStick. The screen graphics for apps were easy to see. The ones on this TV are pretty small, and difficult to read. I’ve yet to be able to get it to mirror what’s on my computer, although I’ve been through a dozen YouTube videos.Beware that if you buy this it’s a 2018 model—so it’s already five years old. When I called Samsung for help, they didn’t believe I’d just bought it.Don’t buy this model.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1690156800000}
{"reviewTitle":"YOU TUBE TV APP does not work well on this TV","reviewDescription":"If you use the YOU TUBE TV APP Do Not Purchase this TV!  The software on this TV does not properly operate this App.  At its best, there is a 15-20 second delay between selecting something on YT TV and the app responding.  Often, once the YT TV selection is made, the buffering circle goes round and round then the screen goes black.  It dies.  This is a known problem specific to this model TV.  (Per both Samsung and You Tube TV.)  Then you have to spend about 10 minutes \"refreshing\" the tv in order for it to work at all with You Tube TV.  After months of agonizing frustration, I finally swapped this tv (that was in my bedroom) with one I had in my kitchen (that I rarely use).  I highly recommend NOT purchasing this product!!","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1668384000000}
{"reviewTitle":"RIP OFF TV","reviewDescription":"Had TV for a little over 30 days and picture quality went bad. Would not recommend anyone waste their hard-earned money on this TV. Picture quality is so bad it makes it difficult to even run diagnostics on what the possible problem may be. I will be buying my TV's from Walmart from now on. At least you can take them back when they don't work.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1697846400000}
{"reviewTitle":"Never connects to internet","reviewDescription":"All the reviews of this TV not connecting to the internet are true. This TV is the worst one I’ve ever owned. You reset and reset and reset and occasionally, it connects. This is the perfect TV for someone who wants to reduce their screen time because it rarely works.ETA: the screen broke even though it was barely used and Samsung had to come replace it. Thankfully it was under warranty because it has been less than a year. It took three weeks to get it fixed. Do. Not. Buy.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"This is a really crappy TV.","reviewDescription":"The color is awful.  Overpowering and unnatural sapphire blue, electric green, and bright red make an obnoxious color palate.  The audio speakers are incredibly cheap, heavy on the bass to the point of being painful.  The TV initialization process does not work and cannot be removed (asks to be initialized when TV is turned on, then periodically after that).  Samsung customer service is unable to fix the problem.This is the quality of TV you find in a really cheap motel.  This is a crappy TV.(Additional review comment after six months of use.  This thing is a lemon.  In addition to the problems listed above, I think this model TV has some serious and fundamental software problems.)The first opportunity I get, I will throw this one away and buy a new one from a reputable electronics company.Will never buy another Samsung product again.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1645747200000}
{"reviewTitle":"Not Roku Compatible","reviewDescription":"This is a smart tv, but it’s not Roku compatible. In order to use streaming services, you have to laboriously create an intrusive Samsung account and sign in individually to each service. Because I can’t send it back, I may pass it along to someone who doesn’t have Roku.UPDATE 6\/30\/23 Sound is now gone. This tv is garbage.Update: after setting up all my streaming services, over half the time I get the Function is Unavailable at this time message. Worst TV I’ve ever owned. Skip.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1686355200000}
{"reviewTitle":"Not what was advertised!","reviewDescription":"I bought 2 tvs. Only the 2nd time I purchased a TV new and 1 its a 2019...supposed to be smart and Google and alexa capable.  They DONT TELL YOU that you need an echo dot to do that and then remote has no voice microphone! It socks clucking back and firth between Samsung TV programs and firestick.  Entire point was not to have firestick.  My other TV a Funai, wasn't smart it needed the firestick.  I buy a TV that's over $500 for 2 of them and they need a firestick? Or an echo dot? NO WAY! I've heard Samsung  Tvs are top notch, in my opinion I'd been better off with a Phillips. ONN. or Amazon or an off brand that was new and has those features  built in. Oh and don't bother with Samsungs customer service....lol! They're useless.Im not happy. I think I may return them.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671321600000}
{"reviewTitle":"TV good.  Amazon Good.  Samsung customer support not so much.","reviewDescription":"I went with Samsung because I felt it was a good brand.  I payed about $65 more than cheaper comparible modes.TV arrived missing the 4 screws require to mount the feet.1) Called Samsung's 1800 number (twice)  Both times they told me I needed to photograph my screen and fax\/sms the Amazon invoice.  I lack that capacity w\/ the phone I have.  They had already asked me for email and suggested I screen shot the invoice and send it via attachment (apparently they lack that capacity).  Both agents confirmed that even if I were able to send the invoice as requested I would still wait 10-20 days for 4 screws (took 5 days for the TV to arrive).I gave up... contacted amazon and they save the day by facilitating a exchange.Thanks Amazon.Never again Samsung.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"Cheap remote","reviewDescription":"I am extremely disappointed in this tv I have purchased Samsung for about a decade. The software is clumsy the remote is a piece of trash.  Do not buy this tv. At the very least upgrade the remote","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Sound is terrible; switching apps is slow","reviewDescription":"You have to create a a Samsung account to work this TV.  Switching apps is a pain, the TV seems to fight it. The sound I have to turn up really high to hear it. My last Samsung TV I could hear at 9. This one I have to put up into the 30s before I can hear it clearly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Very Disappointed","reviewDescription":"I'm very disappointed in this Samsung TV.  I have a Samsung 55\" smart TV in my living room and I love it.  I wanted to duplicate the experience in my bedroom, with a smaller version.  I had expected this 32\" TV to be similar to the 55\", only smaller; unfortunately, it does not function nearly as well.As a basic TV, the UN32N5300AFXZA is fine.  Its picture and audio are decent for the price.  That's about all that's good.  The remote control is one of those old remotes with too many small buttons that have no use, making it awkward to use.  The smart functions on this TV are terrible.  The OS seems to be an older version and will not update.  The apps are also older versions than what I have on the 55\" TV and, likewise, cannot update them.  The basic set up for the TV's system refuses to work.  Every time I start the TV, it prompts me to run the set up.  No matter how many times I do that, it makes me do it again.I ended up connecting a Roku device to the TV which works better, but defeats the point of buying the TV in the first place.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1609804800000}
{"reviewTitle":"Performed factory reset which resolved sound quality issue.","reviewDescription":"I have bought tens of thousands of dollars worth of products from Amazon.  I was experiencing sound quality and the tv just going to black screen when trying to resume a program or when attempting to switch to a new live broadcast.  Finally I performed a factory reset and problems resolved at this time.  This unit has been installed about two months and I hope I don’t have to reset again.  It and another Samsung smart tv is installed on home network with 500Mbps optical service.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1679875200000}
{"reviewTitle":"poor picture, dark,...low app availabilty...no blue tooth for audio","reviewDescription":"audio is TV, optical and thats it.  Apps are non-existant, closed system. Difficult to use as a smart TV and poor pix.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698624000000}
{"reviewTitle":"I hate the user interface","reviewDescription":"I got a Samsung because my main big screen TV is a Samsung and I haven’t had 1 issue with it in 15 years and it’s still going strong.I bought the 32 inch for my room and I returned it because I couldn’t stand the user interface and remote.I gave myself 2 weeks to give it a chance and I ended up replacing it with a LG 43”. I was able to get a bigger screen due to the price difference between Samsung and LG. I instantly loved the LG remote, melts right in your hand and the user interface was easy with NO learning curve. I’m glad I returned the Samsung","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676246400000}
{"reviewTitle":"Worst sounding TV I have ever heard!","reviewDescription":"What a fantastic picture! Worst sounding TV I've ever heard in my 60 years of life. The Audio is so bad, it's like an AM radio except worse. How can Samsung put a product like this on the market? Is it to promote having to purchase a sound bar? Remember if you have to purchase a sound bar, make sure you buy all the extra cables and you'll also have an extra remote sitting on the table. I returned my purchase of this horrible sounding TV the very next day! Also, out of curiosity, I looked up 75 inch QLED Samsung TV and read reviews that had similar sound issues.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676073600000}
{"reviewTitle":"Cheap but hard to set up","reviewDescription":"When it came it had no memory left to download the apps I wanted and you CANNOT delete the apps that come with it.  What a fiasco!!!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Don't buy this TV!","reviewDescription":"First of all, it was a nightmare setting up the two little legs that they give you to hold the TV up right. And even though I did everything according to the directions, it still wasn't the steadiest. It also sits a lot lower than the average TV in my entertainment center, but that's not too big a deal. Then I tried to set the TV up I was hitting in my Wi-Fi password. I have a capital letter in my password and there was no way to make the letters capital on the little screen where you have to move around to the different letters. I ended up having to go in and change my Wi-Fi password so that I could type it in with no capitals. And then, it still wouldn't connect. At this point, rather disgruntled and just wanting to have some features for the night, I tried to hook up my fire stick to it, and that's not working. I have never needed an additional cable with any other TV to use my fire stick, just what comes with the fire stick and of course the plug to the TV. But this one is not working. I'm really trying to figure out how to return this. So disappointing!","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1658016000000}
{"reviewTitle":"Constantly drops channels, sometimes blasts volume 3x max level","reviewDescription":"Channels keep disappearing from the list, only solution is to rescan. Rescan means setting up all lists again. Have had to rescan over a dozen times this month alone, sometimes more than once a day. Scan is inconsistent as well, sometimes only finds less than half the channels. Should find 98, has come in as low as 47. Just have to keep rescanning until it decides to find them all.A couple times I've turned the set on and the volume is blasting at about 3 times the normal max level. Only solution is to keep turning off and on until it returns to normal.Very disappointed with this set.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"Firmware issue w\/ Model","reviewDescription":"After 36 hours of working like a normal tv an error icon appeared on the screen that looked like a flashdrive being plugged into a USB port. All other functions other than turning the tv off and on stopped working. Samsung costumer care had no idea how to fix the issue. They told me to download software from their website, put it on a flashdrive (expecting everyone just to have flash drives lying around in 2023), and then plug it into the tv. This, of course, did not work after I tried this all for a brand new TV. Highly recommend not wasting your time with this model.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"For a Samsung tv, this is the worst","reviewDescription":"First of all, the sound quality is terrible, squeaky at best and difficult to hear. I purchased it for my bedroom. The analog audio extension does not work at all. I had to order a Prozor digital to analog converter from amazon to use on the digital audio ( optical ) to enable my TV listener device. It works, but again very low volume. I have tried the sound adjustments, but nothing increases the volume and sound quality. The TV remote is to small and difficult to use.I would send back, but I live in Freeport, Bahamas, and after paying import duty and courier fee from Davie, Fla etc. its a loss for me all around.I will be very hesitant to purchase another Samsung TV. I have a 10 year old Samsung 47\" in my TV room which I am very pleased with.I WANT MY MONEY BACK!!!! so I can buy a decent TV.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1668643200000}
{"reviewTitle":"Not happy with this TV.","reviewDescription":"This was a frustrating experience. I had bought another Samsung that was a 43 inch and it seems to be working well so I tried to 30 inch for my bedroom. The TV worked OK for about three days. Then one morning I turned it on, and the volume was extremely loud. I turned the volume down to 1 and it was still loud, and the audio is muted, hard to understand. And I agree with other reviews that they the feet are cheaply made. Also, it skips around apps and comes on with whatever app it chooses and then it’s hard to change it. The remote control has tiny buttons. It’s hard to navigate with this remote and hard to stay on the apps that I want. The TV doesn’t seem to like finding YouTube TV so I have to struggle with it.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1681948800000}
{"reviewTitle":"Worst TV I've ever owned - I am done with Samsung","reviewDescription":"Sound issues from day 1. When I turn the TV on, there is never any sound from the connected uverse DVR. To fix this, you have to press the TV source button and cycle through all sources only to return to the original uverse source and then, amazing! there is sound! Also, from time to time the speakers emit a piercing screeching sound, no matter how the volume level is set.After also having a bad experience with a Samsung refrigerator, I am done with Samsung products. Buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1693440000000}
{"reviewTitle":"This tv is terrible !","reviewDescription":"Good points (pretty picture) bad points,the interface is slower and more difficult to maneuver. 3.the insistence that samsung has for involving their app in other producers products -way too many adds. It seems really greedy on their part. I contend that it is not Samsungs business to use their customers in this way!4. Over engineered features that I don't know who asked for.5 bad,incomplete manuals.  So, I will be returning this bad TV I don't need this frustration.  Almost forgot - the remote control mall goofy with the buttons being moved for no apparent reasons. I will not be buying any Samsung products ever again...  Thanks,from a very annoyed customer....","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1688342400000}
{"reviewTitle":"Bad product don’t buy","reviewDescription":"Ordered tv no mounting screws for legs. Returned replacement the same. Don’t buy","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"You can not turn off live tv!!","reviewDescription":"Do you hate getting to choose what you watch? If so, this is the TV for you! I am flabbergasted that Samsung made something so horrible! The search function is inoperable, it takes at least 90 seconds just for an app to open, they hide your apps and Force live tubi tv down your throat! You cannot turn off live TV, despite a programmer in the family and tons of videos and tech support we still can't turn off live TV. The 80's tvs with barely any channel options, poor reception and no ability to pause were much better than this TV! I hope to save someone from making a terrible mistake as I did. I will burn this in the yard as soon as I can afford to get anything else.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1681862400000}
{"reviewTitle":"It was great until it wasn't","reviewDescription":"TV died right at 1.5 years since purchase. So disappointed!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Not a fan of this TV","reviewDescription":"I purchased this TV to replace a non-smart LG TV. I shouldn’t have! I have no issues with my streaming service on my other TVs but this one goes in and out. Will be putting this TV in a room where it will rarely be used.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1684972800000}
{"reviewTitle":"Scammed my mom as soon as she turned it on.","reviewDescription":"There’s all these activation QR codes and connectivity phone numbers to call. My 73 year old mom just got scammed on CHRISTMAS bc she called a number on the brand new tv she was just setting up. I don’t understand how a brand new tv is full of scams. Google it. It’s a serious problem. She’s sending the piece of junk back. I couldn’t be any angrier.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1671926400000}
{"reviewTitle":"screen was broken upon arrival..","reviewDescription":"screen was broken upon arrival","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699660800000}
{"reviewTitle":"Item never worked out of the box.","reviewDescription":"The product never worked out of the box. TV would boot up but would not respond to the remote. Rebooted the TV 3 times and rebooted the remote 10 times. Replaced batteries in the remote with 3 different sets of batteries. Nothing. Contacted TCL and was informed there was a 30 minute wait. Finally got a scheduled call back but the connection was terrible. Had them call me back again and still connection issues. Never had a TV not work out of the box. I returned the item.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1651536000000}
{"reviewTitle":"DNS errors","reviewDescription":"Within 4 months it just suddenly stopped connecting to the internet. Internet service is fine, but keep getting DNS errors. Samsung told me to factory reset. Less than 2 months later, same problem, now factory reset isn’t available.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1687219200000}
{"reviewTitle":"Damaged product","reviewDescription":"Setup went fine. Noticed white lights in the display. Upon further inspection the television was dented on both sides in the back. The frame in the front was also bent back. I returned for a replacement which is now delayed. Reading the reviews for the same time as my order it appears many in this shipment were damaged product. I will probably cancel my replacement and just order it elsewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1666051200000}
{"reviewTitle":"Very disappointed!","reviewDescription":"Do not purchase! I ordered one for my daughter for Christmas and it came damaged. They send me a new one and it stopped turning on after three months. I will never get another tv from Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1684800000000}
{"reviewTitle":"Didn’t even make it 3 Years!!! 1\/2 the screen is black.","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1697846400000}
{"reviewTitle":"Sound","reviewDescription":"My sound just went out and I only had it a year in July","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694131200000}
{"reviewTitle":"Burnt out","reviewDescription":"Had the tv 2 months and it has no picture now. Only sound.Buy a better tv","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"Speakers blew out after only a few months","reviewDescription":"I was happy with the purchase until the speakers blew -- the TV is only a few months old and the sound is distorted - the TV is unwatchable. Going to throw it in the trash and head to Best Buy -- where I should have gone in the first place.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"This is 2018 Model. Had issues in Set up and online setup per enclosed instructions","reviewDescription":"In setting up we went to the website per the Samsung set up instructions and somehow ended up being offered a fraudulent lifetime Amazon subscription.  We were able to cancel the payment as it had not cleared and canceled our credit card and changed our Amazon password out of an abundance of caution.  This potential fraud was very slick and well orchestrated as we only followed the instructions provided","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"Dead after 2 years","reviewDescription":"Used this TV as a security system monitor. Lasted 2 year almost to the day. Now will not turn on. I've had cheaper TV's last longer, much longer, than this. The smart tv features are middle of the road 2018 type stuff, not responsive, slow navigation. Picture quality is actually really good. Remote if you have the older one isn't crippled with services buttons and has navigations for sleep, guide, info etc.At this point - there are 2021 and 2022 versions of tvs that make this one look like the 2018 tv that it is.....","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1672012800000}
{"reviewTitle":"Send you damaged tvs","reviewDescription":"I own a business, I ordered this tv a couple of months back and had it stored waiting to be put up. I open the box and this is what I get.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"Cheap base- ruined Xmas","reviewDescription":"Thank you Samsung for totally ruining Christmas. This company is too cheap to make a proper base so it’s impossible to get the stubby little screws into the beyond cheap, dark and shoddy plastic holes so the tv won’t stand up. I was super excited to set this TV up for Christmas and watch some shows with the family but no as Samsung couldn’t spend 3 more cents on metal screw holes so an hour of Xmas wasted wrestling with the cheap legs and TV has to be returned. Samsung you are dead to me.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1672012800000}
{"reviewTitle":"Sound quality is bad after 2 months.","reviewDescription":"TV worked fine for exactly 2 months. Sound wasn’t perfect but it worked. Then one time I turned it on and the volume shot up to 50 and was extremely muffled from that point on. To the point, you cannot understand. Luckily I had a ‘sound box’ which I now use 100% .... The picture quality is good.  The remote works about 90% of the time. (You have to push the button several times) I guess you get what you pay for.  I would not recommend it.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1673222400000}
{"reviewTitle":"VERY BAD!!","reviewDescription":"CUSTOMER SERVICE IS THE WORST. THEY ARE LOOKING TO THEIR BENEFIT AND NOT THE CUSTOMERS. MY TV SPARKED WITH A BURNING SMELL AND THEY WANT ME TO SEND IT IN FOR SERVICE. MAYBE A FIRE. THEY DONT CARE. I ONLY HAVE IT FOR 2 MONTHS.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"Buy another brand.","reviewDescription":"Very disappointed. Nothing but plastic. Poor directions. Had five people trying to program the remote including the cable man. I gave up trying to watch tv.MAOB.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Screen looks cracked, remote does not work","reviewDescription":"Major dislike, wish I could have withheld one star.Set up is horrible, instructions show a completely different remote, screen looks cracked and 'spidering' all over. Delivery driver likely chucked it on my porch, thus, the damage.Returning for 100% refund.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"No analog audio output, and remote only controls volume for the crappy internal speakers","reviewDescription":"Disappointed in this product because it doesn't have analog audio output, so I had to buy a DAC to convert digital to analog audio. On top of that, the audio settings don't have an option for fixed vs variable audio output, so I can't use the remote control to adjust volume for my precision studio monitors. The remote only adjusts volume for their crappy internal speakers, and presumably might work with a soundbar, but that's not in the cards for me.The picture is very good, and Samsung is one of the few brands that still offer component video input to support legacy video sources. But if you have legacy audio equipment in your setup, you might be in for a disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1648684800000}
{"reviewTitle":"Lasted 2 1\/\/2 years","reviewDescription":"Lasted for only 2 1\/2 years and then wouldn't power up.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Disappointed with this Samsung product","reviewDescription":"I purchased this TV in February of this year. It had major problems as of last weekend. I expected more from Samsung. I wasn’t thrilled with it from the beginning but I kept it anyway. The sound is tinny and the picture isn’t that great. I had a 1080 pixel TV for 10 years prior so I was expecting a very similar picture. It wasn’t even close. Bear in mind that this is a 2018 model. Beware. I don’t recommend this TV.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1685750400000}
{"reviewTitle":"Terrible TV set and the worst customer support from Samsung","reviewDescription":"Purchased this TV for my kitchen. Developed a problem that the TV would not turn on. After checking the remote which was ok the only way to get the TV to turn on would be to unplug and re-plug the power after 5 minutes. This is very difficult as the TV is wall-mounted and the plug is behind the TV. I returned the TV for a new one and the same problem occurred. I contacted Samsung and for 2 hours worked with a technician to install an upgrade to the firmware. The TV still had this problem. I spoke to Samsung and asked them to send me a different model TV or do something to help me. They have the WORST customer service. They insist that all they can do is have me send the TV back to Samsung and have a technician validate the problem, then they might send me a different TV or replace it with the same model. The customer service supervisor was rude, left me on hold for almost 30 minutes and could care less if she could help me or not. Very poor unprofessional behavior.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1564876800000}
{"reviewTitle":"Don't waste your money","reviewDescription":"I bought this TV to replace a super cheap roku TV that was much too slow to change between channels and this TV takes even longer I stand there for 2 minutes waiting to find the channel on the app I want to play it may be a great gaming TV I have no idea but for actually watching television shows it's the worst","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1690675200000}
{"reviewTitle":"How it fix","reviewDescription":"Did not look good, not long enough","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"after 3 weeks of installation - sound does not work","reviewDescription":"Samsung service is no help.  I purchased the TV on July 12 and installed Aug 6, after 3 weeks of use, sound stopped working.  Amazon says because it is out of return window of 30 days, I will be charged a $49 re-stocking fee.  Samsung and Amazon only stand behind the TV for 30 days?!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Cracked screen","reviewDescription":"I suppose I should have opened when it arrived but when I finally got to it the screen was cracked and the tv is worthless so buyer beware check it out right away","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Not a good tv","reviewDescription":"This tv is not good - has poor quality picture, no bluetooth, and the cord doesn't stay plugged into the tv. It just falls out sometimes and you have to turn it off, plug it back in and start over again. I regret having bought this tv. This is after having it for less than a year.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"Worst Samsung ever!","reviewDescription":"This unit is 2019 model.  Does not update via wifi. Absolutely a pain and not worth it.  Make sure you get a flash drive.  Necessary for the update. Smh!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696896000000}
{"reviewTitle":"no audio description","reviewDescription":"being blind this tv is worthless. my old tv has audio description...very out of date for todays standards","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"DO NOT BUY","reviewDescription":"Ok so the TV gave me issues with connecting Alexa, I was never able to get it connected so I just ignored it and was just like we don't need the Alexa. Then I did an update on its own and now it won't turn on AT ALL. I was offered no help getting it fixed or returned. Just an all around terrible experience purchasing this TV.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1665792000000}
{"reviewTitle":"Remote does not work","reviewDescription":"Remote does not work, screen is not that great. I just kept my old Samsung screen.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"TV DOES NOT WORK AFTER 2 WEEKS","reviewDescription":"THIS TV DOES NOT WORK AFTER 2 WEEKS OF USAGE","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693094400000}
{"reviewTitle":"Internet connection won't work","reviewDescription":"I bought this TV to use for streaming. It's connected to the Internet like all my other devices. But it will not stream or play anything through the Internet. No Prime, Amazon!!! No Netflix. No ESPN. No PEACOCK --- none of the apps I pay for will play through this POS TV. Don't buy it!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1681430400000}
{"reviewTitle":"Screen not fully visable","reviewDescription":"Purchased 3 of these.  2 out of the 3 I had to return due to screen damage.  Lines through the screen.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"Speaker blown after 10 normal uses","reviewDescription":"We had this tv in our guest room. It barely gets any use. After about 10 or so uses, I tuned it on and the speaker is blown. It’s being used in a very small room, the volume has never been very high. Incredibly disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Sound distorted within a month","reviewDescription":"Sound distorted within a month. Samsung not responsive to resolve issue","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1693440000000}
{"reviewTitle":"Don’t do it; just don’t. Bad idea","reviewDescription":"Don’t waste your money. It’s a crappy deal. Tv fights you when you try to turn it off. Samsung plus is literally attacking you, it never stops…holiday movie y’all . The controller is the worst. And I got a 65 Samsung upstairs. Never again.  Sony or LG. Sham of a product.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1671926400000}
{"reviewTitle":"Great tv but damaged easily.","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Broken","reviewDescription":"I was so looking forward to receiving this TV, I received it today and after putting the feet on the TV and the batteries in the remote, I turned the TV on and there were so many cracks in the screen it was ridiculous. It looks as though this TV was thrown from one end of the warehouse to the other end. Sending back.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1665100800000}
{"reviewTitle":"failed speaker","reviewDescription":"seems to be working fine.  tonight, lost the volume issue with the speaker. tried troubleshooting tried to reset. still speaker distorted.will need to replace this unit.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677974400000}
{"reviewTitle":"Sound issues","reviewDescription":"This Smart tv has some great features & beautiful picture. I only gave it 3 stars because the sound has cut out or blasted several times in a month on 2 of these purchased, don't know how to correct it!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671235200000}
{"reviewTitle":"Audio Issues","reviewDescription":"This TV has a lot of great features and the video is wonderful, but I keep having off and on audio problems. Some days the audio is very loud and distorted and I can’t do anything to change audio levels and other times I can’t raise the audio. It’s usually fixed by turning the set off and on a few times but I shouldn’t have to do that.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1665100800000}
{"reviewTitle":"No remote control","reviewDescription":"In December 2022, we bought SAMSUNG 40-inch Class LED Smart FHD TV 1080P (UN40N5200AFXZA, 2019 Model). We didn't get to open the box until today, February, 07. We found there was no remote control. Please help.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675728000000}
{"reviewTitle":"A little disappointed in the picture quality and no light on the remote.","reviewDescription":"Picture seems to fade to dark.  Why is that?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680134400000}
{"reviewTitle":"Samsung Smart TV","reviewDescription":"I was hoping for better picture quality but it's lacking in that area. I have cable TV so the remote must be paired with the cable supplied remote. For the price I paid, it was not worth going for a name brand. I have a 23 inch off brand non-smart TV and the picture quality is superb.  I wanted a larger screen, so went with a Samsung.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1658534400000}
{"reviewTitle":"No bluetooth","reviewDescription":"I just thought all new tv''s had bluetooth..I didn't even check that out.  I would not have gotten this tv if I had realized that there was no bluetooth.  Hope this helps.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Good until it wasn't","reviewDescription":"Was good until stopped working but maybe it wasn't supposed to last longer than 2 years 🤷🏽‍♀️","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681171200000}
{"reviewTitle":"Color","reviewDescription":"Color is not as good as expected in spite I tried any of available options to make it better.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678233600000}
{"reviewTitle":"hostage","reviewDescription":"the tv was locked ,would not operate unless i signed up for a samsung account , was held hostageif i had known that , i would  bought another brand , there was no good picture of the back of the tv ,some in and out connections are on the left  side back , be careful of the wall mountpicture and such are good","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1657670400000}
{"reviewTitle":"Be prepared for issues. Part 2","reviewDescription":"I wrote a review awhile back explaining the problems I was having with my first Samsung 32” inch that was returned and now I’m writing this review about the one that replaced it. It has the same exact problems! Sometimes the tv won’t turn on until you pull the plug for a few seconds then plug it back in, sometimes it turns on with distorted sound so pull the plug to fix that and sometimes the sound to picture timing is off. I’m not an expert when it comes to electronics but, I believe most of the issues are caused by the smart  part of the tv. It acts like a computer that is busy doing something or has jammed up due to lack of computing power. I’m hoping that Samsung will come out with a software update that will fix this problem but, if they don’t do something soon I can see this losing lots of customers for them. Every tv in my house is a Samsung and I’ll be looking elsewhere in the future. I will say that when it works, it’s got a great picture but so do other tv out there today.","isVerified":true,"ratingScore":1,"reviewReaction":"35 people found this helpful","country":"United States","date":1550793600000}
{"reviewTitle":"tv that doesn't work junk","reviewDescription":"These tvs are junk 1st one came broken screen so ordered a replacment second one came no sound at all o.k. will just thinking I got a dud I sent back tryed 1 more time this one lasted a little over 3 weeks and now nothing no matter what we tryed nothing so was going to send back guess what missed the 30 day window by 2 days so i will not be ordereing any more of these for sure","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"Samsung is horrible","reviewDescription":"The first TV delivered had a crack screen, the second one delivered worked for 2 hours and stopped for s firmware update. Called Samsung who told me to get a USB and download the firmware. This didn’t work, TV won’t respond to remote to get to settings! Absolute nightmare!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1698364800000}
{"reviewTitle":"Research before purchasing this model to save yourself time and money.","reviewDescription":"This model was apparently built with a faulty power supply according to the many customers on this and other sites that have complained about not being able to get the unit to power up.  After purchasing 2 of these a year apart, I m done with Samsung Televisions.  If you check websites that customers have submitted reviews that are not blocked by Amazon or Samsung, you will discover several pages of users who bought this model which failed and will not turn on.  All the troubleshooting steps recommended fail and the unit becomes trash, unless the customer spent extra money to purchase a warranty.  I believe Samsung is aware of this inferior model but they still sell it to customers who can't afford or don't want to pay their inflated prices for larger more expensive units.If you have a unit that works properly after a year, consider yourself luckier that those of us who have wasted our money.  I believe Amazon should further investigate this product to protect it's members.  Since they do not without the extra expense of a warranty,  we will discontinue purchasing larger electronic products from them.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1562544000000}
{"reviewTitle":"The unit I got was not new and was defective","reviewDescription":"Unit was sold as new but was not, Samsung confirmed that it had been registered previously at least once. It was defective also, which is likely why previous owners returned it. Sometimes TV's response to remote input was normal, sometimes delayed 5-10 seconds and sometimes just would not respond at all. Clearly a defective unit that was recycled as new. Picture quality was fair, not as good as advertised or as good as an old HD TV I bought in 2009 although no idea if that was this defective unit only or applies to all units of this model. Anyway, returned it and am too scared to try another one. Will but something else, probably not a Samsung as my experience with a couple other Samsung TV's has not been good either.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1660780800000}
{"reviewTitle":"Failed after 2 months","reviewDescription":"The tv picture was suddenly compromised by a series of vertical lines. Tried contacting Samsung using the number on this site. Was passed around with no resolution. This was not Amazon’s fault. The Samsung response was worse than useless. Avoid at all costs!!!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Stopped working within 2 days x 2","reviewDescription":"The first unit worked perfectly for 2 days then could only get a black screen including HDMI ports and Roku stick. Usual fixes did not work. Would not display Roku on HDMI either. The power button turned it on and off and ready light indicated the remote was sending a signal. Sent the first one back but same thing happened to second one. Called Samung and they had no solutions since factory reset requires being able to see screen.  Prior TV was an older Samsung that it replaced worked fine at same location. I am sending it back and ordering an LG.  Have to assume there is a fatal floor in the electronics.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1674950400000}
{"reviewTitle":"Didn't work within a week","reviewDescription":"We bought this TV for my husband's office. Not a week after purchase, the TV died. We contacted Samsung and they couldn't even tell us what was wrong. Had to purchase a box and wrapping to return it. And what's worse is that the refund has taken forever. Today it will be 10 days and still no refund. The item was returned on November 11th, received on November 15th, and still no refund back on our debit card. Ironically, Amazon charges my debit card immediately, but it sure doesn't process a refund that quickly. The entire transaction was a HUGE disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1668988800000}
{"reviewTitle":"no buy","reviewDescription":"I made a mistake buying this tv.  The picture on my 10 year old Samsung was better.  I cannot bring out the details in the shadows, it's too bright, and the off angle view is terrible.  I've watched calibration videos and tried everything and it still sucks.  I bought this because a review said it was one of the best 40 inch tv's and it had a center stand.  Well the picture was from a 2017 model and it did not have a center stand.  So don't believe those reviews, they're probably written by an employee of the manufacturer which suspected, but what else do you have to go by.  They got their sale.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1662249600000}
{"reviewTitle":"Sound is posessed","reviewDescription":"The sound goes super loud.  Then it can be just a buzzz and other times just no sound.  I have changed remotes contacted cable company  The only fix is to unplug then reply it.  Don’t buy","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1696550400000}
{"reviewTitle":"Great Value","reviewDescription":"Good pic and sound. A great value. My only complaint is the remote isn't back-lit and hard to use in a darkened room. Ans Samsung menu and interface in general is clumsy but I'm already into the Samsung ecosystem up to my neck so I live with it.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1660176000000}
{"reviewTitle":"nice picture but horrid reflection","reviewDescription":"i like most everything about this tv except for the too highly reflected nature of the screen. i have a laptop - mac retina - that has a great coating that kills most of the reflection. that should be required for TVs!the other thing is some sort of quick navigation tool i guess is the best way to describe it at the bottom of the screen that is really annoying. i haven't figured out how to get rid of it reliably.navigation is one of those things that i'll choose what i want to see. i don't need 1\/3 of the screen filled with little suggestion pictures.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1602374400000}
{"reviewTitle":"Over a year out","reviewDescription":"Bought two of these 3 months ago and couldn't be happier. 32 inch size perfect for small room and bedroom. Color fabulous. Sound is fine and in one room was even able to connect it to my old receive stereo speakers through the optic audio connector. The Smart tv function works fine through wireless internet connection although screen choices still a bit confusing. The Remote tabs for fast forward \/pause a bit small. Shopped around and Amazon price the best at that time.Update atfter 15 months with significant usage. Still terrific. Only problem occasionally HBO freezes requiring a re-start of HBO. Otherwise couldn't be happier","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1606521600000}
{"reviewTitle":"The remote doesn't work","reviewDescription":"The remote doesn't work and I'm having a hard time getting another one I've sent the serial number in a few times and they keep saying they need the serial number if this keeps up I will never buy samsung again","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659484800000}
{"reviewTitle":"Excellent picture quality","reviewDescription":"Picture quality is wonderful. The auto-ambient light feature is amazing. Never have to worry about glare due to the angle of the sun\/time of day. Extremely light weight. Setup was easy and straight forward. I am not thrilled with the remote\/ease of use. I stream only, so expected getting to Netfix and Amazon Prime would be easy-peasy one click, but it takes a number of clicks of buttons and navigation arrows to get to the apps. The remote does not have a back light which is frustrating. imho, not particularly user friendly.  Also was disappointed there is no headphone input or bluetooth to use an external portable speaker.Overall, excellent picture quality at a very good price. The wifi connection has been dependable (no dropped connection so far) Remote is pretty bad.","isVerified":true,"ratingScore":4,"reviewReaction":"28 people found this helpful","country":"United States","date":1533772800000}
{"reviewTitle":"You Get What You Pay For","reviewDescription":"Obviously not top-of-the-line, but does a fine job at its price point.  I don't know how well the \"smart\" portion works, though, because I literally just stuck a Roku in it after performing the setup.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1660521600000}
{"reviewTitle":"Great it you want an older Smart Tv","reviewDescription":"Make sure you buy a 2019 or 2020 I was actually lucky Amazon did the right thing but I got stuck with an older Tv . Which I ended giving away. Make sure is compatible with your cable company by asking Samsung. Or just a 2022 overall Samsung is always there to help.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1644364800000}
{"reviewTitle":"it sucks setting it up ,","reviewDescription":"it sucks setting it up ,the password section likes to omit letters or numbers  .put password for internet in so many times my tower has to be reset  .had my so put his in so could watch regular tv.i will reset my tower latter","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651622400000}
{"reviewTitle":"Just Installed","reviewDescription":"I just installed this TV and it works pretty well but I have not used all the features yet.  The one thing that was mentioned in other reviews was that sometime the TV will not turn on.  This happened to me once so far.  I followed what \"support\" said and unplugged it and then plugged it back in.  It worked!  I have not had the problem again, so far.  There is a \"bug\" in their software some place.  FIX IT SAMSUNG!  I bought this because of your reputation.  Right now I am going to use a power strip that has some \"hot\" outlets so I do not have to turn off the other components to \"fix\" this problem.  Come on Samsung, fix this problem.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1546646400000}
{"reviewTitle":"Decent 40\" HD even though not 4K","reviewDescription":"Long story, but I needed to replace a very old 32\" Samsung. I used my Amex points to get this particular tv. It's slightly bigger than that 32\" antique. It does the job and it's a smart tv. Firestick is installed. Can't really complain. Fyi, this is not my main tv.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650326400000}
{"reviewTitle":"Horrible picture","reviewDescription":"The picture is awful. No matter how much I try to adjust it, the picture doesn't get any better.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Unit does NOT have Alexa built in and was my only reason to buy it","reviewDescription":"Very disappointed with this being a Samsung. Remote does not work smoothly as input jumps all over even with a clear view to the tv. I expected much better from Samsung. Wish I could return it but already got rid of the box….","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"Disconnects constantly. Brand new. Lasted 3 months","reviewDescription":"Disconnects from Wi-Fi and app - it’s brand new. So frustrating. Won’t work without Ethernet Connection and older model did. Terrible remote. Do not recommend Samsung anymore.I’d do anything to return this before throwing it and it’s useless remote out the window. No joke. My second tv I purchased for half the price and twice the size is beyond better and I had an older model if this Samsung I loved. I got a lemon and Samsung really downgraded! It’s an expensive iPod. Quit working after 3 months. Shameful.Customer service is even worse than their shameful produces.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1651622400000}
{"reviewTitle":"Disappointed!!!","reviewDescription":"This was a case of \" to good to be true\".  As advertised \"NEW\" 2019 Samsung $275.  So I ordered.  The arrival and install went well.  Then when turned on we noticed there was a light across top of picture.  The frame across the top was loose.  Installer said it should be returned.  Return went well and I reordered the same item.  When 2nd  arrived I scheduled the install.  Opened box \"which had no damage\".  Set TV on table and plugged in. badly damaged.  Looked like it had been ice skated on.  Very upset needless to say.  2nd time was not a charm.  Have reordered but a 2021 and no Samsung.  More money and hope a adjustment can be made toward new purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"20 people found this helpful","country":"United States","date":1621900800000}
{"reviewTitle":"NOT as advertised","reviewDescription":"Bought this TV because it mentioned it had the Xfinity app. Wish I had known that it does NOT have it before I went through the complicated and tedious set up process, only to find it didn’t come with it. Very difficult to get answers if it was possible, and I finally found out (thanks to best buy reviews) that they no longer carry the app on this model. Pretty redic you can’t download it. I got a LG instead, much better tv, bigger screen, 4K, only $10 more and easy to download and use the app. Samsung is going down the tubes!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1650499200000}
{"reviewTitle":"is NOT Alexa compatible","reviewDescription":"Don't buy this TV, despite saying on the website, on the TV box and in the instructions, this TV is NOT compatible with Alexa. I spent 7 hours with 5 Samsung support reps over 4 days trying to get this figured out and at the end of the day they admitted is was false product labeling. You need to have Samsung's own smarthings app built into the TV to get Alexa to run - which this model isn't capable of. Yes, their own current TV isn't able to run thier own apps!","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1663804800000}
{"reviewTitle":"Worst tv ever","reviewDescription":"Samsung smart tv, here's a screen shot.  This happens about every 35 minutes when  using wifi. This has doing it on Samsung tv my 2nd one junk.I can use other brands of smart tv no problems,  it's Samsung tv. Junk...","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"Poor quality","reviewDescription":"Started glitching when i put the tv on. This tv will disappoint you.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Dangerously flimsy stand","reviewDescription":"A gentle bump to the table this tv was on sent the screen topling over. Luckily I caught it and there was no damage. The other annoyance is that every time you turn it on it’s programmed to be on a loud commercial channel of some kind instead of a silent, standard menu, like I’ve become used to.Overall, good picture and sound.2022 update: this thing barely functions. Every time you press a button on the remote you have to count several seconds before it reacts. And every time you turn the tv on, it’s on some random public channel at top volume instead of the app you last used. And “Recently Used Apps” are full of things I’ve never heard of, never used before, that Samsung is getting paid to put on that list. I seriously regret buying this tv.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1545868800000}
{"reviewTitle":"Don’t buy this model of Samsung TV.","reviewDescription":"I have owned other Samsung TV’s and they have been very good. This TV’s sound would periodically go off and the only way to get back was to shut the TV off and then turn it back on. The other problem was at times it would not turn on and the only way to get it to turn on was to unplug the TV, leave it unplugged for a couple of minutes, plug it back in and then it would turn on. When I called their technical department they said it was because the remote needed to be fully discharged by removing the batteries. Who the heck they were talking to an idiot? I think I was talking to one. Remotes do not hold a charge that needs to be discharged. Poor tech help.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1560988800000}
{"reviewTitle":"Buy cheap buy twice","reviewDescription":"6 months later the sound stopped working. This is an entry level tv and I wish I had spent a bit more to have one that would have lasted longer. Customer support was very unhelpful and refused to take it back under warranty.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Terrible.","reviewDescription":"This TV is incredibly frustrating.  It processes like a 1980 dial up computer. The remote is clunky. I would give negative stars if possible","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Review","reviewDescription":"Too small remote annoying picture nice volume nice Samsung TV plus went out trust me don't buy something wrong with these TV's","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"Screen went out without 6 months","reviewDescription":"Televisions was glitchy the whole time and just went completely out","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Samsung Horrible return policy","reviewDescription":"Product arrived with fracture screen. Samsung wouldn't replace but sold me larger tv, which also arrived with fractured screen.  Moral of story, don't buy tv from Amazon, suspect that shipping company is culprit...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Don't waste your time or money","reviewDescription":"We were looking for an affordable, somewhat basic HD TV and this fit the bill. Less than one month past the 12 month warranty the TV stopped responding to the remote. I spent two hours with support trying to trouble shoot it only for them to say it's needs to be repaired. The repair was quoted to cost the same amount as the TV. Unsatisfactory customer service, I'm never buying a Samsung product again. I'm not sure who they work with on repairs but the person who called me was quite terrible and unhelpful.I suppose that's what we get for buying a cheaper TV, but I expected more from Samsung.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1649289600000}
{"reviewTitle":"THIS IS THE WORST TV THAT I EVER OWNED😡","reviewDescription":"The TV has a mind of it’s own!  It shuts off or turns on by itself. (That’s if it goes on at all). After months of frustration, I finally believe that there is something wrong with the  “Smart TV”, which I never use, Sometimes the Smart apps come up with a blue screen. NO PICTURE or SOUND. Other times nothing happens at all. If I unplug the TV (which is very difficult for me, I have nerve damage in my back), then wait a minute, and plug it back in it comes on. Then the cycle starts over again the next time I try to put it on. 😡 Many reviewers have the same problems.Many more issues, sound, picture & changes channels. Turns on in the middle of the night. I wanted to return it, but my son-in-law threw the box out when he set it up.","isVerified":true,"ratingScore":1,"reviewReaction":"28 people found this helpful","country":"United States","date":1566432000000}
{"reviewTitle":"Don’t bother ordering","reviewDescription":"The sound started going after using it twice. Have a larger one that the sound is extremely quiet. Terrible quality","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Lying description","reviewDescription":"It leads you to believe you have smart tv. All the apps are on the tv but you have to download the samsung app where you have to give it permission to read all your info on the tv and your phone to use any smart features and even then the app is glitchy and you have to go through several steps to use specific  smart features. Instead of a menu in the tv. Deceptive and over reaching. Not only that but the Alexa capability was never on there.  When the arrives it says it's only for higher end models.  Nowhere on the description does it say that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1649030400000}
{"reviewTitle":"TV does not connect to Alexa as advertised","reviewDescription":"The quality of the Samsung TV is fine. The problem is connectivity with Alexa. Although the Amazon description and the information on the Samsung Box clearly say that the TV is compatible with Alexa, it is NOT !!After spending more than an hour with Samsung support, where they took remote control of the TV, and told me that they were transferring me to another department to install the necessary app, I was cut-off. When I re-called Samsung they told me that the TV would not work with Alexa because I had the wrong model of Samsung Smartphone. I'm disappointed with both Amazon and Samsung for not specifying that Alexa compatibility was dependent on the type of phone that is used.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1640908800000}
