{"reviewTitle":"Bad sizes and instructions","reviewDescription":"Used on 38in LG. Indicated a 5\/32 size drill bit for screws but I had to keep going up until I got to a 7\/32 which is what actually fit the screws. Instructions were also very confusing and not friendly for first time users. I didn't use anchors because I was confused if I needed them or not for wood studs based on instructions and since they were too big for my 1\/4 bit, so hopefully it holds. Sturdy so far. You get what you pay for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Poorly Designed Mount","reviewDescription":"I wish I had paid better attention to the reviews of this.  What is most frustrating is that you can go back years on this mount and see the same complaints repeated.  Amazon is still producing and selling a clearly faulty product (the built-in mount is garbage - I experienced this myself and many other reviews confirm it) and despite the many complaints they have apparently made no changes to the product.  Another review also mentions something I found as well, it is impossible to get this thing hung if you don't have the arms in a tilted position.  It is hard to explain, but this little metal piece jets out the less tilt you have, taking up the space you need to hook the mount.  We could not for the life of us get the tv to hook (and keep in mind this is a 70 pound 75\" TV, so the longer it takes to hook it the more frustrating and straining it gets).  So we set it back down, added extra tilt (and thats when I saw the design flaw), and then guess what?  It hooked first try no problems.  But then of course, the fact that it was not level was super obvious.  I should have returned it immediately, but I had no motivation to go back through the mounting process again after all that.  And now I'm out of of the return window, of course.  Listen to the reviews and skip this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695168000000}
{"reviewTitle":"Fitment","reviewDescription":"This is the second time we purchased this mount for the same model TV. First one about 3 years ago, perfect. This one arrived in a box, looking undamaged, but one mount arm was bent nearly 1\/2\".  I was able to straighten it to use it. The bushings that fit into pockets on the TV were about .050 too large on the diameter to drop into the pockets. I was able to purchase nylon bushings at a hardware store in order to finish this project. Frustrating at best.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Confusing directions","reviewDescription":"Hard to understand the directions for hanging.  Even confusing for hubby (retired carpenter).  Still in the box.  Looks well-built otherwise","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Does not fit every TV properly.","reviewDescription":"I put this on my Toshiba 42\" tv, barely. Goo thing my TV does not weight very much, or I would have sent this back. The mounting bracket on back of the TV barley works. On two of the brackets, I was only able to put in one screw while securing it to the mounting bracket. I would not buy this item again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Please note it's only a signal connector to your wall.","reviewDescription":"One of the issues (I wish I looked at the picture better) is that this is a single stud connector, which means it will be really hard to center on certain walls, returning because I am in a situation It will be very off center of the wall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Parts missing","reviewDescription":"Some bolts are missing.  Now I have to buy to be able to use this product.I don't want to return it. It's a good quality item and I don't want to go through returns and refunds...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Couldn’t figure out how to assemble even with durections","reviewDescription":"I returned","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Does not fit Sony Bravia tv - DO NOT PURCHASE","reviewDescription":"This kit comes with multiple choices for screws, but none of them fit the Sony 55\" Bravia TV. I had to order those separately. Waste of money and time!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"No flexibility in mounting location","reviewDescription":"If the studs behind your wall have standard 16-in spacing AND your studs happen to be located exactly in the right spot where you want to mount the TV, then this TV wall mount will work fine. However, if you want to mount the TV a few inches further to the left or a couple of inches further to the right from where the studs are then you're out of luck. I returned this wall mount and ordered a different one which has holes all along the top and bottom so it will give me the ability to attach the TV mount to the wall wherever I want rather than being forced to attach the wall mount only exactly where the studs are.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"No Stud = NO DEAL","reviewDescription":"I have wall mounted over a dozen TV's over the past few years with ease. Whether mounting into a stud or drywall only, I have never ran into issues. However, this product was the a greater nuisance than the worst headache I have ever encountered. I was attempting to mount my TV (55\") in a wall that did not have studs, as it is an exterior wall. It would not have been a problem, had the screw holes in the mount been slightly larger. As a result of the painfully small diameter of the mounting holes in the product, I could not use the strongest drywall screws on the market. As you can see, this translated to four various iterations of drywall screws and three trips to Ace Hardware to complete this task, and there are a dozen ripe scars in my wall now to show for it.Long story short, the design is flawed. The strict vertical mounting mechanism places too much stress on the top screw hole. If it is not screwed into a stud, the mount will give at the top screw and you better hope you're close enough to catch the TV before it crashes to the ground. I was able to mount my TV for a solid 4 weeks until I heard a slow hissing sound from my wall. Seconds later, the drywall gave out and I had to save the device from splitting on the tile while it was ripping out of the wall. Very disappointed with the product, do not buy unless you are prepared to perfectly align the poorly designed product with a wall stud. Otherwise, kiss your TV and drywall goodbye.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"Wrecked my TV","reviewDescription":"While installing the bracket on the back of my TV, a screw wouldn't go in all the way and got stuck on it. I spent two hours trying to get the screw unstuck, and still am unable to. While trying to remove the screw, the mounting point broke. My TV is now basically unusable because it doesn't have legs and now I can't mount it. Amazon was unwilling to compensate me for my broken TV, the best they could offer was 35% refund without returning the mount, or a full refund if I returned it. Very, very disappointed with Amazon's customer service. A $30 TV mount ended up costing me a new TV.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Cheap screws, missing nuts, inferior product","reviewDescription":"I bought this for a guest room, and I didn't want to break the bank so I went with the Amazon brand. A mistake. This product is perfect for my tv but imperfectly manufactured. The provided wall mount screws (TS) were easily stripped. The mounting bracket it's self was missing a nut meaning the TV must be in the tilt position. AND the worst part- the directions require you to use a 5\/32 bit to drill pilots into the wall. This is too small resulting in screws that cannot get all the way into the wall. I had to start over with a larger bit and by the then the screw were stripped because they are inferior metal. Due to this, the mount pulled away from the wall slightly so it was unsafe. What should have taken 30 minutes took 3 hours.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"I do not recommend this mount","reviewDescription":"I don’t understand how this is a full motion mount. It isn’t. I can’t even tilt the tv simply, instead I have to adjust some screws in order for the tv to tilt. There are better mounts out there, where you can move your tv any which way without adjusting screws.Another con, the TV looks straight in some positions but in others it looks crooked. I regret buying this mount. I should have done my research and remembered to find a mount where you can easily adjust the positioning of the tv horizontally, vertically and tilt. They are out there.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"The TV mount fell off the wall after 5 months","reviewDescription":"I purchased this TV mount with high expectations, but unfortunately, my experience has been quite disappointing. Initially, the mount seemed sturdy and reliable. Installation was straightforward, and the mount held my TV securely in place. However, after just 5 months, the mount came out of the wall, causing significant damage to both my wall and the TV.The mount's failure has left me questioning its quality and durability. It's concerning that a product designed to hold a valuable item like a TV would fail in such a short amount of time. I made sure to follow all installation instructions carefully and used the recommended hardware, so I am certain that the issue lies with the mount itself.Overall, I am very disappointed with this purchase. I would advise potential buyers to look for a more reliable and durable TV mount to avoid similar issues. This product failed to meet my expectations and has caused more trouble than it’s worth.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Just go with something else","reviewDescription":"You definitely get what you pay for, there are other wall mounts sold at big box stores that are better than this. Mounted to the wall, perfectly level, moving the TV around on the mount and somehow the thing gets skewed. Getting the TV positioned well is also a chore and a half, just not a user friendly design. Would have sent this back if I could have just set the TV on a credenza or table.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Terrible instructions, cheap screws","reviewDescription":"It will absolutely hold your TV on the wall, but I’d recommend putting some headache medicine in your cart if you order this thing. The screws are cheap phillips head screws and they stripped almost immediately, making it a total pain to install (even in pre-drilled holes). Just spend like $5 extra and save yourself the hassle.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Instructions a vague.","reviewDescription":"I understand that basic means basic, but some of us need written instructions along with pictures. I had to view a video that someone posted to figure out that I don’t need the extension arms mounted on the back of my TV. Geezus. That was unnecessary time wasted.Now it’s on to figuring out which of the two of the bazillion screws will I need to complete the job.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Level, level, level..... Sure....","reviewDescription":"So this tv does what it is supposed to do, except install was a pain in the butt. I'm the type that does read the instructions BEFORE I even begin to install, and this case was no different. I felt confident in doing what was required, got it put up on the wall in a stud, and then went to apply the tv. I made sure the mount was level before I put on my TV. As soon as my tv was put on, the level was way off.  The level that came with it still said it was level. So I took the tv off, and took the mount off to retry installation.So this next time, I got my own level, not the one that came with it. Redid my holes, checked with my good level, things were going good. Put my tv back on, I'll be ****ed if the thing was way off level again.Took it all back down a second time, started boxing stuff up to send back to amazon for a refund. This was junk. Base was level, but the arms were not. As I was boxing up the stand, I noticed that the two screws that connected the tv to the mount, well, those two screw holes were arched for adjustment. This was where you did your final level adjustments. This was not in the instructions at all. Nowhere at all. You would think that this important bit of info would be in those instructions. But no, they were too worried about using the same manual to house 10 different languages.I have decided to keep it, instead of returning it, simply because I finally got it level and it was a pain in the ass, not going to take it down again. But if you are someone who will want to move your tv from angle to angle, side to side.... Just know that when you move it, you have to relevel the **** thing again. You've been warned.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1611446400000}
{"reviewTitle":"Not quite a great product","reviewDescription":"Everything looked like it was going to be great, until the small threads that keep the mount to the tv split.  I have the tools to fix it, but most dont.Carefully thread everything Its made in China with no room for error","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Horrible installation","reviewDescription":"The instructions for the TV mount were absolutely terrible after getting it mounted on the wall getting the TV actually on the wall mount was not only super super hard not very sturdy. Had to end up screwing the back mount onto the TV while another person was holding it. Do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"No words with the instructions.","reviewDescription":"The product is fine but the instructions are the worst I have ever see.  There are no words, only pictures with three different options for each picture.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"poor quality","reviewDescription":"product does not level consistently","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Do not use use their anchors","reviewDescription":"First of all the directions are terrible. Second, the anchors are not capable of holding anything over 30 lbs. Do not purchase this product!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"not true unless tested","reviewDescription":"I followed all the instructions in the manual which is included in the box, such as proper attachment and alignment as well. I just got 36 inches tv but unfortunately it fell. maybe due to poor quality of the product. this is frustrating, now it would be more expensive for me since I need to buy a new tv. for the company who made this one, please at least compensate me for the damage that you've done for my tv. hope for your consideration regarding this issue. please for those new buyers, take time to read reviews and search for quality.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1699920000000}
{"reviewTitle":"Room for improvement","reviewDescription":"First, don’t depend on the instructions. They are both vague and overly wordy (took a lot of work to pull that off). The illustrations are too small and ambiguous. So, you’ll need to schedule extra time for putting it up. I had to backtrack several times and redo the steps. Second, I found the included hardware inadequate. Made two trips to the hardware store (god bless Ace hardware) for additional spacers. The ones included were less than just inadequate. I’ve bought and installed more than a dozen flat screen wall mounts over the years, and this one was absolute crap. It truly deserves the name “basic.” On the other hand, I did like the packaging! Cardboard, no Styrofoam.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695859200000}
{"reviewTitle":"Plastic panel on the back does not work as intended","reviewDescription":"The design of the product includes a plastic panel intended to conceal the screw holes, which could be a neat touch for maintaining a sleek aesthetic. However, the execution falls short of its purpose. The panel fails to stay in place, resulting in a loose and dangling piece of plastic. This not only detracts from the overall look of the item but also hints at a possible oversight in design or manufacturing quality. For future iterations, a more reliable mechanism to secure the panel would be greatly beneficial, ensuring the item’s appearance remains tidy and intact as intended.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"Worst Instructions Ever.","reviewDescription":"Worst instructions ever. IKEA furniture has better instructions than this pos. Trying to mount it on Amazon 43” TV is like trying to decipher 1\/2 the Chinese instructions it came with. It’s easier to understand a stroke victim than Amazons instructions.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Missing all parts","reviewDescription":"Bought used - like new. Was basically missing every screw I needed to mount \/ secure tv. I spent more money getting replacement screws than I did on the mount.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Be Sure Before You Buy!","reviewDescription":"My installer said he couldn't use this product for my TV because it's too heavy. Unfortunately,  I am not given the option to return it so I'm stuck with a useless piece of equipment.  My advice is to let a professional provide the equipment and install it!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Came with incorrectly sized washers","reviewDescription":"This mounting system is fine with regard to its design, and Amazon Basics are usually pretty good. But this was a real dud. I used the included M6 screws to attach my TV, but the the included alleged M6-sized washers, which are absolutely required, were too small! That is, the diameters of the screw holes were too small to let the screws through. With the bracket already carefully mounted to my wall, I had one of two choices: go to the hardware store to buy some appropriately sized washers, or bore the washers myself with a drill. I chose the drill. And neither option is hard to do, but you have to know what to do. What is someone who isn’t handy supposed to do? They would be INCREDIBLY frustrated, stuck with a partially mounted bracket!After installing it, the mount itself works perfectly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661040000000}
{"reviewTitle":"It’s too heavy!","reviewDescription":"The mounting bracket is sturdy but with the TV added, the entire mount came off the stud cracking the drywall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Underwhelming","reviewDescription":"Not as substantial as expected, with limited articulation. Plus, the directions were unclear.  To assemble the TV mount properly,  you had to put the Amazon Basics name against the back of the TV. I later bought a Sanus mount that was about $40-50 more, bit it was FAR more substantial,  with CONSIDERABLY more articulation.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696204800000}
{"reviewTitle":"Could be better","reviewDescription":"Instructions suck. Better off watching videos or figuring out how to install it yourself. Mounting bracket is easy to install if you know your basics about finding a stud\/dry wall install. The issue is the bracket on the tv. Too many pieces and parts that’ll confuse you. Once mounted on the tv it does not feel sturdy. It feels like the tv can fall off at any time because the hook is so shallow. Be cautious on how you turn it.Although installed properly, my tv keeps tilting right and is crooked. Don’t know if it can support it well.Doesn’t seem like a universal mount. For reference I have a 50” Samsung tv with a flat surface.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1674086400000}
{"reviewTitle":"Decent I guess?","reviewDescription":"The lag bolts are a 25\/64 which is the most random socket size ive ever seen. Of course my closest socket was just over that size. Alot of work to install a simple mount for a 32\" TV. The mount for my 75\" was way easier to install.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Do not reccomend","reviewDescription":"This product was very difficult to put together. The instructions weren't clear. Very confusing. So I used all my own materials, & imagination to figure it out. I do not recommend it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Fully extended it sags","reviewDescription":"So after installing the mount and hanging my 42\" tv from it and confirming it was level. I discovered the mount sags when fully extended with TV on it.  This requires readjusting the mount, which will requires more work to adjust accordingly. When not fully extended my tv is level without issue.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Took two men hours to finally get it right","reviewDescription":"The manual and instruction is confusing. The bolts and rings are not correct size. We hired a professional handyman. It was even difficult for him to get this thing leveled and installed. We couldn't use the bolt came with the package to drill tot he wall because it's too long. It hit our brick! We ended up buying a shorter bolt...The mount is great quality but I highly suspect the design of this mount. It's single leg while stationary should be fine. If you plan to maneuver the TV often times, then it might not be a durable mount. I suspect the latter scenario\/usage will make it unstable and potentially having the TV fall off the wall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657670400000}
{"reviewTitle":"Worst quality screws provided!","reviewDescription":"Prepare for a time of frustration and a headache. When you’ve finally drilled the holes where the screws need to go in the wall, make sure you have some better quality screws on hand, because at the slightest application of force from your drill the screw loses its + shape and becomes round, loosing all of its grip. You’ll spend the next 30 minutes running the screws in the wall with a wrench. What a pain!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"It will suffice.","reviewDescription":"Tightening the screws into the wall was down by hand. Somehow I managed to sheer the head of the center bolt off however the two on top and bottom seem to be plenty to support the 32” tv that it is currently holding up. I’m not worried about it however when we get a bigger tv I will get a better quality Mount for it.In addition to that the leveling screws came with one stripped so while I’m able to “lock it in” with the other screw the level will never stay. Again with a small tv this is fine. It’s light snd nothing is heavy on one side versus the other but going forward I’ll get higher quality mounts like the one we bought for our 55”.I almost forgot.. the faceplate that supposedly covers where the mount connects with the wall won’t stay up. I don’t see anything that would keep it in place so right now it’s being held to the wall by sliding the cord organizer up against it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1611446400000}
{"reviewTitle":"Perfect fit for my Amazon Fire 50 inch TV","reviewDescription":"This was a great TV mount for my new Fire TV 50 inch. My wife always wanted our TV mounted on the wall so that she could swivel it outward and watch it in the kitchen while she's cooking. This mount allows for just that.I recommend watching a video or two online to get a basic idea of how to install this thing. The instructions are pretty basic - just pictures - and if you have never done this before, just pictures isn't enough (at least not for me). I took off one star for that. Fortunately the VESA mounting system works for all VESA compatible TVs\/Monitors. There are a LOT of options of course, and figuring out which one works for your TV is the only real hard part.The package includes a dizzying array of hardware to accommodate all the various VESA configurations. It also includes drywall expanders in case you can't find a stud - which I think is crazy! I STRONGLY recommend you DO NOT use these and mount this directly to a 2x4 in your wall! Once mounted on a 2x4, you can feel how solid and strong the hold is on this mount. I think drywall expanders would be dicey at best to hold the TV safely.To adjust the horizontal direction or to pull the TV out further from the wall is simple and easy. The motion is smooth and easy to do. Adjusting the TILT is not so easy and requires you to loosen two nuts behind the TV.  That is the ONLY thing that is even remotely annoying about the operation of this mount. Though I really don't know if any other TV mount would allow for an easier tilt adjustment. Fortunately, I'm happy to set a slight downward tilt and don't foresee adjusting that at all.The mount has a good range of motion and can almost allow you to turn the TV at a 45 degree angle - almost - but not quite. I'd say it's more like a 30 degree rotation. But that's pretty good for today's wide screen TV's!Overall I think this is an excellent value and works perfectly!","isVerified":true,"ratingScore":5,"reviewReaction":"54 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Stop Whatever You're Doing and Order this Mount!","reviewDescription":"The Full Motion Articulating TV Monitor Wall Mount has truly revolutionized my home entertainment experience! From the moment I installed it, I was blown away by the incredible flexibility and convenience it offers.First and foremost, the build quality is outstanding. The mount is constructed from robust, high-grade materials that ensure both durability and stability. It securely holds my TV, giving me complete confidence that it’s safe and well-supported. The sleek design also adds a modern touch to my living room, complementing my home decor perfectly.What sets this wall mount apart is its full-motion articulation. The range of motion is impressive, allowing me to swivel, tilt, and extend the TV to find the perfect viewing angle from anywhere in the room. Whether I’m watching a movie from the couch, cooking in the kitchen, or doing a workout on the floor, I can easily adjust the TV to suit my needs. The smooth, effortless adjustments make it incredibly user-friendly.Installation was surprisingly straightforward. The included instructions were clear and detailed, and all the necessary hardware was provided. I had the mount up and ready in no time, and the adjustable arms made it easy to position the TV exactly where I wanted it.Another fantastic feature is the cable management system. It keeps all my cables neatly organized and out of sight, contributing to a clean and clutter-free look. This small detail makes a big difference in maintaining a tidy and professional appearance.In summary, the Full Motion Articulating TV Monitor Wall Mount has far exceeded my expectations. Its sturdy construction, exceptional range of motion, easy installation, and thoughtful design features make it a standout choice for anyone looking to enhance their TV viewing experience. Highly recommended for its superior quality and unparalleled functionality!","isVerified":true,"ratingScore":5,"reviewReaction":"23 people found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Great TV wall mount","reviewDescription":"This Amazon Basics Full Motion TV wall mount is great. I did have to have my son help me mount it to the wall because it is quite heavy, but was well worth the wait for my son to come visit. The wall mount is so sturdy and it rotates from side to side and up and down smoothly, and holds my TV very securely. Just make sure you have wall studs to mount it because it is heavy duty. Once mounted properly it is very sturdy and easy to manipulate to your satisfaction. I would definitely recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Really nice, SOLID","reviewDescription":"Easy to put up. The only problem that I ran into was that the screws that mount the plate to the tv were WAY too short. Maybe just that my tv is an older one. I used the screws that were in those already.  You do need to mount this to a wall joist. The stand all by itself is beefy, BUT when you place a tv on it, the pressures on those mounts must be tremendous.  Love the mount though. Good price too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Easy TV mount. Great quality","reviewDescription":"This was a good purchase. Very easy to put together and seems very sturdy. I have a 43 inch TV on it. You only need one stud which really helps in placing it where you want it and less drilling. The best part is the almost limitless directional configurations. It moves around easily but is not loose so it doesn't move by itself.  You can point your TV to the left or right and extend it from the wall over a foot away. It also lays pretty flat when you want to move it out of the way.Pay attention to the instructions. The pictures are small and there are no written descriptions. But overall, it was easy. I highly recommend for TVs from 50 inches down to 23 inches.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"Light weight overall compared to older units.  Excellent value.","reviewDescription":"Works perfectly as advertised.  Light weight in comparison to older wall mounts.  The arm swings easily but not too loose.  My wife loves it for her home office setup.  Bought another for my daughters' TV since it works so well.  Saves space from setting TVs on furniture.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Good, sturdy mount.","reviewDescription":"Great value for the money, good instructions and went together easily.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"Easy to install, everything you need","reviewDescription":"I liked this mount so well, I bought 4 of them.Installation is easy: Pick the desired height, drill one hole in the stud.  Put the first bolt in loosely, level it, drill the 2nd hole.  Put the 2nd bolt in and tighten it up.  Tighten the first hole.  Now drill 3rd hole and tighten.  Put the mount on the TV.  Hang the TV on the mount.  Hanging the TV on the mount is most easily done with a 2nd person who can help you get the TV and wall mount lined up.Otherwise, everything you needed to install this was included, EXCEPT for a drill, drill bit, screw drivers and wrenches.  Most people have those tools, but if you don't - beg or borrow them from a friend.Enjoy your new mount!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Excellent bang for your buck.","reviewDescription":"I wrote in my other review about how I recently mounted a TV in my gazebo. I didn't want to have to drill or spend too much money, so I ordered some ratchet straps and the amazon basics mount. I have a 55\" TV mounted to it and it's secured only by the ratchet straps and it's perfect! The mount is rock solid and comes with tons of different pieces you can use in case your tv uses an unusual mounting setup. It's been perfect for what I've needed and it's low cost.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Easy, great price!","reviewDescription":"We used this to hang a LG TV, 43\". It was on the wall, I'd say in about 30 minutes from opening the box to finish.  Easy to install, directions were mostly pictures but it was relatively user friendly.  On the instructions, where it lists out different screws\/washers - that is basically giving you the various combinations that might work. So you don't need all of them, it's just saying you might need screw J, but you might need something else instead, not all of them.  Once we figured that out, it was smooth sailing.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"directions were useless","reviewDescription":"finally got this attached to wall and tv.  directions were a disaster.  spent three hours securing everything so a brand new tv would be safe.  still not confident that it is safe.would NOT buy this again","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693094400000}
{"reviewTitle":"WRONG install guide and video - totally waste of time with the WRONG information","reviewDescription":"Contradictory information in the installation video! The hole into the wood should be larger than 4mm, otherwise the screw will NOT fit it, also need to be smaller than 8 mm. Totally misleading installation guide.Also the screws provided are not suitable for TCL TV as there is a bump behind. Looking all around home depot to look for the same size but longer screw..totally a waste of time","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1665619200000}
{"reviewTitle":"Missing parts","reviewDescription":"I’ve ordered twice now since it has such good reviews and both times I’ve been missing the extension parts. Very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"Wrong screws - Won’t support TV","reviewDescription":"This Tv Mount is not universal. The following issues were found:1) Screws are not long enough for a 50” Sony TV.2) Screws width and diameter are all different, it doesn’t come with pair of same sizes.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688428800000}
{"reviewTitle":"RETURNING IMMEDIATELY. No thanks.","reviewDescription":"Followed instructions, simple enough, used stud finder and electric drill to make pilot holes and used all recommended items from instructions and after trying twice, I now have six holes on my apartment wall. Now I am needing to fill and cover up six holes because after I installed the actual mount and before even thinking about mounting my tv, I tested the mount and both times the mount AND screws came off the wall after drilling. Range of motion is great through. Easily would have been the perfect mount to put my tv and move around but range of motion should also include out and off the wall after installation.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1573084800000}
{"reviewTitle":"dont buy","reviewDescription":"truly hope whoever is responsible for designing this develops a terminal illness","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Poor quality hardware","reviewDescription":"Simular experience to another of the one star reviews. I drilled the correct size hole, 5\/16\", inserted the anchors but the bolts were too large and the heads stripped while I was trying to screw them in.I may run to the hardware store to fix it but that is completely unacceptable quality control and makes me really hesitant to buy Amazon Basics again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1663459200000}
{"reviewTitle":"Seems like a great sturdy product but...","reviewDescription":"Bought this for my 32\" bedroom HDTV. Seems like overkill, but figured it would be better to just pay the extra $5 for something better. Would make future TV upgrades easier... However it doesn't work with my 32\" TV.Back plate, covers the power cord plug.They'd need to include longer spacers. The ones they have are about 1 inch. Not enough to fit cords and cables behind it.If you have a big TV this works for, its probably a 5-star product. But it says compatible with 22\" HDTV, which I highly doubt since its not working well with a lot of 32\" TVs.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1575676800000}
{"reviewTitle":"AWFUL screws, do not buy","reviewDescription":"The metal used for the mounting screws is like butter. In trying to install them, they stripped no matter how gentle we were. We were completely unable to install the mount because of these trash screws. I've got to hope I can find higher quality replacement screws somewhere else, but the instruction manual provides little detail about the measurements for these screws so I have no idea how I'll do that.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1655942400000}
{"reviewTitle":"Does not fit Amazon's own 43\" TVs","reviewDescription":"This was Amazon's recommended mount for their own Amazon Fire 4k 43\" TV. It does NOT fit that TV. This mount has a tiny 200mm maximum VESA pattern, instead of the 300mm pattern required by Amazon's TV. As the TV was very light, I ended up piecing together the hardware in a different way and hanging the TV off just two VESA holes. Frustrating.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1658966400000}
{"reviewTitle":"TV mount","reviewDescription":"Absolutely trash 👎","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Off-center when installed","reviewDescription":"The quality of this mount appears to be quite good, very sturdy.  However, I wanted a  mount that could be centered and flush to the wall.  For some reason, on this design the arms are not spaced in a manner to allow a centered position when flush to a wall.  I returned the mount and got something else from Amazon which worked a whole lot better.  If you are looking for a mount that is sturdy, and NOT necessary to be centered to a wooden stud, this could be a good mount to use - as long as you do not need to have it center to a stud..","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1605744000000}
{"reviewTitle":"Absolute nightmare","reviewDescription":"Don’t waste your time buying this one! They came up with the worst parts and you’ll be spending your day going back and forth to Home Depot or Lowe’s trying to find something that would fit better","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"Don’t expect to hang this when received","reviewDescription":"The Mount itself is very heavy so not for children’s rooms as it can fall and hurt them pretty badly. The hardware is a joke I’ve literally never seen such trashy bolts in my life. Expect a trip to your local hardware store to even be able to use these. Not only does the hardware immediately strip but they put a flat back on the hex edge so you can’t use a socket wrench if it strips. Junk. You get what you pay for buy something else.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1653350400000}
{"reviewTitle":"Commercial came with product","reviewDescription":"I like commercials","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Horrible horrible horrible!!! BEWARE!","reviewDescription":"If I could give 0 stars I would. This tv mount has always made noises when rotating the tv and today it fell! Just seconds after my 6 year old son rotated it in a different direction. Had this fallen on him it would’ve been a lawsuit. DO NOT PURCHASE THIS!!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1686268800000}
{"reviewTitle":"Sent used item","reviewDescription":"Item is great. Just sent it to me without the parts. Happy to redo reviews if I get parts!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"Does not level properly","reviewDescription":"After two hours of trying to get this level when mounted we gave up.  Due to the weight of the tv (65” tv, less than 50lbs)- the extension arm could not handle the weight, causing the tv to dip down on one side about 1\/2”.  Which may not seem like a big deal unless it’s only 4” down from the ceiling.  Not recommended for a large tv","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1665360000000}
{"reviewTitle":"Bad fasteners","reviewDescription":"The load bearing tap screws are garbage and will strip if you so much as look at them the wrong way.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698624000000}
{"reviewTitle":"Cheaply made","reviewDescription":"It doesn't stay level.  I had a professional come and install it for $70.00 and it would be level and when it was pushed back against the wall, it wouldn't stay level any more. Very disappointed in it!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"Inconsistent","reviewDescription":"Not sturdy enough","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"DO NOT BUY!! Cheap Hardware and will cause DAMAGE to your TV","reviewDescription":"I installed this verbatim according to the instructions provided by Amazon. I used the hardware and wall anchors provided. My tv was a 46\" flat screen that weighs maybe 40 lbs. I mounted and hung the TV and after 10 seconds the TV and mount fell from the wall pulling the wall anchors out. I spoke with Amazon customer service and was told that they would only refund my money, and not compensate me for my television because I didn't have professional installation. DO NOT BUY!!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"Very disappointed with this product","reviewDescription":"Very disappointed with this product. The instructions basically say drill three holes and line them up. They also include dry wall anchors even though they said this mount was meant to be installed on wall studs and not dry wall. They also do not include washers for the screws that connect the mount to the wall and the screws they include don't feel very sturdy. I'm an idiot and ended up with a hole that was too big because I was trying to put the dry wall anchor in. I managed to get the screws in right but they never felt secure and the mount would slide if I bumped it. I don't feel confident having this on my wall. The part that connects to my 32 inch tv fit perfectly though. I'm usually all for amazon basics products but this was a very disappointing experience and I would not recommend this product","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1503705600000}
{"reviewTitle":"Anchor pieces are junk","reviewDescription":"Those plastic anchor pieces are terrible. They do not have lips to keep from falling into the wall and made an easy job complicated cause I had to get metal ones that pulled it shut.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Zero","reviewDescription":"I’d give it a zero if I could. Installation instructions are worthless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Missing parts","reviewDescription":"I’m super upset. I bought about a month ago so I can’t return but when I opened my package it was missing the piece that attaches to the tv. So it is basically useless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"How Can This Possibly Be So Highly Rated?","reviewDescription":"I left video review as well. I am perplexed as to how good of reviews this mount has. Mine was purchased to mount a 40 inch TV in my RV bedroom. There is absolutely NO WAY this mount would withstand even the slightest of road motion. Of course, most folks probably didn't buy this to mount in something that moves and bounces around, but it is SO loose that breathing on it too hard would probably knock it off kilter.This is the worst Amazon Basics product I have ever purchased. I would strongly suggest avoiding this item.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1658448000000}
{"reviewTitle":"Did not fit my space.","reviewDescription":"No additional comments.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Not all items","reviewDescription":"I bought this used in good condition. So I figured it would have all the parts but no. Screws and the arms where missing. Be mindful of missing parts if you buy something used","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698105600000}
{"reviewTitle":"Cheap screws ruined everything!","reviewDescription":"Very cheap screws ruined this installation and no idea what to do now.  Soft metal made it impossible to use Phillips heads and only strips the heads.  Moved to manual ratchet and although slow seemed to work until the head of the screw detached.  (See pics).  Now with most of the screw in Tyhe wall but no head, what do I do?  Will definitely never buy anything branded “Amazon Basics” ever again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1665273600000}
{"reviewTitle":"Good but lengthy installation","reviewDescription":"I'm giving this 5 stars because the mount itself is great. It feels sturdy and looks great on the wall.However, the installation took me a long time because I don't have a ratcheting socket set. There are 3 hex head screws that are about 3 inches long and need to be threaded all the way into the wall. This is probably a breeze with a ratcheting socket set but I didn't have one on hand so I had to use the little allen key style hand wrench to get these in. It probably took about 45 minutes of twisting. Just a heads up to anyone reading this.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717200000000}
{"reviewTitle":"Perfect","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"exactly what i needed","reviewDescription":"I had been looking for a small wall mount for a 32' tv. I didnt need anything fancy. Just to secure it to my wall so my cat wont knock my tv off again. This had me skeptical that it would be worth while at the price. But amazon basics have made me a believer in their items once again.  The instruction book was a bit of a mass mess.. but being i used to be a construction worker i was able to get it all sorted on my own. There are addition arms to add one the mount so it will fit the vesa mount on the back. Thant is always handy to have. My only issue  were the wall sinkers. To me they seemed flimsy.I ever needed i would buy another if i get a 2nd tv and i would tell people this is worth the money.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Sturdy and easy to install","reviewDescription":"Very solid bracket.  Works great and very stable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Very sturdy product","reviewDescription":"Impressive. I was looking to mount my Samsung 55 inch tv on a wall mount with simple swivel capabilities. I bought another brand that said it could handle up to 77 lbs of weight. My tv is 33 lbs.  I was very disappointed as the mount was somewhat light weight and had a lot of wiggle in the main connection point. So back to the drawing board. I have purchased more expensive tv mounts in the past, Kanto is very good, but was looking for something  bit more economic and simple. I ordered the Amazon Basic product after watching video. I could tell from the point of delivery it was probably better based on the weight of the package. This tv mount is simple and very sturdy, no wiggle. Easily holds the 33 lbs and probably would hold the advertised max weight with no problem. Also the tv hangs on the mount is a simple manner to allow connection and level adjustments. It is priced in the middle ground of products. If you are looking for a good, solid, straight forward swivel tv mount, this is very impressive. Depending on the your needs a higher end might be needed for more swivel range and other options. This mount will likely work on an LG tv because it has VESA standard extensions. Since LG doesn’t follow VESA, sad, the layout out the extension may be a little unusual but stable (probably two holes in main mount and two out horizontally to the other two). May need to experiment. Good luck!","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Wall mount","reviewDescription":"Great product exactly what I needed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Love these mounts with folding arms.","reviewDescription":"This is the second mount I buy from Amazon.  The first was for a 100 lb TV and then this one for a 50 lb TV.  Both with folding arms.  They are sturdy and easy to install on wood studs.I will keep buying these.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"EASY USE","reviewDescription":"NO PROBLEM INSTALLING THIS... HAS TEMPLATE AND ALL THAT IS NEEDED....","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Great Product","reviewDescription":"From the instructional video on amazon to the overkill in parts for potential various applications this product kept its promise. It was easy to install and the instructions were clear. The template for drilling the mounting bracket was great. The only con for me was that I am questioning the size bit they recommend for drilling the mounting holes in the wall stud. I had to go two sizes larger in order to screw the bolts in. The hex caps on the bolts were rounded so my ratchet head slipped under tension and had to use the Phillips drive but even that was was too tight using the recommended bit. This was a small issue for me because I have tools and strength, but I could see it being an issue for someone less able to adapt beyond the instructions and materials provided.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Nice work again Amazon!","reviewDescription":"This product was a great deal.Easy to install.It came with leveling materials and everything.Solid quality.I put a TV that was a little too big on it but I knew it was okay because I wanted it to angle down just a little bit.The size works well and it's very versatile.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Great mount for the money","reviewDescription":"Good tv mount and pretty easy to install. Seems sturdy and flatly easy to adjust the viewing angles.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1719705600000}
{"reviewTitle":"Solid construction but…","reviewDescription":"The construction is solid but this might not be a good pick for you if this is your first time installing one of these. This is probably the10th TV bracket I’ve installed over the course of my life and eventually you get a feel for how all of these generally work.  The instructions are not very good, and I ended up using some of my own screws and leftover components from past projects to get this mounted on my wall. That said It appears to be made well, and feels really solid.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"TV Mount","reviewDescription":"I have this a four star because I watched my husband put this up. It was a little confusing and after it was up I can still see the back bar mounted below the TV. I think it would be better if you couldn’t see it. But it does the job.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Easier assemble options available","reviewDescription":"It’s a great product and it definitely works but it is a lot more difficult than other brands. I highly recommend looking for a simpler version as this took a long time with different TVs and different screws.  The product does the job intended but it’s a lot more complex than anyone else has mentioned.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Great for TVs, less great for Monitors.","reviewDescription":"It still works perfectly fine, but there's little flairs added to each side of the VESA mount that sits inside the back of the monitor that makes it so it can't fit in. So I had to use longer screws and have it sit on top of the mounting bay instead of inside of it until I can get a better mount. Quality wise the thing is great, just much better for TVs than monitors.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Good, but difficult to install","reviewDescription":"This mount is good and sturdy. It's pretty universal and has a lot of mounting options for different screw configurations for your TV. It feels heavy duty, especially for the price.However, what should have been a really simple install turned into a bit of a nightmare. My first complaint is pretty minor - the instructions rely on pictures and there aren't any words to explain what each of the dozen or so different configuration pictures are for. It was just a bit confusing to figure out how to mount the TV bracket. Major complaint - the lag bolts are the absolute chintziest pieces of hardware I've ever used. I piloted the holes into the stud, and all three bolts just disintegrated before we could get them screwed into the wall. Not just the philips head cross, but the hex bolt head. We had to drive them in by hand with a vice grip. We'll never be able to take it off the wall at this point. It would have been faster and better to go to the hardware store for decent hardware. Really disappointed with that aspect. Do yourself a favor and get bolts that aren't made of tin foil.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"Dope","reviewDescription":"Just dope","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good for the price","reviewDescription":"Good for the price... Arms not long enough for a 50 in TV to turn a full 180 degrees, but works nonetheless","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Don't be afraid of all the hardware","reviewDescription":"This is a great mount for the money. When I first opened the box, I was pretty intimidated by the multitude of screws and other pieces. No need, as there are just a lot of different pieces for different televisions. Ironically, it didn't have a screw the right size and length for the bottom two threaded holes of my TV which do not allow you to screw very far into. However, I was able to use some extra spacers and make the longer screws work.I naively thought you could adjust the angle of the TV as needed. You pretty much set it and leave it by tightening screws. Should have known better at this price. The side to side adjustment is smooth, but has enough friction so that your TV doesn't move on its own.For smaller TVs, I really like the slim, one stud mounting base. It looks way better on the wall and is less work to boot. Final verdict is that if you are mounting a smaller TV, this is a winner, especially for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"Tv mount","reviewDescription":"Works great and can really hold weight. Easy install","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"What a joke","reviewDescription":"Directions aren't worth anything, it's only pictures. Drilled my holes straight but the anchors bent going in and crinkled. Cheap!! Now that my holes are too big to HAVE to put the anchors in I attempted to screw in the screws to straighten them out and everything went haywire. They are not in the appropriate holes and now my hands are blistering from hand screwing these in all kiddy wampus! If I could give a Zero Star I would!! Now I have 3 holes in my wall and these screws won't go in any further. Thanks a lot for nothing!! Cheap anchors!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"Screws not threaded and incorrect sizes","reviewDescription":"Not trusting Amazon much anymore. It was VERY disappointed once the mount was in the wall to realize the holes for the screws to mount the tv to the mount were NOT threaded and also not the correct size…","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Junk - Screw Metal Very Weak","reviewDescription":"The Mounting screws provided Are a very weak metal. Strip super easily, even with pre-drilled holes. Do not recommend… Have to go to the hardware store to buy extra screws to make this work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Does not even fit most recent tvs","reviewDescription":"Instructions were poorly designed. Material is cheap. Had some weird sized wall anchors which no drill bit of mine would size correctly. Waste of money in my opinion. Decided to go with this one because it was Amazon basics and haven’t had issues with that brand… guess I know for my future purchases.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"What's with the cheap construction?","reviewDescription":"I was installing this into my wall, and not only did the screws strip half way into the wall, the tool also stripped itself. It's not that expensive to include quality screws at the very least. Now I have to find a way to get these cheap screws out of the wall, get my own mount screws. I'm was told I might also have to purchase a specific tool just to get the screws out of my wall. Of all the things to save money on, screws are the cheapest to purchase quality metal, and have the most potential to ruin the project in exactly what happened to me.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"My husband hates this tv wall mount","reviewDescription":"My husband is a seasoned vet when it comes to wall mounting tv’s. The instructions were awful! The screw stripped almost immediately and we had to go out and buy more. Honestly the quality wasn’t there for us.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"DO NOT BUY","reviewDescription":"Do not buy this garbage. It says its compatible with up to 400mm VESA mounting but it is NOT. It is only compatible with 200mm VESA mounting. This seller is GARBAGE.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Does not work for non-standard stud spacing","reviewDescription":"This product is unusable for me because it does not work with non-standard stud spacing. It could have been designed with an adjustable mounting width to support 18-24\" stud spacing","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Absolute nightmare trying to install and I am a TV Tech.","reviewDescription":"Everything  is permanently anchored together with large rivets. You have to hold the TV in position and somehow figure out a method to line it up and get the screws in at the same time which are about a half an inch long, instead of sliding it apart, mounting the wall side and the TV side in two different pieces and being able to place the TV with one move.  I absolutely hate this, and would give it a minus 100 rating if I could.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"Awful. Buy something better.","reviewDescription":"The mount weighs more than my TV does, and because of that is requiring that I drill giant holes in the wall, the wall it's being mounted on isn't even thick enough for the long bolts it wants me to put through it. Not to mention the bolts are of terrible quality, as soon as they met the resistance of the stud the heads started shredding. This is an absolute trash item.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Disappointed, not very secure","reviewDescription":"Bought this a few months ago, finally got it opened and ready to install. Disappointed that rack that goes on to the wall and bars that go onto TV are \"clipped\" together only by 2 clips.  No permanent attachment to each other.  Not a very secure attachment of Tv to wall. Installed and attached TV to wall mount, with hands on both sides of tv, created a movement of light shaking, TV unattached it self from wall bars. Not very secure if a little shaking happens or someone grabs it. Would return but no option in Amazon due to my having it a few months... NOT Recommended if you live in an earthquake zone or have kids.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1542758400000}
{"reviewTitle":"Only works correctly with monitors with flat back panels","reviewDescription":"To install this mount on my TV\/Monitor, I had to keep the mounting brackets above a 3\" section of the monitor that protruded out along the bottom portion of the monitor.  While the bracket were able to be mounted to the monitor it lower the central pivot point so that the tilts downward and can not be easily adjusted.  I had to insert shims into the bracket to fix in into place.  This system is much less expensive than full motion mounting systems but it only works correctly with a TV\/Monitor with a flat back panel.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1610668800000}
{"reviewTitle":"No diagrams in the instruction booklet to assemble.","reviewDescription":"Instruction booklet print is very fine. No diagrams as to how to assemble the wall mount. None of the screws could fit the television I was trying to mount. I had to go to a local home depot after checking online as to what screws to buy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663977600000}
{"reviewTitle":"Lots of parts to assemble.","reviewDescription":"I did not use because I did not assemble it. I’ve assembled many many purchases but not even a six-pack of beer gave me the courage to tackle the assembly with its confusing instructions and close to 100 parts.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671926400000}
{"reviewTitle":"Flimsy","reviewDescription":"Mounted a 80\" TV well within the weight rating. Mounting brackets flex badly when TV is mounted. Any touch causes the TV to bounce. Additionally, you can't get the screws tight enough to prevent the TV from sagging and pointing towards the ground--it won't stay parallel with the wall.Returned.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1656979200000}
{"reviewTitle":"A Prime Member Only. NO Compensation for this Review","reviewDescription":"CANNOT RECOMMEND.Here's Why:There are ONLY TWO  tiny 1\/4\" SCREWS provided to attach the thick\/heavy mounting bracket screwed into the back of the TV to the thick\/heavy bracket screwed into the wall!ITS HARD TO BELIEVE THEY WILL HOLD!Also,  tiny screws makes it very difficult to get your fingers or a tool around them while installing. I wanted to return it but my son didn't want the hassle.  He paid for it so it was 'his call'. I won't be surprised to hear his expensive TV crashing to the ground one day.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1592956800000}
{"reviewTitle":"Wouldn’t get it again.","reviewDescription":"The quality of the mount is great however the mount itself is horrible. I mounted my 50inch TV to the wall and while the mounting process was relatively simple, the tv is slanted at an odd angle (the screen is almost facing up toward the ceiling) I’m POSITIVE I did everything right so I’m not sure if I got one that was tilted or defective. I also feel like it is better on the smaller end of the range of TVs. While the material is sturdy, it doesn’t look big enough for my 50 inch","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1590278400000}
{"reviewTitle":"Don’t buy it.","reviewDescription":"Pretty infuriating on the install, have installed several other brands\/makes of mounts. Make sure you have the stud spacing and tv centering figured out before your buy it, otherwise you’ll be using every piece and spacer to make the offsets correct.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661126400000}
{"reviewTitle":"Can’t take the weight when extended","reviewDescription":"I bought this mount because it was the recommend mount for my 43 inch fire TV. It is screwed into a stud, but it sort of says when extended.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680307200000}
{"reviewTitle":"Hardware terrible.  Supplied stud screws are way too short.","reviewDescription":"Yeah, this is garbage.  All the supplied screws are crap.  The anchor screws are way too short.  Not happy, and too late to return.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680566400000}
{"reviewTitle":"Very sturdy when mounted into a stud","reviewDescription":"Be careful when you're hanging the TV on the mount support circle it looks like it's on there but it might not be... When the TV is straight out it's level but when you fold the mount back it's crooked...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Extremely difficult to put together","reviewDescription":"The instructions or lack thereof were simply diagrams with no writing. After two frustrating hours we finally decided to look up YouTube videos. The mount is universal, the instructions are not.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"meh","reviewDescription":"the mount works fine for my tv, it moves out and pushes into the wall no problem. the directions can be a bit confusing","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Toys for life..","reviewDescription":"This one's not on you I ordered the wrong once I did like them they were on the wall they were okay just wasn't what I thought I was ordering I'm some of these stuff that I need I'm not sure so trial and error it's all good I've got two receivers that I'm stuck with but trust me I'm going to figure out a way so I like them they're all right I got them in a box warn them laugh out loud. I'm just joking I hope you have a sense of humor","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Directions were horrible","reviewDescription":"We were able to figure out how to use this but the directions were worse than buying from IKEA.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Plan for some sag when mounting.","reviewDescription":"I measured the distance from the mounting points to entertainment center top when mounting, gave myself what I thought was 1\/2\" clearance or more. Unfortunately after mounting the ≈35lb TV the arm had enough flex\/bending to drop over an inch when slightly out and more when all the way out  so I've got to drill 3 more holes in the wall and move it up an inch or two.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Decent product \/ but buy new mounting screws","reviewDescription":"Decent product \/ serves intended purpose \/ but agree with other comments \/ best to buy own separate stud mounting bolts \/ I used 1\/4 x 2 in lag screws \/ Home Depot - rather than what was provided - they did not seem the best material \/ but bracket was good and install was simple for my 32 in","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Solid for cost","reviewDescription":"Good for the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Works.","reviewDescription":"Works.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Good mount with one big issue","reviewDescription":"This mount does as it says, holds up to 40in TVs, but it is VERY hard to install a TV on this by yourself. no way to hold the TV for the sake of screwing it securely, we needed 2 people of decent strength to do it. otherwise of okay build quality.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Good, but.....","reviewDescription":"Sturdy, heavy duty unit. Too bad Amazon didn’t take the next step and include instructions that were readable and understandable. The directions were a total waste of paper. I managed to get it installed in spite of the attempt to make it easy. It could have got 5 stars if not for that","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577750400000}
{"reviewTitle":"Built-in level is WRONG - Good price, just use your own level!","reviewDescription":"We installed this and leveled it using the built-in level. Put our tv up on it and the tv was visibly tilted. We pulled out our own level and it read as being angled. Had to uninstall it, shift it to drill new holes, and use our separate level. Good price, just use your own level!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1593648000000}
{"reviewTitle":"Does not fit 43” Amazon Fire Omni TV","reviewDescription":"Fun Fact: This 12” to 43” Amazon mount does not fit Amazon’s 43” TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658016000000}
{"reviewTitle":"Review for: \"Full Motion Articulating TV Wall Mount for ...","reviewDescription":"Review for: \"Full Motion Articulating TV Wall Mount for 22-inch to 55-inch\"It works, but the instructions tell you to use drywall anchors when hanging on the stud while the provided anchors are nearly as long as the screw. I managed to install it luckily because the last maybe 1\/4\" of the screw had some bite while the rest (as per the instructions was drilled out too wide for the supplied screws.)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1504051200000}
{"reviewTitle":"Directions are a little hard to follow. You definitely ...","reviewDescription":"Directions are a little hard to follow.  You definitely want a ratcheting wrench set that has metric sockets, the included bolts are not US standard.Also, if using the smallest mounting holes (like the TCL 43\" TV), then you might want to track down your own washers.  The included ones have a inner diameter size that matches the small bolt head, so some bolts may slide through, which is a pain.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1495411200000}
{"reviewTitle":"Screws provided not Long Enough","reviewDescription":"The hole pattern fit perfectly for the Samsung 55” 6 Series NU6950, however the screws provided to attach the plate to the back of the TV are not longer enough.Build quality looks fine and sturdy. Looks like a good mount, just didn’t come with enough screw sizes to mount the plate to the back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1556323200000}
{"reviewTitle":"Mount Blocks Input Panel","reviewDescription":"I have a 55\" LG LED TV and this seemed like the perfect mount with it's full motion capabilities, however, I discovered that the main mounting plate is so large it completely obstructs the input panel of the TV. I tried using the included spacers to provide room, but it is still not enough. Warning to potential buyers, be aware of this issue! I have an LG 55LF6000.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1515283200000}
{"reviewTitle":"Missing piece cant hang it up.","reviewDescription":"I am missing a piece I received 3 out of the 4 metal things that attaches to the tv. Super upset I was looking forward to hanging my tv up today and cant. Can someone please contact me to have the missing piece mailed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1592524800000}
{"reviewTitle":"Cheap material. Worth spending more on something else.","reviewDescription":"Not heavy duty at all. One of the two bolts that holds the Tv mount to the wall mount and controls the tilt of the mount broke down the middle. It's a very important part and it's made of low quality material.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1598745600000}
{"reviewTitle":"Very sturdy but awkward","reviewDescription":"It is very sturdy and not too hard to install.  It isn't suitable for a small to medium sized room. When you push it close to the wall,  it doesn't go straight back,  but to the side. To keep it straight,  it has to be kept out several inches from the wall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1548979200000}
{"reviewTitle":"Cheap but works","reviewDescription":"Tighten the crossbolts on the base before you hang the TV on it. Otherwise it will not stay where you angle it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"My go to TV wall mount system!","reviewDescription":"5th one purchased 4th one received. Just like anything in life nothing is perfect. This system for mounting full size tvs is simple straightforward and very functional. The mounting plate attached to the TV is universal and easy to install. The absolute worst part is finding your stud in your wall. After you get your stud and get your deep lag screw in the center started, make sure you keep the level close. Get your second screw in and into the stud you’ve got a lot of cursing behind you. Install the third lag screw in and tighten all 3. Place cover plate and your ready to pick up that tv after having removed all cords from tv. Have a second person help visually guide you to make sure your mounting plate goes in the mount receiving hole. Secure the mounting plate to the rest of the mount with the 2 small screws. Now reconnect all wires. I like to affix a power bar or extension cord to the wall mount at this point to allow all cords to be hidden behind the tv near the middle so you have full range of motion for your tv. Using a cable management\/ concealment system makes a professional looking job. Now your done. MAKE SURE TO GET THE BEST STUD FINDER YOU CAN before you start this process. Look at cable management systems as well a little homework helps make your day a lot better. This is a solid mounting system. Be warned, Many people but this system and don’t trust themselves with loosing the investment they have in there TV. I understand every second guess. I just have had good experiences with this system. The tilt and swing feature is a really nice touch. Good luck.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1653177600000}
{"reviewTitle":"Good for the price","reviewDescription":"Works great and sturdy, but you get what you pay for in the sense that there is not much range of motion and it cannot tilt or rotate while the monitor is attached.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Great Product...Mostly...","reviewDescription":"I want to 5 star this, but I can't. The wall mount works as described. It holds my 55\" Samsung TV on the wall with no issues. My issue is with the stud screws that come with this. I didn't want to drive to Walmart again for another mount, so I bought this as it said it would be here in 2 days. Well over a week later, I finally got it and went to Walmart for grocery shopping the day before and grabbed another ONN full motion mount for the bedroom (where the Amazon one was originally intended for, not in the living room). The bolts on those are nice and thick. They feel sturdy and I am confident those will not break. These Amazon Basic ones? They're puny, the threads are bent, the bolt itself just looks thin and brittle. I still attempted putting the first one into the wall, and half way through, the bolt would not push any further, no matter what amount of strength I put into it. The bolt felt like it was bending. I went out to the hardware store and bought new ones, and they went in just fine. Not an issue at all. Nice sturdy bolts and the rest of mount went on fine with all other screws good enough for government work. I still recommend this product, maybe I got unlucky, but before you start removing your tv and furniture to get to the spot you want, make sure to double check the box and all it's contents. Make sure the bolts being used are good.","isVerified":true,"ratingScore":4,"reviewReaction":"17 people found this helpful","country":"United States","date":1663977600000}
{"reviewTitle":"Almost perfect","reviewDescription":"This works great with our 55\" Sony TV. The mount is very strong and well designed. It mounted solidly to a stud in the wall. It doesn't make any noises when moved. The screen's range of motion makes it easy to avoid glare, and the TV can be positioned flat against the wall to take up minimal spaceOne minor issue during assembly: the mounting plate that goes on the TV is easy to install backwards... because the \"UP\" arrow is on the side facing the TV. Naturally, you would mount it to the set with that arrow visible; when you do, it's backwards and the TV cannot be hung on the wall mount. This cost us about five minutes, and I deducted one star from the review.","isVerified":true,"ratingScore":4,"reviewReaction":"18 people found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"Mounts works fine","reviewDescription":"If you don’t have mounting instructions for your tv, the instructions with this bracket are lacking, in my opinion. It’s all visual. The use of the extension arms vary quite a bit.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Instructions are terrible","reviewDescription":"I was nervous putting a 55inch tv on this stand but it seems to work great once installed.  Instructions are a bit confusing on attachment to tv.  Had to use trial and error to get it right for my sony.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Great for small tv","reviewDescription":"Got this for a small 43\" TV. It sits off the wall more than I thought it would. The instructions are terrible. The image you see that looks like drywall mount is actually from the directions for concrete wall. I went and got some molly bolts and used those. I'd say the biggest issue with this mount is it really doesn't have much adjustment on the wall. If you need to move up or down left or right a half inch, you can't. But it does work well. I'm happy for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Base","reviewDescription":"Buena base solo un pequeño ploblema  para hacer la función de sacarla y meterle y girarla a los lados esta muy dura se ocupa algo de fuerza y se tiene que usar las 2 manos","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"One of two arrived used","reviewDescription":"Ordered two TVs and two of these mounts.  One was perfect.  The other was obviously used.The screws to mount it had wallboard on them.  The mounting template was cut out and missing.  All of the parts were loose in the box.Lucky that I got two because I was able to use the other template and leftover screws to install both TVs.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Not Simple To Assemble","reviewDescription":"Part of the mechanism that attaches from the mount to the TV wouldn’t fit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682294400000}
{"reviewTitle":"1st day ....Lag screws broke off in wall!","reviewDescription":"WELL... I was going to give this review 4 stars across the board  1) After Installing 3 of these in our house recently this last one was a doozy  2) Mounted the 55” TV like the last 3 and it started to pull out of the wall almost immediately 3) it is stud mounted as 2 of the lag screws broke off ...and are still in the wall wth 4) Very scary5) Be Aware of cheap hardware’!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578009600000}
{"reviewTitle":"Be sure of your tv mounting hole spacing.","reviewDescription":"Will not work with my 25” tv. Bolt hole spacing on tv is 3 1\/2”.  Smallest hole spacing on mount is 4”.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1666569600000}
{"reviewTitle":"Do not use with large TV’s","reviewDescription":"These are super cheaply made. They would probably be fine for smaller TV’s but we tried using it with a 65” which was well under the weight limit and it bent the bracket. We were not comfortable with it and ultimately went to a local store and purchased a much heavier unit with a much larger surface area to brace against the wall. Would not recommend for large TV’s.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1594944000000}
{"reviewTitle":"Modifications needed","reviewDescription":"I used this to mount a 32'' led Visio.  The screws are either too long or too short.  The adapters are too long or two short.  The place where the TV mounts to the bracket cannot attache because the long screws wont go all the way in.  first I tried to shorten the adapters.  That's when I ran into mount issues.  So I had to go and buy shorter screws to make it work.  other than that it's fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1546646400000}
{"reviewTitle":"Was not what I wanted","reviewDescription":"Could not use it was not what it was advertised to be","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677801600000}
{"reviewTitle":"Garbage","reviewDescription":"Buy your own lag bolts because the ones that come with this will strip out in seconds and they don’t fit any metric or mm at all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653609600000}
{"reviewTitle":"Too many issues.","reviewDescription":"Would not buy again.  The level that was included was not accurate, had to use my own.  No instructions included, I figured it out.  It became apparent that the TV cannot be placed on the mount unless it is tilted as far forward as possible, but, once the TV is attached, the tilt adjusters are accessible only by the smallest hands.  I was unable to reach behind the TV to tilt the mount back to vertical and tighten the adjusters.  My wife could barely do it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1490572800000}
{"reviewTitle":"Very poor design for this mounting option","reviewDescription":"Exercise in frustration for smaller TVs.  The small mounting holes are impossible to use because the screw goes underneath them making it impossible to get a screwdriver inserted.  I had to try to Dremel out the metal to tighten down the screws and was still unsuccessful in being able to get a screwdriver to the top screws.  Very poor design for this mounting option.  2 stars, because the mount is decent otherwise would have been down to one.  If using the smallest mounting holes, buy something else.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1494806400000}
{"reviewTitle":"2 chance? Never 👎🏻 try it.","reviewDescription":"Don’t recommend this to buy it to give it a second chance, there was a reason why it got returned.😅","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660953600000}
{"reviewTitle":"cool","reviewDescription":"easy install, looks and works great","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"For a basic product this is complicated AF","reviewDescription":"The instructions provided got way too much going on, not organized well. Different languages through out it instead of providing different languages separately. Not clear on what bolts and washers to use throughout the whole thing. 10\/10 recommend getting something else with clearer instructions.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"No directions?","reviewDescription":"It would be nice if this product had directions.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Screw holes missing threads","reviewDescription":"I bought this to mount a 43” tv in the spare room. The holes lined up with the tv vesa mount and installation went well until I tried to install the two securing screws that keep the tv plate and the bracket arm together for safety.  The screws just would not engage in the holes. Once I took the tv back down I found that those holes were missing the all important threads. Deduction of two stars because I had to dig around in my garage to find some screws and nuts that would allow me to secure the tv plate to the bracket arm. Not sure that too many people would have these fasteners laying around. Since I had to use nuts on the tv side of the tv plate that meant that I had to attach the tv plate to the bracket arm and then enlist my wife to screw in the screws that secure the plate to the tv while I held the tv in place. Went from an easy 1 person job to a drawn out two person job.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Hardware was not correct","reviewDescription":"This is a sturdy wall mount used for a Samsung smart TV. My issue is with the hardware provided. The screws supplied to attach the TV to the mount plate were either too long or not long enough. I purchased proper length M8 1.25 screws at my local hardware store. The wood bolts to attach the mount to the wall stripped easily, again I had to improvise with 1\/4 inch lag screws. The mount works well just was not adequately equipped with needed or quality hardware.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"Easy to mount and sturdy","reviewDescription":"Product works well I used it to mount a 32 inch flat screen, instructions were mediocre but not impossible to figure out the only thing I would add would be a bit more hardware for attaching the TV to the mount but for the price it's not a big deal","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"Good gizmo, horrendous instructions","reviewDescription":"The stand itself is great - very solid, good fit and finish, tight but smooth hinges, etc. However, the instructions are absolutely horrendous. It's the usual two-pager affair with microscopic font, very complicated pictures and no real instructions per se. If you haven't set up one up, prepare to spend 20m trying to make sense of the dozens of symbolic hieroglyphs, what is meant to represent what, which part goes where, in what sequence you assemble it, etc. I know that manufacturers are going down this road to save cost (i.e. minimize paper and presumably human labor to prepare truly helpful instructions) but it is madness. And even after the 20m or more of study, prepare to make mistakes in assembly.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"It does the job but the instructions were not great.","reviewDescription":"The product itself is what I was looking for, but it was not easy to install. The instructions are not very clear and there was some screws missing from the package. Overall, it seems like a good tv mount.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Let's be clear.  It hangs the TV. It doesn't \"mount\" it","reviewDescription":"Look, it's very economical so you need to temper expectations. It's well packed and well made and includes all the hardware you need.The TV with the hanger hooks to the wall bracket. The TV then rocks down and a small pin pops in place to \"lock\" Tav to the bracket. That's it. Its not really different than hanging a picture. The TV will wobble and rock around if handles. There's no feature to tighten the TV so it's immobile. It's quite free to move, but will not come off the bracket unless you pull the visible dangling rip cord to pull the lock pin.It's ok at best. Hate the movement, and loose hang. But it's cheap and puts TV on the wall.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"Confusing instruction booklet","reviewDescription":"This is a good, sturdy product.  It is very flexible.  It was received in good time and condition.  The biggest downside is that the instruction booklet is written to where you have to jump multiple pages to the next step to find it in your language, and then to realize that there are two ways to assemble was very confusing.  We have assembled may things without any problems, but this one was definitely enough to make one grumble.  When it says you need two people to assemble, that was the truth.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Sturdy","reviewDescription":"Good and sturdy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Fitting","reviewDescription":"Has everything you need to hang any size tv. It’s has tilt and swivel on it. Comes with a paper that has where you can make pilot holes you drill!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Bought multiple times","reviewDescription":"Great cheap option","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Easy and sturdy","reviewDescription":"Was surprised at the solid quality and sturdiness. Came with all the correct and useful hardware to hang the TV. Easy setup. Perfect fit and size. Perfect for our tv in our room.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Superb idea hanging a tv on the wall.","reviewDescription":"This has all the parts you could possibly need to hang any tv. The most difficult thing about installation was finding the stud.  I managed to do it all with just myself. I practiced hanging the tv bracket on the wall bracket before installing on the tv to make it easier to hang the tv by myself. The wall bracket is level but it was necessary to loosen the screws and level the tv while hanging on the wall, and that was easy to do as well. They seem to have thought of all possible issues and mitigated them. Peace out.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"Great","reviewDescription":"Did its job great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Great","reviewDescription":"We got three os these to hang our tvs. And we love them. You can pull them out, and side to side and tilt. We love them.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Locks securely for travel trailer.","reviewDescription":"We purchased this to hang a new 32” TV in our RV. It attaches securely to the back of the TV and locks securely to itself for the bumps in the road while traveling. It articulates easily if needed and re locks automatically when pushed back flat. We have been very happy with it. Price was good, too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"is as advertized","reviewDescription":"easy to install, will accommodate large TV","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Highly universal","reviewDescription":"It is a good tv mount","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"JUNK!","reviewDescription":"I will never buy an amazons choice again… every time I do it is china made JUNK!….. wasted 2hours time on what should take 15 minutes and it’s still not working properly….. so tired of this crap","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Missing important part","reviewDescription":"I ordered this tv mount about a year ago.When I opened the box I discovered it is missing the plate that mounts to the wall that the brackets attach to. This makes the mount useless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"A real safety hazard","reviewDescription":"I bought a 22-inch to 55-inch TV wall mount to support a 39'' TV, and it snapped straight off the wall within minutes. The hardware that comes with this product, particularly the anchors, cannot withstand TVs within the size limits promised when used on dry wall. Even if you follow the home installation instructions that come with the product down to the last detail, there's still a good chance that your TV will come crashing down.My TV was a total loss -- the screen was irreparably broken. Replacing it would likely cost me about as much as buying a new TV. The worst part, Amazon customer service refuses to cover my loss. When I filed a complaint, they offered to refund me for the TV wall mount only (which is less than $30), rather than the TV itself. A representative said they would forward my complaint to Amazon's product safety department, and days later, I'm still waiting to hear back.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1538179200000}
{"reviewTitle":"Missing","reviewDescription":"The product was missing all the hardware","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"Horrible instructions.","reviewDescription":"I don’t believe I have ever witnessed instructions as bad as these. Please, for the sake of your sanity, choose another option. I have scratched my head with this garbage for 6 separate days. I finally got my tv hung up but at what cost? Buy a brand that actually cares what their instructions look like before shipping it out to people. The hardware they give you is trash too. All of the screws are too soft to take a drill bit. Had to go to Lowe’s to get something different instead.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1671321600000}
{"reviewTitle":"Truly Terrible Directions","reviewDescription":"The directions have no words. Just pictures. There are several things that could be clarified with just a few words. Spent more time trying to figure out what the directions said than actually installing it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"Low-quality hardware","reviewDescription":"The product's only contribution to my home is the two lag bolts that are now broken off in my wall. They didn't break during any special set of circumstances, just basic loosening and tightening. I am returning the full package and won't be buying another Amazon-brand wall mount.The rest of the product seemed fine, although the wall mount has a faceplate that wouldn't sit flush against any other part of the kit, and the instructions were written so poorly that they made the project seem much more confusing than it really is. The ratchet that comes in the box is also of a low quality, and I found that the project was about a thousand times easier when I used my own ratchet set.I would not recommend buying this product until Amazon provides better, more durable materials with its mount.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1590624000000}
{"reviewTitle":"Pathetic Installation Instructions","reviewDescription":"Come on Amazon.  If you are going to put your brand name on this product, have some control over the quality of the installation instructions.  These are in the top 3 worst I've ever seen.  I remodel houses on the side and I put a lot of things together so I'm pretty confident in my ability.  I can't figure these out.It's a simple task to write clear, understandable and illustrated instructions.Why do manufacturers have such a difficult time with this?I work for an industrial designer.  We develop products.  We also provide a link to step by step animated instructions.  They make assembly\/installation super simple to understand and they take little effort for us to create.  They also  reduce the risk of unhappy customers and bad reviews.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1606608000000}
{"reviewTitle":"Terrible, no good tv mount","reviewDescription":"This review is for the Amazon Basics Tilt TV Wall Mount. Good luck finding some way to position the arms in a way that matches your tv mounting points. There isn’t even a drawing in the directions on how to assemble this erector-set of a product. I had a very cheap and light 32” tv to mount so I was able to just attach the mount with two of the tv’s mounting holes that happened to match the mount. Even without having to use 4 spider-leg-looking things the mount is about as stable as picture on a nail. And why are there are reviews that mention a built in level because this thing doesn’t have one?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1660435200000}
{"reviewTitle":"Don't Buy","reviewDescription":"This is the worst thing I have ever bought on Amazon, don't waste the money. Attempted hanging it myself and could not, attempted with someone else and could not, attempted again alone and could not. My screws are now stripped and this is useless to me. Wish I could return but it's been a month now and window has closed. Not Happy","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Not for small Visio TVs","reviewDescription":"This mount was fine except that the power port on my small Visio TV ends up being behind the mounting plate. Due to the bolt pattern, there were no other mounting options. I had to cut out a small section of the mounting plate to allow the power cord to pass through. Other than that it works well.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Eh.","reviewDescription":"I’m not sure if the part that adjust the tv is not right or what but no matter what we do we can not get our tv straight. The holes are in the wall so won’t take down yet. Just tilt your head to the right slightly and it doesn’t look as bad😂😂","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Pay attention!  Read and re-read before install, and try it out","reviewDescription":"Bought to replace a heavy-duty mount for a lighter TV. Instructions are near-unintelligible; take it slow and re-“read” whatever Amazon considers “help” in their instructions before mounting. A few tips:1. Pay attention to the direction that the large mount needs to be mounted on the wall. Arrow goes “up!”  You’d think it obvious, but it isn’t and the instructions are useless with this.2. Pay attention to the sidedness of the small mount that screws onto the TV. Logo faces inwardC not outward!  The large mount will not connect with the smaller mount unless the facing is correct. Make sure there is a “space” to hook the large mount to the small mount before trying.3. Do not listen to the “eye level” instructions on the template. This assumes that your small mount is centered on the back of your TV, which is not necessarily true. See where the mounts line up and adjust as appropriate. Be careful, or you will mount your TV too high, like I did, with no way to fix the error without a complete reinstall.It’s a decent mount but this isn’t beginner-friendly despite the reviews. Extremely disappointed with the install instructions.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1667692800000}
{"reviewTitle":"Not very clear instructions, lots of pieces with no descriptions.","reviewDescription":"EDIT:  Just saw the video on this product page with installation instructions. That would have been a lot more helpful to notice ahead of time. It is far better than the printed instructions that come with the product. Watch that first.--------I can see the frustration that some people have had with the lack of instructions. There are several different pieces in the box because this bracket is meant to be universal for several different types of TVs.  It does take a little bit of figuring out what pieces you need for your particular set up. It would be very nice if the instructions gave a brief description of what all the different pieces are for. You can see in the picture there are several screws, washers, and spacers included (even a little level which was nice!), and they are all labeled with letters.  There are no references to the letters or any of the hardware in the instructions.In addition, if you are not too handy, it is not clear what size pilot holes to drill for the bolts, or even if pilot holes are necessary.  It says to drill the bolts directly into studs and not to go into drywall, but it gives drywall anchors in the package, so it's not clear in the instructions if that really is ok or not (it's not).So if you are handy or good with tools and hardware, it may be easy to figure out. If you bought a TV and simply want to mount it to your wall and you are not comfortable with basic tools, it will be confusing. Get some help.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1612137600000}
{"reviewTitle":"Far too Heavy for Smaller Television LCD\/LED Displays!","reviewDescription":"This mount is far too heavy for televisions weighing only 10 pounds or less, with the amount of metal\/steel used for the mount being wasted and\/or not utilized!I returned this make\/model, and purchased a TV display mount weighing the typical three pounds.However, this mount might be just fine for larger more heavier TV displays.  Although the nomenclature states the mount could be used for smaller TV displays, I just would not recommend it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"It's a great mount for a lightweight LED TV. (However, don't trust the built-in level)","reviewDescription":"It's a great mount for a lightweight LED TV and a great mount at it's price point.  I have deducted 2 stars for the following reasons:Compared to previous mounts I have purchased, this one by no means is \"Heavy-Duty\".  The metal flexes a little under torque.  It's fine for a modern lightweight TV, but I would not recommend this mount to hang a heavy plasma or older LCD TV.  The heavy duty mounts I have used in the past are much thicker metal and have zero flex to them.  (Minus 1 star for claiming to be heavy duty when its really not.)The built in bubble level on the wall mount is garbage.  I should have read the other reviews here first that clearly point this flaw out.  I made the mistake of installing the wall bracket and trusting in the built in bubble level (how can you screw up a bubble level?).  When I went to hang the TV it was close to 2 inches too high on one side compared to the other.  After taking back down the TV and putting a proper level on top of the wall bracket the problem was obvious.  The built in bubble level was way off.  I would have much preferred this mount to not include a level at all if its going to be inaccurate.  I have included a photo of the built in bubble level compared to a separate level after re-leveling the bracket according to the tool.  (Minus 1 star for misleading, inaccurate, useless bubble level)In summary, its a fine mount at a very affordable price point as long as you are aware of the downsides up front.  I would have given this mount 5 stars if it had not claimed to be heavy-duty and had not included a built in level or included a built in level that was accurate.","isVerified":true,"ratingScore":3,"reviewReaction":"88 people found this helpful","country":"United States","date":1503878400000}
{"reviewTitle":"definitely cant support 80lbs","reviewDescription":"We were mounting a samsung 3d tv and this mount would not have worked. yes the tv is an old tv but it definitely wasnt 80lbs the mounting piece would of fell off the wall for sure","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Mount good but use your own screws","reviewDescription":"I haven’t had a TV mount before like this, so once we got it up it was nice to move around. However, the process of getting it mounted was difficult due to the screws provided. Each of the screws broke off into our wall. If we would’ve just used our own screws from the start we would have saved a lot of time and headaches!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Directions for installation are garbage","reviewDescription":"I’m surprised with people saying easy to install and wondering if the directions have changed recently. The directions are pics only and they’re completely deceiving and show different angles and sides going different ways. My husband is a superintendent in the carpenter union and agreed with me that these are horrible and difficult to follow. Once it’s up, it’s awesome, but the process to get there was ridiculous.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699747200000}
{"reviewTitle":"Works great except…","reviewDescription":"Works great except it was missing some of the hardware. Had to go to Home Depot to buy some bolts. I guess it’s my fault for ordering “like new” even though Amazon guarantees it comes with everything. Should have just bought it new. Will think twice next time before ordering a used product from Amazon.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Didn't have the right screws for our TV","reviewDescription":"Apparently, this TV mount didn't have the right screw length for our TV, but it didn't come with size options. My husband had to rig it kinda awkwardly to make it work without having to get more screws. But at least it still works!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Don’t buy anything less than new","reviewDescription":"Not a bad TV mount. I bought the “used-like new” to try and save a few dollars. The mount I got had previously been installed by someone. There was drywall dust on the lag bolts. Missing screws and stripped out screws. I made it work with extra hardware I had laying around. But definitely a pain in the rear","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Great product, TERRIBLE instructions","reviewDescription":"The instructions were completely unclear. Took me much longer to assemble this than it should've. I would recommend any other product if you don't have much time to put this together.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Providing measurement for the full-motion 22-25 inch version.","reviewDescription":"I have not installed and used the product. I will return because I’m looking for a mount that will have the TV roughly centered on a wall with a non-center stud. I want to provide a couple measurements that may help others.  The current answers are all over the place, both because they don’t specify which model and because I think the design has changed over the years. I have the 22-55 inch full motion model with ASIN B01KBEOL5E, Jan 2023.  When fully collapsed against the wall, the bracket that attaches to the Tv is exactly centered (0 offset) over the stud-mounting bracket. So if your stud is off-center, the TV will also be off-center when collapsed against wall. If you push the TV against the wall when the arm is fully extended, there is an offset of 13.75 inches between stud bracket center and TV center bracket center. The base plate that mounts to wall is roughly 11.5 inches tall by 3.25 inches wide by .25 inches deep. The screw holes are are 9.25 inches apart vertically.  The distance between the wall and the plate that mounts to TV is 15.25 inches when fully extended. Amazon is not letting me post pics. I think all mounts should include these measurements as part of specs, so we know where TV will end up on wall (not all are centered over stud plate).","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1672876800000}
{"reviewTitle":"Inaccurate Template","reviewDescription":"The template provided for this is inaccurate to the actual product. Make sure to use your actual mount as the guide. They could improve this product by simply NOT INCLUDING the misleading paper they provided.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Good mount but cheap bolts?","reviewDescription":"Two bolts sheered off on me while screwing this into my studs. Bolts could be stronger.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712966400000}
{"reviewTitle":"Had to rig the mounting plate different","reviewDescription":"Good mount but make sure your TV mounting holes are square shape. Mine were rectangle but made it work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Not well built","reviewDescription":"I got this tv holder for the TV in the RV and it didn’t hold the TV well as it wobbled around and just didn’t live up the what you would I expect. Amazon offered a full refund with not questions asked so you must keep that in mind.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Ridiculous install but works","reviewDescription":"Luckily, due to being in a rental and on great terms with my landlord, I asked if his handyman would like to install it. So glad I did. They both came and spent half an hour fighting with it. There is NO way a single person could have installed this.It does, however, work. My TV is up. Do note that it almost blocked off my ports.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Abysmally bad instructions","reviewDescription":"This wall mount fit my Hisense 55 in TV just fine. It seems to be well built from sturdy metals and came with all the parts to put it together. The instructions for putting together are abysmally bad. They are not even in the usual laughable \"Chinglish\". All you get are pictograms. Some of which are misleading while others appear to be completely incorrect! This is not my first wall mount and I know that it's easy to over drive a screw and fry your TV so I didn't just jump right in. It took me more than an hour to interpret then re interpret the pictograms, carefully test how the mount part that is attached to the TV could be attached then finally correctly affix that part. I would not recommend this mount to someone who was not experienced with using tools. In addition, the connection between the part on the TV and the part on the wall is a little \"minimal\". It definitely needs to be beefed up and I would not use this wall mount brand for a bigger, heavier TV.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1683936000000}
{"reviewTitle":"very good","reviewDescription":"got it same day delivery. best budget wall mount. not as far out extension but still it’s a bang for your buck.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"good product, not as easy install","reviewDescription":"The product works perfectly, but the install is a little difficult because you need a lot of tools, some of which people won't have, but if you have a basic set of tools and drills this will be easy for you.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691539200000}
{"reviewTitle":"Easy to install","reviewDescription":"Helpful instructions, easy to follow. Screws are cheap, I ruined two and had to replace them. Tv mounted and it has a lot of movement to move up down, side to side.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"Sturdy, did the job","reviewDescription":"Was kind of a pain to install, but once up super sturdy! Does the job, love the movement.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Sturdy","reviewDescription":"Flexible, strong and excellent choice","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Really great!","reviewDescription":"The instructions are the worst instructions I’ve ever used which is the only reason it only got 4 stars. There’s multiple options for different TVs but nothing is labeled on the sheet provided. A different review suggested looking up videos on YouTube which I ultimately did and was able to install it correctly.Don’t be alarmed with all of the extra parts left over, they’re supposed to be there.My tv is a 50” Vizio and I was able to install it by myself.","isVerified":true,"ratingScore":4,"reviewReaction":"34 people found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Went up pretty easy","reviewDescription":"Wasn't hard to install. Is nice and sturdy.I used it on a 55 inch it has a lot of different configurations with the bracket to fit  more flat screensthan I have used before. The tilt side to side brackets let you pull it nice and close to the wall","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"Easy Install TV Wall Mount","reviewDescription":"Love the one bracket installation. Hated so many tools and accessories. But overall - looks great on the wall. 2 person installation is highly recommended.This is our 1st- we plan to order 1 for other rooms.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688428800000}
{"reviewTitle":"Read instructions carefully. Watch videos.","reviewDescription":"Instructions are only pictures, there are no written directions and some of the pics are not very well done. Also, don’t be alarmed by the large number of left over parts which is usually a bad sign, but not in this case.Fairly sturdy mount for the price.Watch a couple you tube videos - they will help you maintain sanity.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1682985600000}
{"reviewTitle":"A little tough to move.","reviewDescription":"Heavy duty but pretty stiff.  Definitely not easy to change positions.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Terrible instructions questionable quality","reviewDescription":"The instructions for the product were abysmal. There were steps that were just skipped, steps that were in the booklet in the wrong order, steps that were so unclear I just had to take my best guess.  The step specifically for how to mount the arms to the back plate was so small I needed a magnifying glass to see which orientation I should use.  (I'm in my late 20s so it's not an eye sight issue)The screws\/bolts that are used to actually mount it to the wall were so soft that I was stripping the corners of the hex pattern with a hex wrench. I tried to drill them in with a Phillips head and that stripped them even faster.  Getting those bolts in the wall was an awful experience. And this is my third time hanging a TV in my house, so I know it's not always this bad.Aside from the awful mounting hardware and instructions, this product seems fine.  My 55 inch 20ish pund TV survived the night, and I don't for see it going anywhere any time soon. But if you're looking for something to hd anything heavier I would reccomend going elsewhere.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651536000000}
{"reviewTitle":"Better than some but still not strong enough.","reviewDescription":"While this is better than the MegaMount I tried first and is able to support the monitor's weight (all 11 lbs of it) it still will not lock down my 32\" monitor. The monitor moves side to side with little resistance and the mount allows one side to dip down slightly.It's easy enough to install but the tolerances between the wall plate and the TV's plate are just too loose to keep the monitor locked in place.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"Iffy safety","reviewDescription":"Bought used and it came without instructions, frustrated buuut found the pdf at the top of the product pageThe one thing that throws me is there are screws that attach the arms to the mounting plate.. but no nuts.. when they say don’t shake it, they mean it. It tightens on well, feels sturdy but in the back of my head I’m like… who approved this? Maybe if I had the user manual in front of me I could check if I’m missing something but I’m old (ish).. like late 30s (it counts) and I hate not having the paper user manual! 🤦🏻‍♀️With all that I’m just going to call it temporary, I don’t have little kids and I’ll probably upgrade to something that extends but for $10 I’m just going to make it work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688947200000}
{"reviewTitle":"Can’t lock the arm in place.","reviewDescription":"The slightest thing moves the arm left, right back-and-forth. You can only lock the tilt function.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Bracket does not align with TV holes","reviewDescription":"The installation process was going great until I realised that the bracket provided does not align with the holes in my TV. I am pretty sure I will have to return this mount as I can’t secure the bracket to my TV. Very disappointed. For reference I have a 55” TLV fire TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"12” spread for wall palte","reviewDescription":"This won’t go into studs as it’s only 12” wide. Also NOT full motion. Not even close.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"Hard to mount 40”","reviewDescription":"Did not enjoy putting this up. Very hard to mount 40” Vizio","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Terrible instructions, lots of \"optional\" components","reviewDescription":"This this tries to be a product that \"works with any TV\", but it needs to be betty illustrated in the installation manual. There are way too many components that work for 1 TV, not for another, and so by the end you will probably try 50 different variations in order to make yours work well. On top of that the instructions are just photos, and where there are words it lists out 10 different languages. Making the whole things just seem like gibberish as you search for your language. Absolutely a terrible instruction manual. It needs to be thrown out and they need to start from scratch. Whoever created that should be fired.That being said, it works once you figure it out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"Did not fit or look nice","reviewDescription":"Did not like this item the way my television sat on it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Time will tell...","reviewDescription":"Bought this because it was a good $20 cheaper than what was offered at the electronics store, and now I see why. First off, if you plan to anchor it to drywall only, do yourself a favor and buy good anchors - don't even bother using the ones included in the box. Second, it has way too much side to side play just moving it in place. Claims it will accommodate up to a 50\" TV, but the 32\" we mounted seems like it might be the max for it. I would not recommend this mount at all.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1688342400000}
{"reviewTitle":"You get what you pay for","reviewDescription":"There are much better and easier to mount products out there then this one. The “directions” are impossible to follow. There are so many extra pieces its like the maker just threw every piece they have in the box and said you pick what you want. I used at best 25% of what was in the box. If you have no experience mounting a tv do not buy this. You wont figure it out. The directions were written by someone with no mental capacity. Not a good product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"Absolute dog water","reviewDescription":"The instructions are garbage. Hieroglyphics would be easier to decipher. Didn't come with appropriate screws. Hangs crooked. Arm swings widely with no weight or force on it whatsoever. Would return it if getting it off my wall wasn't such a hassle.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705190400000}
{"reviewTitle":"Not for curved displays","reviewDescription":"Some nuts missing and it looks like it was a return sent out again. And it won't stay straight. Returning","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Difficult!","reviewDescription":"The mounting system doesn't make it possible to move the television easily.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Can’t mount unless u have a stud in the middle","reviewDescription":"The worst. Stay away. If you don’t have a stud in the middle of where u want to mount went work. Only have 30 days a to return and. Bought it early for the holidays and now I’m stuck with it. Amazon has been backing some pretty crappy stuff from China. I’m over it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Not reliable and good","reviewDescription":"Very low arm length. Not that good","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Didn't fit my TCL 55R635!","reviewDescription":"Thank goodness I didn't drill holes and mount it to the wall first...  The mounting system appears to be quite sturdy.  However, the universal \"plate\" that attaches to the back of the TV is too large to mount flush to the back of my TCL55R635.  The \"plate\" fits up to a 400X400 mounting system.  If it were only large enough to fit a 300X300 mounting system, it would work for the TCL55R635.See the attached photos.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"Parts Do not match.","reviewDescription":"It is supposedly \"universal\" but none of the volts were the right size for my tv.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Amazon doesn’t allow me to return this item.","reviewDescription":"I never received the item. I ordered two and only received one. I just want a refund for the item I never even received. Amazon doesn’t allow this. Mount worked well though.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Charge for customer assistance!?!?","reviewDescription":"First time after many purchases that I had to ask for help. I purchased a:Amazon Basics Full Motion Articulating TV Monitor Wall Mount for 22-55 Inch TVs and Flat Panels up to 80 Lbs, BlackThe instructions for mounting the wall mount are CONFUSING & VERY UNCLEAR.When I called AMAZON Customer Support to ask for clarification and or assistance, the very polite lady who answered my call said\"Your request is beyond my knowledge capacity. I would have to refer you to a \"professional\" who can assist you but there is a $$ charge for their assistance.I decided to just send the mount back and get a refund.Very disappointing!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1657843200000}
{"reviewTitle":"Goode Wall Mount","reviewDescription":"I don't know if you paid higher $$ for other TV mount stands what they would do different than this one does. Works great and it does whatever it superpose to do. Mounted 43inch TV. All good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"The BEST one ever!","reviewDescription":"I just put my living room 55” Samsung TV back up on the wall. I used to pay over a $100 for wall mounts. Figured I’d give this one a try and I was not disappointed. I can’t say enough good things about it! Easy to install. FANTASTIC product at a FANTASTIC price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Surprisingly well built","reviewDescription":"I wasn’t sure what to expect for a 30 dollar mount but my socks were knocked off. Quality build. I wouldn’t call it heavy duty but it’s above average. Holding a 49” Sony real nicely.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Low vision user","reviewDescription":"I’m using Siri to write this so please excuse any strange words. I purchased this because I have a 50 inch TV that I needed to get up off the table and onto the wall. I needed to get it on the wall so that I can move it around to adjust the help my vision getting closer or getting further away as well as being able to turn it if somebody’s sitting on the couch so they can watch it. I also wanted to get it off the table otherwise all that tables space under the television is useless this way it’s a foot off the top of the table. It was sitting on and I have a huge flat surface the store things on charge station, etc. it’s working out great what a fantastic product that a great price  The handyman that installed it took him about 25 minutes to do it. He put it together without any frustration it’s simple and sweet. I would recommend it to anyone as the handyman said it’s crazy to have any television sitting on the table when you can stick it on a wall and I agree 100%. Thank you for taking the time to read my review. I hope this helps , if I have any problems with this in the future, I will come back and change this review. Have a great day.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Quality Mount, No Issues Hanging My TV","reviewDescription":"Quality built mount with the parts to fit any TV in the size range. I had no issues getting my TV on the wall. Made sure to drill into studs and this thing feels like it could hold a tank. Also able to adjust horizontally and tilt, so you shouldn't have any issues getting your TV level or at an angle you want.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722556800000}
{"reviewTitle":"Excellent","reviewDescription":"Excellent product very easy to put up around 30 minutes multiple fittings for different TV s highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Worked great, still returned","reviewDescription":"I found a compatible TV mount about the day after I purchased this, so I returned it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Works Amazing!","reviewDescription":"Works great for the second poolside TV that I installed on our privacy fence!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Great and reasonable in price","reviewDescription":"Received quicklyDirections are a bit confusing but overall not hard","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Working great","reviewDescription":"Bolted right up fits perfectly and holds the tv up!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Product is adjustable for most TV brands","reviewDescription":"Product is compact but too universal for all TV brands as the adjustable arms were not designed very well. You may have to modify the adjustable steel arms a little bit to get them to align with the back TV panel predrilled mounting holes.  Once installed on the wall, there was some sloppy movement due to the nature of the design to be able to remove the TV from the bracket that is permanently attached to the wall.  Caution on installing the wall bracket as the sheet rock anchors are not heavy enough so I had to use HD anchor bolts because my walls only have 1\/8 thick metal studs that may not hold the weight of the TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Confusing Instructions","reviewDescription":"The instructions were so confusing, I gave up multiple times on the installation.  I finally watched numerous YT instruction videos and some common sense and got the TV set up.  The construction is sturdy and seems to be holding up well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Doesn't work well with 43\" Roku TV","reviewDescription":"Poor instructions.  After assembling the TV back plate mount, the two bottom extension brackets actually protrude about 2\" below the bottom of the TV frame.  I'm not sure if this is a Roku design fault as their mounting holes are low on the TV, but the Amazon ad claims it fits 26-55” TV’s.  Fortunately, I am able to cut-off the two lower extension brackets and make it work, but it still makes for a more difficult install.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Missing parts","reviewDescription":"The mount is okay but it was missing several screws and parts, as a result I can’t attached the mount to the tv.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Instructions","reviewDescription":"There were little to no instructions on assembly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Two Small Screws","reviewDescription":"This mount is heavy duty and very sturdy but there's only two small screws holding the TV to the mount.  One would think that there would have been at least two more screws and a little larger.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Major design flaw","reviewDescription":"I prefer the solid plates or the rails for mounting, the littler arms work, but its a flawed design because you cant access the screws after installation to make final adjustments.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Missing parts","reviewDescription":"I was missing the essential screw and bolt in the component that secures the TV to tilt forward.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Hardware missing","reviewDescription":"Received the tv mount, however I did not open the box for months (my mistake) as I was doing a renovation. When we finally went to mount the tv the hardware to attach the bracket to the tv was missing. I ended up ordering a hardware kit. Of course I could not return the tv mount.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Solid mount.  Challenge to fine-tune.","reviewDescription":"Purchased this mount for an older model TV that measures 55\" in width.  Installation was pretty straight forward.  The template supplied made it easy to figure out where to drill the holes.  One drawback is that there isn't much room for side-to-side adjustment.  The mount is designed to be drilled into studs with 16\" centers, although there's a second set of holes set a few inches closer together.  Once the mount is secured to the wall, it's possible to hang the TV off center a little bit (maybe 6\" in either direction of center).The TV can be adjusted front-to-back tilt, as well as horizontal tilt, but it takes some effort.  Front-to-back tilt is controlled by loosening a set of screws with the supplied allen key, moving the TV to the desired tilt, and then tightening them.  I found that I had to really torque these down tight to ensure that my 80lb TV didn't continue to tilt forward.  There's not a lot of room to turn the allen wrench, although fully extending the TV and turning it to one side did move the brackets out of the way to give some room to turn the wrench.For the horizontal tilt, there are 2 bolts with Phillips head screws that need to be tightened.  Again, its a matter of positioning the TV to level, and then tightening the bolts.  I found that I couldn't get enough torque using a screwdriver, but a socket wrench (metric size) did the trick.  I did notice that although the TV was adjusted to be horizontally level when up against the wall, it was a little off level when fully extended and turned.With my 55\" wide TV, I'm able to rotate the TV about 60 or 70 degrees from the wall.  Not the 90 degrees I was expecting, but it's good enough for my application.UPDATE:  After using this mount for a month or so, I've had to re-tighten the screws that set the vertical tilt two times.  I have my TV mounted outside, and I need to pull it away from the wall and rotate it every time I use it.  The act of moving it around seems to loosen the tilt adjustment screws.  I'm going to wedge something into the slots to ensure that it doesn't tilt forward anymore, but I feel like this is a design flaw, and I've reduced my rating by 1-star because of this.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1653955200000}
{"reviewTitle":"Easy Install","reviewDescription":"Super easy install, love it, rotates tv perfectly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"The instructions are intimidating","reviewDescription":"There’s tons of parts, but don’t be scared. It’s for multiple tv options.It’s a two person job. You need a drip, stud finder and electrical finder.Works great. Opted for the lightly used option and the package I got was brand new. Worth 15$","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Good","reviewDescription":"I can move it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Great buy!","reviewDescription":"I bought this as a discount warehouse return. Best one I've tried and under 15 bucks! TV is 32 inch and about 10 years old","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Works","reviewDescription":"Has held up my giant 55 inch tv for 3 months now. 10\/10 would buy again","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Heavy Duty - Fairly Easy Installation","reviewDescription":"Very solid and good quality.Instructions are easy to understand - a one person job for even the person who is only \"slightly\" handy.It comes with screws and extensions to fit just about any TVs back plate. Very well thought out product.I attached a 43\" TV to it in our guest room and it was great getting it off the \"stand\" I had bought only to find out that it was too short.If I had the need, I would buy another.The Bottom Line?Uncle Steve Approved!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"Strong","reviewDescription":"I actually bought this to mount a tool box in my truck so that I could swivel it in out over my tailgate. Well built and very stout! Shouldn’t have any issues holding a tv.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Works great.","reviewDescription":"Sturdy build, no problem handling my 11 year old plasma TV. Instructions aren't the clearest I've ever seen but they worked. Also used Echogear low voltage kit for in wall use for the plug so no wires hanging down, love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Great stuff","reviewDescription":"Commercial stuff","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Gets the job done","reviewDescription":"The installation process was straightforward and hassle-free. The instructions were clear, and all necessary hardware was included, making it easy even for someone with minimal DIY experience.Moving the TV is a breeze. The articulating arm allows for effortless adjustments, making it simple to find the perfect viewing angle. Whether I want to tilt, swivel, or extend the TV, it moves smoothly and stays in place once adjusted.The price point is fantastic for the quality and functionality offered. It’s a budget-friendly option that doesn’t compromise on performance or durability.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Can't manage as much size or weight as it claims to- and hard to center on a wall","reviewDescription":"Just switched to a larger TV, but still well within the mount's advertised size range.  On three occasions now, the hinge screws that allow you to adjust the angle of the TV (I.e if you wanted to tilt it down,) have just released and allowed the TV to pivot so that the bottom moves closer to the wall and the top tilts away from the wall.  I've given up and just decided to allow it to stay that way, because my nerves can't take a huge TV suddenly lunging towards me as I sit at my desk again.The other issue is that with the size\/shape of the wall bracket, you'll be very lucky if you happen to have a stud in the exact spot where the mount needs to go in order to screw into a stud.  I'd opt for one of the mounts with wide horizontal brackets in the future, as those would allow you to shift the TV left\/right in order to center it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614643200000}
{"reviewTitle":"Very weak screws!","reviewDescription":"The mount is nice, however the screws are weak (see pictures) and the holes were not fitting the screws 😫. Same issues with the screws that go into the wall stud; because of that, we couldn't put them all the way in the stud, afraid we won't be able to take them out when needed, and the cover therefore didn't close.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1686182400000}
{"reviewTitle":"Missing nuts","reviewDescription":"There’s no way to screw in the wing arms to tv attachment. Its a lot of screws and washers but does nothing to help build what it is showing. I am having to go to a local hardware store to find nuts and bolts to create item. Headache- beware","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Horrible directions","reviewDescription":"Sanus mounts are so much easier.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"if the no beam to hold the tv mount isn't working 😒","reviewDescription":"After installation the mount came off the wall so if you don't have a good support isn't going to be able to used it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"Wish this mount was flexible and universal","reviewDescription":"Make sure to check your studs before buying this. This mount was recommended for me for my 77” LG C1 tv. I bought it back at December and just started the process to mount it. After measuring my studs, i lay over the traced mount paper that was provided to the wall. I didn’t realize this supported only 16” studs. The studs in my living room are 20” inches. I didn’t realize my previous mount for my older tv was a universal one, so the thought about different widths of stud didn’t crossed my mind.I do wish this stud was universal and adjustable","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1646179200000}
{"reviewTitle":"After you figure out how to install it it is a good deal","reviewDescription":"I got this for my daughters room - it came with ZERO instructions on how to install so you have to go on youtube to figure it out.  We had to take everything apart and start over because one small step ruined the entire install.  In the end it is solid and seems to work really well.  The price is amazing so I can't be too annoyed with the lack of direction.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664496000000}
{"reviewTitle":"Missing correct hardware, bolts break in wood studs.","reviewDescription":"If I could give -1 star I would(joking, that repetitive comment) 3 stars. Solid, nice range of motion. Buuuuuut. The included bolts were about 1\/16-2\/16 in short. Very frustrating. I had to make a trip and find a 5\/16 x 2 machined bolt to get the mount to fit to a Samsung vesa 400x400. Mind you this is Samsung probably the biggest manufacturer of Displays in the world. So they screwed up on the mounting hardware options. Got around that. The mount is nice. Make sure you have a good stud finder, drill. After the wrong bolt debacle got it mounted and TV up. Feels very sturdy and nice range of motion.-update, first one had wrong size bolts that wouldn’t fit my new Samsung 400x400 vesa, the bolts were not long enough by 1\/4”. The second mount 2 bolts broke when mounting. The mount itself is good. The pack in bolts and hardware is pure JUNK!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1580601600000}
{"reviewTitle":"Came with defective wrench","reviewDescription":"Came with a decective wrench, I will have to go to home Depot for buying a wrench now","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"Poor Design for Tilting TV Mount","reviewDescription":"It is a poor design for a \"tilting\" wall mount. Each arm that supports the TV has a nob to turn that allows you to adjust it. But when the TV is vertically it is practically impossible to access it by hand and you need a extended screwdriver (16\" extra for 55\" TV). When it is vertical or even semi-vertical it is, once again, practically impossible to plug in cables. To be clear it will tilt it just requires tools and a small hand.We are returning this as soon as our new one arrives. This model while twice the cost allows you to tilt by simple pushing the TV forward. No tools or having to unscrew and re-screw every time.https:\/\/www.amazon.com\/gp\/product\/B00BMGTALQ\/ref=oh_aui_detailpage_o00_s00?ie=UTF8&psc=1I'm a big fan of AmazonBasics but they really missed the mark here. I made the mistake of trusting that it had so many great reviews without reading the negative reviews.This post is under my wife's account but the husband of this account bought and is returning this product.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1518307200000}
{"reviewTitle":"Buyer beware!!! Head of the included M4 screws (VESA 100x100 TVs) smaller than the holes in included washer and back plate.","reviewDescription":"Buyer beware. Both sets of the 4 included M4 screws (needed for VESA 100 mm by 100 mm TVs) included with the kit have a head smaller than the holes in the included washer and the back plate . You cannot use those screws as the back plate will not attach to the TV. I used my own Stainless Steel Fender Washer, 1\/8 in X 1 in and the 4 of the included M4 X 12mm screws to attach the back plate to the TV. I had to cut the washers to size and was more work than I planned for. After that was done all other tasks were simple. Just wanted to give fair warning to anyone else buying this kit as this will cause your TV to fall if you attach with or without the washers. The spacers were good but the design recommends using the spacer with the washer and as before the washer would not work with the included screws.","isVerified":true,"ratingScore":2,"reviewReaction":"8 people found this helpful","country":"United States","date":1512259200000}
{"reviewTitle":"Larger TVs beware","reviewDescription":"I bought this for my 50” tv, thinking it would suffice despite being on the larger side of the spectrum. When I unboxed it, I realized it was a single arm mount, and would likely not hold my 2-man lift 50” tv. I expect it would probably work fine for a significantly newer (and therefore lighter) tv, but if it appears to be a heavy tv you couldn’t lift yourself, I’d not trust the mount to hold yours indefinitely. Better to get a double arm design.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1647129600000}
{"reviewTitle":"Level on Wall Bracket Not Accurate","reviewDescription":"It's a TV mount, so not much to review. Very easy to setup, seems like heavy quality steel for the brackets, and comes with all the hardware+ for mounting to different TV types. Only complaint is the integrated bubble level on the wall bracket....which is way off. I marked the holes keeping level with the integrated bubble, hammer drilled pilot holes thru brick, mounted the wall bracket with Tapcons, and then hung the TV to find out the dang thing wasn't close to level. So I took it all back down and remounted using my own level to finally get it level. Wasted about an hour of time to get it right. So make sure to use your own level, don't trust the one that is on the bracket. The picture shows how off the level on the wall bracket is when I actually got it level.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1502668800000}
{"reviewTitle":"Disappointed This Mount Does Not Flush With Wall","reviewDescription":"If you are looking for a TV wall mount that aligns & flushes back into your wall perfectly in the middle, this is NOT the model for you. I just recently got this mount installed onto my wall here in my studio apartment, and the results of how it turned out after the time and money I spent into it have me very underwhelmed. While the quality and material are good, I'm just upset that when it comes time to push my TV back into the wall, it does not do perfectly in the middle and instead goes more to the left. Overall, just very displeased with this product for the type of wall mount I needed and in the future plan to look more a model that is more flush to the wall for my purposes.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1547596800000}
{"reviewTitle":"One evening later, still not done.","reviewDescription":"Solid looking product, the installation template is nice. That's where my good impression ends.Instruction booklet would have been better off with different languages in separate sections, instead of each page having instructions in all 6 languages. Instructions are convoluted, way too many extra parts included, with unhelpful letter labels.Drilling has been a nightmare so far. We've increased the size of the holes 2 times already and still these giant screws are too big to fit in! Any deeper and we'll drill a hole right out of our house at this rate! I understand things need to be safely mounted but 2.5 inches is a long way to drill in!We've called it quits for one night, maybe sometime tomorrow we can get a new set of not stupid screws and try again...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1540512000000}
{"reviewTitle":"Too heavy","reviewDescription":"This mount is so heavy, I needed a helper just to mount it.  And the price is a little too high.  It actually weighs more than the TV.  Returned for a lighter, less expensive unit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683763200000}
{"reviewTitle":"Horrible Instructions","reviewDescription":"The instructions for using this wall mount where so confusing and difficult to follow! This is probably the 4th or 5th time I've mounted a tv and never had any issues before. I will never use this mount again. I was finally able to mount my tv, but I don't think I did it correctly so hopefully it doesn't fall down.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659398400000}
{"reviewTitle":"To many parts and screws, bolts its absurd , compared to other mount this 100 time more complicated","reviewDescription":"I have another wall mount for a bigger TV, it has two wall bolts and 4 screws to attach the TVThis mount has over 50 little screws and bolts and washers, i have not nearly completed it even though I mounted the bracket on et wall. This is today's nightmare.Had i known i would have have returned it I would still like to","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653436800000}
{"reviewTitle":"unstable","reviewDescription":"I had this mount installed professionally and the 75\" LG TV sat straight.  It is mounted in a built in wall unit and we needed to get behind the TV easily.  After about a month or so the TV started to tilt down.  Considering we sit across from the TV at eye level, this was not good.  I had a local handyman come in and level it.  It is now sagging again.I would not order this product again and I hope the manufacturer reads this and contacts me we a solution before we have to go out and replace it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617408000000}
{"reviewTitle":"Need longer M8 screws for Samsung","reviewDescription":"Two issues:1.Samsung TVs need M8 43mm - 45mm screws to attach plate with Samsung’s spacers that came with tv. Spacers that come with bracket are too fat for Samsung and too short. Bought M8 45mm screws at Home Depot.2. The security screws (FS) which are also the leveling screws are brittle. I hand tighten one and the head popped off. I had to struggle to drill out the remaining screw but the threads were damaged. I managed to utilize one of the extra M4 screws and found a sweet spot where it grabbed but if go to far it loses it bite.Other than that it’s ok and does the job. Hoping Amazon sends me a new plate and leveling screws.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1561075200000}
{"reviewTitle":"Please read, might save you the trouble","reviewDescription":"The product itself seems to be built well and of good quality, however we purchased a Vizio 24 inch TV that I double checked on the sizing to ensure it would fit the bracket that screws to the back of the TV and found that it completely covers all of the HDMI ports AND the power cord input. Even after trying to rig it with the spacers that were provided we were still unable to make this work. We ended up having to go up in size to a 32\" which worked great. I just felt frustrated though because we checked the sizing and everything prior so this put us at driving an extra hour just to go make the return of our TV because it was either that or return this mount which had already been drilled into our wall and would have resulted in more work to patch the enormous holes.Best advice: check power cord input and HDMI to make sure that they aren't covered by backplate of mount prior!!","isVerified":true,"ratingScore":3,"reviewReaction":"27 people found this helpful","country":"United States","date":1552780800000}
{"reviewTitle":"Needs better drywall mounts","reviewDescription":"The drywall mounts are not strong enough they are a very weak material and the shape isn't correct to hold. We hammered in the drywall mount... no problem but then when we went to screw the screw in the whole drywall mount pushed all the way through and we heard it drop down between the walls 😅. Soooo we got another mount and went with that","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672790400000}
{"reviewTitle":"Works fine for the price. Very heavy and a little unclear","reviewDescription":"The instructions were literally “all over the place”. Some were on the template, some in the English section if the manual and some at the back illustrations. Still failed to clearly note a few things:1. The plastic facade the goes against the wall mount has no  connection and just floats there. (See photos)2. The tv plate can be removed but this is not clear unless you stare at all the illustrations. I first thought i had to hold the TV while i lined up the screw holes and held the screwdriver.3. The screws and washers that came with it were not referenced anywhere. I ended up using A and R4. The instructions said to refer to your tv for mounting instructions. Tv did not come with this.Note: I bought this mount with a combo TV order in Amazon. You would think they'd be synchronous instructions but they were not. Still worked fine in the end but I am a visual\/technical minded gal.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1589241600000}
{"reviewTitle":"Good but needs written instructions.","reviewDescription":"The instructions were just pictures.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"Very poor \"tilt\" design","reviewDescription":"The tilt is designed to be adjusted by  a bolt in an oval slot.  The bolt is threaded into an opposite piece. I was never able to tighten the bolt to the point where it wouldn't slip forward under the weight of the TV. There need to be some washers or other gripping pieces to stop the tilt section from tilting forward under weight.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670198400000}
{"reviewTitle":"Don't trust the built in level","reviewDescription":"I gave this 3 stars because the built in level is way off as you can see in my picture.  If I was going to level from the build in level the wall mount would have been crooked.  I always verify with a level I know is true.A person who doesn't have the right tools would install this wrong because of the level being off.I'm happy with the quality otherwise. The arms take little effort to move.It also came with a template which did help for the install.I used this on a Sony a80j OLED 65 inch","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1635897600000}
{"reviewTitle":"Mixed Bag","reviewDescription":"The product itself seems to be very durable and functional but the instructions that come with it leave a ton to be desired. Being a mount that’s “universal” leaves a lot of unused hardware and there are no words in the instructions just diagrams. Leaves you to use your imagination quite a bit, just awful instructions.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675728000000}
{"reviewTitle":"Excellent Deal but Some Issues","reviewDescription":"I've mounted several TVs with several different types of mounts and this mount is my least favorite of them all. It works just fine and is perfectly safe, sturdy, and functional. However, it is harder to mount than other types. First, the entire mount system has to be held up against the wall while you're mounting. You cannot just mount a plate or something and then attach the mount. You have to hold up the entire thing. Secondly, because of the first issue, it is EXTREMELY hard to mount perfectly level by yourself. This is further complicated by the fact that the part that actually affixes to the wall is relatively thin. If you are trying to hold it up against a level or level line you've marked on the wall, it is very hard to keep stationary.  All that said, after wrestling with this thing for longer than I care to admit, the TV is mounted, it does look nice, and it is perfectly functional as advertised.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1547856000000}
{"reviewTitle":"it was easy to install and is holding the TV up without ...","reviewDescription":"Somehow the level in this mount is not correct. We used the built-in level and when we installed the television it was not actually level. I'm not even sure how that is possible, so make sure you check and double check the installation with a different level while putting it on the wall.Other than that, it was easy to install and is holding the TV up without an issue. I wish it were about 2\" longer, as the way the studs in our wall are arranged the TV is off center on the wall, but that's no the fault of this mount. The mounting hardware provides a lot of flexibility so if you have a weird TV or it has recessed or uneven holes you can easily install the brackets on the back. The included guide that shows where the center line of the TV will be was extremely useful for figuring out where to put it on the wall.Overall, besides the leveling issue, a good purchase. Double check the level with a separate level and you'll be very pleased.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1513468800000}
{"reviewTitle":"functional, but made from cheap, low-grade parts. also, no useful assembly instructions.","reviewDescription":"If you are going to hang the TV once and never move it again, this is probably a safe buy.  The TV mounted brackets are the thinnest gauge metal I've ever seen on a TV mount, but engineered in a way that it is sturdy enough.  The friction mechanism to hold the preferred tilt of the TV is cheap plastic, and will not likely survive multiple adjustments (It feels like it would be easy to strip the threads if over-tightened).  Also, the built-in bubble level in the center of the wall bracket is a great idea, but only if it is actually square with the bracket.  Mine was glued on crooked, so it was useless.  You should plan on using a real level when you install this product.All that said, It was easy to install.  It came with a wide variety of different size bolts and spacers - but no instructions about how various parts should be assembled.  If you are used to DIY assembly, it is easy to figure out though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1535932800000}
{"reviewTitle":"Perfect","reviewDescription":"Easy fast sturdy install less then 30 minutes to install including mounting TV and arguing with my son.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"durable and easy to install","reviewDescription":"got this for a roku TV, it had initially confusing directions when it came to figuring out what hardware needed to he used (I may be stupid) but it was easy to install once my brain cells did their thing. very durable, the arm moves smoothly, and the stand itself isn't fugly so that's a win too","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Our tv is up and away from the kids","reviewDescription":"I love this ! I can watch tv at any angle ! Sun I’m coming for you !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Has all the parts","reviewDescription":"Came with all the parts. Setup was pretty easy. Glad it included a level.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Easy to mount","reviewDescription":"Love how solid it is and also easy to move","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Strond mount","reviewDescription":"Very strong mount. Easy to install. I would strongly recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Durable","reviewDescription":"Easy to install","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Good product","reviewDescription":"Works very well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Perfect for my 43inch","reviewDescription":"Very easy to install. Easy movement. Lots of range.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"It works","reviewDescription":"It works perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Instructions unclear but holds up","reviewDescription":"So the instructions in the packet didn’t make sense, so we ended up figuring out another way to put it together and it’s been holding our 55 inch TV up really well since! But again the instruction manual is terrible.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Good quality & easy install - only lacking range of motion","reviewDescription":"It's sturdy and well-constructed, ensuring a secure hold for my TV. However, the only area that could be improved is the range of motion in terms of how far the TV can be turned. While it's a minor limitation, the mount's inability to swivel or tilt as much as expected might be a drawback for those seeking more adjustability. Overall, it's a reliable and durable mount that secures the TV well, but it could benefit from greater flexibility in movement.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Works great","reviewDescription":"Nothing fancy but did not expect fancy:  it works!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Sturdy but…","reviewDescription":"Great Wall mount but the directions are ridiculous I’m handy but your on your own  it’s a simple project but takes longer than it should because of worthless diagrams and no wording","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703462400000}
{"reviewTitle":"Good mount","reviewDescription":"Works fine but instructions could be clearer....","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Great bang for the buck","reviewDescription":"Overall very sturdy and easy to install. the only improvement I would like to see is that it comes off the wall a bit farther than aesthetically pleasing resulting in a sizable visible gap (bit over 2\") between the TV and the wall.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Watch installation vide","reviewDescription":"This wall mount is well designed and fairly easy to install. The one deviation from the instructions I made was in the size of my drill bit. The 5\/32 recommended in the instructions was too small for the screws provided especially for a woman with a less than powerful drill. I took one star off for the fact that the instructions were entirely visual. Watching the video and a YouTube video on how to locate studs was  ery helpful.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Did","reviewDescription":"The job and enjoying the movement","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Solid mount but a little loose","reviewDescription":"The mounting solution for this is good on both ends. My big complaint is that the joints are a little loose and allow a very slight sag. Not a huge issue to fix with washers on the wall end but could be better. Not bad for the price. To clarify, I have a 22\" monitor on this so the sag might be more noticable with a larger monitor. Second photo shows where I added a few washers.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Easy set and use...","reviewDescription":"I worked for me and easy to use\/install.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"good stuff","reviewDescription":"easy to use. good quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"💫💫","reviewDescription":"Buena calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Simple to install","reviewDescription":"Everything provided allowed quick installation. All I had to do was drill holes. The hardware was sufficient complete uncomplicated placement.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Perfect","reviewDescription":"Perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Great mount","reviewDescription":"This mount was easy to assemble and attach to my TV.  I didn't need the extension pieces for my TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Easy Setup","reviewDescription":"Easy to follow instructions, and got it up and installed quickly to a small TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Easy to install","reviewDescription":"The Amazon Basics Full Motion Articulating TV Monitor Wall Mount is easy to install and comes with everything you need including a level. I just installed it outside on the patio for my new tv and it was easy and took less than 15 minutes. I can position the tv any which way so it can be viewed from any part of the patio or in the pool.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Good quality, easy to install","reviewDescription":"We really appreciated the videos that are available on Amazon for this product, very helpful with the installation.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Sturdy and Easy Install","reviewDescription":"Received a quote from handy man to install.  After install was done he revised his quote stating \"that was really easy to install\", so he charged me a lower fee to install.  Very sturdy, I would highly recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Sturdy!","reviewDescription":"A little difficult to install, but once in place is great. Very satisfied with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Weight limit","reviewDescription":"No way does this hold the advertised weight. I tried mounting an older 55\" & 100lb plasma TV and the bars that hold the vesa mount bent. The mount itself its sturdy and well built but strength fails at the vesa mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656028800000}
{"reviewTitle":"Can’t fit hand between wall and tv to adjust.","reviewDescription":"Very hard to engage hooks, can’t fit hand behind to adjust angle. After wrestling it’s finally up. Would not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675641600000}
{"reviewTitle":"Bars will not fit TV sizes listed","reviewDescription":"The mounting brackets on this are very short and will not reach the holes in the back of a 43 inch TV as listed in the description without purchasing extenders.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1662508800000}
{"reviewTitle":"Cheaply made","reviewDescription":"Very cheaply made. The lag bolts are aluminum and parts of the threads are missing and the heads strip easily. The back of the wall mounting plate will chew up your wall as the 'pads' are recessed from the curved\/sharp metal edges.The dovetail for mounting the TV is far too narrow, which makes for a very risky mount. It's too easy for it to sit wrong, leading to your TV face planting. The set screws for setting tv tilt are awkward since you need access from both sides of the TVs to tighten or loosen them.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1542499200000}
{"reviewTitle":"Horrible directions","reviewDescription":"This was very difficult to put together.  The directions were terrible.  They only show pictures no written directions.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674864000000}
{"reviewTitle":"Poor quality screws, strip easily","reviewDescription":"The design is fine, but the screws were poor quality - they had a hard time digging into the wood studs and just stripped instead. Even if you manage to get them in the wall, you'd never get them out.I'd recommend not buying this; get something higher-quality.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1658534400000}
{"reviewTitle":"Not the best… tv moves too much once it is on the wall. Not very sturdy.","reviewDescription":"Easy to install, but it does not hold the tv in place very well. It can easily move on the mount… always stays tilted no matterHow tight the screws are… and I have a very light tv, about 7lbs","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665532800000}
{"reviewTitle":"Doesn't work for all TVs","reviewDescription":"We were very impressed with the quality of the TV mount, It is a heavy duty one  But when we attempted to mount our 24\" smart TV to the plate we encountered a problem.  The screw holes matched up with the back of our TV just fine, but the plate was too large and covered the port on the back of the TV where the power cord for the TV needs to be plugged in.  So we had to order a different wall mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1562284800000}
{"reviewTitle":"Not Universal","reviewDescription":"I bought this item to use on a Sony 46 inch  Bravia TV but it CANNOT work on this TVThis bracket covers \/ blocks out ALL the input points eg. Antennae, Internet, etc. etc.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652400000000}
{"reviewTitle":"Beware with smaller TVs","reviewDescription":"I bought 2 of these mount for 2 Vizios i believe they are 27\" or right around that. Unfortunately when I put the mount on the TV it covers over half of the plugs on the back of the TV and those have no side connections. You are unable to connect ethernet, or either HDMI on the models I have.  I was able to cut a piece off the mount to fix the problem, but it would have been better if I didnt have to do that.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1555286400000}
{"reviewTitle":"Great mount! Horrible hardware.","reviewDescription":"I gave this only a two star rating because the lag bolts included and instructions are the worst. The lag bolts were so bad they snapped during installation and the instructions lacked in instruction. However, the articulating mount is very nice and worth the price but go and buy new lag bolts at the hardware store before you install this mount to save yourself a massive headache.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1571443200000}
{"reviewTitle":"Threading issue","reviewDescription":"Part of frame was supposed to have threads for bolts and did not.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1668556800000}
{"reviewTitle":"Will not work on Vizio 32” D series Tv","reviewDescription":"I can’t say much about the performance of the puduct because I was not able to install it. The mounting plate that installs onto the back of the TV is too big and blocks the power port on the back of the tv. It hangs over the VESA mounting homes and into the media input section on the back of the tv.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1575676800000}
{"reviewTitle":"READ BEFORE BUYING: we've installed 4 previously, this time impossible,","reviewDescription":"OVERALL GREAT VALUE, not recommended for anything above 47 inches. Doesn't fit LG 55 inch TV, absolutely no way to attach to the 300MM X 300MMVery frustrating experience wasted a good 90 minutes.  Was super easy and works well on smaller tv's and on our VIZIO, even installed on a 55 inch VIZIO","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1593907200000}
{"reviewTitle":"Don't waist your money.","reviewDescription":"While my tv fits on the mount, the level on the wall mount it self was off from another level we had laying around the house. So we went with the wall mount level and the tv was crooked, had to redo the whole process 3 times. Come to find out that the bottom latches don't even latch onto the wall mount. Currently in the process of looking for a new wall mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1512432000000}
{"reviewTitle":"Parts were broken","reviewDescription":"One of the four extended arms was not machined correctly so the screw did not attach. Had to order a second one for parts because I had already put the unit on the wall and was not going to take it down to hassle with a return","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614556800000}
{"reviewTitle":"Does not maintain a level postion from open to close","reviewDescription":"I leveled the mount when closed, but after opening it to an angled position, the TV is no longer level.  I had to level it at the opened position, and then put up with it looking crooked on my bedroom wall when not in use.  Poor design...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1604448000000}
{"reviewTitle":"Bad bolts shear off!  Be careful!","reviewDescription":"Would be 5 star if the super cheap bolts didn’t shear off in the stud.  I ended up with two sheared off bolts that were tightened by hand.  Dangerous product without buying aftermarket bolts from Home Depot etc... I’m confident it’s sturdy now but if you buy do NOT use their bolts!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1581292800000}
{"reviewTitle":"Be careful","reviewDescription":"Super cheap and it wobbles with the tv on it, mounting system just isn't tight","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668124800000}
{"reviewTitle":"Impossible to LEVEL","reviewDescription":"I do like this style of T.v. mount. I give it 2 stars because it is impossible to get LEVEL !! If you pull it out from the wall and level it, the. Push it back against the wall it is out of level. Same thing vice versa. Also if you bend it the opposite way it will be out of level. So the concept of the T.v mount is useless !!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1513987200000}
{"reviewTitle":"It’s fine","reviewDescription":"It’s doing the job but would have liked it to be a bit more sturdy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"It works","reviewDescription":"Easy enough to assemble. Just make it's used on a light weight led TV. Lcd might be too heavy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Bring your patients and then some","reviewDescription":"I attempted to assemble and attach this thing to my tv and then walked away from it 3x before having any success. Then after you manage that part make sure to brush up on your trigonometry because if you just center the piece that attaches to the wall to tv itself will not in fact be centered. However if you get past the assemble and you can center everything around the tv (instead of centering the tv to everything else) then it's sturdy and so easy to put the tv at any angle you want.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Nice but heavy realized can’t hang on wall, my walls are week. Heavier than tv","reviewDescription":"Nice but heavy realized can’t hang on wall, my walls are week. Heavier than tv","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"Works great","reviewDescription":"Very sturdy and easy to adjust. We mounted on back porch and the only reason it gets 4 star and not 5 is cover plate that covers mounting bolts will not snap on because of our vinyl siding. Not a big issue for us for tv covers it anyway.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Directions are confusing","reviewDescription":"Was not what I thought it was but it worked for now","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Poor hardware","reviewDescription":"hex bolts are soft metal and are easily stripped. Also, they are metric so be sure you have a 10mm socket of some sort.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Screws","reviewDescription":"1. The only set of screws and washers that fit and tighten the TV to the bracket were a 1 CM too long. There's a wobble now. They also shred easy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Was a little difficult to mount from a high location with a 32\" TV.","reviewDescription":"A little difficult to get the spacing correct with the VESA mount on my TV. Likely a non-standard mount. It worked okay, but a little difficult. Price was right and working well once it was mounted.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Just what I needed","reviewDescription":"We replaced our old RV TV with a smart TV and the existing mount did not match. This mount advertised almost 100% compatibility and they were not wrong. So many accessories to accommodate any TV manufacturer. There were several parts supplied that were not needed, but it was clear there was an incredible range of variations for attaching to the TV>","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"The bars stick out from below the Fire TV Omni 55","reviewDescription":"The mount itself works exactly as described - full motion. The installation process was easy with a template and clear instructions. The only reason I took out 2 stars is because this does not work well for the Fire TV Omni series 55 inch.The bars stick out from below the TV: You can see that the bars on the mount look like an X. On a Fire TV Omni 55, the mounting is done at the lower end of the TV. The net result is that the 2 bottom parts of the X project out below the TV and are visible from the front. This was not a dealbreaker for me since I was looking at a mounting in the garage, and so I did not want to go through the hassle of waiting for a new mount to come back.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1660435200000}
{"reviewTitle":"Drections not very good","reviewDescription":"Nice solid product.  The directions not exactly good or easy to follow","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"It works but it’s really confusing","reviewDescription":"I was building it and the instruction were so confusing no words and there’s so many screws. But it works good holds my tv well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698624000000}
{"reviewTitle":"It is NOT off center (and I wanted it to be)","reviewDescription":"I bought this specifically because a number of reviewers complained about it being off center by 4 inches when mounted and pushed back flat against the wall.  Unfortunately this mounting bracket is perfectly centered.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Some screws are missing but other than that is fine","reviewDescription":"Two screws using at the very final step were missing. We were lazy to put everything back for a return or replacement so ending up buying compatible screws in Home Depot. The product works fine and flexible with different angle, but highly suggest to check every part before the installation.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Works, but the screws broke during install.","reviewDescription":"One of the screw heads broke off as I was mounting it to the wall. Aside from that, it's still pretty stable and was relatively easy to install.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"Mount is great; hardware not so much.","reviewDescription":"Opening the box I thought the product was very well made.Instructions are useless for the most part.The hardware that mounts to the TV is fine however the bolts provided to secure the mount to the wall are cheap quality. Unfortunately had one of the bolts snap on me while installing (wasn’t over tightened still have some space to go before the but was fully flush with the bracket). Thankfully I was able to secure the bracket with the two other mount holes in the bracket.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1682726400000}
{"reviewTitle":"mid","reviewDescription":"Make sure your tv supports the M4,M6, and M8 Screws for bracket mounting, my tv needed M5 screws and it didnt come with them. had to go to walmart and get a hardware kit for the screws. and Upsize the drill bit when drilling the holes in your studs by atleast 2 sizes, used the reccommended size, (5\/32) and stripped the screws trying to put them in because the holes were much smaller than they shouldve","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1684972800000}
{"reviewTitle":"Very basic mount","reviewDescription":"It fits the TV and mounts it to the wall.  So far it appears to be ok.  The included hardware works well.  The wall bracket should have been made out of a thicker metal.  Since you stud mount this, and its only so long you can't center mount the TV on the bracket (IRT to anchor points) to distribute weight on it.  This causes one of the sides to be extended beyond the wall stud anchor point, and with the TV weight on that side it slightly bends the bracket away from the wall.  My TV is well within the weight specs that is claimed.  The release cords for the mount are very long and require a little looping and tucking to hide them behind the mount.  As others have noted the \"level\" on the wall bracket is off, its useless.  If you don't have a level it will get you as close to level as eyeballing it will.  Thing I learned very quickly was how much of a difference my other mounts with extension capability makes so that you can pull the TV from the wall a few inches.  This mount, have two or three people to install the TV, one or two to hold it up and one to hook up the cables before you put it on the wall.  For the price though it is serving its purpose.  Tilt is very very minute because it is so close to the wall.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1493856000000}
{"reviewTitle":"Sturdy but difficult to assemble","reviewDescription":"I guess since this is a universal tv wall mount, the instructions were extremely difficult to follow. It’s very sturdy and final product is great, but would def recommend buying one specific for your tv\/size next time","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690243200000}
{"reviewTitle":"Great price","reviewDescription":"No complaints at this time","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Easy install! Feels durable!","reviewDescription":"This tv mount was very easy to mount, it performs just as much as I need it to! You can move the tv to any angle you desire. It’s very sturdy when moving. There are lots of screws so make sure you follow instructions!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Works well at a fraction of the cost","reviewDescription":"Got one for $100 at Best Buy and this for $25. This works just the same, fully mobile and holds my 55 inch. Save your money get this","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Fits most TV’s easy install","reviewDescription":"Easy to install. Brings all hardware needed for different size TVs.  Great movement accommodates many angles. Brings screws and spacers. I highly recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724976000000}
{"reviewTitle":"Heavy, but easy to install all the same","reviewDescription":"The second this super-heavy box arrived on my doorstep I panicked a bit - would this actually work for my TV? It definitely did and was quite easy to install.Worth noting that while the instructions (which are all picture, if I recall correctly) don't show all the permutations of the way you can configure the part that attaches to your TV, but I found a setup that works really well for the Toshiba FireTV I bought recently. This package comes with a paper guide to help you place your initial mount (don't make my mistake, though: make sure you or someone else eyeballs the TV placement *from the distance you'll be sitting to view* so you have it at a good height - mine's a wee bit higher than I would like, but I angled the TV to offset).I also appreciate it that it comes with a level. If you're a perfectionist like me, you will absolutely notice if your TV isn't 100% level and it'll drive you bonkers. But the good news is, even if you initially don't get your TV exactly as you want - it's pretty easy to make a minor adjustment.This was a two person job but the second person really just needed to hold the TV in place a couple times. It's very easy to tilt your TV with the device it comes with, so I have my TV tilted down ever so slightly. It's also easy to move the arm around. It also comes with a small clip to help you arrange your cords so they're not dangling all over the place. Very good value for what you pay and easy to get going. I thought it'd be a half day project, but we had my new TV up and mounted in less than an hour no problem.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Love it!","reviewDescription":"Wonderful to have my TV hung now!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Good product, very versatile, but you have to follow the directions.","reviewDescription":"Since this product is so versatile you have to make sure you follow the directions for your specific TV and don’t skip any steps.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Works really well for my 42 to 50 inch TV's.","reviewDescription":"The mount will accommodate several sizes. I have two 42 inch and one 50 inch TV mounted on three of these around the house. It's really easy to assemble and it's very sturdy. It can be articulated to adapt to most any angle needed for home viewing. It comes with hardware to adapt to most situations that you would encounter with wall mounting in a home. Very happy with it. Definitely recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Heavy","reviewDescription":"I have a new 75\" TV and this mount it is SO MUCH BETTER than using the stands.  Need to plug in cables? No big deal just pull out the TV from the wall and you have all the room you need. Tilt and viewing angles easily adjustable and stay put depending on how tight the set screws are set. Obvious install issue, is to tap into your wall studs as a 100 lb+ TV plus the HD mount is serious weight, especially when extended. Only gripe is 1 day after I received this, Amazon decided to discount the unit by 20%...hummm not the first time to experience this with previous purchased. Seems a bit fishy (AI?), to put it nicely. Notwithstanding a good unit.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Great mounting bracket","reviewDescription":"This is a great mounting bracket for our old 45 inch smart TV. We used it to hang our 12 year old smart TV that we still have for the kids. It is heavy, but this mounting bracket is holding it up and we are able to fully move it different ways with ease! It was very easy to install since it is a single line bracket. You just need to find the stud and drill in the screws from there. It is nice also that it includes extensions to attach the bracket to the TV. Most newer TV's have the holes in the same spot, but not all the old ones.It is a great bracket that we will be buying again, if we have another TV that fits the size.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Great mount but installation can be tricky","reviewDescription":"Great mount but the screws (for the wall and hanging) strip easily. So beware.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"Almost perfect","reviewDescription":"This mount is really great! It’s store easy to install & holds a lot of weight. But, the dials to adjust the TV up\/down angle are too close to the TV so I can’t tighten them. & maybe that’s more of a TV problem, but either way I just have a piece of wood wedged behind the TV that you can’t see to hold its angle. The easy install was far more important to me. I would definitely recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"Time consuming","reviewDescription":"Was not aware when purchased that it was not going to be easy to adapt to back of my 32 inch  fireTV, to wall mount.  There was only one option and the fit was tight and awkward. I made it work, but it required a trip to hardware store. It’s not perfect but functional. How was I to know it wasn’t going to work easily with my 32 inch TV? Mlc","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692489600000}
{"reviewTitle":"Be prepared to buy your own screws!!","reviewDescription":"This is a great wall mount BUT when I tried to install the backplate onto my Samsung 43\" TV, none of the screws provided fit the holes on the back of the Samsung 43\" TV. One set was too long and the other set was too short. The instructions indicate that three lengths are provided but they are not. They aren't even on the included supply list. Easy to fix with a quick trip to Lowe's but I should not have had to do that. It is possible other TV brands would accept the two screw lengths provided, but Samsung 43\" is a definite no. And the Samsung 43\" is brand new model and not an older one.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1672876800000}
{"reviewTitle":"Poor Instructions","reviewDescription":"Because of the poor instructions that came with the unit, I had to hire a professional installer to the wall mount up on the wall.  You receive all the parts and pieces in individual cellophane packets, but unlabeled for what each contains.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Gets the Job Done","reviewDescription":"Overall a great value. Well made, beefy. Will support a 55 inch TV. Mine was a wee 40 incher @ 16 lbs. Requires thoughtful planning before execution. Most important is the location and method of securing to wall. Mount comes with a wide variety of fasteners and spacers. Be careful when mounting the VESA base plate to your TV. The length of the screws vs the TV mounting hole depth is critical to prevent damage to TV. If needed use the supplied spacers. Too long and !#x$*&! In my case the TV manual said I needed a 6mm screw (supplied in the kit). In reality though my TV required a 5mm screw. Plan ahead. Most of the mounting work can be done by 1 person. The final step of lifting and securing the tv to the mount is definitely a 2 person job!","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1660521600000}
{"reviewTitle":"Directions weren’t clear","reviewDescription":"This thing was a pain to put together because the directions weren’t very clear, it was just pictures with arrows everywhere. However the product itself is excellent and is very functional for what we needed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Great price, lots of options, somewhat confusing setup","reviewDescription":"This has been a surprisingly solid mount although I must say it was a bit difficult to set up even though I had a standard 400 x 400 vesa pattern on my Samsung 50inch 4K UHDTV (UN50KU6300 to be exact).Pros:-Ablility to use it on only 1 stud if need be-Offers full motion and tilt in a very compact design and at half the price of competitors options-Very versatile with many different screws and spacers included it should fit almost anything in its size rangeCons:-Somewhat obscure\/confusing instructions. Amazon seems to have gone kinda Ikea style with the instruction manual. There was almost no verbiage describing the different diagrams and it’s was very unclear which screws corresponded with which mounting types.-No documentation related to specific TV brands. It  would have been very helpful if Amazon provided something like a guide to the most common screws\/spacer combinations for the major TV brands or sizes so you didn’t have to just guess and try diff ones over and over again.-Cable Management seems to have been an afterthought. All they provided was a small u-shaped plastic thing that I guess was supposed to wrap around all your cables and then hang there I guess??Overall given that I only payed $20 for this mount I can’t complain too much although I must say I was expecting set up to be a little more intuitive just based on the fact this was an Amazon-made product.  If you were looking for something cheap and you are trying to minimize the amount of damage to your walls this is not a bad option just be prepared to spend double the amount of time you THINK it should take! :)","isVerified":true,"ratingScore":4,"reviewReaction":"188 people found this helpful","country":"United States","date":1510012800000}
{"reviewTitle":"Excellent, sturdy, just wish it would extend longer","reviewDescription":"Incredibly built and sturdy, easy to install by one person (except for lifting TV). It’s great that it swivels 180 degrees each way (I don’t understand why some much more expensive ones like Sanus don’t!). The tilting adjustment is a little loose after just loosening the screw just a little bit, which then results in an abrupt drop of the TV forward which freaks you out when it happens. Any way to make that smoother?).  I just wish Amazon would sell one that extended just about 2-4 inches longer (28 or 30 inches) because that would ensure a 65” TV could swivel almost completely 180 degrees (length of such a TV is about 57 inches).Other than that this is an *incredible* value compared to almost all other mounts.  Really makes you feel that Amazon basics products are reliable.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1655164800000}
{"reviewTitle":"Directions are wrong!","reviewDescription":"I was able to use the mount, and it does work nicely. However, look at the picture attached. The directions show this piece mounted in reverse- (the amazon logo needs to be pointed towards the TV, so you can't see it when mounted).  Doing it their way makes it impossible to hang.  You also definitively need 2 people to hang this.  I've mounted 6 TVs previously and this was the biggest PITA so far.  Lastly, my old Samsung has a bulge @ the bottom, so I had to take the parts to the miter saw and cut it short.  (See second photo).","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1678060800000}
{"reviewTitle":"I had to remake","reviewDescription":"I had actually ordered a different one that wouldn't fit, luckily my friend needed one and it did fit his TV. I ordered this one and had to remake it so it would fit.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"Keep the product page open when you try to install it.","reviewDescription":"When it arrived, the instructions were a bit unclear.  Very complex pictograms with no words.  Think Ikea instructions but way more complex.  The version of the install manual on the Amazon product page, and the accompanying video, made things MUCH clearer.  The overall installation is pretty straightforward once it's explained in the video and with words.When installed properly, this thing is STURDY.  I have an older flat screen TV that's smaller but heavier than you'd expect, and the mount holds it just fine.  Just make sure yours is within the weight and screen size limits and you'll be ok.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1658966400000}
{"reviewTitle":"Easy to install but use own bolts.","reviewDescription":"This is great for the cost. I ordered one before and I had forgot that I needed to get my own bolts. It come with the metric system sizes and they are super long. I needed bolts that were 2\". Once I used the correct size bolts it made it simple to install. This is a great stand for our in home gym.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1681430400000}
{"reviewTitle":"Not full motion.","reviewDescription":"It does not tilt up and down. Other than that I have no issues l.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695686400000}
{"reviewTitle":"It’s sturdy.","reviewDescription":"I was a little concerned about how sturdy this mount was gonna be. I have an older flat screen I wanted to hang in my home gym but it’s a lot heavier than the new tv’s. Once I pulled it outta the box, it felt well made. Once I anchored the mount to the stud and hung the tv, it was clear the mount was gonna do the job. (I highly recommend mounting to a stud and not using the wall anchors to mount in the dry wall. Unless it’s a smaller, really light tv) happy with this product!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"Good price","reviewDescription":"Works well for multiple tv's. Kind of a pain to set up but once you have it figured out it makes sense.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Instructions stink","reviewDescription":"The instructions need to be better , but it works, with that said, why does it swivel to the right?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Almost everything you need","reviewDescription":"Installing with the template to a single stud- easy. 3 lag screws are more than secure.Installing mounting plate to 32” LG- almost too easy, but I was looking for 6mm flat washers. Lots of 8mm spacers and washers, but no 6mm? (5mm?) I used my own 6mm flat washers to install the plate directly to television, couldn’t ask for easier alignment.Easy to hang the TV on the arm- you’ll want a friend to use the supplied level to make final mounting easier.All in all, it’s a solid mount, really easy for a “small” TV.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1663632000000}
{"reviewTitle":"Terrific wall mount. The screws...not so much.","reviewDescription":"This wall mount is actually impressive, and I see absolutely no reason why any other one would be needed for TVs of the intended size. I was originally concerned it would not back up close to the wall, but it does this as well as the non-swivel wall mounts. The only issue worth calling out: the low-quality screws. Both of the ones I tried to insert into the wall bent about halfway in, which ofcourse was frustrating. I bought new, sturdier ones from the hardware store and everything worked seamlessly.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1667692800000}
{"reviewTitle":"Buena","reviewDescription":"Práctica fácil de montar","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692835200000}
{"reviewTitle":"Heavy duty tv support","reviewDescription":"This is well made, the negative I found. The support bars hang below the tv set","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"PLENTY of options for mounting","reviewDescription":"I ended up with the right hardware & screws, in the multitude of bolts and parts, so there's enough in here to fix basically ANY type or size of TV. I put it into the studs and this thing is definitely confidence-inspiring for its durability and stability.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Was perfect for us but...","reviewDescription":"It's decent quality and works well for us. However, if you are not intuitively able to assemble objects, then this mount may not be the best choice for you. The instructions are lacking.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Unclear Instructions, But Sturdy TV Mount","reviewDescription":"The TV mount itself is strong, sturdy and versatile.  I found the assembly instructions difficult to understand, with poor instructions and poor diagrams.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Definitely worth the price","reviewDescription":"I would have given this a 5, but did notice that when a gust of wind hits, it tends to move the TV from the stowed position.  That's just a minor problem compared to the cost, so this is definitely a great deal!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Great mount, bad directions","reviewDescription":"The actual mount is great, but the instructions are terrible. Make sure to review install manuals before getting started.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Works well","reviewDescription":"Works as advertised for me tv.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Great","reviewDescription":"Very nice product.  Great quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Ok for light duty. Suggest tooth washer for wall mount screw.","reviewDescription":"I went outside of the specs which as I recall are 70 pounds and 40 inches. Mine is 65 inch (way over) and 44 pounds (Fine).I got it to work in a fixed state but it is not heavy duty enough to move the TV around much and stay even. The tilt is with a wrench.One thing omitted was a tooth washer for against the wall bracket and another washer over that to keep the wall bracket firm with the screw that should go into a stud and wall bracket. I would say a tooth washer is a requirement for all but the smallest TVs.Extremely difficult to mount yourself at 40 pounds. Would want ideally 3 people.This should work OK up to a guess of 24 pounds.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Make sure it’s on the right way","reviewDescription":"Spent an hour trying to hang it up and couldn’t get the pieces to connect\/ hang. Finally realized the part that screws on the back of the tv was the opposite way. The “Amazon basics” logo should be against the tv. (Not visible) after flipping it, we got it hung in 2 seconds lol. See pic for how it is supposed to look.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Good Value","reviewDescription":"Easy to install.  Keep the included level handy in case the TV gets off center if you opt to not lockdown the left-right tilt, up and down tilt with a screw.Install Tip:  Measure the distance between the top of the TV and the center bolt hole on the mount.  Use a stud finder.  Drive the center bolt about 3\/4 in on the wall mount into the stud at the desired height.  Level the bracket and mark the top and bottom holes with a pencil.  Install all three bolts.  Bingo.  You're ready to mount the TV.  Best to use two people.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Great price, well made","reviewDescription":"This is a very sturdy, solid TV mount that is well built and has a great range of motion.  For the price you really can’t beat it. I also love the fact that you only need to drill into one stud to mount it, which really provides great flexibility on the mounting location.  The install instructions are terrible though. Like many others, they’ve opted to go with illustrations\/ pictures and very few words, I assume to prevent the need to print in a bunch of languages.  Problem is, the pictures aren’t clear on which direction the plates should face and some of them just make no sense. Aside from that- this is a great item that I’d recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"Pretty colors","reviewDescription":"The only thing I didn’t like some of the tops were hard to open","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"Needed modification","reviewDescription":"This is a well constructed TV mount that comes complete with everything needed.  I used it on a 43 inch Roku TV.  The setup for 17 inch mounting hole spacing on the Roku left about 2 inches of the lower arms protruding from the bottom of the tv, kind of unsightly.  I cut off the ends of those 2 lower arms which took care of my issue.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Nice item","reviewDescription":"Thanks","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Great buy","reviewDescription":"Good purchase, sturdy and had all the needed pieces to get it right for your brand of TV","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714003200000}
{"reviewTitle":"I got it up","reviewDescription":"It's a bit heavy and the instructions weren't all too clear. It comes with any possible screw you will need (extra in case your tv has a different size).  I've installed smaller and non swivel mounts before, this one was a bit different and took me a little longer to get up. I'm pretty handy and this one gave me a little struggle. Make sure to have a drill, twist drill bit and even a handheld wrench. Overall though, good price and not too bad to put up.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Good Quality","reviewDescription":"Product and provide tools made for an easier installation. Completed this solo and in less than 30 minutes. Currently holding up a 43\" tv for the past couple months without issue. However, I did snap a bolt when mounting the plate to the stud. Be sure to predrill deep enough and don't over torque the bolts to avoid any problems.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Installation could be easier.","reviewDescription":"The design has unnecessary complications.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Large mounting screws","reviewDescription":"I really like this stand it’s really easy to install. It is very well priced compared to the competition.Only issue: the mounting screws we’re too large for a dry wall\/ seam setup. The large screws provided are ideal for concrete setup. I had to make a run to Home Depo to get screws that could be used on drywall\/ seams.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Not bad, worth the price, has flaws","reviewDescription":"It works, so it's worth the price.However, it does have some pretty big flaws in my opinion:The hooks from the vertical bars are small, so they're hard to catch on the horizontal bar.  This resulted in me scratching up the wall behind the tv a good bit while trying to mount it.The mount puts the TV too close to the wall, resulting in it being hard to connect the tv and route the cables behind it.The tilt adjustments are impossible to change once the TV is mounted.  Adjustments must be made off the wall and then re-mount the TV.The strings or pulls hanging from the bottom of the vertical bars are the only way to remove the tv from the mount.  These will hang WAY below all but the largest of TVs using this mount.  I had to tape mine to the rear of my TV to keep them from dangling.The instructions are awful.  But they shouldn't be necessary if you are used to installing things like this.It comes with plenty of mounting hardware, but it's a guessing game as to which one fits your TV.  They're labeled as Letters in pouches, which are not referenced at all by the instructions.The built in spirit level isn't even close to accurate.  Use at your own risk.I won't be returning it, but I would not purchase again.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1502841600000}
{"reviewTitle":"NOT UNIVERSAL!  MEASURE FIRST!","reviewDescription":"So I trusted that this was universal for all flat screens and that was NOT The case.  I made the mistake of drilling three holes into the concrete block of my garage and THEN realized that the TV mount did not fit the mounting holes of my flat screen. I had to buy extra metal strips and attach the mount to those strips.  Make sure your TV has mounting holes near the center and not at the corners only like mine.  BUT this is an awesome mount and it does work well now that I fixed it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1666569600000}
{"reviewTitle":"Instructions are pointless","reviewDescription":"Instructions are horrible. We had to figure it out on our own. There are just a bunch of pictures with no explanation. I suppose it works good enough if you can figure out how to use it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"Super frustrating","reviewDescription":"I originally purchased a mount for my 43\" tv at a big box store. The mount required to be installed on 2 studs 16\" apart.  However, mine are more like 24\" apart. Needless to say, I returned it. I went on Amazon and this appeared to be mounted on one stud. However, in all the instructions it said it needed to be mounted on 16\" sections of studs...soooooo confusing because it was mounted on one stud.  I'm a rather handy person and a college graduate (whatever that means anymore) and it literally took me 5 hours to figure out what the heck the instructions were trying to say!!!...and I still had no idea. Once you throw out the instructions and figure it out for yourself it should take about half an hour. They are literally the WORST instructions I've ever seen!... and I've put together all sorts of things. Amazon makes so many products and things that are user friendly and this was so laughably strange, I thought I was on Candid Camera. Bottom line, I'm not sure about the whole 16\" stud thing and dont pay attention to the directions. After 24 hours, my tv hasn't fallen off the wall (fingers crossed). Happy drilling.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1577577600000}
{"reviewTitle":"Item as described.","reviewDescription":"Delivered 2-day late,, otherwise item as described in add. Shipping was terrible.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Minimal Instructions","reviewDescription":"Overall it's a great product. I want to say that first and foremost. The instructions, however, are so incomplete that you're left searching online for what all of the extra hardware is for. I get that it comes with extra pieces to fit just about any TV, however there's no documentation for what piece to use in what situation. There are some helpful videos out there if you search for the product name on Google, just be prepared for a bit of frustration when installing. Again, overall I'm happy with how it works, just wish the instructions were more complete.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1663545600000}
{"reviewTitle":"Bad physical Instructions - Bad quality bolts - Great everything else","reviewDescription":"The construction of this is decent enough but there are a couple of things that make it a headache.1. The instruction manual is in something like 10 languages and it is all jumbled together so it is not user friendly at all. just watch the video they have on here it is much better than the manal2. The lag bolt heads are soft, so if you are using a drill vs a socket wrench watch out! If you dont drill the pilot hole to the correct depth, an impact driver will strip the bolt in a matter of seconds once you hit true resistance. They are a very shallow phillips head as well, beware of that and use the correct bit. Even a socket wrench stripped the sides of the bolt.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1638403200000}
{"reviewTitle":"For $8, it's ok, but wobbles more than I would like.","reviewDescription":"For $8, it's ok, but wobbles more than I would like.  The way the lower spring pin fits, allows the screen to wobble in place.  I would not buy it again, but for $8 I'm not taking it down.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1684368000000}
{"reviewTitle":"inadequate rotation","reviewDescription":"The unit is a solid fabricated device. It came with good instructions. and was easy to mount.My problem: My customer wanted a mount that had 180 degree rotation. This unit was advertised to have 180 degree rotation and was rated for up to a 55\" TV. I mounted a 40\" TV for my customer, and when I tried to move to the 180 degree position, it hit the wall. I can't imagine where a 55\" TV would have landed.I have an unhappy customer.Tom","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1670630400000}
{"reviewTitle":"Do not trust the attached level that was inserted into the mounting frame. It was off","reviewDescription":"The whole concept of this is great. It is made to be very simple and designed to make mounting simple. That is great if the level that is inserted into the mounting rail is actually level. Nothing like completing the job, hooking up all the wiring, then sitting back to watch tv and admire the job accomplished. Until you NOTICE,,,,,, It is crooked. Took me a bit to try again, wasted time, only to use a level I had to see that the provided mounted level is OFF! So I recommend you have an external level before trusting the framework included. Anyway, after all is said and it is done. I do like it, it was just frustrating until the issue was self discovered.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1648080000000}
{"reviewTitle":"Good Motion, Good Mount, Bad Install Instructions.","reviewDescription":"I used a different mount on a larger tv, but didn't care for the range of motion. It was pretty easy to install that one. This one was a pain in the rear to install on a 55\" TV.  You'd have to be very strong and a little lucky to mount this one alone. If you don't have help, maybe try a different type of mount.The problem is the way the back brace attached to the TV fits into the mount on the wall. It's a small circular whole, and the mount on the wall has a circular lip to place into the hole which holds the tv so you can put the bolts in.  Maybe if you have a lot of experience blindly putting large things in holes and can hold a larger tv up by yourself for a long time, you can do it... But the mount may move unless it's flush against the wall, but then you can't see where the circle is at all.  I had to get help so my TV laid on the floor for a while.The instructions are also very unclear.  I went through them several times.  Even with reading glasses I had a lot of WTF is that garbled number thingy.  I eventually gave up on the instructions and used logic to piece it together.It's a little awkward that if you want the TV flush to the wall, you don't install the bracket in the center of the tv.  Be prepared to measure a lot.to get the placement right (and hope you find a stud where the mount goes - thankfully, I did)  I wanted to be able to move the tv to the corner when viewing, and push back flush against the wall afterward. It definitely fits that purpose and the motion is smoother and easier than the other mount I installed (with easier installation on the other mount).In the end,the mount is sturdy and I have no fear it's coming off the wall anytime soon. Now that I've done it once, I'd buy the mount again should I ever need one, but if you need clear instructions, this isn't it.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1592784000000}
{"reviewTitle":"Good product","reviewDescription":"I like it hanging in there nice and sturdy no issues with it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Interesting install","reviewDescription":"So I bought two of these for dual monitors, I wanted a standing desk and my monitors on the wall. My monitors serve several purposes, I work from home and I also use them for my crafting projects, and just to watch\/stream tv when I'm in my office and not working. I needed my monitors to move, turn, and adjust. I purchased these because of the price point and because the reviews were solid compared to other versions. I've also been dabbling in Amazon basics and really like their products so far.To mount these I first mounted a piece of plywood to the wall, there was no way I was getting both mounts into a stud and still getting the range of motion I needed, plus having them side by side for work. The plywood was directly mounted into the studs, then I mounted the brackets to the plywood. It's been up for several months and I'm pleased with it so far.I have one issue, the holes to mount the monitors, while plentiful, only mounted my monitors slightly high on these mounts, so I can see the bottom of the square the monitors mounted on. There was no way around this, I tried every way to get them mounted lower, but they were the only holes that lined up. As a result, and because I wasn't prepared for it from the get go, my monitors around about four to five inches higher than I had intended them being. I can move the brackets down if it bothers me, but I don't want to deal with it again, I just wish I had known to look out for it prior to mounting, so I could have redone my measurements. I would still purchase these again if given a chance and I do like them otherwise.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1577404800000}
{"reviewTitle":"Used in my water bottle","reviewDescription":"Tasty","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Worked great!","reviewDescription":"I got this product to mount my 32\" Samsung TV above my computer monitors to act as a 3rd monitor\/tv for my game room. The installation was easy and it works great as intended.My only issues with the product is the instructions could bit a little more clear, but I already have experience with TV mounts so I was able to get through it easily. And my other issue is that I wish the part that mounts to the wall had screw setting holes that slide down onto the screw and keep the mount in place while you tightened like some other mounts have. Would have made mounting on the wall solo much easier.Still a great cheap product. 4 out of 5 stars!","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1686614400000}
{"reviewTitle":"Nice quality","reviewDescription":"Good quality and motions.  But won't fit all tvs. Had to adapt it to work on our LG tvs","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Instructions weren't amazing","reviewDescription":"but the install is pretty easy after you figure out the hardware","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Excellent but has some drawbacks","reviewDescription":"I really, really like this unit.  Compared to others, its a beast on steroids.  Rock solid stable, with far more range of motion than I expected.  But it does have some drawbacks.  First, I would suggest installation be done either by two people, or one very strong, highly coordinated person.  I say that because lifting and placing the TV onto the mount's TV support rails is real tough.  I ended up having to tape the arms together so they would not move out of position.  The main drawback, though, is the method they use for mounting the TV.  It has these wide rails that extend 18-20 inches side to side.  Its a good idea since it lets you further adjust the side to side placement.  Plus you can adjust the height of the TV by attaching the brackets higher or lower on the TV.  BUT, on my TV they pretty much obscure the place where you do most of your connections.  I ended up having to replace my perfectly good optical cable with one that has a right angle connector just to get an audio connection.  That is the good news...….I cant even get to some of the other connections for legacy peripherals with old tech outputs.  That forced me to buy a Component to HDMI converter for about $30 to hook up an ancient DVD player.  Yeah, I could have purchased a new blue ray player, but at 2X-4X the cost of the converter.  But who buys discs these days with streaming so easy and inexpensive?  I think that if they had an option to somehow reduce the length of the rails, but I doubt anything I say will have any bearing on how they design, or re-design their product.  Just be aware that there is an issue you need to be aware of if you purchase this otherwise excellent product.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1591747200000}
{"reviewTitle":"Good design","reviewDescription":"We are happy with this product! It is easy to install and worth the money. We like that we can turn the tv in different directions.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Fit well","reviewDescription":"Easy to install","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Missing parts and wrong size.","reviewDescription":"Missing parts and won’t fit the television. By the time I got around to opening this thing it was too late to return. Still no excuse for not having all the parts.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Cheap pot metal bolts caused $1000's in damage, Amazon CS is worthless.","reviewDescription":"The mounting screws for this unit are undersized cheap garbage and sheered off in the wall, yes we drilled a 5\/32 pilot. The problem is we were putting it into a very expensive ship oap fireplace. When it sheared it twisted causing damage to the ship lap.  To fix it we now have to have the fire place mantel and surround removed, all the trim, crown molding and fireplace tile replaced, then the shiplap from top to bottom replaced because of color match. This will easily approach $2000 because Amazon cheaper out with a $0.06 cent garbage potmetal bolt instead of $0.25 bolts.What's worth is all I got from Amazon was, sorry, please return the product to the store. Not even the slightest bit of how can we make this better, or keep the mount and go buy your own bolts but here is a refund. He'll give a customer some credit for something or offer to send someone to do the repair your garbage product cost.The last picture is the bolts from my Omni mount ... Those are real bolts, bolts you can trust to hold a TV and not snap of in your wall.","isVerified":true,"ratingScore":1,"reviewReaction":"116 people found this helpful","country":"United States","date":1574121600000}
{"reviewTitle":"Not compatible with 43\" Fire TV","reviewDescription":"This problem exists with most mounts so I was hoping an Amazon mount would be compatible with a Fire TV, but it isn't. The arms that are required to fit the Fire TV holes (300mm L and W) end up sticking out the bottom of the TV and are visible if mounting this way. I will be keeping the mount and just cutting the arms to make it work but that's a ridiculous step I need to take.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"None if the screws provided fit","reviewDescription":"I have a 32 in ONN TV to mount in my kitchen. None of the screws provided fit. Only 1 spacer size was provided. It doesn't fit. It will have to be returned. I think its better to just go with the same brand as the TV for the wall mount.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Disappointed, its very loose","reviewDescription":"Used this to hang a 42\" TV, it is barely stable bit I feel I'm stuck with it since it's already installed. I would really look at the TV your using vs the sizing holes of this mount.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"Does not fit LG","reviewDescription":"I’m sure this is a good product and it looks like it’s a universal fit except with the LG TVs. I wish what was mentioned in the description.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"Horrible instructions and confusing parts.","reviewDescription":"I've mounted a few TVs to the wall before, but this was my first time using Amazon Basic mount.  It came with the worse instruction manual.  Hard to understand drawing with no text instructions to follow through.  It was like playing Pictionary, trying to figure out what the instructions are trying to tell me.  On top of that, the smaller washers did not fit the smaller screws.  I finally got it mounted, but it was the most frustrating process and spent much longer than anticipated.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Parts are substandard","reviewDescription":"The metal used to manufacture the screws and included tools are made of very soft metals.  This results in stripping of the screws.In addition, the measurements used on the hex bolts do not correspond to the metric system or imperial.  I was unable to use any ratchet heads to fit what was included.I ended up having to go to Home Depot and purchase all of the mounting screws and bolts to actually make this work.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Most frustrating experience hanging a tv I’ve ever had","reviewDescription":"I’ve hung 100+ tv’s. This was the absolute worst experience I’ve ever had. I wouldn’t wish this on my worst enemy. I’m seriously so mad right now.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Only 3 ft long","reviewDescription":"Too short","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Used product with missing items","reviewDescription":"My mount was clearly a returned product that was just resold to me. Mount is dirty and scratched up, instructions are torn and several items are missing from the delivery content list. Don’t buy this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Not worth the money. Look elsewhere.","reviewDescription":"This mount fit my 46\" Phillips plasma TV, but this TV is heavy at around 60 lbs. That meant I had to make sure that I mounted it into wall studs. Although the product pictures show the mounting bracket with full width mounting holes, mine only had holes on the ends, not spaced enough to allow hitting two studs that would allow me to keep centered on the wall. So, since I'm going to replace this TV with a larger one, I decided to use it anyway with this TV slightly off center on the wall. Beware of the stud positions before you decide to buy this thing.The built in level is nice and makes marking holes easy.Like other reviews have stated, the tilt friction knobs are totally useless. No matter how hard I tightened them, the TV flops down to the maximum tilt position. The only way I can get the TV to stay in a more level position is to put a block of wood behind it.I do NOT recommend this mount. There are better ones out there at good prices.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1592438400000}
{"reviewTitle":"Hardware and mollys are cheap","reviewDescription":"Mollys are cheap and bolts sent with would be fine for stud install but screw seemed to blow out back of Molly for drywall install and screw just kept spinning. I’ve installed plenty of tv mount and hang with Molly use very often. Bought different Mollys to complete job.There are better options and easier to install options with better hardware on Amazon.  Keep shopping!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700524800000}
{"reviewTitle":"Not universal","reviewDescription":"Tried to use for mounting a standard 55 in lg tv. Bracket does not line up do yourself a favor and buy a model specific mount","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"Spend more money","reviewDescription":"The TV hasn't yet fallen off the wall. That's pretty much all I have that's good.There were obvious quality issues upon opening. There was a loose locknut on the pivot of one of the tilt mechanisms. Those mechanisms themselves are pretty junky - impossible to adjust the friction once the tv is on the wall, but that doesn't matter because it's pretty much either \"won't budge\" or \"flops down\".By far the biggest issue is a misalignment of the attachment arms that results in an unlevel TV.  As the attached pictures show, the wall plate is perfectly level, but the TV is askew.  That's totally down to slop in the brackets themselves.  I think I can jury rig a shim to take out the slop, but it's a total failure on one of the most important functions of a TV mount.Spend the money on a better option, you're going to wish you had.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1640390400000}
{"reviewTitle":"Missing mounting screws\/bolts","reviewDescription":"Got the product .. package did not have the screws to hang included. Didn’t realize until threw away packaging etc. Disappointed cost about a extra $20 out of pocket to get rest of hanging things needed for proper hanging","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Too complicated to install","reviewDescription":"The instructions are confusing. It says there are install videos, but they're actually aren't. What a pain.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Beware: Terrible hardware.","reviewDescription":"The mount is ok I guess, but the tv is a bit wobbly and more importantly the included hardware is absolute hot garbage. Two of the included screws to attach the mount to the tv broke when snugging them, requiring me to drill them out of the tv, which chewed the threads of the insert and required then to be tapped. Turned into a frustrating hour long project. Never again, Amazon Basics. Spend the extra $5 for a real brand.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"Worst purchase","reviewDescription":"Honestly, I hate to leave bad reviews but this was the horrible purchase probably the worst purchase I’ve ever made on Amazon in the last 11 years. Nothing is right at all and doesn’t feel secure once the TV is connected. I will never purchase this again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Doesn't fit","reviewDescription":"I am not trashing on the bracket.  It seems good quality.  The fault was with amazon who recommended this wall mount bracket for my tv and it doesn't fit.  Not even close.  This bracket does NOT fit the tcl 55r635 tv.  Neither does the other one amazon recommended for a 55\" tcl, an Elived.  I have now purchased 2 wall mount brackets that amazon recommended for my tv and neither one fit.  If you purchase this model tv, do not expect amazon to suggest the right wall mount.  If anyone knows of the right bracket to wall mount the tcl 55r635, i would appreciate your input.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1663718400000}
{"reviewTitle":"Easy","reviewDescription":"Super easy install. Has a level and template for the wall. Many different options to attach to your TV. Articulation is solid and easy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Easy install and great mount","reviewDescription":"Got this mount for my daughter's 55\" TV and it looks great in their room.  This is my second one of these mounts and if I need anther one, I wouldn't hesitate to get this one.  It had all of the included hardware (which some brands don't always include), a template if you need it to hang on the wall, good instructions and outstanding range of motion.  Don't pass this one up.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"I Installed It Myself","reviewDescription":"I'm a 70 year old woman and I purchased this in order to get the large flatscreen TV off the dresser and higher on the wall. It sat on the floor in the bedroom for about 6 months while I waited for my boyfriend to install it.  Finally, when he was on a trip out of state, I decided to install it myself.I unpacked it, checked the box contents, measured and marked the wall as per the instructions, drilled holes and put the whole thing together. I had never done anything like this before, but the job went perfectly. The hardest part was lifting the big screen TV up high enough to hook it on the support bracket and even that was achieved without too much fuss. (And I didn't drop the TV even once.)When he returned from his trip, my boyfriend wanted to know who installed the bracket and hung the TV because he had bought another bracket for the TV upstairs. When I told him I did, he didn't believe me.The following week he went to the flea market for the day and when he returned, I had the second bracket installed upstairs and just needed help to lift the heavier TV onto the bracket.I guess it's never too late for an old lady to learn new tricks!","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1715212800000}
{"reviewTitle":"Exactly as pictured","reviewDescription":"Product worked great for us.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Just what we needed","reviewDescription":"Added tv to our back screened in porch this summer. This mount was easy to install. It’s moves easily and gives us great versatility in where we sit to watch tv. Size is perfect for our 32 in tv.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Love It","reviewDescription":"it's the best","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Good","reviewDescription":"Love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Impressive Design","reviewDescription":"Third mount for me and the best. The design is great. Mount goes on the wall, piece goes on TV back and you simply hang the TV onto the mount then secure with two screws. Ingenious those Chinese.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Great product","reviewDescription":"Works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Quality Product","reviewDescription":"While this is a very quality product, the mounting plate did not match the holes in the back of the TV. The \"X\" design prevented mounting.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Easy","reviewDescription":"Installed quickly and does the job.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"tv wall mount","reviewDescription":"very easy to install and mount on the wall. had a ton of screws and spacers to make it easy to install.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Easy to install and sturdy","reviewDescription":"Amazon Basics does a great job with their TV mounts, and this one is no exception. Easy to mount, and excellent range of motion. Extends and folds back in place easily. The only thing I would improve on would be if it could extend just a little longer out from the wall. At the high end of the TV width range it doesn't quite turn all the way to the left or right when extended, though that's a minor inconvenience.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"This thing is tough","reviewDescription":"It’s mounted on a concrete wall and has held up a 55” with ease. Pretty easy to mount and put together and really strong screws. Great value for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Good purchase","reviewDescription":"Easy to install, has been up over a year and still holding.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Very nice and heavy duty mount offering great tilt ranges but 1 problem...","reviewDescription":"This is a very strong, yet inexpensive TV mount that comes with everything and more you could need to mount most any TV.  However, the bubble level built into the mount was off a bit so don't trust it.  Before I drilled my holes for the lag bolts I double checked the levelness of the bracket with my contractor's level and also a smart phone level app and they both confirmed the built-in level was off a bit.  Now, many people may not notice it but I would.  I mounted a 55\" TV and decided to only use 2 of the 4 included massive lag bolts.  There is just no need to drill 4 holes in a wall and sink 4 lag bolts for a 55\" TV but if you are up in the 70\"-80\" range maybe?  Anyway, having the expanded tilt range allows a TV to be mounted higher and still properly pointing at you.  I put this one in a spare bedroom so with one's head on a pillow in the bed the TV is still aimed directly at guests.  Anyway, a great value for the price and the fact that the mount is one piece and wide means you can tap 2 studs that may not be centered where you want the TV to be and still get the TV perfectly centered for your room along the mount.  Yes, this is a 2-person job no doubt and it takes some time... as they say, measure 2 or 3 or 10 times and then drill once so everything ends up just where you want it.  Adding 1 more hint... If you are going to mount a TV higher like I did and you need to angle it down more you want to attach the 2 brackets to the back of the TV so they are as low as possible so the bottom of the TV doesn't hit the wall when tilted down.  So, when you are putting the 2 brackets on the back of the TV you want the top holes on those 2 brackets screwed into the 2 top holes on the TV.  Then adjust put the other 2 screws into the lower holes on each side.  I did this first so I could then measure and know where to place the permanent mount on the wall that requires drilling and sinking those lag bolts into 2 studs.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"Excellent product!","reviewDescription":"So easy, a girl can do it!! I wanted to mount my TV on my wall so I bought this to get the project done. I just needed a few basic tools to get it done and found the instructions easy to follow and installation was overall easy! So glad I took a chance and ordered it as I love the finish product....and, it was SO easy and the price was so great, I bought a second one for another room!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Worked!","reviewDescription":"Used this mount to hang a very tricky corner TV at my rental. It was easy to install, super durable, moves around well, fit in the space well & Was good value for the money","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Tv stand","reviewDescription":"Works great and has a lot of options for different tasks. Pretty easy to assemble and looks nice. Adjusts well and is perfect for what we needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Totally happy!","reviewDescription":"Every now and then you find a product that exceeds your expectations. This is a strong, well built TV wall mount excellently designed with a huge range of motion.My only \"complaint\" is that the installation instructions are only in picture form and cover a ton of different mounting options. Once I understood which ones applied to my situation, installation was quick and easy.If you need a good stud finder, I ended up buying the Franklin Sensors ProSensor 710+ Stud Finder with 13-Sensors. Kind of pricey, but the two other stud finders I already owned were terrible. Franklin also has a 9 sensor version that costs less and has good reviews.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"Spray painting pains","reviewDescription":"Come on Amazon Basics. Do some people not have white walls?  Spray painting this was cumbersome.I just wish I would have made sure my TV fitted it.  If not I will sell it to some one who wants white.Spray painting pains.Update - neighbor installed for me without looking at instructions. If you have someone to install it properly, it will be mounted solid!  Excellent durability.If your installation is wobbly- then it was installed incorrectly - dont blame it on the product.Pros:Looks as if it is floating in the air. Love that.Very solid mounting as long as it is installed properly.Don’t have to use reading glasses anymore in order to see words on the screen.Cons:I do like the range, but I wish it would be kept fully extended out when turning it left or right.Otherwise when you turn it after it is max extended out, it will go back near the wall.Also a tilt up\/down feature would be helpful for certain viewing.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1598313600000}
{"reviewTitle":"Don't try this at home","reviewDescription":"As a building and electrical contractor I was able to figure this out pretty easily. because I have high mechanical aptitude and 60 years of experience. The average person would be overwhelmed by the sheer number of small parts (I used 8 out of 60) and instructions that are not only contradictory but missing any description of the installation process. The arm hinges in 3 spots but the middle spot is really stiff. The arm does allow my little 29\" TV to turn 90 degrees which was the one feature I was looking for.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1661817600000}
{"reviewTitle":"You will never get it perfecly level.","reviewDescription":"There is just enough play in the mating mechanism to ensure no matter how many times you use a level or just say eff it and jog the wall piece back and forth, the panel will rock slightly to the right or left once it latches in. Not majorly but if is it's near anything that is plumb you will kind of notice. Not easy to install given you cant make any adjustments without removing the panel again and again and again and not sturdy as the 2 components don't mate smoothly.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1663286400000}
{"reviewTitle":"Some parts missing","reviewDescription":"The TS screws, M6 x 50 and U8 were missing from the package.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690502400000}
{"reviewTitle":"Cheap materials \/ seems like an okay mount.","reviewDescription":"I have just installed this product. I didn’t not read through all the reviews. Just a few. And my issue seems to be isolated. When tightening The last lag bolt into the wall the head snapped right off. So there’s two good bolts. And the third is useless.The installation process was very simple.  Someone mentioned there were only two methods to install the bracket and both were very difficult. Well there’s a third.  The third is to take off the 2 security screws on the back of the mount. And the tv mount plate lifts right off. Then you need two people to place the tv back onto the little lip once everything is secured to its respectable place.  The tv holds itself up like that.  Then the security screws keep it there.All and all. It seems okay. But the parts just seem to be on the cheaper side. If I ever bought again. I would go to the hardware store and buy better bolts to secure it to the stud. But for this price. That is still a better option than the $100+ mounts.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1550534400000}
{"reviewTitle":"Very poor instructions","reviewDescription":"Very poor in instructions, had to redo some parts as the photos on the instructions didn't show which side was correct. Over all product is sturdy, does what I want it to do, but was a pain to install!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683244800000}
{"reviewTitle":"labeling and instructions could be better.","reviewDescription":"I installed on a 6x6 open post.  Finding the center of a 1 1\/2\" stud that's hidden behind sheet rock and using these big lag bolts would be hit and miss.The directions and especially the labeling are lacking.  A few more words or bigger pictures would have helped to know what bolt goes where and it would be nice if they told you the actual sizes of the bolts so people aren't left to guess which one will fit their TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658880000000}
{"reviewTitle":"It's basic and works","reviewDescription":"But I would not trust it on a pricey TV.I would not buy again. But it does work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"Doing its job, but wished I had bought something different.","reviewDescription":"Serves a purpose and for the price, not bad but if I was going to do it again, I'd buy one that isn't fixed against the wall and had a better way to adjust it. On the upside, it came with a bunch of neatly packaged hardware, so you're bound to find what you need to mount a TV or Monitor. Don't plan on getting your arms in behind it once mounted, because its so close to the wall, you're going to either have to hook up cables beforehand, or have a partner hold the TV while you mess with it. Its definitely a 2 person job to hang the TV, and the only way to adjust the tilt is when the TV is pulled off the rail that mounts to the wall. Also, don't over tighten the bolts because it is fairly flimsy and bends to whatever shape your drywall is, making it nearly impossible to hook the TV onto the rail, and forget about trying to level it. Also the little level that's built into the wall mount is way off, so measure or use a legitimate level when installing it.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1558051200000}
{"reviewTitle":"Instructions?","reviewDescription":"Worst installation instructions imaginable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"GET DIFFERENT SCREWS.","reviewDescription":"We have had this tv mount since the beginning of June. It is now beginning of October and I came home from work with my tv on the ground and a hole in my wall. Mount was fine and still attached to the tv, tv thankfully landed on a soft surface and seems okay, but now there’s a big hole in my bedroom wall. Quite unhappy with the damage done to my home from due to Amazon cheaping out on screws.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"Got it “New” but had clearly been used","reviewDescription":"I order this for outdoors so I’ll keep it but wish I had been charged for what I was given. The mount was bent, level was broken. Bolts were cut out of packaging and taped together. Not to mention the whole box was tapped back together from getting ripped apart. Again it functions and is fine, I just wish I had gotten the discount for what was received.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"All my audio video plugs are concealed.","reviewDescription":"I like its usefulness but I realized after I mounted it I can't plug into the jacks.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Does it's job well but the installation was a pain.","reviewDescription":"The screws to hold the rack seem to be made of cheap metal(s). They're pretty thick but a regular drill bit should not have chewed away at the screw head as easily as it did with these. It's extremely frustrating when you have to resort to options to get the screws all the way in or even pull them out as a result. I also don't know what everyone is talking about regarding the instructions. They're your typical horribly laid out steps with nothing but pictures.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Not level level bubble, no verticals slits","reviewDescription":"Built in level bulb shows frame level, it isn’t, use your own level.Nice heavy duty material.All the mounting bracket slots are horizontal $&@!? It’d be a ton easier to adjust for level if some were verticle","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Did not support 55\" TV","reviewDescription":"I installed this for my Mom in her bedroom and had a 55\" TV.  The mount was not strong enough to support the TV when I tried to position it in the middle.  The weight of the TV would force it to move left or right.It would work fine on smaller TV's","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Was so close to having it done...","reviewDescription":"Overall, the mount itself is good. The problem I ran into was the lag bolts. I had 2 of the 3 lag bolts tightened down, but as I was tightening down the last lag bolt, the lag bolt just snapped in half. Luckily, it broke somewhere behind the drywall in the stud, so I was just left with a hole in the wall and a broken off lag bolt somewhere in a stud. I shifted the bracket to a different vertical position on the same stud to hide the holes and started over. I had to back out the other 2 lag bolts, run to the store and grab a new lag bolt (I was able to use a 1\/4\" lag bolt to replace the broken one that came with the mount), and then finish the installation. Once installed, the mount itself is great.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1670198400000}
{"reviewTitle":"hard to install","reviewDescription":"different than was expecting, wasnt easy to put together the range isnt that great but does the job","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Works fine nothing special","reviewDescription":"I wasn't looking for anything special it works fine looks good my biggest issue was the selection of blots for the tv didn't have the size (m6 I believe) that fit the back of my tv.... it had them but they were too short....I had to run to home depot and pick up bolts that fit...thats my only problem is it doesn't have a wide variety of hardware to fit certain tvs.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Trash","reviewDescription":"I am disappointed, Useless directions utterly useless","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705363200000}
