{"reviewTitle":"Power Up Safely and Conveniently with QINLIANF Wall Charger Surge Protector","reviewDescription":"Experience enhanced power convenience and protection with the QINLIANF 5 Outlet Extender equipped with 4 USB Charging Ports. This versatile surge protector is designed to meet your power needs while keeping your devices safe from unexpected electrical surges. With its combination of outlets and USB ports, it's the perfect solution for home, office, or travel use. Here's why the QINLIANF Wall Charger Surge Protector is an essential addition to your power setup:Expanded Power Outlets and USB Ports (5\/5):Enjoy the convenience of five AC outlets and four USB charging ports with the QINLIANF Wall Charger Surge Protector. Whether you need to power multiple electronic devices or charge your smartphones, tablets, and other USB-powered gadgets, this extender provides ample options for all your power needs in one compact unit.Surge Protection for Peace of Mind (5\/5):Protect your valuable electronics from damaging power surges with the built-in surge protection of the QINLIANF Wall Charger Surge Protector. Designed to safeguard your devices against voltage spikes and fluctuations, this surge protector provides peace of mind, ensuring that your electronics stay safe and functional.Space-Saving Design (5\/5):Maximize your available wall outlet space with the compact and space-saving design of the QINLIANF Wall Charger Surge Protector. Its sleek and low-profile design fits flush against the wall, making it ideal for use in tight spaces, behind furniture, or in areas with limited outlet access.Fast and Efficient Charging (5\/5):Charge your devices quickly and efficiently with the high-speed USB charging ports of the QINLIANF Wall Charger Surge Protector. Equipped with smart charging technology, these ports automatically detect your device's power requirements and deliver optimal charging speeds for maximum efficiency.Versatile Power Solution (5\/5):Experience versatile power solutions for home, office, or travel use with the QINLIANF Wall Charger Surge Protector. Whether you're charging your smartphones, tablets, laptops, or powering your electronic appliances, this extender offers the flexibility and convenience you need to stay connected and productive.Conclusion: Stay Powered and Protected with QINLIANF Wall Charger Surge ProtectorIn conclusion, the QINLIANF Wall Charger Surge Protector is the ultimate solution for expanding your power options while ensuring the safety of your devices. With its multiple outlets, USB charging ports, surge protection, space-saving design, and fast charging capabilities, it's the perfect accessory for any home, office, or travel setup. Stay powered, connected, and protected with the QINLIANF Wall Charger Surge Protector.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"GREAT Surge Protection, USB ports, outlet spacing and price! Standard (not fast speed) USB C charge","reviewDescription":"So, this surge protector and power strip has a lot of protection when it comes to surge protection!  At the top end of what you will find for general electronics, this one has 1680 joules of protection before it gets fried to save everything thats plugged into it. If you have any high end gaming computers, REALLY expensive electronics, you would purchase an expensive\/entire next level surge protector having over 2000 (2K) joules of protection.  So this surge protector packs a punch for all regular electronics, regular computer equipment.The lit up center green button shows that the surge protection is still working and has not been fried by a lightening hit or something. If it does one day get fried, this whole unit will still work as a power strip but would no longer provide the surge protection for the devices plugged into it.I mounted this charger and plugged in some \"hard to plug in\" electrical cords and this thing held sturdy!  I was impressed at how sturdy it was when I had to really give an extra push or pull to some of my plugs going into or pulling out of it.Each of the three USB A (same as saying USB) port is 12 Watts. This matches the highest capacity of most USB A cords, so this is good. It also is great that EACH USB A port has this capacity, so plugging in multiple devices into these ports will not create a slow down on the others, which is great!The one USB C port is 15 Watts but not a fast charging port.  So it may take 56 minutes to charge the same as what a fast charger would take 34 minutes, as an accurate example. I am fine with that.. But good to be aware that this will not charge as fast as a \"fast charger\" if you have one of those elsewhere in the house.  And if you do, you could always plug that fast charger into one of the traditional outlets on this power strip and achieve your fast charging effect that way!The traditional electrical ports are well spaced and VERY handy.The price is GREAT!  A GREAT bargain!This purchase is an excellent one!","isVerified":true,"ratingScore":5,"reviewReaction":"30 people found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"Great update to home wiring","reviewDescription":"This was an easy way to upgrade the outlets in our home without having to replace the receptacle.  Not only does it allow us to plug in our USB devices but gives us more outlets for lamps, TV, media devices, etc.  Very handy and seem to provide adequate USB power.  Does not provide the high amp charging many cell phones have today but works well with my wireless phone charger.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"Convenient","reviewDescription":"Makes a very convenient charging station for my night stand. I am able to plug in my phone watch and ear buds and have a lamp with ports to spare. Very nice profile fits behind nightstand and still easy to plug and unplug things. The center screw keeps it secure and works great.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"This was exactly what I needed for my myriad of devices.","reviewDescription":"I got 2.  One for the kitchen and one for the bedroom.  I love the fact that it has multiple places to plug in my lamp, etc.as well as multiple USB slots for all my devices.  This is very handy, works great and was a great value.  I got them on sale which was a definite bonus!  I will likely buy more.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Great on our Kitchen Island!","reviewDescription":"When we built a kitchen island in our home, I begged for an outlet there and after much hemming and hawing, we finally got one!  As any modern homeowner can tell you though, one outlet is not enough for a kitchen island.  In looking at the outlet extender options out there, this one is relatively attractive in comparison, very inexpensive, and adds so much functionality to a frequently used part of our home.  I've had for a few weeks now and all the ports work great and we are using a lot of these plugs!  Install was literally plug and play (we didn't screw it in).  I would gladly recommend this to a friend or family member.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"All in one charger","reviewDescription":"This wall charger is multifaced and resourceful product. I am using it at my kitchen and around the enterainment center.It is functionaing well and I can charge mulitple devices through one outlet. This product is very easy to install and works great.Through device I can organize the wires at one location and avoid the mess.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1710547200000}
{"reviewTitle":"Great Design!  Just note that USB-C does not have fast charge capability","reviewDescription":"I have been looking for a charger like this for a long time.  One that doesn't crowd the plug-in ports because so many plugs today have the big head, or the cord that hangs down so it's impossible to use it on a strip without losing 1 or 2 neighboring outlet ports.  That crowding also makes it difficult to use the USB ports when they are located in the middle between 2 other plug-ins.  This is well thought out in that respect. Also with an indented back to allow it to sit flush against the wall even if you don't remove the face plate on existing socket.  I didn't think about the USB-C wattage required to properly charge my iPhone, but that was my own ignorance as it is mentioned in the details.  I have a work around for that though, so not a big deal, just thought I should mention in case someone else is ignorant as I was!  ;-).  Nice that it comes in either black or white, I got one of each and when my husband saw them he proclaimed that he needed a couple as well!  Happy.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1711843200000}
{"reviewTitle":"Multi tasking plug","reviewDescription":"I bought two of these plugs for the bedroom night stands. We have our lights, alarm clocks, phone chargers and watch chargers all plugged into one place. No extension cords needed. I don't think I would use these for multiple high load appliances, like microwaves and hair dryers, but I think they do a good job for what I am using them for. The housing seems to be well made and the plugs are solid and the plugs are not loose. I think future models will probably need more of the USB-C outlets, as that seems to be the new standard. Fortunately, I haven't had to test the surge protection, but hope that it works as advertised. I'm happy with them so far, and would purchase more if I needed them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"This wall is nice to have.","reviewDescription":"The outlet has been a game changer for me, as it has helped to declutter my space and make charging my devices much more efficient. While I wish it charged my phone a bit faster, I can't deny that it has served its purpose well.I would highly recommend this wall outlet to anyone looking for a convenient and practical solution for charging their devices. Despite its slightly slow charging speed, the benefits of having built-in USB connectors far outweigh this minor inconvenience. Overall, I am very satisfied with my purchase and would definitely recommend it to others.No issues here in regards to anything catching on fire either. I have a gaming PC and 2 monitors along with a router and gaming mouse charging station on outlet.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"Love the screw in feature!","reviewDescription":"I am happy with this purchase.  I had an outlet extender prior to this one that would not stay in the wall due to all of the plugs.  This on screws right into the outlet so my computer stays on without glitching.  This has been a game changer in my office.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Returned the product","reviewDescription":"I only returned the product because it will not work in my square outlets. It is only compatible with the more round outlets with the screw in the middle. Although the seller showed the square outlets next to the round outlets and indicated the gap needed between the two, it DOES NOT WORK in the rectangle outlet because there is not screw in the middle of the outlet to put the screw into. Although it mentions not working with GFCI outlets, what they meant was any outlet shaped that way. They took it back with no problems.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"It's works well","reviewDescription":"It clearly says not to use the outlets for a high draw space heater which is a good thing. I use it in the bedroom for light clock, charge my phone with inductive charge pad etc.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Just started using.","reviewDescription":"Not much of a test with only two days use!  So far, all outlets and usb ports work perfect.  It is plugged in on a double GFCI double outlet, so as the instructions stated, I cut off the lower plastic post so I could seat the unit fully into my wall outlets.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Perfect Fit","reviewDescription":"Installed two of these in the house. One in a teens bedroom and one in the kitchen where everyone who visits tends to charge their phones. I like that you can screw it in. I have 2 more in my cart since they are still on sale (998). I would definitely by the black one if it were on sale. Hope they last.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Work great. No problem.","reviewDescription":"Pros: easy to install, with only two screw and it is secure, used on basement-Love the multiple plug- like the usb, i used it all the time- Good for my investment|Cons: none","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"You need this","reviewDescription":"I got this on a flash deal for 9 bucks and it extremely handy. I can charge everything that I need to in one spot instead of taking up multiple outlets and cords everywhere. Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Easy to use, install, no cords, easy to hook up 110 volt cords to it; no crowding.","reviewDescription":"It has more than enough usb and 110 volt outlets. No 110 volt cord to mess with.  It quickly mounts sturdily if it is only for a temporary location. I like the center screw that very securely mounts the unit to the existing wall outlet. Has a small green light to let you know it is on & surge protector is working. For traveling I would get a smaller model. Has an 1875 watt max use. But the instructions are clear; especially warning you NOT TO HOOK UP a continuous 1000 Plus watt appliance. (eg: space heaters). Instead hook 1000+ directly to outlet. You risk melting most extension devices or cords, even heavy duty ones.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"Take your outlets to the next level.","reviewDescription":"Love these things. I love that it screws in so it won’t fall off. I love how many different types of cables it will take. Perfect for a highly used outlet in your home!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Very convenient and sturdy","reviewDescription":"I love the 45 degree plugs, it helps to utilize all plugs without having any covered by power blocks.  The USB ports seem to charge quickly as well.  10\/10 would buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Surge Protection, basic low-powered 5v USC charging, and 5 outlets spaced out well.","reviewDescription":"This is the third \"Surge Protector and Outlets\" brick over outlet product I've purchased.  This one is ok and fit my application. Seems well built, anchors well to the socket with the included screw, and the threading is a US standard 6-32 threading.Similar units I had in the past had a recessed screw which required a precision screwdriver to fit in the hole... this unit doesn't have that problem... the screw is long and it doesn't recess deep at all.  Very quick and easy installation.Pros:- 5 AC outlets with surge protector- some low-power 5v outlets- 6-32 threaded anchor screw... which doesn't recess into a deep holeCons:- Nightlight \/ Power LED would be nice.- Top of the unit is SLANTED and can NOT be used as a shelf (ie for when charging your phone).  There are better units if you want a LED or even a light-sensing nightlight... or even a shelf for holding a gadget while charging with the USB units.  Also, the charging isn't a Power Delivery 3.0 or 3.1 protocol.  You won't get anything but 5v out of these ports... they're only good for small low-powered devices.  There are better options out there if you need a true PD 3.0 or 3.1 GaN charger.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"Works well, but didn't fit properly on a decor outlet","reviewDescription":"I got this Qinlianf HR-519D outlet device for my bedside night table, to allow me to plug in a light, clock and other device, as well as a cell phone, Fitbit and whatever may come in the future. I had a decor outlet in that location (see my photo to learn what a decor outlet is) and the Qinlianf HR-519D did not fit well over the decor outlet. I tried it both with the trim plate on the decor outlet, as well as the trim plate off. It did not fit well either way -- the blades on the back of the Qinlianf HR-519D did not insert fully into the decor receptacle. The first couple times I tried it, the Qinlianf HR-519D worked its way loose and the devices I had plugged into it lost power.To make the Qinlianf HR-519D work reliably, I had to replace the decor outlet with a standard outlet. That way, I could use the long screw that comes with the Qinlianf HR-519D to hold it into the outlet firmly. Now that there is no possibility of the Qinlianf HR-519D pulling out of the socket, it works really well. I like having all the standard AC sockets, as well as the USB ports.I got the Qinlianf HR-519D for a great price, and I like having the convenience of multiple AC receptacles and USB ports in a handy location. I have not had it in service very long, but it seems well built -- assuming it lasts, it is a good product.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"It's actually pretty awesome BUT...","reviewDescription":"So I do love it but it has one flaw. It's not very secure. It keeps falling out the wall but that's potentially a problem unique to certain people. It has a screw that will secure it but it's in the center so if your outlet is screwed in elsewhere it will definitely fall out.. a lot. So that's pretty much my only gripe. As long as you have a center screw 5 stars easy if not 4 or less depending how tolerate you are of it. It can be avoided by holding it in whenever you plug or unplug. It's annoying but manageable I guess.TLDR: If your outlet has a screw in the center get it. It's great. If not I don't recommend as it will fall out a lot.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"So far so good","reviewDescription":"After recognizing the necessity for a versatile wall charger capable of accommodating a variety of devices, ranging from lamps to phones, radios, computers, shredders, and even art sharpeners, I decided to test out this particular product.In my initial week of use, I've been pleasantly surprised to find that it has surpassed my expectations. Installation was a straightforward process, and I particularly appreciate its adaptability in accommodating both traditional plugs and USB charging cables.I wholeheartedly recommend this product based on my positive experience thus far in accommodating all the aforementioned mechanics.  Moreover, considering its affordable price point of just $10.60 inclusive of taxes, I find it to offer exceptional value for the functionality it provides.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Convenient Charging Hub for All Your Devices","reviewDescription":"The QINLIANF Wall Charger and Surge Protector has been a game-changer for my electronic charging needs. With 5 outlets and 4 USB charging ports, it's incredibly convenient, allowing me to charge multiple devices simultaneously. The design is sleek, and it fits well in any room without being an eyesore. My only nitpick is that the USB ports could charge a bit faster, but this is a minor issue compared to the overall functionality and protection it provides against power surges. A great buy for tech-savvy households.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"We love these","reviewDescription":"These are great so far. They easily plug in to any normal plug. Love how they offer 4 charging ports. I always had cords all over the counter for people to charge their phones. I also had different blocks plugged in. Became a hassle when we needed the plug for other things. My husband wanted me to order him some for the guest house he was building at the ranch. Think I may order a few more for our office. Great buy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"To me the extra plugging space was what I needed.","reviewDescription":"This item was bought for the bedroom which has only 2 outlets in it. I prefer to use it instead of a extinction cord because it plugs directly into the wall. I scored the item a 4 instead of 5 because I haven't tested the charging ports yet to see how they work.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Great addition to outlet","reviewDescription":"Very helpful to add to outlet and allow for more versatile use of our outlet. The only downsides are the larger size it takes up around the outlet area and the plastic grounding plug. Easy to break off the plastic grounding piece and easily fits into outlet without further issue.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Add USB ports to the sides, otherwise very nice product","reviewDescription":"I just bought this wall charger, outlet multiplier, and I think it's a nice product. But I do have one small gripe: add some USB ports to a side, not all the USB ports should be on the front. Found this to be nearly universal on these type products.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Wall charger, outlet extender","reviewDescription":"This item was easy to install and has all of the outlets I need to be able to charge my phone, my kindle and plug in 5 items at the same time.  I don't need all of them at one time but it is nice to have options.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Renter friendly!","reviewDescription":"We had replaced outlets on our kitchen island and bedsides with usb outlets in our house so I was pretty sad when we became renters because we can’t modify them. These were the perfect solution! Better, even, thanks to the extra outlets and the USB-C port. They fit pretty snugly without the screw but it does lock it in place really nice. Great way to upgrade your outlets without needing to replace it, especially for renters!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"Excellent device","reviewDescription":"This is a terrific product that does exactly what it says it is supposed to do. You simply plug it in and it gives you lots of options and room to plug other appliances and phone chargers, etc. into.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Perfect for our needs","reviewDescription":"Arrived quickly, easy to install, cleans up cord mess, unobtrusive, even my wife commented on how perfect they were. The USB charging points will be handy when the grandkids come with all their smart phones, tablets and the such.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Solves the previous tangle of cords","reviewDescription":"Bought 2,  1 for use in kitchen to charge laptops & phones & second 1 in bedroom to get rid of a mass of cords stretching out to an inconvenient electrical outlet.  Works great in both locations.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Great all-in-one adaptor","reviewDescription":"Prior to this, in an outlet we had plugged in multi-outlet adaptors, extension cords, phone chargers etc. - this does away with all of those, it provides more outlets and is so much neater. with fewer cords trailing around.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Great for camper","reviewDescription":"Harvey’s in campers are limited on their outlets. This allows to plug in more items without replacing the hardware already in your outlets. It fits in all of the outlets inconspicuously, and is very nice to look at.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Perfect for bathroom plug.","reviewDescription":"There’s never enough outlets in the bathroom for your hair and makeup accessories and with this you can listen to music and charge your phone and get ready at the same time. It’s a win win product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Very handy","reviewDescription":"I like this outlet because it has USB charging in addition to the 110 outlets.  The 3-dimentional layout of the 110 outlets allows larger plugs and charging units to fit, without the usual space limitations.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"As advertised :)","reviewDescription":"It’s clear that products like this are drop shipped there’s like 1000 different listings with this same photo. I had bought these same style but with all USB-C from another vendor and it was awful, literally wouldn’t stay in the outlet and would fall out of the outlet throughout the day\/night. I bought this was holding it would be better. It works great. Am currently using all of the outlets and it’s still snug in the outlet. I didn’t even need to screw it into the outlet plate. Wouldn’t say it’s anything fancy but for $9 it’s well worth it.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Very worthwhile purchase","reviewDescription":"I bought one of these to put over the outlet next to my bed, I've always just used a regular power strip\/surge protector that sits on my nightstand to charge all my devices, but my girlfriend has informed me that it was very ugly to have a power strip on a nightstand....well this product saved me from her judgment. It definitely does look much nicer than my previous setup, and still offers just as many outlets, more if you include the USB ports, as well as surge protection. Best of all, it's girlfriend decor approved. Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Handier than pockets on a shirt!","reviewDescription":"Simple to install. A good design. I don't know how I got along without one. All of my new devices fot the bathroom need a USB charger. This is great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"I've bought 4 so far.","reviewDescription":"First, I use them in areas of my old house that have limited outlets. If I use anything that draws a lot of amps, it's the only thing plugged in it besides a lamp or computer. These fit tight and the USB charge fast. Highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Love it","reviewDescription":"I bought several of these I had outlets with charger adapters hanging off of them and decided I needed a different outlet. And these worked great, I did have to take a small piece off the top of one of them to get it to fit under the molding","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Plan to buy more","reviewDescription":"This is an awesome product. The one i had kept falling out of the wall and really frustrated me. Bought this and i love it. Also love the usb ports built in!  You won’t be sorry you bought it!  I plan to buy more.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Very nice design","reviewDescription":"I have several different wall outlets which also feature USB ports. This unit with slanted sides I find more versatile in the space I need it because the slanted side outlets are easier to access than outlets in a square or rectangle unit. Although it is not necessary to use the center screw, I find that the screw gives added stability when unplugging an item. Note that you do need to pay attention to measurements given, as this design might not work everywhere.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Nicley designed multi outlet extender w USB charge ports","reviewDescription":"the outlet is perfect for all the different shapes and sizes of plugs we are tasked with \"plugging\" in. It has a crisp clean look and being able to plug in FIVE different plugs PLUS 4 USB is FABULOUS! the spacing of the outlets creates a clean orderly look.  good product so far!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Great wall plug.","reviewDescription":"This is very nice it has a screw that holes it in the wall not like the cheaper ones that fall out when you put heavy plugs in it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Great for vintage motor home","reviewDescription":"I used it to bring a vintage motor home's power outlets into the current decade.  One in the living area and one behind the entertainment system, and we can now plug in everything with no problem.  They're easy to install and they look great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"6 plug ins. 3 USB and I USBC! Awesome","reviewDescription":"Took 30 seconds to remove the face plate and put this on. It’s better than expected and has a lot more use for a communal spot in the kitchen.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Great replacement for a long surge protector","reviewDescription":"I was able to plug in my lamps, Show, and charging station as well as have USB ports for my iPad and my Kindle. Each of the power cords\/charging blocsk is a different size and having this unit accommodated all of them without an issue.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Wall Charger for Living Room","reviewDescription":"I like to sit in my reclining chair and talk on my cell. Power kept running out. Saw the charger and bought it.PERFECT SOLUTION! I can sit my chair and simply plug my phone in and it charges quickly! No  need to run and look for the charger. I got pink. So everyone knows it's mine.Real good value for the price. Now I want more for other rooms. Deb","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Just What I Needed!!","reviewDescription":"This outlet extender was just what I needed to eliminate the extension chord and phone charger mess that had taken over my end table.  Installation involved plugging the unit into an existing grounded electrical outlet.  What could be easier?  So, if you’re tired of wire rat’s nests taking over your domicile, give these a shot.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Essential for charging electronics","reviewDescription":"We upgraded to this model since more and more USB-C devices are becoming common in our household, but we still have numerous USB-A devices. So it’s a good transition. Charges quickly, depending on the device. Haven’t had any issues or complaints from household. We’ve charged an iPhone 15 Pro, Bose speaker, iPhone 11 on a Qi pad, and powered a baby monitor with no problem. Great value at this price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Sooo convenient!","reviewDescription":"This is convenient and easy to use. I like having one spot for all my charging cords and not having to plug in one at a time and then switch them out - or have items charging in every wall outlet in the house. I like being able to plug the cords directly into this. I can keep my lamp plugged in at the same time because I don't have a clunky adapter (or 2) plugged in. I even got one for my octogenarian mother so she could plug her charger cords directly into it and not have to keep finding the appropriate piece that plugs into the wall socket for each item she charges. I gifted a 3rd one to my daughter and SIL, who have 4 people charging things in their household. I haven't had any feedback from them, but I think it would be particularly useful for a multi-person household. I have not had any problems with it since I started using it a couple months ago.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"\"HOME\" USB charging !","reviewDescription":"Thomas Edison wanted home electricity to be low-voltage DC.  George Westinghouse thought high-voltage AC would be better.  AC won . . . initially, but NOW homes are using more and more DC \"battery\" (rechargeable) low voltage devices!  NEED to have \"charging\" and doing charging off a computer USB port is NOT particularly healthy or prudent for the computer power supply.  But with now having added https:\/\/amazon.com\/dp\/B0C9CSVSNY LED \"mag-clamp\" lights to several other \"rechargeable\" devices [several LED high-power flashlights, digital pocket camera] accumulating CORDS plus needing a BETTER charging place!  This QINLIANF 5 Outlet Extender with 4 USB Charging Ports makes any standard wall-outlet a charging-station yet maintains regular outlet for lamp or whatever.  HANDY (travel?  Hadn't figured--but little larger than \"diabetic finger puncture kit\/meter\" so should travel well if remember to yank from whatever its usual spot will become.  If remember also take needed charging cord(s) -- but MY devices are  mostly \"stay at home\" use {rural America-- no cell signal so no cell phone}","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Great product","reviewDescription":"I purchased these for a home built in the mid 90s, renovated mid 2014.  There was still not enough outlets in guest bedrooms & other locations throughout the home.  The product was purchased as a great sale item.  Good product, multiple electronic outlets.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Great !","reviewDescription":"I work at home and this is such a space saver so much better than the long bulky ones that sat on the floor . Also have one in the bedroom and recommend to my sister who bought a similar one just a little smaller","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"LOVE THIS WALL PLUG","reviewDescription":"I love having the extra receptacles with USB and C ports. It charges my phone quickly as well. You can’t go wrong with this wall plug if you’re tired of struggling to find charging blocks. Do yourself a favor and order it immediately.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Very well built.","reviewDescription":"I needed more outlets next to my desk, and without having to change a slightly worn out duplex outlet in that location, this attachment was perfect. The added bonus of USB & USB C was a no brainier for me. Note: my cat kept grabbing my charging cables, pulling the charging blocks out of the outlet. The multiple new ones are very tight, which is what I hoped for. The center screw keeps the unit firmly in place. Haven't had one plug pulled out since I installed it! 😁 Bad kitty!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Product is everything they advertised","reviewDescription":"Bought three of these to use in places where I needed outlets on the side plus USB charging ports and surge protection. So far it met my needs and I well pleased. If I need any more I would reorder these.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"It's perfect","reviewDescription":"This wall charger has enough plugs to make it easy for me to charge my phone while also being able to plug in my light, etc. Easy to install with enough plugs for my phone to charge while my light, etc. is plugged in. Yes, I would recommend this wall charger to anyone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Love this little wall outlet","reviewDescription":"Not only does it give me more sockets for standard plugs, it allows me to use the charging cords for a variety of wires.  This has really com in handy, and it's a reasonable price too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Needed for multiple electronics","reviewDescription":"My elderly father was unplugging one item to put in another so got this for him so he could have multiple plugs for his electronics while also giving you access to the plugs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Decent wall plug extension","reviewDescription":"This worked just as described no issues at all so far works great ..be sure u leave ur original wall plug plate on just remove the tiny middle screw that is holding it on remove it to make room for that long screw that the new adapter comes with cause it's the original wall plate that helps make the new adapter fit nice tight an sturdy fit if not u will not fit nice an tight it will be wobbly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Clean space with lots of plug-ins","reviewDescription":"Have one in multiple rooms and the floor is much cleaner without a charging strip on the ground. It also saves me from needing AC plugs for all my USB charging devices.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Good product","reviewDescription":"Like how it screws in to the hole on the out let. Will not come out. It fits perfectly over a standard face plate. Will not sit flush with an oversized faceplate.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Wall charger for multiple devices","reviewDescription":"Only bought this because it was half off and was useful in the kitchen to charge multiple devices. Installs fast if you can do a little house wiring. Seems to work fine.  Stays green to signal everything works. Also be careful you don't overload more than 15 amps just because it has 5 outlets.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Excellent for convenience","reviewDescription":"Allows us to charge health watches, laptops, lamps, vacuum cleaners, humidifiers, cell phones, etc - multiple things at once - without having to unplug the lamps we want plugged in all the time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"So glad I bought this!","reviewDescription":"You remove the switch plate cover and this actually screws in, which makes it very stable.  I love that I can charge all of my devices at one time! Will buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"No Problems for months","reviewDescription":"We've been using this wall charger for months and have had no problems.  I have 3 USBs plugged in and 4 electrical plugs plugged in.  I would recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Excellent, well-made product","reviewDescription":"Bought five. Installed three the same afternoon they were received. One ties everything in the entertainment unit together, another ties everything in the office together, the third & fourth are being used in the den, and the fifth is a reserve. Very pleased with the quality and capability of these items.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"works great for phone chargers","reviewDescription":"We use this in my son's room where there are limited accessible outlets.  TV is plugged in 1 outlet and the USB are used for Roku and phone.  No complaints from my son and don't have a power strip on the ground to get stepped on.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Great for a phone station","reviewDescription":"We use ours for a charging station for everyone to leave their phones at and charge. It works great and you get a fast charge with the USB and C ports","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Nice Accessory; Solid Installation","reviewDescription":"For my wife’s Sewing \/Sitting room.  Now she & Friend can have use of power & charging options without sacrificing the TV & lamp being plugged it.The star rating for this is asking me to read it for traveling. This is not a travel item. This is for a “permanent” attachment to your wall outlet.Feels solid in construction. We removed the original decorative face plate to ensure a VERY solid and sturdy fit.  We have ordered 2 more for the house.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Like the different angles","reviewDescription":"I liked the different angles this power plug provided.  We have a desk and a side table close together and I can easily plug in a device from either place.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Does it all","reviewDescription":"I love this. I know there are a bunch of these on Amazon from various sellers and manufacturers which is fine. I just am so happy that I can attach so many different devices to this in a limited amount of counter space. I can charge my smart phone and kindle at the same time as well as have a couple of small appliances attached too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Very good quality \/ space saver","reviewDescription":"I used this item in my home office. The performance has been outstanding. It powers some of my office equipment. It charges by phone and tablet. I would recommend this item.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Great new charging station","reviewDescription":"I replaced the old cover plate on island receptacle, plugged this baby in, and now the kids have a new charging station for their devices. All in one place. 😊","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Awesome plug","reviewDescription":"Needed more outlets but didn’t want the power strip cord mess. Tried this instead and it has been great. Works awesome and is much cleaner look. Great price as well!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Quality Power Strip with Lots of Space","reviewDescription":"This replaced an ugly power strip I had that was necessary to plug in all my stuff on my nightstand because of bulky power plugs that took 2-3 slots. This has much more room, the USB ports work nicely, and looks way better than a huge rectangle laying in the floor. Great product, especially on sale. The screw to hold it in place for duplex outlets was a nice touch.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"It worked great","reviewDescription":"After having for 3 months it still works but the USB charger will not work you have to use by Outlet","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"This allows you to add extra USB ports","reviewDescription":"This allows you to add extra USB ports as well as plugs. It takes just a few minutes to install.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"2 month review","reviewDescription":"This is was a great way to expand my outlet, unfortunately the bottom outlet does not provide any power, but all others do.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Great value","reviewDescription":"These are really good, they can be used for charging different products without having to use charging blocks","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Convenient, easy to install. Not exactly \"White\".","reviewDescription":"I installed three of these on my kitchen island, which is painted white. They work fine, but as they are a bit large, they really stand out. They are not quite white. They are more of a grey\/putty color. Not bad, but not white.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Works well for all your cords","reviewDescription":"This outlet is very practical and actually has more plugs than I use. To save energy, we know we should unplug devices from the outlets because many operate in a \"standby\" mode.The only issue with this outlet was that the little green light in the middle stopped working within 24 hours after installation. I still will use this outlet and may purchase another for one other room. The price is affordable.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Works Great So Far","reviewDescription":"Ive been using this for my tv, xbox, and wifi router and its been working perfectly, no dead sockets and lots of different kinds of outlets.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"It works","reviewDescription":"Only downside is wish it had a night light on it other than that like it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"I wish it plugged into both outlets.","reviewDescription":"It only plugs into one outlet. And requires it be screwed in. Otherwise, works great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Limited space","reviewDescription":"Won’t fit if you have a dual socket and light switch side by side.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Perfect outlet extender","reviewDescription":"I purchased this product to provide more versatility for a bedside outlet and it does its job perfectly. No more having to plug in an appliance across the room!Two cons:1. It is quite big\/bulky, so I do not plan to travel with it.2. I wish the light wasn't constantly shining - it's annoying at night.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Very Useful","reviewDescription":"I really like this product. I use one at home and when I travel.  When I am at a hotel I don't need to plug my electronics all around the room.  I just plug this in and perfect.  Thank you for making this product , very nice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Works great!!","reviewDescription":"I installed this in my kitchen where my family likes to charge their devices. I have tried lots of different adapters. This one is sturdy and has the most pets that I have found. We can charge all our devices and still have outlets open for other users.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Perfect","reviewDescription":"I bought this for my bathroom. I can now have my light up mirror, towel warmer, charger, and Bluetooth all plugged in at once without having to swap one for another. I love that it's a surge protector too. I may end up getting a second one for my kitchen.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Perfect for behind dresser outlet","reviewDescription":"We’ve got a TV mounted above a short\/long dresser in the bedroom. The outlet is directly behind the dresser and if I added a power strip it would cause a mess and we would have to move the dresser away from the wall further.This outlet is slim enough to keep the dresser closer to the wall, youll benefit most if you use the 4 side plugs and not the front","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"So convenient","reviewDescription":"I can’t stand the floor extensions. The cords are always too thick, the actual power strip never wanes to stay in place… I was tired of it being the way. I bought one of these and it’s amazing. Cords aren’t pretty. It’s wild seeing how many usb cords I need. But this at least feels far more organized and out of the way. Fits into the outlet no issue. Would highly recommend for anyone that hates power strips and wants the fire hazard off the floor. This seems much safer.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Product works as described.","reviewDescription":"I'n not sure as to why we rate a vendor that has the foresight to stock a product with Amazon, but if it makes you feel good here's a 5 star rating.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"USB outlets stopped working","reviewDescription":"Not something for traveling. There are plug in multi-outlet devices for that purpose. This item is very versatile with lots of different style outlets. I don't plan to use them all, but glad they are there for when I need them. Appears well made. There is a downside to this item. It mounts into an existing duplex outlet. My problem is that you can only plug it in to the TOP outlet (to cover the wall opening). The outlets I wanted to use it on have the top outlet connected to a wall switch, and the bottom outlets are live 100% of the time. It would be nice if they would make a version of this where the outlets on the top of this item connect electrically to the top (wall) outlet, and the outlets on the bottom of this item connect electrically to the bottom (wall) outlet. BTW, if this were offered, it could still be used on outlets where both outlets are are live 100% of the time. Please get back to me on this . . . .[ update - 2 mo ] After 2 months the USB outlets stopped charging.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Multiport Charging on wall mounted surge protector","reviewDescription":"This item is has good construction and easy to install. It gives multiple electrical outlets and 4 charging connections including a USB C charging port. The only limitation is that total charging current is 4.8 amps shared between the four ports. I would really prefer that each charging port support 2.4 amps.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Easy install and works perfectly","reviewDescription":"I have zero electrical or handiness experience, and this was a piece of cake for me to install in under five minutes. I’ve been using it for months in a busy spot in my kitchen and always have at least four things plugged in. Whenever I need to use the air fryer or blender, I plug them I here, and have never had any issues with my phone or electronics charging slowly, even with multiple small kitchen appliances running on it. Totally worth the money and it has been a game changer. Buy it!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"gives us options","reviewDescription":"Love the USB ports. Looks good on the wall. Gives us more plug-in options","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Much needed USB ports","reviewDescription":"Needed multiple outlets and ports. Needs longer anchoring screws. Does not fit securely into outlets.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Okay","reviewDescription":"It is okay but it takes up both of my plug in spots.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Great basic surge protector","reviewDescription":"This is a basic protection device. Sturdy mount great multiple type outlets","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Must screw in","reviewDescription":"You have to remove the faceplate on outlet and screw this in.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Available ports for all different devices","reviewDescription":"The surge protector. Very ergonomic, user friendly and fits well with room","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Great but…","reviewDescription":"Some of plug ins don’t let me insert completely so it’s useless.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Great product","reviewDescription":"This is a great product. The price is very reasonable and installation is extremely easy and quick. I have had zero problems with it. All the outlets work.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Works Great","reviewDescription":"But more type USB and style “C” connections would be better.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Odd stud, but it's still a great unit!","reviewDescription":"The reason why that I say it is \"odd\" is because it won't just plug into your outlet - there is some kind of plastic stud (?) that sticks up and must be broken off before it'll plug in; it broke off with a little bit of effort but not so much that I would consider it hard to remove. And once you get it plugged in and lock it down (with the long screw that comes in the box) that's in the middle it's tight to the wall, secure and it works great. We all love it!And it's really awesome that you have multiple USB ports on it so that you can charge your phones or whatever else or just plug in your phone or whatever to play sooner music while you're doing dishes or cleaning and then you don't have to worry about the batteries draining down (and it will obviously charge your phone or whatever while you have it plugged in playing the music). The plug outlets are arranged in a great pattern too, easy to use formatting.","isVerified":true,"ratingScore":4,"reviewReaction":"23 people found this helpful","country":"United States","date":1700438400000}
{"reviewTitle":"USB-C port failed after a few months, the rest is still working at 1 year","reviewDescription":"I've been using it just over a year, and MOST of it has been working fine, but unfortunately ONE of the USB-A charging ports failed after about 6 months.  The other 2 USB-A ports and the USB-C port have been working fine.  The strange thing is that that USB-A port was the LEAST used of the USB ports, it had a Lightning cable for charging my phone while using it in bed, but normally that phone sits on a wireless charger.  So I probably only used that USB-A port a couple dozen hours at most before it quit.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Nice unit...but falls off the wall constantly","reviewDescription":"This charging unit falls off the wall constantly due to the weight of the chargers that are plugged into it.  It does come with a mounting screw that doesn't to avoid this but the screw hole in the unit does not align with any of the outlets in out house.  For the money it's nice but I've been forced to plug it in horizontally  on another circuit breaker extension so it doesn't fall off the wall.  Not exactly a clean way to use the unit.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Too big for travel","reviewDescription":"This may work great, but I bought it specifically for travel, since it is promoted for that purpose. It's too big for travel, and I had to send it back. It actually comes with a big long screw to secure the middle, which would be great if you wanted to use it semi-permanently in your home. Suggestion for the company: If you're honest about its ease of use for travel (or lack thereof), you may be able to avoid getting reviews with low stars.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Shorted out my socket","reviewDescription":"I bought this wall charger for the outlet next to my bed.  Last night, I smelled that familiar electric smell near my head and discovered that my outlet that this wall charger was plugged into was shorted out.  I can't imagine this had any other cause than this wall charger that was plugged in.  I am returning this and also have to replace my wall socket.  I'm glad I was home to react to this.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710288000000}
{"reviewTitle":"Defective usb ports","reviewDescription":"I bought 3 of these and one of them worked for 2days and then ALL USB ports quit working.  The only thing that worked were the 120V outlets.  I hope the other ones work for a longer period of time.  Suggests poor quality control. Also I could not find a website to contact them","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Reliable at First, But Quality Declines Over Time","reviewDescription":"Pros:Initially worked great upon purchase in July.Provided extra outlets for convenient use.Cons:Quality seems to have degraded over time.Green light indicating functionality now requires manual pressure to appear.Reliability has diminished since initial use.Overall Thoughts:I was pleased with this outlet extender when I first purchased it in July. It offered additional outlets and performed reliably. However, I've noticed a decline in its quality over time. Now, I find myself having to hold it in place for the green light to indicate functionality, which is disappointing. While it served its purpose initially, the decrease in reliability is a concern.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"USB C port stops charging after some time","reviewDescription":"This is a great product, great design, except the USB C charging port, the reason why I purchased the product, stops emitting a charge to my device. I am observing the outlet, so far I can say that after a few minutes of doing what it is supposed to do, provide current to my laptop, it stops. I do not see how could this be a problem on \"my\" side. If someone does not reach out to me, I will return it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Works til it doesn’t","reviewDescription":"This product worked flawlessly and was a huge help with telework due to multiple devices.  Then it suddenly stopped working with no reset nor indication why it stopped.  It took an electrician to see the circuit within this unit caused the circuit breaker to not restart.  I’m hoping the company sees this as a replacement would be greatly appreciated (this product was purchased last July of 2023).","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Great for 5 months then not","reviewDescription":"I bought this device since I thought it would be the answer to charging several USB devices. 5 outlets and 4 USB chargers would have been great. Well it did work great for about 5 months. Then the USB chargers died. Now it's no better than the simple multi-outlet devices and actually worse since I can only plug in 5 devices not 6.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Do not waste your money!","reviewDescription":"Quit working after only two months. Cannot return it just lost my money. Not very durable only used in one outlet and it stopped working! Terrible product do not waste your money!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Bulky but Useful","reviewDescription":"I bought a number of these units to provide extra outlets in a number of the rooms in my house and to add the convenience of device charging in those locations as well. They do both of those things quite well and offer a small degree of surge suppression as well.I only have two issues. This device is very bulky in size. The attached photos show that quite well and I'm sure that they could have been made thinner by a quarter or even a third easily. So, not meant for tight spaces. Second (And this is an issue with a number of other wall-mounted surge suppressors I have seen as well.), there is a LOT of light bleeding out from the USB ports and that's in addition to the LED indicator showing that surge suppression is active. See attached photo. If you put these in a bedroom, you're going to have a very bright room at night when you're trying to sleep. Good luck with that!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710720000000}
{"reviewTitle":"USB ports don't work","reviewDescription":"As a general AC outlet extender, it's fine.  I have no idea whether or not it's good at surge protection (I HOPE it is).  As far as USB charging, I tried using each port to recharge several devices using different USB cords and got ... nothing.  I gave up trying to use it for USB charging.  Maybe my unit is defective.  I can't image that I'm doing anything wrong in connecting to the USB ports -- that's pretty straightforward.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Awesome Concept","reviewDescription":"This item does not sit flush to the cabinet. I re-read the instructions and its supposed to sit over the faceplate and flush with the wall. It doesn't, but it does sit on there securely with the long screw that is provided. All the plugs and usb work, so if doesn't sit flush, not too much of a big deal, but wanted to make aware.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Falls out of outlet without the screw.","reviewDescription":"Took it on a cruise last week. It was too heavy for the outlet, and I had no way to use the screw that was included, so had to prop it up which only worked about half the time (it kept getting bumped) I’m guessing it would be fine at home under normal circumstances.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Wall plug","reviewDescription":"Got this so that I could have better access to my plugs.  I am giving a 3 instead of a 5 because the holes are not properly sized and it is difficult to near impossible to use the outlet.  A bit disappointing but not worth the trouble of returning","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Good spacing but Surge Protector already fried","reviewDescription":"The spacing of the outlets is nice and which accommodates bulky plugs.  I don't know if it was a freakish thing but I had two monitors plugged in along with a plug for my desk.  When I used the last outlet for the third monitor, there was spark and the green light went out.  Nothing was pulling powering from the desk, just the two monitors.The item stop working and their isn't any reset button.  I had tested the item on another outlet but wasn't working still.  Luckily, I had another outlet similar but a different company.  That one is working fine with all the monitors and additional items plugged into it.  So, I would have giving a higher star if it wasn't for this incident.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Keeping it in the receptacle","reviewDescription":"It doesn’t stay flush to the wall and consequently loses contact. There’s got to be a way to correct that, but I don’t know what that is.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Returned","reviewDescription":"Couldn’t use on cruise because it Is surge protected. It also didn’t fit a double outlet at home.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Missing the long screw to secure.","reviewDescription":"I didn’t get the long screw to secure this item and need to get one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"One Plug on Back Side and No Reset Switch","reviewDescription":"The product is listed as a surge protector, but there's no reset button.  The only \"indication\" that it's a surge protector is the green light in the center of the device.  I'd feel better about being able to use more of the outlets on also if it plugged into both receptacles instead of just one.  I know that's all normal strip design surge protectors do also, but at the very least it'd make the unit more stable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"cool gadget","reviewDescription":"it is perfect, plenty of outlets and voltage safety.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"As described","reviewDescription":"The angle makes it easier to plug in chargers","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Genial y practico","reviewDescription":"Un buen adaptador, funciona a la perfección.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Good","reviewDescription":"A little hard to fit dut works","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"It's ok","reviewDescription":"It works. Kinda large but it does the job","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Works Well","reviewDescription":"Make sure you purchase when discounted!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Better than others.","reviewDescription":"No dislikes. And easy to use!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Convenient","reviewDescription":"Great ..Keeps everything organized","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Works well!","reviewDescription":"Really come in handy in out of the way wall outlets!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"What we needed.","reviewDescription":"Works well for our needs.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Good product but USB-C does not work for Apple iPad (as of Feb 2024)","reviewDescription":"Great little product! Love the extra plus as well as how they are angled to be out of the way of the way of the other plugs. Being screwed in really makes sense. Bought specifically for the USB options and having 4 (three regular and one C) is great! Only complaint is that USB-C does not work with Apple iPad Pro which was why I specifically bought this model. Wish it was specified in the description that it’s not MFI. Still keeping it for all the other features.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"No screw included","reviewDescription":"It’s great but it loses a star because I had to go find a screw the would hold this item in place. I do like how it has a little light that tells you it’s plugged in right and also makes it easier to find with low lighting. It’s great and it has really come in handy but I ordered two and no screw in either box.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Easy to install and versatile","reviewDescription":"Installed this on an outlet in a room where my kids and their friends hang out all the time. They used to annoyingly unplug things to charge their phones on this outlet and leave them unplugged. Now, it's easy for them to charge any number of things while not bothering the few others things that are plugged in there. It's also super versatile with many different charging port types.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Streamline Your Outlet Woes with the QINLIANF 5 Outlet Extender!","reviewDescription":"I can't recommend the QINLIANF 5 Outlet Extender enough! It's been a game-changer in simplifying my scattered outlet problem. This extender offers ample outlets and USB ports, all in one convenient location. The surge protection is a great bonus for added peace of mind. The build quality is excellent, and the design is sleek and compact. If you're looking to tidy up your outlet situation and keep all your devices charged, this is the perfect solution!\"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Will not adapt to newer duplex plugs","reviewDescription":"The Quinlianf outlet extender will only fit the older round duplex outlets, not the more modern rectangular outlet.  I has to change the existing duplex out back to an older, basic duplex outlet with the center threaded hole to attach the extender.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Will not screw onto modern outlets","reviewDescription":"Works well enough for a static environment provided you are not unplugging\/ plugging connectors.The screw cannot be used with modern outlets, see picture of a modern outlet.  It is tight enough fit and does wraparound the outlet plate to the wall so is moderately stable without the screw.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Sleek and Swift","reviewDescription":"The Wall Charger Surge Protector's fast charging capabilities ensure that my devices are juiced up quickly and efficiently. Whether it's my smartphone, tablet, or laptop, I can count on this surge protector to deliver power reliably and swiftly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Added Electrical Outlets","reviewDescription":"I purchased this device for the added electrical outlets.  The USB charging ports are an added feature which would be a better feature if at least one port was a Rapid Charge or Quick Charge port.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"I like it","reviewDescription":"I bought this one a month or so ago to use in the kitchen area.  It turned out that this outlet doesn’t fit the GFI so I kept it and used it somewhere else….just FYI","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Bright light on all the time","reviewDescription":"Just a heads up… the product works well, but there is a bright green light that stays on all the time. If you’re using this in a bedroom, you may want to keep that in mind.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"It works","reviewDescription":"Works fine so far","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"like it","reviewDescription":"product good so far","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Easy install","reviewDescription":"USB charges at lower power.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Better","reviewDescription":"Second one worked","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Good value for how much it cost","reviewDescription":"versatile and inexpensive!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Works great","reviewDescription":"Good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"it works","reviewDescription":"Okay","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Works well","reviewDescription":"This is my 3rd one I’ve purchased. I have them now in my kitchen, living room, and bedroom .  It’s very easy to install. It’s got enough outlets for everything I need to plug in. Always nice to have the surge protection & the night light is really bright.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"So good you will want more.","reviewDescription":"I like this product.  It makes les it easy to add outlets to any room.  It takes up space a little bit bigger than the original outlet, but adds 3 more places to plug into with standard plugs, and gives you three USB(regular) and a USB (c).  You can fasten it in place using a screw that goes where you would attach the receptacle cover.  Make sure you remove the original screw or it won't go... Don't ask me how I know this.  So good I went back and bought another.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"main outlet does not work","reviewDescription":"I purchased two of these. Unfortunately, one of them does not work. The main outlet in the front just does not work. Just installed it, but passed the window for returns.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"USB ports stopped working.","reviewDescription":"I’d like to swap for another one, but I am past the return date. Surely these are expected to work more than 60 days. Is there any type of warranty?","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Plugs don’t work, USBs do","reviewDescription":"I got this bc I live in an older house and needed more plugs in the living room and thought this was perfect bc it has a built in surge protector. Install was easy but the plugs don’t work unless the item has a 3rd prong and only the ones on the face work. The side outlets don’t work at all. Only reason it’s not a one star is because the USB outlets work. I would’ve returned it and gotten a different one but life happened and I missed the window.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"USB Ports stopped working","reviewDescription":"Like the multiple outlets and ports, the only issue was that USB ports either didn't work or stopped working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Packaging appeared to have been tampered","reviewDescription":"Received package packages and was a bit concerned and disappointed on how the package of the product was delivered. It appears that it might have been used and retuned, which is fine. But should have not been sold as “New”.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Worked for 6 months","reviewDescription":"Worked great for 6 months, then all the outlet came loose and started sparking.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Just not powerful","reviewDescription":"Doesn’t support all ports at once , nothing fully charged after overnite","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Keep out of bedrooms","reviewDescription":"The green LED will pierce your eyes and will be a constant annoyance in rooms where you sleep.There doesnt appear to be an obvious way to turn this off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Too heavy","reviewDescription":"I thought this was going to be the perfect solution. When I plugged it into the outlet, what happened is that it was too heavy and it was falling.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Wall outlet","reviewDescription":"Some of the bottom plugs stopped working after two weeks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Great concept and cost effective","reviewDescription":"Full function device. Product sticks out further than I desired which limits placement options and that's the only reason rating is not 5.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Covers two plugs can't use just one plug","reviewDescription":"Dislike that it covered both plugs thought I was going to be able to use my other Outlet and then have this in addition","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Don't use metal wall plates","reviewDescription":"When the electrician plugged it in, the prongs bumped the metal (brass?) wall plate.  The adaptor and the new outlet he had just installed got fried, the metal wall plate got welded to the adaptor.  Learning points: Turn off the power before plugging in or unplugging?  Don't use metal wall plates. Or, the electrician's solution - remove the wall plate; period; not needed.I had bought several.  Haven't used the others enough yet to rate it.  Compromised on 4 stars because, at the least, the instructions need a warning added to not use it with metal wall plates.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1698364800000}
{"reviewTitle":"very versatile","reviewDescription":"Seems so far to work just fine.  However, using the USB port takes longer to charge a device","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Love it","reviewDescription":"Can use outlet and multi charger same time and not to worry of loosing charger box everytime","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"MIssing a screw","reviewDescription":"We are missing the screw that goes into the wall outlet. How can I get a replacement?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Gave as gift.  She liked it!!","reviewDescription":"Gift for friend who needed more places to recharge items.  Easy instructions for installation.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Needs more USB C","reviewDescription":"Arrived quickly, works as expected. Just wish someone would add extra USB C outlets.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Quick and easy","reviewDescription":"Plug it in and go! No wiring and gets rid of phone adapters. Win win!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Love it","reviewDescription":"I love these, it makes plugging things in so easy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Beware not USB-c compliant - Buyer Beware","reviewDescription":"Unless you read all of the information in detail, until you try to charge a phone. That this item CAN NOT CHARGE USB c phobes or other similar devices. Further, and obviously, it is not 3.0 compliant. Useless USB ports, even on the \"updated\" devices. Buyer Beware","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Good at first, but USB ports stop working","reviewDescription":"I’ve had this for a few months and loved it and now 2\/3 of the USB ports have stopped working. I love that it was a space saver to plug all our devices in but sad it’s not working properly. We’ll still use it because the extra plugs are nice but now have to buy extra charging blocks to have around.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Fits loose","reviewDescription":"Worried it will get bumped off and expose outlet to kids and pets","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Outlet extender","reviewDescription":"Nice device. Hate the green light on all the time;\/","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Defective","reviewDescription":"Only one of the usb connections work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"To big","reviewDescription":"Extra large sizing","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Comes with a plastic bar right in the middle forcing you to plug into upper outlet","reviewDescription":"It is good to have multiple outlets and usb outlets. However, if you have a room wired in a way that the upper outlet is controlled by a light switch, all outlets on this will be powered off.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"sorry","reviewDescription":"I believe this is a good product, but it did not work on my home because the outlets are on a switch, and it would not work because of that issue.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693440000000}
{"reviewTitle":"Ehhh","reviewDescription":"Only half of the outlets seem to work. I’ve been having some trouble with the USB outlets but I still think it’s a good purchase.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"Not bad","reviewDescription":"Purchased these for outlets that are visible and not covered by furniture, still trying to decide if I like them or not.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Careful with fit","reviewDescription":"Product is and does what it says. However, it is NOT designed for GFCI outlets. We had to cut off the plastic bit on the lower portion to fit it, and we cannot secure it with the long screw because well... all of our outlets are standard GFCI.Not sure why they wouldnt make this or an option of this with GFCI more in mind. But we make do and it does the job. The usb and usb c ports are phenomenal additions that were needed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Almost 5 star","reviewDescription":"I have 6 from this account and a few more. They are great for functionality. There is only 1 thing holding them back, and that the is extremely long screw in the middle have no \"keeper\". As a result, the screw falls out easily. I have tried replacing this locally, but there seems to be nothing readily available.If these screws are proprietary, I will happily buy some but they cannot be found.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Converts 2 plugs to 5, plus adds USB","reviewDescription":"Very happy with these. My only suggestion would be to make this plug longer and deeper.  Any larger plug you are plugging in to it only fits on the ONE plug on the front.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"works!","reviewDescription":"this my 2nd one. 1st one i got was by POWERIVER  and  did not work as perfect at this. that one, the face place needs to come off from the wall then install.  But this,  dont have this!  just unscrew, attach this and screw back and done!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"It's okay","reviewDescription":"Make sure you use the screw, I didn't and when you pull the plug out the whole things comes off the wall.  But otherwise it's okay.  Charges good, no problems.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Check the size.","reviewDescription":"Larger than others I’ve purchased. Check your existing outlets especially older homes. The baseboard was too close on outlet this was bought for, I just used it elsewhere. Very helpful product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Versatil, easy to install","reviewDescription":"The equipment appears robust, and during the operatioit it has worked very well. I recommend this product not only have a 10 v outlets  ports and USB charging ports.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Great quality","reviewDescription":"I've wanted this for so long, and it's great quality. It just doesn't fit the plugs that I need it to because it needs to screw in.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"very large and heavy","reviewDescription":"This won't stay in the outlet must be screwed in its to heavy my outlets don't have center screw. to large to travel with.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"A Good Answer for Anyone With Lots of Rechargeable Devices","reviewDescription":"Like most of the people we know, my wife and I own multiple devices with rechargeable batteries. Phones, cameras, tablets... you name it. After a weekend away, nearly every convenient outlet in our house plays host to at least one rechargeable device.This wall charger helps simplify matters. Since most devices don't draw much current, we can plug almost everything that needs charging into one outlet. With the added reassurance it's also a surge protector.It simplifies getting all our devices recharged after a weekend away. And the surge protector offers a degree of confidence our frequent lightning storms (We live in southern Florida.) won't fry our devices. It's easy and quick to install... though the instructions leave something to be desired.As far as traveling goes, don't bother. This is a household device, and isn't appropriate for travel use.But, if you have a half-dozen rechargeable devices and struggle to get everything charged in a timely manner, this could be the solution you seek.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1689638400000}
{"reviewTitle":"Slow charging time for my phone","reviewDescription":"I purchased this because my kids keep taking my boxes. I figured if its an extension cord I could keep things more organized.  What I found out is that it will take hours to charge my phone using this way, so this is a downside if I need it charged in a short amount of time.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1680566400000}
{"reviewTitle":"Functional USB Wall Charger with Unnecessary Green Light","reviewDescription":"This USB Wall Charger is a functional device that works well. The sturdiness of the product is impressive, as the center screw installs directly into the plug. However, the constant green light can be annoying and unnecessary. Overall, an excellent option for anyone in need of a reliable USB wall charger, but keep in mind the potential annoyance of the green light.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1680220800000}
{"reviewTitle":"Will not pass thru switched outlet","reviewDescription":"Will not pass thru switched outlet only 1 plug on back need 2 for switched outlet","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"Charging and back plug","reviewDescription":"It took way to long to charge and difficulty finding good plug to use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Some ports are dying after one year","reviewDescription":"I am not sure what is lifetime of this product. The real test of a product is its longevity. After little more than one year some of its ports are dying. Out of 4 only 3 are are working. If I have to buy it every year that may be my choice.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"Defective item","reviewDescription":"I bought three these at one time. One out of the three doesn’t work. To get it replaced. I have to jump through hoops. So I would look at a different item from now on not willing to do business with this company anymore.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"Limited Versatility","reviewDescription":"I was disappointed that I was  unable to obtain power for either my iPad Pro or my Alexa without adding a plug at the end of each power cord. Otherwise, this device has a tidy appearance.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686268800000}
{"reviewTitle":"Bulky but handy.","reviewDescription":"It is bulky but handy.The charging power is the sum of all of the ports so it is somewhat slow to charge things.  It is handy though bc you don’t have to worry about losing the usb charger blocks.  The light in the center is not necessary. It is just a waste of energy.It is an ok product overall.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678838400000}
{"reviewTitle":"Is not stable if you aint got a third hole","reviewDescription":"If you dont have the hole in the middle, is remarkably very unstable","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"low charge even with a single unit plugged in","reviewDescription":"the charge for a single unit is slow and even more slower with multiple units plugged in.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Too big for my kitchen plug","reviewDescription":"I got this for my kitchen plug but it was too big. I’ll find another use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680048000000}
{"reviewTitle":"Slow Charger","reviewDescription":"Pros: has plenty of available sockets and good layout and reasonable price. Cons: Very slow to charge an Iphone or an Android phone. Don't have spec on parasitic (no load) power consumption. I dedicated it to running an amazon Stick since it doesn't have smart chip to do fast charge. OK for that purpose.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668038400000}
{"reviewTitle":"Included screw was too short","reviewDescription":"Disappointed.  The included screw is too short to reach the receptacle, so it won't screw in where it would be stationary.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676764800000}
{"reviewTitle":"Good power but has issues…","reviewDescription":"As you can see from my video, it’s a little touchy with the power going in and out. Can be frustrating when you leave thinking your phone is charging and come back and the power is off. When it works though the power is strong.","isVerified":true,"ratingScore":3,"reviewReaction":"11 people found this helpful","country":"United States","date":1673049600000}
{"reviewTitle":"NOT A FAST CHARGER","reviewDescription":"UPDATE: Plugged in C connector compared to my samsung fast charge plug. This is about half as fast. The USB don't really charge not sure why they're there.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674345600000}
{"reviewTitle":"USB C did not work","reviewDescription":"I purchased 4 of these units. The USB C port did not work on one of them. The other 3 seem to work fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Great product, just didn’t last long for me","reviewDescription":"This is a very useful product, charges my devices super quick, but died about a month after receiving, so that’s why I gave it 3 stars.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1674345600000}
{"reviewTitle":"Works but not sturdy","reviewDescription":"Product not sturdy, any movement\/plugging in or unplugging turned the whole thing off. I ended up buying a different one with 8 plugs instead on Amazon too and it was much better than this crap","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671062400000}
{"reviewTitle":"Not perfect","reviewDescription":"I thought this would be better than it is, and would in fact be perfect except for 2 problems.It does have a screw to hold it in place, which was a priority for me, but the screw is loose  and may get lost. Other units I own have the screw permanently held in place.The other small deficit that is disappointing is that the unit will not suck tight against the wall. My older one would. This one stays at least 1\/4 inch away, so it looks ugly and rocks around a bit, even when screwed in tightly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645401600000}
{"reviewTitle":"Caution, came open.","reviewDescription":"Seems like a good product. But they sent one that was previously opened and charged full price of a new one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674950400000}
{"reviewTitle":"Not Quite White.","reviewDescription":"Decent extender, but not a warm white; almost gray. The unit extends enough to cover a standard size wall plate. With a typical plug plugged into the unit the plug extends 3 inches.or more. When installed everything works as described. The only other possible issue is the one time use surge protection. There is no reset.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676160000000}
{"reviewTitle":"Good enough for the sale price","reviewDescription":"I like the spacing of the outlets on the side and the USB A and C, and one cannot beat the $12 sale,  but I was spoiled by the 360 Electrical outlet extenders I bought 3-4 years ago which are perfection except pricey, and no C USB.The Qinlianf 5 has a rougher exterior,  ugly greyish color,  good USB's outlets but the AC outlets are absolutely not smooth, I almost bent a plug first time I used one trying to fit it in, then it would not come out.  Spent some time working on the 5 outlets but it is easier to leave appliances plugged in.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657929600000}
{"reviewTitle":"Nice product, but it does not fit well on the wall","reviewDescription":"I liked this product based on the description. However, I was not able to secure it on the socket using the screw that was provided. I tried moultiple approaches, including disassembly of the the wall outlet, but no luck.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676419200000}
{"reviewTitle":"Good Concept","reviewDescription":"The overall concept was excellent but when trying to use more than one socket on here the weight would cause it so constantly come out of the wall socket. I have since returned this item as it wasn’t as useful as I thought.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675123200000}
{"reviewTitle":"FLASHING BLOCKING THE BOTTOM HOLE","reviewDescription":"Two units ordered with one perfect, as advertised. The second had a large plastic piece of \"flashing\" in the bottom hole that made it unusable for the front facing plugin. One out of two is a small sample, but, it severely restricts our ability to use it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675382400000}
{"reviewTitle":"Limited outlets","reviewDescription":"The wall charger only has two plugs to recharge our iPhones & iPad.  There are other plugs & the charger fits flat against the wall for space saving.Not real happy with product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677369600000}
{"reviewTitle":"It kept falling out of my original socket.","reviewDescription":"It kept falling out of my original socket.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1684800000000}
{"reviewTitle":"Not very good product","reviewDescription":"After many months of use, the plug is not performing well. First, the mounting on top of an electrical outlet cover plate (even with the screw) is not stable or smart. There is a big gap between the wall and plug. The back plate at plug could be recessed to cover the outlet wall plate.Second, plugging in into 120V is very hard at first, metal receptors inside a very tight, and then over time it relaxes and making sparks when plugging in.Third, the high speed USB PD outlets are not so high speed. My phone showing 1hr 12min to a full charge with Samsung OEM charger, and this plug shows 2hr 25min until full charge.Not recommending this plug.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1648339200000}
{"reviewTitle":"Hmmmmmm","reviewDescription":"I wanted it flatter on the wall","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683763200000}
{"reviewTitle":"Not sturdy but has potential","reviewDescription":"You need an outlet where you can screw this in, which I don’t, so it just sits on top of the current outlet which is unstable and easily falls with the slightest touch. Highly considering returning this device. However, if I could scare it in to the outlet this would be a good product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669420800000}
{"reviewTitle":"Good product, but not new","reviewDescription":"We loved the first plug we got, but the second one was clearly used. It had scratchs, a small dent and black smudges on it. It still works, but clearly not a new product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Works great but comes out of plug easily","reviewDescription":"We can’t screw ours in so it does come out of wall when removing a plug from it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"Was great when it worked","reviewDescription":"Only complaint is one of the outlets stopped working after a few months of use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695340800000}
{"reviewTitle":"Doesn't stay on wall. Can't mount, no availability screw slot for outlet.","reviewDescription":"I have top and bottom screws and this doesn't work with the outlet  above.Apparently I need a \"duplex outlet\"Might have to put 3M tap or something","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Price","reviewDescription":"I like the product how is this a deal if I paid the same price and today is supposed to be 40% off is this deceptive marketing?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689033600000}
{"reviewTitle":"Supports several appliances at once","reviewDescription":"The USB ports are slow charging. C port is fast","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695859200000}
{"reviewTitle":"ADB C doesn’t work.","reviewDescription":"It works fine for everything I didn’t get it for.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"DECORA VS. STANDARD OUTLETS","reviewDescription":"If you have Decora outlets, beware this will not work as intended.  Decora outlet cover plates have screws at the top and bottom.  This extender works for standard outlets, where the hole on the plate cover is in the center of the cover.  Using them without being screwed in makes them unstable.  I purchased 5 of these for around my home and am returning them.  I'm giving the item 3 stars because it's partly my fault for not realizing it before purchasing, but they should be a bit more explicit in the description of the item.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1677196800000}
{"reviewTitle":"It's ok","reviewDescription":"Not made for the newer outlets so be wear","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Using USB port interferes with TV","reviewDescription":"I liked this until I plugged in something to the USB port to be charged. It interfered with the channel.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"Have to push into wall to work","reviewDescription":"This product works, but only if I push it into the wall and almost suction cup it to the outlet. The things charging in it are warm to the touch as well. I'm hoping it stays plugged into the wall without me having to constantly fix it.  It did come with a screw to mount it to the wall, but it didn't work with my outlet cover.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Misleading wall outlet","reviewDescription":"I mean 3 USB a and 1 USB c and 5 outlets are nice for multiple items but the 4.8 Amp outlet is misleading and it does not fast charge. Takes 10+ hours to charge my samsung s23 ultra from 10%. Not up to speed for today's modern day electronics","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1678579200000}
{"reviewTitle":"Could be better","reviewDescription":"I like the fact that it screws into the wall, however it's still very wobbly.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Comes unplugged","reviewDescription":"If bumped in the slightest, it will come out of wall, unplugging the TV etc. Other than that issue it's effective","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Works great but still not a fast charger","reviewDescription":"You would expect it to be a fast USB but it's not...Waste of opportunity imo","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"Hard to charge large items","reviewDescription":"Kind of disappointed as it sticks out from the plug quite a bit.  Found charging two of the same plugs hard to do. I never even realized that it was a night light as I stuck in between the bed and wall…mehhh","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677801600000}
{"reviewTitle":"Ok","reviewDescription":"Ok surge protector","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"Does no work on all plugs","reviewDescription":"I broke of a part to get to plug it in","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"Good product overall.","reviewDescription":"Bought it for compact size. Just okay.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"It half works, top level plugs don't function. Overall low quality","reviewDescription":"The top level AC outlets on the device I received don't work. The USB output only hits about 2amp max. Overall it works, just low quality. Basically you get what you pay for, I suppose.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1683072000000}
{"reviewTitle":"Meh","reviewDescription":"Didn’t work. Tried twice.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Doesn’t fit GFCI","reviewDescription":"Title says it all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"No use","reviewDescription":"Not working properly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Has a pin attached that makes it almost impossible to plug anywhere","reviewDescription":"It looks good until you actually try to plug it in and find an unremovable plastic pin that's sticking out and preventing it from being plugged.This pin has no function whatsoever and I'm really curious to know why it is there. If anyone knows what it's for, please let me know. It sucks! I bought two from two different vendors and both have the same issue.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Waste of money!!","reviewDescription":"I used it for Alexa and phone charger, sometimes for a minute for teapot.  I received it one month ago and it was working great until today. No changes on use. Don’t waste your money!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Doesn't last long","reviewDescription":"Had it for a little over a month. Type C port has already stopped working. Now the window for return\/exchange has closed.It's a nice charger, wouldve gave it 5 stars if this didn't happen","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"Plug holes don’t hold at all.","reviewDescription":"So we’ve had this plug for over a year now and none of the plugs holes hold any plug. They all fall out and spark when you try to plug it. Do not recommend it. It’s been doing this for a while and we just threw it out. It was good at first but didn’t last.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Not suitable for flush mounting","reviewDescription":"While this unit provides slightly higher total amperage limit on the USB ports compared to some less expensive units, it's simply not worth it, if you want a flush mount with your wall.The back of this surge protector is smooth and flat. If like me you live in a somewhat normal home, the outlet you'll use is not recessed. Your surge protector will be separated from the wall by the depth of the actual outlet, making it a nice place to house dust and bacteria if you secure the outlet with the screw provided.I found multiple units of the same style with sunken backs to accommodate the outlet even if you leave the old cover in place. Most of these other brands cost less than this unit when purchased, and have the same 5 AC ports 3USB, 1USB-C, and your little green light to show you're protected.Except for the slightly higher 4.8A total rating for the USB ports (others mostly at 4.2A) I do not see a reason to purchase this item unless you are really having trouble finding the alternatives in black, and you are set on the color.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1646438400000}
{"reviewTitle":"I've only had them for a day and I plugged them in they work","reviewDescription":"Yes they work and it's nice to be have that many plugs into one as long as it doesn't cause any fire hazards or anything it should be fine don't remember seeing markings seeing where it was certified by us but there it is usually being approved by an agency CE I believe it is","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Burnt out at under specs  after a few months","reviewDescription":"Rated: \"Max.Power Rating: 1875W\"It burnt out 2nd time we plugged in a 1700 W heater.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Good But Falls Out of Wall","reviewDescription":"It works but it falls out of the wall so easily. I will sometimes think my item is charging when really it isn’t the entire time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"The sockets are very tight","reviewDescription":"The sockets are very tight. Hence it is hard to plug in anything and it then falls out after you remove anything from it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Stopped working after 6 weeks","reviewDescription":"Buy name brand. Dont waste your hard earned cash on this crap like I did!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Outlets get loose and USBs are slow","reviewDescription":"The outlets got loose over the course of the last 6 months since I bought it.  Now plugs won't stay plugged in to it.  Just fall out.  Also, the USB power is very low.  Charges devices very slowly.  Replacing it with a unit from a different brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"Expect Product Failure","reviewDescription":"45 days into the product, and all the USB ports have stopped charging. They have been used possibly ~20 times total.  The USB ports were my primary use case, and they have already failed.This not much else that can be said for the quality other than that.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680134400000}
{"reviewTitle":"It does not turn heat pad ON","reviewDescription":"When I plug heat pad to itdoes not work, means maybe not safe","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693180800000}
{"reviewTitle":"Doesn’t fit well","reviewDescription":"It works okay. Little wiggle and comes out so wish was better fit. Still works fine just don’t bump it ha","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"2 of the usb ports are funky","reviewDescription":"I bought this for extra ports instead of running a surge protector strip and when I got it upon plugging in one of my usbs I wasn’t getting any power, as I started to pull the cord out, it powered on which is odd but yea two of the usb ports only work if u don’t push the usbs in all the way….","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676851200000}
{"reviewTitle":"Meh","reviewDescription":"The USB ports suck!  Very slow charging. Plugs are good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"USB ports work On\/Off","reviewDescription":"USB ports sometimes work and sometimes they don’t. So I still find myself having to use the adapter for regular wall outlet, which in a way defeats the purpose of having this wall charger. If it wasn’t for that, I would of given it a 5 star review.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1678838400000}
{"reviewTitle":"It's useful....for a little while.","reviewDescription":"I've had this device since July. Today, 03\/17, I noticed that my device had barely charged. It was a creeping issue for a while. The time to charge my phone has become longer and longer over a few months. This morning my phone was only charged to 22% upon waking. I blamed the charge cord and got another one. It wasn't any better on the estimated charge time. It was this device. The USB ports quit charging as well as before and they weren't by any means a rapid charger to begin with. The plug on the side was only marginally better.The first picture is the best time I could get with this device plugged in. The second picture is after i removed this piece of junk and plugged into the outlet. Disappointed and throwing in the trash. Pay for quality.","isVerified":true,"ratingScore":2,"reviewReaction":"7 people found this helpful","country":"United States","date":1647475200000}
{"reviewTitle":"Caught on fire and broke my charger","reviewDescription":"Parked for about a year. Then it suddenly caught on fire and burnt my charger.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"Stopped working after a year and half.","reviewDescription":"The side outlets don’t plug in as tightly as the two in from directly connected to the outlet. This causes cords to fall out easily. Convenient to have the USB ports. Stopped working after a year and a half. Wouldn’t recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1687737600000}
{"reviewTitle":"Extremely Hard to Insert Plugs!","reviewDescription":"I bought a 5 outlet extender from another company a while back which works fine.  Thought I would try one from this company as it was cheaper.  Received it a couple months ago and when I went to install it today found that it is very had to insert plugs into it from various electrical fixtures (i.e. lamp, clock radio, etc.,).  I actually had to use two hand to insert each plug!.  I don't know if I got a lemon but certainly wouldn't recommend this particular brand!  USB charging ports were fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665273600000}
{"reviewTitle":"Want to return it","reviewDescription":"It looks exactly like the picture. But if your sockets don't have a place for the middle screw then it won't stay it. It keeps falling loose from the wall. I wanted to use it for work purposes but it keeps falling out the wall without me knowing and my screens keep going dark. Not worth it!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1681430400000}
{"reviewTitle":"Made in China","reviewDescription":"I'm reluctant to use these, because they are made in China.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"Dumb design will not fit most outlets.","reviewDescription":"Poorly designed - the center screw will not work with most modern outlets. Similar products use screws above and below the outlets to be universally compatible with any outlet.Granted, had I looked more closely before ordering, I might've noticed that. But it's just plain dumb to design it in this way. I made sure it'll stay put with some double sided tape and called it a day.The outlets are an extremely tight fit - a lot of force and wiggling is required to insert or remove a plug. They loosen up some with use, but it definitely doesn't feel like any \"normal\" outlet. Makes plugging stuff in and out a bit of a hassle, but on the plus side, there is absolutely zero chance things will get unplugged accidentally.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1648166400000}
{"reviewTitle":"This couldnhave been great","reviewDescription":"Unfortunately the pulg i need it for is the plug it is not designed to fit in. I didnt realize it came with a post like this. Sonits not gonna fir and be useful cuz its not properly supported.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683676800000}
{"reviewTitle":"Makes a buzzing sound","reviewDescription":"Product fit well in wall, but after a few hours of being plugged in, it starts making a buzzing noise. I was using 4 of the outlets to plug in 2 monitors, a docking station and a phone charger. I would not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1685923200000}
{"reviewTitle":"Not worth the money?","reviewDescription":"The design is weird, I have a wall outlet that has two sockets. it blocks out one of the socket when I plugged in, this leading one socket wasted. What’s the point?  bad design I returned it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686268800000}
{"reviewTitle":"You can only use 3 of the 5 outlets","reviewDescription":"If you have more than 1 large square plug then this is not for you","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Even with the screw in it is loose.","reviewDescription":"Sometimes it works and sometimes it does not. Do with that what you will.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Stopped Working after 6 months","reviewDescription":"I bought this product in June, 6\/2023. It was great at first! Powered all of my devices without a problem, up until today 11\/28\/2023. Seems to have burnt out after about 6 months of use. The wall outlet it was plugged into still works, so that’s good. If you’re looking for something to plug lots of stuff into & forget about, this product might not be a long term solution.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"16 hours to charge a phone?","reviewDescription":"Not really good. I have different brands and with this one any phone take minimum of 16 hours to charge on the USB ports. In any other brands or USB charger only 2 hous.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Falls off the outlet easily","reviewDescription":"We had that problem with a previous unit but this model is worse. I think it's just heavier and sticks out further off the wall so it gets pulled out easily.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"the usb c port stops working after a week","reviewDescription":"the outlet was good, and anchored on the wall well with the screw. All the USB ports worked at the beginning, but the only USB C port stopped working after one week.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"USB stopped working","reviewDescription":"I purchased 3, the USB plugs on one stopped working a few months after using. The other 2 seem to be ok for now, 6 months in.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"NOT user friendly & bulky.","reviewDescription":"See pics: in order to use, tools are required to completely REMOVE your current outlet. This is big, ugly, bulky and chunky sitting off a wall. Returning.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Does not work on all electrical outlets","reviewDescription":"Guess I missed the part that this surge protector does not work on all electrical base plugs.Mine has one of those surge trips, where you have to reset it by pushing a rectangle part, in my bathrooms & kitchen.  So when I plugged this surge in - the 2nd thing that happened after the green light came on - Was - it tripped my wall base plate - or whatever they are called.  So back to the drawing board, as ‘they’ say or maybe none work for my type of wall plug bases.  Who knows?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Does not always stay in the wall and my iPhone would not charge in this unit.","reviewDescription":"iPhones may not charge in this adapter, maybe it wants to be in the wall instead of this adapter.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"It’s fair quality","reviewDescription":"The cell phone charge feature didn’t charge phone but it does have many outlets forRegular plugs","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"A couple bad design decisions","reviewDescription":"I like the number and variety of plugs, but the way it is designed makes it wiggle a lot when you plug it into the wall (even after removing the outlet cover screwing in the USB charger screw). The first bad design decision was to only have one 3 prong plug that plugs into the wall. This thing is big and having two plugs would have made it significantly more stable. They should have a least made a second \"dummy\" plastic plug so that it plugged into both wall receptacles. The second bad design is that the back is not recessed. Even when you remove the cover on the wall outlet, the actual outlet still protrudes past the drywall about an 1\/8th of an inch (or more). Without the back being recessed, the USB Wall Charger will not sit flush with the wall, which makes it even more unstable. I wound up trimming the wall plug box some to allow the plug to sit further into it. But even with the USB charger flush with the wall, it still wiggled around a bit because it has only one plug to secure it to the wall outlet. Now that the 1\/8th inch gap wall closed between the charger and the wall, I was able to put double sided tape at all four corners to eliminate the wiggle. It's really amazing that products get manufactured and shipped with such obvious issues. Did no one plug this thing in before giving the green light on the final design?","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1636934400000}
{"reviewTitle":"Frightening!","reviewDescription":"As you can see by the photos, this outlet started to burn. This unit got so hot that it started to melt. The wall outlet itself remained cool to the touch so there was not that. We use it for a coffee maker, a small lamp and an electric teapot so it’s not overloaded. We’ve only had it for two years.Thank GOODNESS we unplug everything from it before we leave the house.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Not sure if it’s defective?","reviewDescription":"When I was first plugging it in, it was green which shows “protected” and now that the thing is fully plugged and screwed in, the green light is off. Not sure what to do.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1703116800000}
{"reviewTitle":"Received defective item","reviewDescription":"Can’t use all of the connections because not all of them work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Not all outlets work","reviewDescription":"Only a couple of the outlets actually work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Only lastedsix weeks and can't get support or replacement","reviewDescription":"I was impressed when I first received two of these, but after about six weeks my wife said hers wouldn't charge her phone. I checked it on another outlet, and while the 110 outlets worked fine, the USB connections won't work at all. No manufacturer or seller numbers on what they're calling a manual and Amazon says they can't do anything. Paperwork does say that it has a 12 month replacement service, but no way to contact anyone. By the way, two of them were delivered to me on July 8th 2023.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"Have to take regular plate off outlet","reviewDescription":"I didn’t realize I had to take plate off the outlet and it works but still feels loose. Maybe not the best","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Doesn't sit in outlet correct","reviewDescription":"Slides out of outlet very easily.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"USB ports stop working","reviewDescription":"USB ports stopped working within a month of purchasing. Plug-ins still work, which is why I gave 2 stars.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"High quality product","reviewDescription":"Wow! This outlet expander is the best I’ve ever seen. Feels and looks very solidly made as soon as you take it out of the box. Recessed in the back so it fits snug against the wall over a regular two-plug outlet cover. It’s snug even without using the long screw to replace your standard outlet screw. But I loved the chance to fully secure it to the wall (for us, the end of a wooden lower cabinet section in our kitchen). It’s protective of the outlet unit to use the long screw. The outlet holes hold prongs very firmly and straight-no side to side motion. I don’t think we need the surge protector because we have a whole-house version, but it certainly doesn’t hurt to have this added feature (working when it shines green). This product is a deal!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Great Value and Much Better than a Extension Cord","reviewDescription":"I was so Excited when I found this product that I ordered 9 of them. Yes I said 9 of them.... I had a different Brand and type and I got by with it but I wasn't happy with it. I believe I picked it up at Walmart years ago or somewhere but like I said I made do with it but it needed to be Replaced. I found this Electrical Outlet with the added features and I jumped on it and purchased 9 of them. I have all of them up and did so the day they arrived, I was really excited to get them up and put them to use. I have two left that I plan on putting downstairs in the Basement.  I Highly Recommend these Wall Charger, Surge Protector, Outlet Extender and the USB Ports. You shouldn't be Dissappointed at all since you get so many wonderful things in a small Punch of an Outlet. Stock Up like I did, it's better than an Extention Cord.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"I LOVE THESE","reviewDescription":"I love this outlet!! I have bought four total so far and will be buying three more for our bedrooms. I currently have them in my two office areas, my family room and living room! I love the different things you can plug esp the different type of phone chargers.• HIGHLY buy it. You’ll end up buying more so just get two while you’re at, plus the price is reasonable for how amazing this product is!•","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Awesome Everything Outlet","reviewDescription":"A lot of my devices require plugging in usb. Often this requires turning on a device with usb like the tv or pc which are only helpful while turned on! This thing is so convenient!  it provides multiple charges of USB with extra plug outlets! It is a game changer, and I plan on purchasing another one! Thanks!! Great product! Highly recommend. It also secures into the outlet nice and tight with a provided screw!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Most Convenient","reviewDescription":"This surge protector outlet plug is an answer to my prayers. As a renter, I'm not able to install one on a permanent basis. This product eliminates the bar style which has the wires coming in from all directions having to move it around furnture, under anything to keep it from getting switched off. This plug is great. It's stationary. AND, the number of outlets and USB plugs it's just enough for all my needs. Especially in my bedroom where I can now plug in my charger, lamp and alarm clock without any interference.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Love this!","reviewDescription":"I absolutely love this outlet extension. I live in an old house from the 1960s, which doesn't have outlets every 3 ft in the kitchen the way modern kitchens do. I have more appliances in my kitchen than I have plugs for, and this really works great for me. Also love that I can charge up my phone in the same place. In fact I found this to be so useful that I bought a second one for the living room!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Charging central station!","reviewDescription":"I put this in my kitchen where everyone Is plugging in and searching for the appropriate charging cable constantly. It is a great central charging station and will handle everyone's devices at once, all while leaving the wall plugs free! It has multiple USB charging ports and even includes a type C port for your Mac or iPhone or other type C devices which I found so handy! This screws into your actual wall outlet, so you will just need to remove the wall plate on your electrical outlet and plug this in and fasten down with the provided screw. I love this as opposed to a simple plug in wall charging port because no one can run off with it! Its now a permanent fixture that definitely makes my home smarter and more efficient!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Love this item!","reviewDescription":"So I have several items that are actually very similar to this product and I just want to state that this is the cheapest and my favorite out of all of them. I love the fact that it has plug-ins on the side because if you have an inconvenient placed plug it’s a lot easier, to sort of make the plug a little bit more accessible. Furthermore, I like the fact that it lights up and it shows you that it’s protecting against the surge of the power. I also like that the plug comes with several different options of what you can put into it like whether you just want to put the charger without the cube or just put a regular plug in. I would totally recommend this product to everybody and I think it’s a perfect price as well!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Adds Options To Conventional Outlets","reviewDescription":"Having additional outlets compared to the standard two-outlet capacity found on most walls, and with the additional benefits of 3 USB and 1 USB-C ports, these are especially nice to have in areas where you have multiple items that need access to electrical current as well as making it convenient to charge cell phones. The added feature of surge protection is essential since it is possible to overload their capacity with items that draw too much current. Be sure to read all of the accompanying information since you will find that one of the USB ports is a fast charger compared to the others.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Looks great easy to use","reviewDescription":"I have this in my kitchen to plug in my refrigerator, coffee pot, espresso machine and to keep my tablet\/phone charged while following recopies. I like that the plugs fit nicely. I originally got this for the surge protection because I just bought a new refrigerator and power surges are not covered by warranty.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Easy to install","reviewDescription":"Like the amount of outlets and the ease of installation.  Did not realize it could not be used for a GFCI outlet as it has to screw into the middle of a regular outlet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Great item.","reviewDescription":"These seem pretty neat. I’ve installed 4 now, they’re very easy to do.All outlets and USB ports work well, I may buy more in the future.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Wall Charger","reviewDescription":"Nice design, and worth the money. However, it does not charge quickly on your cell phone or tablet unless you plug in the quick charge adapter to it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Good, but high pitched whine","reviewDescription":"This is a great outlet to extend to USB as well as additional outlets but it has a high pitched whine when anything is being charged.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"It’s ok","reviewDescription":"It doesn’t like to stay when I plug it. It falls on its own here and there.it doesn’t fall to often but once in a while","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"I like everything about this plug-in unit EXCEPT ... see review.","reviewDescription":"I like everything about this plug-in unit EXCEPT it needs to have a shelf on top to lay your phone or other items I want to charge.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Does as expected","reviewDescription":"One thing to note is that this particular box does not have the option of a nightlight as some products of similar price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Great product","reviewDescription":"I only marked this down one star because it doesn’t come in an all or mostly usb c options. Technology is the states in already moving away from usb to usb c and Europe has already made the move. Other than that I’m glad there is at least one usb c option. Overall great product and even better price point!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Almost perfect","reviewDescription":"Needs 2 plugs for sturdiness into wall. 2nd plug would hold extender much better, but the extra charger ports is a nice bonus","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"USB-A port not working after two months.","reviewDescription":"Was working great for two months and then one of the USB-A ports stopped working.  Was granted a full refund from the seller.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Stop working","reviewDescription":"Funcionaba bien, pero despues de 2 dias la luz verde se apaga y hay que estar constantemente apretando con un destornillador. Es bien molesto, no es funcional.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Didn’t last a year","reviewDescription":"I bought this march 9, 2023. It worked great until a week ago. Plugs don’t work all the time and the usb chargers have stopped working completely.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Way bigger than you expect; only 1 plug in rear","reviewDescription":"It’s nearly 2” deep and sticks out quite a bit. Most concerning though is that the back of this is only one plug into your box, not the standard two. If every plug was filled this would 100% be over capacity for a single plug. Certainly not UC rated.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"A couple of the side sockets do not work well.","reviewDescription":"Several of the side sockets either don't work or I have to have the plug leaning down to get it to work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"usb ports stopped working","reviewDescription":"I loved this when it worked. But the usb ports stopped working after 3 weeks… now I missed the return window.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1709510400000}
{"reviewTitle":"Not For Night Lights","reviewDescription":"Nice idea, but I bought it to plug night lights in, in our bathrooms.Our outlets are right by towels.  When I plug in night light, the towel is in the way.  I need all the outlets for toothbrush, hairdryer and curling iron.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Scary","reviewDescription":"The 3rd instruction states that sparking is normal. This scared me away from it immediately. I suggest reading reviews before purchasing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"2 weeks in USB ports stop working.","reviewDescription":"Seemed like a great solution for my desk area but the USB ports all stopped working today (after about 2 weeks of use).Regular outlets work fine. Just disappointed because I bought it for the USB charging and that feature no longer works.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Crummy","reviewDescription":"Buy something else more appropriate.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Worked great until ALL USB ports stopped working","reviewDescription":"I bought this for my office to help eliminate all of the plugs from USB. It worked great for about six months, then all the USB ports stopped working. I have attempted to find the seller, but to no avail.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"USB c port is really slow at charging","reviewDescription":"USB c port is really slow at charging","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Does not stay in socket","reviewDescription":"Wanted to like this as the features are nice but it just does not stay in the decor style outlet and is therefore useless; should have returned but was trying to work with it. If your outlet has the screw in the middle, this can be mounted properly and may be a good option.  But it needs to work with any outlet as advertised.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"USB chargers don’t work","reviewDescription":"This would have been perfect if the USB-A and USB-C chargers worked. This is the whole reason I purchased. It took me a bit to install it but first time installing and it doesn’t work and unfortunately I am two weeks outside of the return window.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Falls out of the wall","reviewDescription":"Do not use this for anything that is sensitive to being removed from power. It falls out very easily so while plugging something else in, it will lose connection and everything will turn off. Go with a better brand, like Anker or something.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"not a huge fan","reviewDescription":"its fits loosely into the existing outlet - felt flimsy. very bulky. Much better off replacing your outlet with one with USB chargers.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Worked great until my USB-C port melted","reviewDescription":"I like the product, I have two of them and it does the job. However the USB-C port melted and stopped working on one unit. The USB-C port is the main thing I use and just to charge my phone.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Very loose 110 outlets.","reviewDescription":"I used this item for nearly two years but must replace it because the 110 outlets are very loose. I tried to take it apart to bend the receptacles but the screw heads are shaped like a triangle.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Bad USB ports","reviewDescription":"Looks nice and fits well but USB ports did not work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Can't use all plugs simultaneously","reviewDescription":"Frustrating that I need to change the USB back and forth to try to get it to work.  The 110 plugs always seem to work, but USB doesn't.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Disappointed ☹️","reviewDescription":"The USB-C port cannot charge my MacBook Pro. It can keep it running if the battery is already charged, but not enough power to charge. Kind of defeats the purpose if you still need to plug a charger in, the internal transformer can’t handle any load on it. Kind of a waste.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Charges everything I need for the next day","reviewDescription":"It hasn’t let me down with being able to charge 2 phone, 2 portable chargers, a flash light, and a mini speaker. All while keeping my lamp and fan plugged in. Very good investment. And I recommend it because of surge protection, the very same week I put this on my wall my neighborhood had a power surge and I just thought thank God I bought this.Update: 2 months in and the usb ports and usb c stopped working. That’s unfortunate but side plugs still work so yeah we had a good sprint but couldn’t do the marathon. Had to drop it from 5 stars to 3.","isVerified":true,"ratingScore":3,"reviewReaction":"22 people found this helpful","country":"United States","date":1695945600000}
{"reviewTitle":"Just fine, until it wasn't","reviewDescription":"This was exactly what I needed in my space, particularly the USB ports. The other day, though, I noticed my phone wasn't charging from the USB-C port, and now it's iffy at best. Since it's outside the return window (I got it two months ago), it looks like I'm stuck. It appears the USB-C just didn't stand up to repeated pluggings-in and unpluggings.The rest of the device is working fine without issue--I'll hold onto it, but I won't be buying another one. I do like that it screws to the wall, though.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"Handy","reviewDescription":"Great idea the only thing is that they’re hard to fit into some outlets.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"very wide","reviewDescription":"It has numerous plug ins for all of your needs.It is wider than a previous similar one that I purchased about 2 years ago that I have in my living room. I wanted to have one one my bathroom as I have just recently got a electric toothbrush, water flosser, and shower speaker that are all USB charging. I thought it would be nice not to have all these USB blocks to juggle.But the thing is so wide that it won't work with the flip switch outlet combo as it blocks the light switch.So to use it, I have to use the alternative plug in across the room. Meaning whole anything charging at it has to sit on the floor!?I thought about swapping out the old one in the living room but it is a light switch plug in combo as well.The price is right though.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Good amount of plugs, but loose fit.","reviewDescription":"Fits loosely into wall even with the included extra long screw. You have to be careful when removing anything plugged into this as the entire device moves\/shifts slightly since it does not fit securely into existing wall outlet (yes, I removed previous outlet cover first).","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Worked great, until it didn’t.","reviewDescription":"Worked great for 7 months and then the upper outlets and USB ports stopped working.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Somewhat uncomfortable as…","reviewDescription":"it only plugs into one of the wall outlets and not both. Worry that if I used all ac plug ins at the same time that the device will become overloaded,","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Good","reviewDescription":"Did not fit my first spot but is working out","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"It almost fits the wall Socket","reviewDescription":"This wall charger has an excellent design and it works very well with a standard outlet.  Of course, as noted in its descriptive data, it cannot EASILY be used with a GDCI (Ground Fault Circuit Interrupter) outlet, such as those found in kitchens counter areas and bathrooms, as those outlets DO NOT have a center screw.  The charger has a lower plastic insert for the \"standard\" lower ground slot on the standard outlet, and the insert is ever-so-slightly lower in the GDCI outlet.  Thus, in order to use the wall charger with a GDCI outlet you will need to remove the lower plastic insert, AND, you may find the outlet slightly looser when mounted to the outlet (because it is only plugged into it).  Nonetheless, IT WILL WORK, and I like mine.  Mine is mounted to a GDCI outlet in my kitchen with some Duct Tape positioned on the back lower area where the insert should have been (firefighter engineering)!","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1673308800000}
{"reviewTitle":"One of three stopped working within a month","reviewDescription":"Got 3 on a good sale price, one of them stopped working in a matter of week. Out of curiosity I popped it open to make sure the others I installed weren't a fire hazard or something, and found the solder holding one of the prongs on the back to the circuit board had come free. Not sure if heat was to blame or just poor soldering, but nothing seems browned or any real danger. Was able to solder it back in place easily enough and it works, but still debating how safe I feel using them.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1690848000000}
{"reviewTitle":"It works very well","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"Very easy to install","reviewDescription":"Brings the bathroom up to the 21st century.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Better than using extension cord","reviewDescription":"Ordered, delivered, installed, plugged cords in, works, great!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Does what it says","reviewDescription":"It’s as advertised. Good pricing and product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Good","reviewDescription":"Excellent plug for all your needs","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Es multiuso y muy fácil de usar","reviewDescription":"Es increíble y muy bonito","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Good","reviewDescription":"Easy to install and work great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Great product","reviewDescription":"Easily installed. Nice design.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Plug with charging station","reviewDescription":"So far so good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Great","reviewDescription":"Does work great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"NO 'fail-to-close' safety feature. Poor clamping voltage. NOT UL listed.","reviewDescription":"You want a surge suppressor to have a 'fail-to-close' safety feature … \"to stop power to your devices once surge protection expires.\" (Alternate related terms for this feature include 'fail-to-safe' or 'fail-to-shutdown' or 'automatic shutdown technology.') Most suppressors DO have it. There is NO mention of this product having any 'fail-to-close' safety feature (1) on this webpage, (2) on the back of the product or (3) in the User's Manual that comes with it. So you can safely assume it does NOT have it.Oversimplified, a suppressor doesn't 'kick in' until the voltage exceeds its 'clamping voltage\/specification.' (Alternative related terms include 'UL1449 let-through' and 'voltage protection rating.') So you would want that number to be lower (to be better). Relying on various online sources, it appears safe to say that 330 volts is common on better suppressors, 400 volts is considered merely adequate, 500 volts is considered to be borderline inadequate. The seller now claims the clamping voltage\/specification for THIS device is 600 volts. Further, there is NO mention of the clamping voltage\/specification for this product (1) on the back of the product or (2) in the User's Manual that comes with it.[ I submitted a question – twice – to the seller asking for the 'clamping voltage\/specification.' Twice the question was ignored by the seller. Meanwhile I saw the seller DID post an answer to three other questions the same day I first inquired. Apparently the seller did not want to discuss the matter of clamping voltage at all. After about a week the seller posted in Q&A, after someone else asked, that the clamping voltage is 600V. ]This product is NOT UL listed. This product does NOT have a UL hologram sticker on it. To get such a listing and such a sticker, the maker must submit sample units to UL for testing that assures the device meets UL standards. The back of the device states \"Conforms to UL Standard 498A.\" THAT is a standard for a wall tap, not a surge suppressor. It is a general safety standard (such as 'designed without sharp edges,' 'designed without parts that children might ingest,' and so forth). IT IS UL 1449 (3RD EDITION) that is the standard to which SUPPRESSORS are commonly held by UL. The maker may claim that the device conforms to some kind of UL standard, but without a UL hologram sticker and listing, the device has not actually been found by UL to conform.I bought this gizmo for an outlet I do not use at all … so I will have a convenient place to OCCASIONALLY recharge cell phone battery chargers, my GPS device and so on via this device's USB ports. I suppose I can trust it to do that from time to time.However, given the opaque nature of the device's actual specifications and ability, as described above, you should NOT assume it fully functions as a true full-featured surge suppressor should. Or trust valuable electronic devices to be fully protected by it as if it does.","isVerified":true,"ratingScore":1,"reviewReaction":"189 people found this helpful","country":"United States","date":1623110400000}
{"reviewTitle":"Fire Hazard","reviewDescription":"Mine that I purchased started sparking and caught on fire 🔥 I was lucky that I was at home, Mine was plugged in my kitchen area, I heard a bunch of weird noises coming from my kitchen, And the plug adapter was sparking and smoking, And started on fire just as I unplugged it, I was scared I was going to get electrocuted. I’m so happy I was home, Had the potential of burning the whole house down. I recently purchased another one that has a built in GFI thinking the power will cut off in case of a malfunction.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1711670400000}
{"reviewTitle":"Not safe","reviewDescription":"Device used security screws, but after popping off the back, I found neither outlet bus was connected to ground. There were clear spots on the board for ground to be routed to the ground-pin, but there was no ground on the boards routing, or with a wire.This makes the device not-safe to use on any device that has a ground, and should not be used on any high voltage\/wattage devices.The use of security screws to deter the examination of the product brings up an ethical question, but it’s not worth my time.1\/10, save your money.","isVerified":true,"ratingScore":1,"reviewReaction":"24 people found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Money wasted on a piece of junk","reviewDescription":"I am glad these other people were happy with their purchase but mine is a piece of junk!  The outlets do not fit any of the plugs on my devices.  I have an iPhone, several iPads, and some medical devices and thought this was going to be the answer to my charging problems but even the normal looking electrical outlets will not accept a plug.  Money wasted!!!  I had to put a star but it didn’t deserve that!","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Not a good product","reviewDescription":"For some reason, these do not work correctly. No matter what you have plugged in or in what slot, it will eventually stop working. It will have to be unplugged and left unplugged for a couple of hours at least. Plug it back in and it will work. This is not acceptable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711843200000}
{"reviewTitle":"ZERO POWER TO USB's","reviewDescription":"I was excited to take this to my camper so i didn't have to take all of the assorted chargers, unfortunately it was useless as there was no power to any of the USB Ports. $10 bucks, threw it in the fire pit. At least that was fun!","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"USB ports do not work","reviewDescription":"All usb ports don’t\/rarely work and when they do work there is a high pitched sound. I wouldn’t recommend. You shouldn’t have an outlet that doesn’t or sometimes works.I tried removing the original outlet cover and over it. As well as different plugs and devices.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"Didn’t even last a year with only light use","reviewDescription":"Love the box love the concept so convenient I ordered it in October 2023 and it went out today March 19,2024. It was only used lightly so maybe just not good quality and the return window is only a month long so that’s not very good.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"HEADACHE INDUCING high pitched, faint whining noise","reviewDescription":"I've been using this outlet extender for a month so far and ever since installing it, I can hear the most annoying, headache inducing whine\/static noise produced from it across the room (the noise became clearer and more apparent the closer I am to it). The noise stopped immediately after removing it from the outlet.If you have good hearing, this thing will definitely annoy you and induce a headache (maybe mine is a lemon, but I've checked other reviews complaining about this) so this doesn't seem to be a random issue.Throwing this in the trash and buying a UL listed outlet extender from now on, lesson learned.","isVerified":true,"ratingScore":1,"reviewReaction":"28 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Can't Plug My Laptop Into This Device","reviewDescription":"I wanted this next to my bed so I could have my light plugged in, my laptop plugged in, and be charging my phone at the same time and within reach. However, my laptop charger plug will not plug into any of these outlets. So I will be returning these, I bought two, one for the kitchen.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"The worst outlet","reviewDescription":"DONT BUY. It can’t stay still on the wall outlet well, it’s loose, so when it moves just a little bit, it got disconnect. And sometimes make noisy like bzzzzzzzzzzzzz. This is the worst outlet I’ve ever use","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Didn't work","reviewDescription":"I bought 3 of them thinking it was the best purchase I've made because of the reviews and the thought of not having to deal with an extension cord. Not only is it really bulky, but also didn't work at all. It stated that works and fit best with my socket and the unit was loose. I only plugged the TV to see if it worked and there was no power at all.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"USB ports did not work","reviewDescription":"The usb ports do not work. I tried different cords different outlets my fiancée took it apart and said the soldering was wrong causing it not to connect. I had given it as a gift and they did not tell me right away so I did not return it just bought a different one for them.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Not right for me","reviewDescription":"I bought to charge my smartphone which has a USB C and this outlet has 1 but charges slow so I can't use it and have to use my fast charger","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Don’t waste your money!!!","reviewDescription":"I thought this was a super idea, and it would be if it worked but when I hooked it up the three bottom plugs do not work!!  So if you keep you can only use the 2 top plugs and the four usb ports!!  If it doesn’t plug in to your wall sockets top and bottom don’t wast your money!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Plugs get hot","reviewDescription":"I have an issue when plugs get hot and have to keep unplugging them and wait awhile till they cool down. Afraid to use any longer, afraid fire might start. Thought this would replace long surge protector. Not worth the money","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Doesn't work","reviewDescription":"Plugged it into the wall, secured with screw. Green light is active in the middle and.......outlets don't work. Tossed packaging, so I'm stuck with it. I would rate it less than 1 if I could .","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Fire Hazzard","reviewDescription":"I purchased this for a cruise in Australia and New Zealand however it  was considered a \" fire hazzard \"and confiscated buy the cruise authority while there and returned when our cruise ended . I do not have the original box but want this returned  as \" never used \"","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Slowest Charge Ever","reviewDescription":"This is great for the number of outlets offered, BUT, it's SO SLOW!!! Check out other options and get one that has faster charging.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"USB ports stopped working as soon as the return window closed","reviewDescription":"Very disappointed - USB ports - all 4 of them, including USB C - stopped working as soon as the return window closed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Some outlets don't work","reviewDescription":"Very unhappy. Some outlets do not work at all....","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Why would Amazon sell a product with safety issues","reviewDescription":"I purchased this for my daughter’s room. I should have read the reviews closely. Multiple reviews mentioning it catching a fire.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Does not work with decor outlets, falls out of outlet","reviewDescription":"Despite claims in the listing and in the insert included with the product, the plug will not work with a decor outlet (the rectangular modern kind with screws at the top and bottom rather than a center screw). This surge protector needs to be screwed in to the outlet to work.I tried two different outlets and even removing the outlet cover but it pops out. And that's even before I add heavy plugs which pull it out more. Immediate return.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Poor quality.","reviewDescription":"Smelled and sizzled like burning internally","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Super Frustrating","reviewDescription":"Every time I unplug my phone it restarts my alarm clock. It’s too loose or something. Once I barely pull on the cord to plug something in or unplug something, it shuts off everything in the device.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"Doesn’t work.","reviewDescription":"It stopped working due to cord being loose in the unit. I can push it back but it will stop working after a bit. I am going to contact seller and hopefully he’ll make it good.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Blow out","reviewDescription":"When I ordered this I thought this was the most amazing gadget ever that was until I plugged it in and used it. The front plugs work and the ones on the sides didn’t. The usb plug worked for 1 day lol. I only had one plug being used and I was so disappointed with this product. I really thought I was on to something but it turned out I wasn’t on to anything.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Bad","reviewDescription":"I bought it new but I received the same item as used, it had scratches and hair in it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Not safe.","reviewDescription":"Received yesterday, smelt something burning today about 24hrs after its been plugged in. This house is also almost 100 years old and I don't usually use these time of items so unsure if it's house electrical itself or product but could of went truly bad if I didn't catch it in time. Be safe","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1696896000000}
{"reviewTitle":"Does not work as wee asi thought.","reviewDescription":"USB port don't work the way I was hoping, would not recommend.  But , might work for you.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Makes a squealing noise","reviewDescription":"It works great except it makes a squealing noise. I wanted to use this next to my nightstand but it’s too loud in a quiet room. Passed my return date or else I would’ve returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"It is defective","reviewDescription":"It caused the connected breaker to trip with the minimum load. The device may have a leaking issue or a short-circuit-ruling-out overloaded outlet. It sparked and smoked. I also know that a brief and small spark can be normal when someone plugs into the unit initially. Returning it. It may just be a bad unit.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"I received a used product","reviewDescription":"This package has clearly been opened and there was hair\/fur stuck in the tape. The item itself is scuffed\/ dirty and has scratches on some of the USB ports. Very disappointed. I don't recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Wall surge protectors dont work on newer outlets","reviewDescription":"Why why why does everything i buy electronically from you guys never work? I want my money back","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"USB ports are junk.","reviewDescription":"USB ports didn't work at all straight out of the box. Trying different USB cables didn't even help.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Non Functional USB Ports","reviewDescription":"The plug worked fine for the first couple of weeks, then I began to notice low to eventually no charge on my devices. The regular outlets work, it’s just the usb ports that completely stopped. The main reason I purchased was because of the USB & USB C port.  Very disappointed, I may have just got a dud.Hopefully, the seller reaches out to me and offers to replace it. If so, I’ll let you know. I’ll also let you know if it works better and the first one was just a dud.","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"USB Ports Do Not Work","reviewDescription":"Bought 1 none of the usb ports worked. I returned it for another and it doesn’t work either.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"I'm sure it's great if you get one that works","reviewDescription":"I received this and only the ports on the left side worked and two out of the four USB work. Will be exchanging hopefully","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Product not as advertised","reviewDescription":"Let the buyer beware.  The product review states that this unit will stay adhered to the wall by replacing the center screw in the wall plug cover.  The problem is that the holes for the screws on most wall plug covers are on the top and bottom of the plastic cover, not in the middle.  These units completely fall out of the wall if you plug them in and do not adhere them with their replacement screw.  The only option is to completely replace the plug in the wall with one that has a set screw in the middle.  The result is that these are basically worthless for most installs.  I have 4 brand new units that could not be installed or returned, so that was a complete waste of money.  Very disappointing.  Buyer beware - no customer service at all, so I advise that you do not waste your money on this product.","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1667952000000}
{"reviewTitle":"This thing sucks so bad","reviewDescription":"I tried to plug a charger, projector, and chromecast in at the same time and it shuts off. This is garbage don’t buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Purchased and can’t use","reviewDescription":"The product probably works well but I can’t know that because of the way it is made were the corners extend in the back it won’t allow the plug to fully insert in the socket. Disappointing when you purchase a product and can’t use it.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"usb-c not enough power to charge my Iphone","reviewDescription":"I bought this for the main reason of having a usb-c port.  The outlets work fine but the ports don't  hold a charge.  After my iPhone being plugged in for a minute it will stop charging. Feel like I wasted my money.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Shorted the first time I plugged it in!","reviewDescription":"Sparked internally the first time I plugged it in. Outlets work but the USB ports don’t which was the original reason I purchased it. Cheap enough that it doesn’t warrant returning so now I’m stuck with a glorified plug expander. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"USB  and USB-C ports do not charge","reviewDescription":"was hoping to charge multiple devices but the USB ports don't charge (even after trying multiple devices and multiple cords)","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Junk beware it shorted out and burnt our wall","reviewDescription":"This thing shorted out and started a fire in the wall where this outlet was installed. It made a loud noise and fried on the wall. If we hadn't been home to shut off the power our house would have burnt down. The receptacle was all melted and brown and black from melting in the wall socket.","isVerified":true,"ratingScore":1,"reviewReaction":"38 people found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Didn’t work","reviewDescription":"I have the standard outlets but it didn’t fit properly. It kept having to be pushed in and held in place for it to work. If it was not held in place it would pop out of the socket. I put the screw that it came with and everything. Bought two of them returning both.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Shuts off when all plugs are full","reviewDescription":"At first this product worked well, but once I plugged in the final device to fill out the AC plugs, it immediately broke and all power lost until I unplugged a device, even though every device plugged in is very low power draw. At least some breaker is being tripped instead of frying everything or causing a fire... Do NOT recommend, go with a reputable brand. There is zero warranty for this no-brand device.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Plug is very loose and won’t connect properly unless you push it against the outlet on the wall","reviewDescription":"I can see a workaround, you can tape it on to the to wall but it’s a stupid solution.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Just didn’t fit right","reviewDescription":"So it was returned. No matter what I did the unit would not lay flush against the wall. The grounding wouldn’t activate. Good idea. Poor design","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Will not stay plugged into outlet.","reviewDescription":"So this definitely works. You plug it into the wall and plugs stuff into it. Simply right? Not really. Everyday I have to go ouch this thing back into the outlet because it’s slipped out. It completely fell out of the wall once. I think the design is just too too heavy to allow the unit to stay plugged into the wall. I’m going to replace this with a standard power strip.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"The USB and USB-C power supplies make much audible noise!  :-(","reviewDescription":"Poor power supply design - in that the integrated USB and USB-C power supplies are audibly noisy.  It is annoying in relatively quite environments, especially if the outlet is located within about 3ft (1m) of the users ears.  Not good.  :-\/","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Doesn’t fit this configuration","reviewDescription":"Perhaps obvious, but should be highlighted that the screw won’t go into outlets with the configuration as pictured. Nor does it fit flush against the wall with these in case you decide to use without screwing on. I doubt the prongs go all the way in as a result. I would avoid if you have outlets as in this picture.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Terrible product","reviewDescription":"I plugged it in every single outlet connector in my apartment and they do work because I have things plugged into them and the green light did not turn on. It did not work in any of my outlets ridiculous.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Just doesn't work","reviewDescription":"I purchased this as a gift so it took a little time to install, but when we did, because of the ridge it touts as a benefit, it did not fit tightly into the outlet and we didn't get any power.  I thought it was the outlet.  In the end, I tried the wall charger in three different houses.  But, in all three cases it did not work.  Unfortunately, the return window closed before I had confirmed the device was broken from day one and not just user error.Also, on the back, it only has one set of prongs making it less stable than it could be in the outlets.I will not purchase from this company again.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"Last 4 months","reviewDescription":"Piece of garbage… bought in December and broken by March. Just enough to last beyond the return window. Don’t buy!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"USB outlets don't work","reviewDescription":"The USB outlets don't work. You better check them out right after you receive your item. I noticed so late, and I missed the return day line.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Didn’t last - USB stopped charging","reviewDescription":"The usb ports stopped working after 3mo of usage to charge various devices like game controllers, headphones, etc.. very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Smoked it on first test","reviewDescription":"Installed on an existing outlet, tried to do a meter test, giant spark and smoke. I bought two of them - not going to even try the other one. Unfortunately my return window closed earlier this week…","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Dangerous fire hazard!!!","reviewDescription":"This is what happened after one year of use.  Only one space heater was drawing electricity through this outlet extender at the time smoke began rolling out.  Not well made.  Very scary situation!!!","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"USB port doesn’t work","reviewDescription":"The whole reason I bought this was for charging my iPad\/iPhone. And everything works on it besides the usb port. My battery kept dying instead of charging. This company that makes it needs to stop selling it until they fix this issue. And I’m definitely returning this and never buying one of these ever again.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Worked for a month, then made noise & quit charging","reviewDescription":"This item was used nightly for charging two phones. We also made use of the electrical outlet for a small white noise machine for the office. Last weekend it started making noise and the light stopped coming on. My husband unplugged it and deemed it unsafe. We are just past the refund period.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"DO NOT BUY","reviewDescription":"This fried our socket causing issues with other outlets on the circuit. Gonna cost me some $$$. ☹️","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Shorting Out","reviewDescription":"Ironically, the surge protector shorted out my devices. I thought it was an electrical issue but apparently it was the surge protector. Of course it's outside the return window so I can't even return it.Short Story: Unless you like fried (broken) iMacs and standing desks, DON'T buy this item.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Does not fit over Decora Outlets","reviewDescription":"It does not fit around the sides over the outlet cover nor is there any way to screw it to the wall. These are only good with the old style Outlets!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Trips the breaker every time I plug it in","reviewDescription":"It's junk.  Buy a reputable brand for this purpose.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Worked, then stopped working","reviewDescription":"I think this fried one of our devices. It worked for about 7 months then completely died. We tried different outlets in the house, different chords but nothing. Would not recommend this product.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Waste of money","reviewDescription":"Green light is turned on but doesn’t charge anything.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Horrible product","reviewDescription":"After one week of use the right upper slot to plug in started to make a loud electrical cracking noise.  Sounded like it was shorting our.  Cannot use due to fire risk.  Scary and not acceptable.  Returning.  Don't buy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Didn’t last long","reviewDescription":"I bought two, and one of the units has already died, about 5 weeks after purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Don’t buy!","reviewDescription":"This won’t stay plugged in so it’s loose at all times & whatever is plugged into it will flicker. Don’t buy it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Almost perfect!","reviewDescription":"The item is great but it is missing the screw it was supposed to come with to mount to the faceplate.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"USB charging ports failed after 3 months.","reviewDescription":"All USB ports failed within 3 months. 115vac ports work so it's back to the plug in adapters.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"50\/50 chance","reviewDescription":"Had ordered 2 to test out and one doesn’t even work the other one is working well","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698105600000}
{"reviewTitle":"Great layout. Certain outlets stop working intermittently","reviewDescription":"This extended has such a great layout, you can actually fit a variety of plugs. Unfortunately, no matter how many times I unplug and plug back in, the outlets do not consistently provide power. This is particularly concerning, as something must be disconnecting or shifting inside to cause this issue. A short on a product like this is not good.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1688083200000}
{"reviewTitle":"Falls out of socket constantly.","reviewDescription":"I really don't recommend this product to anyone, the one we bought falls out of the wall socket all the time and is a pain to deal with, I dislike it so much I would advise anyone interested to choose an entirely different type of model.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688428800000}
{"reviewTitle":"Convenient","reviewDescription":"Convenient for multiple uses but take up entire outlet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Disappointed","reviewDescription":"Couldn't use all the outlets, I had 3 things plugged in: lamp, phone charger cord-no device, watch charger cord-no device, and when I plugged in another charger cord the lamp went out (it did not blow the bulb at least) I had to unplug one, so seems only 3 of the outlets is of use at a time. I did move all the plugs around thinking maybe it was just the one socket but same issue. Not satisfied. It's sturdy enough, I appreciate that it's on the wall and not taking up space on my desk, hence why I purchased it and so I could plug in my computer, phones, watch, lamp, and printer but that's not possible.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669766400000}
{"reviewTitle":"It works - but not as desired","reviewDescription":"The unit is wider that some receptacles and won't fit.  If space is an issue, it won't fit over a standard (smaller) plate.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"Lasted 3 months","reviewDescription":"I loved it while it worked. I received it in early June and it stopped working at the end of August.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693785600000}
{"reviewTitle":"No se mantiene firme","reviewDescription":"Cuando se conectan los cables, se cae... cada vez que vas a despegar un cable también se cae...  :(","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"Good product","reviewDescription":"This is fairly compact, has 5 outlets, hdmi ports and has a built-in surge protector. There is a green light in the center that indicates is working. I particularly like that I no longer need a long surge protector behind my television so now I only deal with long cables and cords.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"A Good Product that Stays in the Wall","reviewDescription":"I love this product. It has 5 electrical  outlets and 4 USB charging ports, one of which is a C charging port. Most of these products only have 2  USB charging ports. The best thing about is:  it has a long scew that comes with it that you screw into the wall outlet so that when you pull out the cord to one of the electronics that plugs into it, the entire device stays in the wall unlike other.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Change your charging game!","reviewDescription":"Imagine keeping all of your lights, tv equipment, routers, etc. plugged in when you need to charge phones or computers.  These things changed my charging game completely!  6 standard outlets on each provided plenty of options for keeping things wired while the 3 standard usb and 1 usb C outlets allow you to charge anything you may need without unplugging anything.  Plus, NO MORE BLOCKS!  No searching for the right one, no remembering to take it out and bringing it with you.  I keep one by my bed and one by my couch.  Perfect fix to a frustrating problem and totally affordable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Amazing start","reviewDescription":"We live in a rental with loose outlets and our landlord refuses to fix them so this is an amazing alternative. I love that it screws in over the plate and CANNOT fall out.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"I need about 10 more","reviewDescription":"Our house is old and doesn't have enough receptacles in any room.  This solves that problem and with the USB charging ports, it eliminates the charging bricks for our phones, tablets, watches...  heck, we even have a keyboard, mouse and handheld vacuum that charges via USB.  Very useful gadget.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Offers many charging options!","reviewDescription":"You can't go wrong with this charging outlet. I like that it is secured by using the supplied screw. All USB outlets have ample power to charge my iPhone, iPad, and photo accessories.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Nice design seems to be well made","reviewDescription":"The enclosed directions were not very useful , I have been in the electrical industry for over 50 years so I did not need directions anyway ,but others might not be so fortunate.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"So convenient","reviewDescription":"I love This thing! We have it plugged in, in our kitchen, and it’s so convenient having 3-4 different cords plugged into it for various charging. I got sick of always running around looking for a different cord so this helped tremendously","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Many options","reviewDescription":"This outlet adapter has so many options for other plug-ins and it is very solid, it hugs the plug in the wall.  Glad I found it!  Great for any multi-use area.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"great all-purpose charger","reviewDescription":"I have several of these at various places in my home.  They are a wonderful place to plug in the regular stuff such as lamps, but also especially useful are the USB ports.  I put one of these in our guest room so guests can plug their devices directly into this charger rather than having to hunt around for a place to plug in their cords and cables.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Dangerous","reviewDescription":"First time I used this product, it burned my plug.  I returned it immediately!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Outlets work but not USB’s","reviewDescription":"I have several of these from another manufacturer and they work great this one however was a let down. The outlets work fine but the USB’s have zero power.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Worked for a month","reviewDescription":"I bought this item. It was working fine for the first month. Now it’s completely shot. Won’t charge anything out of the outlets work. I’ve tried different outlets in my home still nothing. Very disappointing. Stopped working right for after my return window.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Do not waste your Money","reviewDescription":"I wish I had returned this as I planned to do.  It does not stay in the light socket.  There is a weird plastic piece that keeps it from going into the socket.  If you remove it you can put it into the socket but it does not stay in when you put a significant plug in it.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Crackling and smoking","reviewDescription":"Will not buy this again.  Item started to crackle and pop, and smoke came out after just a couple months of use.  Glad we were home.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Hazardous - Danger - Be Careful","reviewDescription":"\"Surge Protector\" literally started smoking and would have started a fire if I hadn't been there to catch it.  Be forewarned, this is a dangerous product.  It was installed properly and not overloaded.  Just a bad product.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Quality & Safety","reviewDescription":"I plugged a speaker and the recliner plug into device. Later in the evening both had no power. Device smells like burnt plastic. I have fire concerns.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Cheap","reviewDescription":"Has a hole in middle to put long screw in but none of my outlets have that hole. So it just falls off everytime I walk by","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Garbage","reviewDescription":"It didn't even last a month. Just died on me for no reason.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Does not work","reviewDescription":"Your charger does not WORK!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"RUINED my Bluetooth speaker. Does NOT charge correctly","reviewDescription":"Burned up my JBL XTREME 3 speaker port. Will not charge and is broken now. Do NOT USE THIS.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Didn’t last last long","reviewDescription":"Wasn’t real thrilled with the single plug installation….that’s a lot of power draw out of a single wall plug. Decided to give it a try anyway as I didn’t expect to use all outlets\/usb charging plugs. The most plug-ins I used were 3 (one led floor lamp, one home phone extension charger, and a single table lamp, 60 watt bulb). Going into the 4th month after purchase the unit stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1695686400000}
{"reviewTitle":"Versatility my butt","reviewDescription":"get another kind these do not fit a standard wall outlet.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Half of the outlets don't work after only 1½ months","reviewDescription":"I've only had this for 1½ months and already 3 of the outlets don't work (the bottom 3). Barely made it past the return window so I guess now I'm stuck with it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Not for everyone","reviewDescription":"item is meant only for sockets with screw in the middle, tried two sided tape and still useless","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"High pitch noise 24\/7","reviewDescription":"This product has been producing a high pitch sound, it is especially loud when I have USBs connected. The only way I’ve gotten it to stop is by unplugging it. I’ve had it for less than a month. Even after unplugging everything it still produces a high pitch noise","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"DEAD ON ARRIVAL...DONT WASTE YOUR MONEY..BUY ANOTHER BRAND!","reviewDescription":"THIS PRODUCT WAS DEAD WHEN ARRIVED AND HAS NEVER WORKED...SAVE Y0UR MONEY AND BUY A BETTER BRAND","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Junk","reviewDescription":"It works but falls out of the plug.... it's bulky and heavy, the plug isn't strong enough to hold it in place. Falls out","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Garbage","reviewDescription":"All usb ports inactive after 43 days of use.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Couldn’t get it to work properly","reviewDescription":"After owning this product for a while, I finally decided, to use it. I already had a multi plug unit in the same outlet, so, I figured it was a win-win and that it would work… Well, I removed the old multi plug unit to put the new one in its place. It will not turn on. I hear a click, then nothing. I wish I had realized this a long time ago so that I could’ve returned the product. Shouldn’t have procrastinated on the use of this outlet.It is a nice unit though. It has multiple outlets and four places for chargers.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"Dangerous.","reviewDescription":"These outlets can burn your house down if you cause a short.  Wires or the outlet itself may break when you screw this item to the outlet.  Have an electrician install.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Used for one month and the USB ports stopped working.","reviewDescription":"I bought several of these. For one of the the USB ports stopped working.  The regular outlets are still passing electricity. I waited too long to return.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Convenient","reviewDescription":"Con for tie spaces has multiple angles. And only has a 4 amp output","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"USB C plug is weak.","reviewDescription":"USB C plug is very weak and plug doesn't stay in very well.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"It is practical.","reviewDescription":"It doesn't have fast charging but it's useful anyway.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"meh technically it worked but not impressive","reviewDescription":"obviously cheap product but I was expecting it to be a higher power to quick charge my items. Instead it was more of a trickle charge.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Not all inputs work","reviewDescription":"The product is a good size and is easy to install. The outlets work just fine, but none of the USB plug-ins work.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"Low output on USBC","reviewDescription":"Takes forever to charge using USBC jack. Otherwise it is great.  Would pay more for one with normal 30 watt USBC capacity","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Dead USB ports","reviewDescription":"Got this a year ago but had it in a spot where I was mostly using its standard plugs and only one USB (A) port (the lower left one, adjacent to the USB (C) port). After rearranging my room I tried to use a second USB (A) port, but got no power. Figuring the demand for the things I was charging might have added up to more than the 4.8 amps shared between the ports, I unplugged one figuring I'd just wait to charge the second item - but the remaining item was still not charging. Eventually, I tested both items on all three USB (A) ports and found that only one (the one I'd originally been using) actually worked.In other words, it's still useful as a standard outlet multiplier, but not much good as a charging station.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1690675200000}
{"reviewTitle":"Hate the green light","reviewDescription":"This product works as you would hope it would but the green light is too bright for my bedroom.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Doesn’t fit outlet","reviewDescription":"Won’t fit into the outlet?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Wouldn't plug all the way in","reviewDescription":"The product would not plug all the way in and made hissing and popping sounds. Its going back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Works when it wants to","reviewDescription":"I couldn't get it to turn on in the same outlets I used for other things.  I checked to make sure they were working, they were.  Put it back in.  Nothing.  I left it alone in frustration.  A few days later I noticed the green light was on.  I began to use it to chege my phone.  Was able to use it a few days and it stopped working again.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1685664000000}
{"reviewTitle":"Might be nice if it stayed plugged in","reviewDescription":"It's always moving or falling out of the outlet. It only comes with one way to screw into the wall so it cant make it sturdier by attaching it to the outlet.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Won’t stay in wall\/connected","reviewDescription":"Constantly has to be jiggled to stay connected and even moving my phone when it’s on the charger plugged into this thing can make it come loose enough to stop charging. Should have returned.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"This will not stay connected to the outlet","reviewDescription":"After about 7 times of putting it back on, and in different outlets, I came to the conclusion that this just won't stay out no matter what outlet you put it, it would be different if it was kinda coming out of the wall but still powder stuff, but it's very annoying having to check if I stall have power because the thing came out of the wall again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Slow charge and you need to screw it secure","reviewDescription":"It only has one plug instead of two plugs to go into an outlet. This issue causes the apparatus to slowly charge phones, smart watches, and other devices. It requires the user to screw the object into the actual outlet as well and some newer outlets don't have screws anymore. This plug in also has a bright green LED light that can't be turned off. It is bothersome at night. One last thing,  it makes this terrible high pitched sound when charging some devices. I DO NOT RECOMMEND.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1677974400000}
{"reviewTitle":"Doesn’t stick","reviewDescription":"This is not a good adaptor. It doesn’t stick to the dual port at all. Even a small weight will unplug it .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Do not recommend","reviewDescription":"If I could give less than 1 star I definitely would. NONE of the USB ports worked from day 1. The outlets worked but we mainly purchased for the extra USB ports and the surge protection, so I have to question if the surge protection even works. A total waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1691971200000}
{"reviewTitle":"Right out of the box, all 4 USBs don't work.","reviewDescription":"This wall charger looks sharp. But the one I received is a lemon. The AC connections work fine. But none of the USB connectors work. I tried charging several USB charged devices. None of the devices showed a \"charging\" status in the USB ports. They worked just fine in the normal AC ports, when I added an AC adapter.  However, the whole reason for this purchase was to be able to charge directly into USB and avoid needing AC adapters. So I am returning this wall charger.","isVerified":true,"ratingScore":1,"reviewReaction":"39 people found this helpful","country":"United States","date":1672704000000}
{"reviewTitle":"All hooked in one","reviewDescription":"Good solid quality","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"3 ..blaah","reviewDescription":"To plug it in,has that dumb 3 thing. To simply plug into 2 hole inlet,impossible. Stupid U.S system ,why to need 3 sticking out to plug in. Otherwise ok,but have to go around the house & buy extra extension cords. So make sure it would even fit","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Works ok","reviewDescription":"It takes a long time to charge phones or tablets or any device you have. Besides that it’s nice to only have one thing plugged into the way with many plug in options.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Doesn't hold firm against wall","reviewDescription":"I like all the outlets, but it only plugs into one outlet and it doesn't stay on the outlet very well when plugging and unplugging cords","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"This product does not work with a GFI outlet.  The stabilizer nub does not line up with the outlet.","reviewDescription":"This product does not work with a GFI outlet.  The stabilizer nub does not line up with the outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"The green light is not for the bedroom","reviewDescription":"The product works as advertised, but the green light is not for the bedroom. Be warned. Very bright.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Unfortunately..","reviewDescription":"I didn't read the details and this product cannot be screwed in into my outlet wall","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"I Must Be Inept and Clumsy","reviewDescription":"I bought 15 of these outlets to install all over our home. Something tells me that they are really good. I’m still waiting to find out for sure. I’ve had them for several months now and have not been able to install just ONE successfully. I spend at least two hours on each installation attempt. Still no dice. With the original plate in place I have been unable to successfully align the screw and the receptacle hole on the base plate.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Elec","reviewDescription":"Works good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Not the perfect fit","reviewDescription":"It looked good out of the box, but once I tried to install it I noticed it was smaller than my outlet covers and basically sat on top of the outlet cover and not snug to the wall. This doesn't allow the prongs to be fully inserted all the way into the outlet and may create an arc hazard.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704585600000}
