{"helpfulVotes":1,"locationId":23753531,"title":"Nice location","lang":"en","publishedDate":"2024-03-29","publishedPlatform":"OTHER","rating":4,"text":"The hotel was clean and room was comfortable.  The location was great with easy access to subway.  Breakfast selection was minimal.  There is no late check out at this hotel and you are charged $25 per 1\/2 hour Staff ","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"5 stars. Would recommend.","lang":"en","publishedDate":"2023-02-26","publishedPlatform":"OTHER","rating":5,"text":"Hotel was recently renovated and everything looked new. Staff was great, rooms were clean, bed was comfortable, water pressure was great, and breakfast was surprisingly good (selection and quality).⭐️⭐️⭐️⭐️⭐️","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"So wonderful","lang":"en","publishedDate":"2024-03-22","publishedPlatform":"MOBILE","rating":5,"text":"The Best Western SoHo was sooo perfect.  Not only was the entire hotel experience spotlessly clean, the service was exceptional.   On the first day of our stay we did not anticipate that it would rain and the front desk kindly offered the let us borrow umbrella.  At every turn the met our needs and more.  We will definitely stay here again.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Would stay again","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":4,"text":"Location at the intersection of SoHo and Chinatown is prime for all the dumplings on one side, galleries on the other. 8 floors, so not super tall, but we heard zero street noise. Get  the 3 person room for extra sq. footage, it’s worth it. The actual pull-out bed is only suitable for a small person with a younger body; so know that going in. Do not put grandma on the pull-out. \n\nThe front desk staff, the housekeepers, the breakfast staff: AMAZING. Every. Single. Person. So hospitable, so accommodating, so welcoming. They all deserve raises. \n\nWe felt cared for, safe, seen, and appreciated as customers.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"A decent stay in New York","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"MOBILE","rating":4,"text":"Room - it was a small without a wardrobe. We stayed 406 which is at the front of the hotel and was therefore nosey hence them providing ear plugs for guests. Bathroom again small without bath (which I knew when booking) \n\nBreakfast - fine, no complaints. Not a massive selection but likewise not small either. Expect toast pastries, egg, yoghurt. \n\nStaff - very friendly and helpful. \n\nLocation - not the best location I’ve stayed in New York but it does have quick access to Canal Street station so you can get most places quickly. It’s not in the part of SoHo I would want to stay. \n\nThere are some things the hotel staff and management can’t change to make this a five star review but it is still a decent stay.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great Hotel For My Business Travel","lang":"en","publishedDate":"2024-03-14","publishedPlatform":"OTHER","rating":5,"text":"Great hotel to stay at while I am in the area for business\/meetings! Clean spacious rooms, great breakfast, and I loved the coffee station in the lobby! The staff is amazing, everyone is friendly and accommodating. I will plan to stay there in the future.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Good Experience at NYC Best Western Soho","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":5,"text":"The location of this hotel is very convenient.  Transportation- NYC subway are close by and sight seeing are all walkable.  Most of all, their staff is professional and very helpful.  The amenities offer are great from their free cappuccino to the daily breakfast.  Highly recommended.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"A personal favorite in the city!","lang":"en","publishedDate":"2024-02-28","publishedPlatform":"OTHER","rating":5,"text":"I work in upstate NY and every 6 months or so like to visit the city to recharge and sneak in some R&R. \n\nThis was my second time staying at this Best Western due to the great location near lots of great amenities and very affordable price for the area!\n\nI had arrived much earlier than expected (around 10am when check-in is at 3pm) and the manager on duty Kaina was able to check me in early with no issues at all. She even recognized me from my last stay 6 months ago which was really special considering how much foot traffic the hotel must see everyday!\n\nThe room was spotless with a smart TV for entertainment and a great high-pressure shower with plenty of clean towels available. Bed was nice and soft and the room had multiple lighting options and great sound insulation from the busy city below.\n\nThe staff was kind enough even to keep my bags safe after I checked out when I wanted to grab brunch before returning home. I want to compliment Kiana, Reuben, and the other staff for making me feel welcome and adding some warmth to the big city. I hope to be back in 6 months!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best Western Plus Soho NYC","lang":"en","publishedDate":"2024-02-25","publishedPlatform":"OTHER","rating":4,"text":"Overall nice hotel. Rooms a little small bit ok. Breakfast decent. Location in SoHo good but closer to Chinatown. Not a lot of shopping nearby. No valet parking so park on street if you can find otherwise have to park in nearby garages. Plus for us hotel was dog friendly. Overall though would recommend based on value for the cost","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"A gem in SOHO","lang":"en","publishedDate":"2024-02-19","publishedPlatform":"OTHER","rating":5,"text":"The staff is very, very friendly and helpful from the time you enter the door. There is a coffee machine in the lobby which we definitely took advantage of. The rooms are clean and modern and I love that there is no carpet. They are smaller rooms which is common for New York. The location is not in the heart of things but there is a subway stop very close by that takes you right up to to Times Square in a matter of minutes.  There is a new Eataly in SOHO a couple blocks away where we ate. The 9\/11 memorial is walkable. The only change to the room I would like is the ability to control the room temperature even by a few degrees. It was a little warm. The breakfast is standard at all best westerns. I wish they could bump up the coffee quality but otherwise it was good. I would definitely stay here again.","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"The best best ever","lang":"en","publishedDate":"2024-02-11","publishedPlatform":"OTHER","rating":5,"text":"Of all the Best Western properties we’ve stayed at the BW+ Soho puts them all to shame! Just an incredible property in an incredible city!! We loved the appointments and the bed was very comfortable. Extremely clean and again one of the best we’ve ever stayed at","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23753531,"title":"Alright","lang":"fr","publishedDate":"2024-02-09","publishedPlatform":"OTHER","rating":5,"text":"Nice hotel, clean, very well located.\nFriendly staff.\nBreakfast offering a limited choice but still very good value for money.\nVery clean room, the little plus is the large veranda type windows, I loved it.\nNo complaints!","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Rubin saved the day and a great hotel","lang":"en","publishedDate":"2024-02-08","publishedPlatform":"MOBILE","rating":5,"text":"Agency Travel office messed up my reservation, there was nothing for me in their system \n\nRubin, the desk clerk took care of getting me a room and got me\nChecked in fast !!   \n\nGreat room, great location \n\nI will stay here again \n\nAnd thank you again Rubin!!","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Amazing hotel and great staff!","lang":"en","publishedDate":"2024-02-08","publishedPlatform":"OTHER","rating":5,"text":"Honestly the best hotel experience I’ve had this far. Kaina was kind and  very welcoming. She was such a pleasure to be around, always making sure that we were well taken care of. The rooms were clean! Thank you so much! Definitely will be back!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Nice clean hotel.","lang":"en","publishedDate":"2024-02-04","publishedPlatform":"OTHER","rating":5,"text":"Awesome customer service. Tom at the front desk was very polite and helpful, accompanied all of needs. The facilities clean and rooms felt the were new updated and modern. Highly recommend. Location is great near subways and little Italy, and Soho.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great all round experience","lang":"en","publishedDate":"2024-02-02","publishedPlatform":"OTHER","rating":5,"text":"The hotel is small, very well appointed and cosy. Perfect hotel if you want to be in a quiet part of town. Soho is great and the hotel is situated on a side road, so limited noise at night. We didn’t hear anything in five nights. hotel staff are very helpful, esp Tom.  \n\nYou will not find a better hotel for a peaceful stay after a busy day sight seeing.","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Perfect stay","lang":"en","publishedDate":"2024-01-31","publishedPlatform":"OTHER","rating":5,"text":"The Best Western Soho Plus was a perfect hotel! Newly built so the rooms were modern and spacious! Perfect location, short walk to china town, little Italy and Nolita! All staff were very accommodating and lovely. Breakfast was delicious. Room heater worked perfectly as we visited mid January. Loved everything about this hotel","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best location & Best Price!","lang":"en","publishedDate":"2024-01-27","publishedPlatform":"OTHER","rating":5,"text":"This hotel is located right between two very accessible subway stations. All the best restaurants in SoHo are within a 10 minute walk both in Little Italy and Chinatown. The room was so cute and just what we needed. Everything was clean. ","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Recommendation to stay","lang":"en","publishedDate":"2024-01-24","publishedPlatform":"MOBILE","rating":5,"text":"The room was so clean, they have room service every day, I do not need to call for clean, it was quiet, near to the subway station,price was nice, 24 hours front desk, free breakfast, very nice to stay. I feel comfortable stay in for the past three days, thank you for the nice service.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Our new favourite NYC hotel","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"OTHER","rating":5,"text":"The hotel is really well located in downtown (SoHo). Although it is a Best Western it get like a chic boutique hotel. Rooms, reception area and gym were modern and very clean. Breakfast was a great bonus for my two teenagers who filled up on eggs, bacon, bagels and cereal each morning. The beds were extremely comfortable and the staff was consistently helpful and friendly. I’ll definitely be back.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Perfect !","lang":"en","publishedDate":"2024-01-20","publishedPlatform":"OTHER","rating":5,"text":"We stayed here three nights the first week of January and had a slightly larger room. The hotel is less than a year old with a super convenient location, easily accessible to the Canal St stations, Little Italy, Chinatown et al.  We also booked a very early morning check-in (slight extra cost) and were immediately appreciative of the amenities and efficient, quiet room design (safe in drawer under bed, ample outlets\/including USB ports, room AC controls that actually work, WIFI, well designed and placed railings in the accessible bathroom design, in-room coffee machine and fridge), Desk and food service staff were consistently helpful and greeting guests.  Housecleaning well done.  Thank you.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great place!","lang":"en","publishedDate":"2024-01-20","publishedPlatform":"OTHER","rating":5,"text":"This hotel was clean, breakfast was great and the staff was amazing! Shout out to Eugene for going over and beyond in his customer service! Will definitely stay here again! The location was perfect for us, walk to Little Italy, Tribeca and Greenwich Village!  Full breakfast, loved the cappuccino machine in the lobby!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Wonderful stay in New York!","lang":"fr","publishedDate":"2024-01-18","publishedPlatform":"OTHER","rating":5,"text":"Very clean hotel. Good breakfast. Well located in Soho. Complete metro station very close to the hotel, whatever line you are looking for. The center of Soho is very close. The Whitney Museum accessible by foot, when the weather is nice. Close to a large number of very good restaurants.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Eugene was awesome!","lang":"en","publishedDate":"2024-01-18","publishedPlatform":"MOBILE","rating":5,"text":"This is an excellent budget hotel. Prices are decent and the amenities surpass most of the 4* hotels in the area. Gym is adequate, there is a free breakfast, and complimentary coffees (cappuccinos) in the lobby. Rooms are small but completely functional and clean. Noise is an issue, but you are in NYC. Invest in some earplugs, they make a difference! \nLastly a big shoutout to Eugene who helped with some cosy duvets when we mentioned our room was on the cool side. He went above and beyond. So nice and friendly.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great stay!","lang":"en","publishedDate":"2024-01-18","publishedPlatform":"OTHER","rating":5,"text":"Hotel and rooms are very clean! Front desk staff are friendly and accommodating. Breakfast selection was perfect and area very clean. Always coffee in lobby. We love the location, as between soho and chinatown. Very close to subway stop. Stay here, you won’t be disappointed! ","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great price\/quality and amazing service","lang":"en","publishedDate":"2024-01-15","publishedPlatform":"OTHER","rating":5,"text":"Let me first say that the price\/quality is a great deal. You stay in a great location with lots of nice restaurants and metro stops (very) nearby that take you almost anywhere in Manhattan in just 10-25 minutes. But that's definitely not all. The rooms are very new and clean and the breakfast is tasty. Not very high level, but just a good start of the day.\n\nThough best of all is the service. The people at the reception are incredibly friendly and our best contact was definitely with Eugene. What a great guy. He really made our stay. Would 10 out of 10 recommend this place to anyone going to NYC. 👍","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Like brand new","lang":"en","publishedDate":"2024-01-12","publishedPlatform":"OTHER","rating":5,"text":"My room was so clean and comfortable it seemed brand new. The staff were over the top nice. The location was great. The breakfast was comprehensive. And the cheapest price around. I will be going back for sure.","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"The “BEST” Best Western “PLUS” Hotel you could wish for!!!","lang":"en","publishedDate":"2024-01-02","publishedPlatform":"OTHER","rating":5,"text":"Have to start by saying all the staff especially Karina, were exceptional. They went over and above to help with a major issue we had with our reservation through Booking.com. We booked the hotel via Booking.com however they had not bothered to check with the hotel before confirming our room and on arrival, we were shocked to discover the hotel had no record of our reservation and were fully booked!! Karina called Booking.com whilst we were there to try and resolve the issue however they refused to accept any responsibility and blamed the hotel which was complete rubbish as Booking.com had over booked and left us high and dry without a hotel. \nKarina took it upon herself to call local hotels to get us a room for the night and then proceeded to sort out our initial reservation for the remaining 5 nights back at the Best Western. To this day I don’t know how she did it but we are forever grateful to her and her team that went out of their way to make our stay hassle free ! We would definitely return and book directly in future as would advise anyone to AVOID BOOKING.COM!!!!\n\nI would also recommend this hotel due to the location, staff, cleanliness, value for money, amenities AND THE STAFF!!! Although the room was a little on the small size, it has all you need for a short break. If I could make any improvements, possibly a wardrobe as it was a little tight living out of our suitcase. \n\nJust another BIG thanks to all at the Best Western and you were fantastic!\n\nThanks \nAngie\n\n","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Stay in December 2023","lang":"de","publishedDate":"2023-12-31","publishedPlatform":"OTHER","rating":4,"text":"The location of the hotel is very good in terms of the distances to various subways on Canal Street. \nThe hotel and the rooms are well maintained and cleaned properly. \nThere is a free water dispenser and a coffee machine in the lobby. We made plenty of use of both. \nThe breakfast was a pleasant surprise (even if you eat from paper plates).","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great Price! Great Location!","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"OTHER","rating":5,"text":"The hotel was in a great location close to metro stops and shopping! Staff was friendly and helpful! They even stored our bags after check out while we spent time in the city! Would definitely stay again!","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Awesome place to stay in NY","lang":"en","publishedDate":"2023-12-27","publishedPlatform":"OTHER","rating":5,"text":"It feels like a brand new hotel, clean and with a great complimentary breakfast with reasonable options, which was a good surprise for us. The Staff is very friendly; the Location is good, near SOHO and Chinatown, with yellow and green lines nearby.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Incredible","lang":"es","publishedDate":"2023-12-27","publishedPlatform":"OTHER","rating":5,"text":"Pleasant and nice stay, a special mention to the Front Desk to Eugenio, who received us and gave us very friendly attention during the days we were at the hotel, thanks to him we felt very comfortable, especially because he speaks Spanish as well, in addition, He provided us with maps, reviews, recommendations, etc., very helpful. Something that we also liked a lot was the coffee machine, which had many varieties and was included in the stay. It was perfect for these cold days.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Good rates, comfortable, clean, good service and good breakfast. I give them a 5star","lang":"en","publishedDate":"2023-12-25","publishedPlatform":"OTHER","rating":5,"text":"One of the best hotel I have visited this year, very clean, Good breakfast and friendly staff. I will surely visit you again. I had the the best experience ❤️❤️. I recommend it, if you looking for comfort then this is the place.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great location with helpful staff and good breakfast","lang":"en","publishedDate":"2023-12-20","publishedPlatform":"OTHER","rating":5,"text":"We needed a place to stay in Dec and chose Best Western Soho for it's proximity to 911 Memorial and Museum, Tenement Museum, Little Italy and Chinatown. Also very near subways to Broadway shows, Radio City Music Hall, and Rockefeller Center. Special shoutout to Kaina Marte, Operations Supervisor. She helped us with a smooth check in, answered all our questions during our stay, and helped with everything we needed.\nWe had a great 4 day stay with good breakfast!\nMary","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Relaxing","lang":"en","publishedDate":"2023-12-17","publishedPlatform":"OTHER","rating":5,"text":"Staff are so helpful, good location and clean facilities . Very quiet and feeling safe around the area. We didn’t have the hard time locating for restaurants, surrounded by all ethnics. Shopping is no question too, just around the corner of SOHO where all the stores are.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Christmas trip","lang":"en","publishedDate":"2023-12-10","publishedPlatform":"OTHER","rating":5,"text":"This hotel was in a great location. Near China Town, Little Italy, 9-11 museum, World Trade Center. It was really easy to navigate around the city from this area. The room was super clean and the staff was amazing. Will stay here again for sure! ","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great Experience in NYC","lang":"en","publishedDate":"2023-12-07","publishedPlatform":"OTHER","rating":5,"text":"Had a great experience at BW Soho. Close to subway and bus lines, blocks to the Chinatown and Little Italy.  Can take bus to 911 Memotial and Museum.  Hotel is very clean and modern. Great breakfast to get you started.  Staff is very helpful and friendly!!  Would book agsin.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Recommended. Great location and stuff","lang":"en","publishedDate":"2023-12-04","publishedPlatform":"OTHER","rating":5,"text":"We had a great experience staying in the hotel. Nichole explained everything we needed to know at the reception. Breakfasts were good to start a new day without wasting time looking for a place to eat. The location is perfect: a few subway lines and direct one to JFK. It was loud one night outside due to Halloween, but it was just a specific day and warm weather for parties outdoors. I'd stay there again without doubts ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Recommended! ","lang":"en","publishedDate":"2023-12-01","publishedPlatform":"OTHER","rating":5,"text":"We really enjoyed our stay at Best Western Plus Soho Hotel. The hotel felt safe, was clean, staff friendly and helpful. The breakfast was a typical american breakfast with waffles, egg and bacon, bagels, yoghurt etc and it was easy to find something you like. The location is good. No doubt we stay here next time we go to New York. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Clean and friendly hotel with a few small issues","lang":"en","publishedDate":"2023-11-26","publishedPlatform":"OTHER","rating":4,"text":"Brand new, small hotel with clean and spacious rooms for NYC.  Friendly staff and decent breakfast.  Swanky looking rooms with a Scandinavian feel.  Beautiful bathrooms.\n\nThe hotel is not actually in Soho though - it's just off Canal Street, on the border of Chinatown and Tribeca.  Walkable to many attractions in Lower Manhattan, but not the nicest neighborhood (lots of garbage on the streets and homeless people).  \n\nI would give this hotel 5 stars, but we had two major issues.  The room we stayed in did not allow us to control the temperature and we were VERY HOT at night. A maintenance person adjusted it for us the next day and said that any room ending in 01 (ex: 701) controls the temperature for the entire floor.  So anyone in one of these cannot adjust the temperature (there is a lock box over the thermostat).  This is a function of the way the hotel was constructed, so there is nothing to be done (apparently).  Why on earth would you construct a hotel that way?\n\nThe second issue was the sofa bed, where our son slept. It was comfy, but every time he moved it would creak really loudly.  That kept us up at night as well.\n\nI wanted to love the hotel but we didn't sleep well due to the temperature and the noisy sofa bed.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Me encantó!!","lang":"es","publishedDate":"2023-11-21","publishedPlatform":"OTHER","rating":5,"text":"Mi estadia fue por un par de días, realmente me sentí muy bien. El Hotel es muy acogedor, la habitación muy tranquila y cómoda cabe destacar la limpieza del hotel en general es excepcional. En la recepcion puedes servirte tu café o agua en cualquier  momento.  Los desayunos están increíbles 🤤. Personalmente me encantó. Todo el personal que trabaja en el hotel son muy amables, muy cálidos en su trato. La ubicación está muy bien, puedes encontrar cerca muchos restaurantes, tiendas y parqueaderos. \nEn relación con el precio 10\/10. \nSuper Recomendado. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great and clean place to stay in NYC","lang":"en","publishedDate":"2023-11-20","publishedPlatform":"OTHER","rating":5,"text":"Great and safe location, close to many metro lines. Room was well cleaned everyday. All staff was very friendly and helpful, would like to say good words about administrator Sasha, she was incredibly helpful, prepared list of restaurants and small cafes nearby where she recommend to have a meal(with approx price range), as well this trip was birthday gift for my boyfriend and they made small but very nice greeting for us in the room. We are very happy that we decided to stay in this hotel! Highly recommended ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"A recommander sans réserve","lang":"fr","publishedDate":"2023-11-15","publishedPlatform":"OTHER","rating":5,"text":"Hôtel situé dans un rue calme (malgré quelques embouteillages à certaines heures) au croisement de Tribeca, Soho, Chinatown et Little Italy, et très proche des stations de métro. Les locaux sont neufs, fonctionnels, la propreté remarquable. Chambre très agréable et calme. Le personnel est très cordial et à votre écoute. Le petit déjeuner est varié, de bonne qualité et très complet. J'aurais préféré un bar cosy à la place d'une salle de sport, mais cela n'engage que moi...Bref à recommander sans réserve.\n","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Kaina was great...","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"OTHER","rating":5,"text":"Everything worked well in the whole hotel - and we got a very great help from Kaina Marte... We look foreward to come back to New York and the very nice hotel... Walker Street is very close to everything on Manhattan...","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Friendly staff, decent no-frills accommodation ","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"OTHER","rating":4,"text":"Compact room but clean and quiet. Staff always friendly and helpful. Not a lot of choices for eating and drinking in the local area, but very close to many subway lines. Complimentary breakfast was basic, but decently maintained. Refrigerator in the room was welcome. ","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"3 days in New York","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"MOBILE","rating":5,"text":"We had 3 days here although the room was small it was very clean . Breakfast was decent . We were 10 min walk to little Italy and china town . The young lady at the front desk gave us a list of her favourite restaurants. She did not disappoint. This made our first trip to New York even better .","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Hôtel au top !","lang":"fr","publishedDate":"2023-11-02","publishedPlatform":"MOBILE","rating":5,"text":"Séjour du 27\/10 au 01\/11. Hôtel super bien situé, proche métro et de plein de restos\/bars, et aussi des boutiques.\nLa chambre est super jolie, propre, le personnel au petit soin.\nLe petit dej est simple mais efficace. \nSi nous devions revenir sur NY nous reviendrons ici sans aucune hésitation !","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great hotel great service and great location","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"We really enjoyed our stay here, the hotel was clean, modern and well maintained. Staff were consistently helpful. The room is well equipped with a fridge and coffee machine. Free coffee and tea in the reception too. Easy to book cans via the curb machine in reception. Helpful staff ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Modern, safe, and thoughtful hotel. I recommend.","lang":"en","publishedDate":"2023-10-23","publishedPlatform":"MOBILE","rating":5,"text":"Second time staying. Lovely cozy new hotel. Clean and modern. Finally a glass door shower that does not leak water outside. Staff is very sweet and helpful. Kaina the super visor especially and Sasha. Will come back again. Lots of good food choices nearby. Chinese food of course plus cafes. Anejo has great Mexican food nearby. 7\/11 and Starbucks right there. Also fruit market on the same street little cup canal st. On weekends. It’s on the snug side of hotel sizes but perfect for two people. So clean and thoughtful. Only one thing I wish was better, more sound proofing between rooms\/hallway but not a big deal. Feels peaceful and safe overall. I would recommend for solo travelers too.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"My October Stay ","lang":"en","publishedDate":"2023-10-18","publishedPlatform":"OTHER","rating":5,"text":"Awesome reception at the front desk even though I arrived and checked in late at 11:30 pm , The room is neat cozy and the pillow the fluffiest I’ve experienced, A Shout out to Sasha at the front desk who always cheery helpful and has such a great vibe ","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Walker street","lang":"en","publishedDate":"2023-10-18","publishedPlatform":"OTHER","rating":4,"text":"New, modern, comftarble and very clean establishment, very helpful staff, breakfast and hot beverages included. Location is excellent for exploring the lower Manhattan, financial diatrict, and waterfronts by foot","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Exemplary Customer Service Staff","lang":"en","publishedDate":"2023-10-11","publishedPlatform":"OTHER","rating":5,"text":"A beautiful & new hotel in SoHo Tribeca\nThe customer service was outstanding!!!\nHuge KUDOS to Kaina, Sasha, Gio, and\nthe customer service staff in the \nBreakfast Center !\nSuch exemplary professionals !\nCourteous, helpful, very kind, and \n💯 % willing to make your stay there memorable !\nIf I travel to NY in the future, I will definitely stay here again !!\n\n","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Canal Street Hotel","lang":"en","publishedDate":"2023-10-10","publishedPlatform":"OTHER","rating":4,"text":"I booked last minute, planning to stay an extra day in NY. The hotel\/rooms are new and clean. The receptionists are very friendly and helpful, especially Sasha. Breakfast options were not good, there was very little low-carb, high protein options and the coffee was tasteless, vending machine quality. My room was very hot, even when I turned the thermostat temp down so I slept with the window open, listening to the loud New York street noises. This is right off Canal St, between Little Italy and Chinatown, walking distance to the Brooklyn Bridge.","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Good New York Location","lang":"en","publishedDate":"2023-10-09","publishedPlatform":"OTHER","rating":4,"text":"Great location to branch out to many parts of New York City.  Rooms facing the street are noisy, but they supply ear plugs.  Breakfast was adequate.  Good, friendly staff who are helpful and knowledgeable.  We would stay here again.  ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Nuovissimo albergo tra chinatown e little italy","lang":"it","publishedDate":"2023-10-09","publishedPlatform":"OTHER","rating":5,"text":"Albergo nuovissimo vicino Canal Street. Tutto pulitissimo e negli standard Best Western. Acqua e caffè sempre disponibili nella hall, colazione ottima (purtroppo nelle 4 notti in cui abbiamo soggiornato non faceva il forno quindi solo colazione continentale), camera grande per gli standard di NYC, ma soprattutto vicinissima a tutte le linee della metro possibili.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Excellent Acommodation","lang":"en","publishedDate":"2023-10-06","publishedPlatform":"OTHER","rating":5,"text":"The night we checked in, the front desk (Nichole) did an excellent accommodations especially with my adult autistic son.She made us very comfortable after the long travel we had.She is very loving.She put us to the room I wanted near elevator and a great view. \nI also met other hotel employees and they are also accommodating and friendly ( Kaina, Gio, Cristina,Delcy and Evan. \nThe hotel is super clean and still new. We are looking forward to go back to NYC in 2024\n","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best Western Plus Soho ","lang":"en","publishedDate":"2023-10-05","publishedPlatform":"OTHER","rating":5,"text":"The Best Western Plus Soho is a good property. The staff is outstanding. A shout out to  Kaina, Nichole, Thomas and Sasha at the front des for making us feel welcomed.  The room was immaculate \nBreakfast was convenient and great   There is a subway stop very close and in Chinatown we enjoyed Shsnghi 21\nLittle Italy is a short walk away.  I recommend the Best Western Plus Soho","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great, simple hotel","lang":"en","publishedDate":"2023-10-05","publishedPlatform":"OTHER","rating":5,"text":"The location might not fit everyone, the rooms are not the biggest, and definitely not fency, but we loved it! A minute walk from the subway, Chinatown, little Italy, the village. And most important: the friendliest team, mainly Nichole and Ray, folks that it feels that they're enjoying what they do. ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best hôtel ","lang":"en","publishedDate":"2023-10-04","publishedPlatform":"OTHER","rating":5,"text":"I received a warm welcome. The room is large for this category of hotel. The room smells of wood with wood floors and walls. Nice modern bathroom. The hotel is brand new. USB sockets on the walls and very good free wifi.\nThe best hotel I had had in Manhattan","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great place to stay","lang":"en","publishedDate":"2023-10-03","publishedPlatform":"OTHER","rating":5,"text":"We stayed 2 nights at the hotel while visiting NYC.  The rooms were very clean, nicely accented and worked well for our visit.  The hotel lobby was very nicely decorated and the free breakfast was very satisfactory.   The location is an easy walk to the financial district and Chinatown and is close to the subway.  Our flight didn't depart until evening, but the hotel manager, Tom, took our bags and offered to let us use the breakfast area to relax before heading to the airport later that evening.  Thanks again Tom!","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best front desk! ","lang":"en","publishedDate":"2023-10-01","publishedPlatform":"OTHER","rating":5,"text":"I really loved the concierges there. They were very responsive and fast when I had requests. They were friendly and I loved hearing Sasha’s journey through EQ training and communication with people. \n\nThe other concierge gave me an umbrella to borrow too when it was raining the entire time. \n\nHotel is clean and staff is so friendly and quick to resolve any issues. Love this stay here!","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Wonderful!!","lang":"en","publishedDate":"2023-09-28","publishedPlatform":"OTHER","rating":5,"text":"The hotel is very nice, simple but extremely cleaned. It has the perfect location near to everything.  It is very easy to move around since the hotel is just a couple of blocks from different subway stations.  Including the one that takes you to the airport.  The Manager Mr. T.  Carpenter is extremely helpful to guide you, and he is always available.  The staff at the front desk, as well as, the staff  in charged of the breakfast area are very kind and willing to help you anyway they can.  The breakfast is simple but it changes a little bit everyday.  I recommend it 100%.  Good price for a good quality 👍👍","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"NYC trip","lang":"en","publishedDate":"2023-09-26","publishedPlatform":"OTHER","rating":5,"text":"Such a lovely stay here! They have all the amenities you could ask for including complementary breakfast and a gym. I love how after 9pm you have to use your guest key to enter the hotel lobby, made me feel very safe during my stay. Not to mention the the wonderful service from the front desk, Sasha, very polite, professional, and quick to get us taken care of!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"2 nights","lang":"en","publishedDate":"2023-09-26","publishedPlatform":"OTHER","rating":5,"text":"Spacious room and very courteous staff. Sasha was an exceptional front desk attendant and was always friendly  and helpful. \nBed was great, good shower pressure, the only issue was the tv remotes did not work well. ","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"So quiet and friendly , comfortable beds ","lang":"en","publishedDate":"2023-09-23","publishedPlatform":"MOBILE","rating":5,"text":"Excellent hotel , wonderful staff . Gio was so kind and happy all the time even on the night shifts . Comfortable beds , quiet with no noise at nights , block out blinds . Rooms where an adequate size for two twin beds . Little fridge in the room , cleaning staff where polite . Really enjoyed our stay and we will be back ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"A Great Stay!","lang":"en","publishedDate":"2023-09-22","publishedPlatform":"OTHER","rating":5,"text":"My stay at the Best Western Plus Soho was as good as I could have hoped for. The customer service is top of the line. The service started before I even arrived, as they made sure I was all set prior to coming and that I knew what to expect. I stayed one night, and was given an early check in (or I could have left my bags with the staff). The room was very clean and comfortable and the night's sleep was perfect. Couldn't hear any outside noise. After checkout, I was able to leave my bags at the front desk for a couple of hours as I tended to business and then came back to get them. Would highly recommend and if I'm back in the area and need a hotel, I will be staying here again.","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great Stay","lang":"en","publishedDate":"2023-09-22","publishedPlatform":"OTHER","rating":5,"text":"Great location, we liked closeness to Tribeca and Piers for a walk in the sun.\n\nThe Hotel was Fantastic, the breakfast exceeded our expectations, the hotel was kept very clean and all the team we met were super friendly and helpful.\n\nRooms great.","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Eccellente hotel","lang":"it","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"Hotel con camere molto confortevoli e super letto. Anche la colazione è di buon livello.\nIl personale è super. \nLa zona ti permette di vivere New York in modo diverso dal solito centro turistico. \nCamere insonorizzate ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best Western was a good stay","lang":"en","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"I enjoyed my stay at this hotel. The customer service was excellent, the breakfast was decent, and the room was clean. Everyone that worked there was so polite and helpful. The only thing I can say that was unsatisfying was the sink water was brown anytime I turned it on. And they have a gym but I didn’t use it.","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Very clean, front desk\/management was incredibly polite, nice, helpful, fast, efficient, accommodating, friendly, etc","lang":"en","publishedDate":"2023-09-17","publishedPlatform":"OTHER","rating":5,"text":"Super clean, staff, front desk, management, all were extremely kind, helpful, accommodating, super helpful, fast, efficient, just all around amazing.  Especially Gio and I forgot the female manager\/front desk associate.  ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"A 3-star hotel, but actually at a 5-star level!!!!!!!","lang":"en","publishedDate":"2023-09-17","publishedPlatform":"OTHER","rating":5,"text":"The stay was totally perfect, in every aspect ! \nService providers, from the workers at the reception desk to the workers in the dining room and the room attendants, were very helpful and nice! The location of the hotel is excellent, close to all the surrounding neighborhoods within walking distance! The free breakfast was absolutely fine, and the coffee machine in the lobby is amazing and very high quality! And most importantly, we mentioned that it was our wedding anniversary and they  prepared us  a romantic and charming surprise in the room, including complimentary drinks and snacks!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Fantastic place well located","lang":"en","publishedDate":"2023-09-16","publishedPlatform":"MOBILE","rating":5,"text":"Thanks for making my stay so great. Well located and super clean. Breakfast is also super good. Staff is really good and friendly. Special thanks to Gio and Karina for their above expectations professional attitude. Keep going you’re making this place awesome","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great stay","lang":"en","publishedDate":"2023-09-15","publishedPlatform":"OTHER","rating":5,"text":"Staff was so friendly and helpful even with our middle of the night arrival! Everyone was very accommodating. Location was good as it was also important that we were able to find parking within walking distance. Lots of shops and food in the area. We were also accommodated with a late checkout.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Amazing staff!","lang":"en","publishedDate":"2023-09-13","publishedPlatform":"OTHER","rating":5,"text":"Amazing staff. Really went out of \ntheir way to assist us. The Hotel is perfectly located, clean and pleasent but the jewel on the crown is the friendliness and helpfulness of the staff.  A real pleasure. \n","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great stay👍","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":5,"text":"Very friendly staf, Nice rooms and decent breakfest. Hotel is super clean.\nPerfect location near some subwaystations to explore New York.\nWe had a very pleasant stay for 4 nights, next time we keep this hotel on our list👍","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Clean, location and service were top notch!","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":5,"text":"The best was comfortable, room was modern and very clean, breakfast was tasty and plenty to pick from, location was wonderful and the team on staff were simply amazing! All a win! Would stay again and definitely recommend.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Friendly and Helpful","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":5,"text":"The bed is comfortable and the pillows soft and fluffy. The shower felt very nice, as well. The housekeeper did a great job cleaning and tidying the room every day, and the front office staff was very friendly and helpful.","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Quiet, spacious stay","lang":"en","publishedDate":"2023-08-22","publishedPlatform":"OTHER","rating":5,"text":"Very quiet location, spacious for the city. Not a bad price! Great hospitality.\n\nCheck in was simple and there seemed to be someone at the desk at all hours of the night. Would definitely stay again!!","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Beyond Expectations","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":4,"text":"Bed was small for a Queen but super comfy. I love a walk in shower and water got really hot. Kinda hot in the room the first night, not sure why we were so uncomfortable but the second night we slept more comfortable and the AC felt so nice. Breakfast was a nice surprise, didn’t expect so many options. Thankful that we were able to drop off our luggage and Sasha at the front desk was sooo nice! The whole staff really, even in the morning during breakfast some of the staff came by to say good morning and kitchen staff was really nice too, always had a smile :) We knew we weren’t getting housekeeping since we stayed two nights but they still knocked to offer towels. Everything was beyond expectation. Area feels safe coming in late night. So close to multiple trains. 99cent pizza across the street. I only gave 4 starts bc the bed felt a lot smaller than a queen size. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great experience! Clean!","lang":"en","publishedDate":"2023-08-20","publishedPlatform":"OTHER","rating":4,"text":"The best water pressure in shower on a hospitality property I’ve seen, and I have been to many over the years!  Nicole is amazing! She is friendly, listens to guests, knowledgeable, gentle and efficient.  Professional!  Had similar experience with Delcy this morning despite our brief interaction.  Hot, free breakfast with great variety.  Short walking distance to Canal street subway stop. Walking distance to Little Italy for dining and other options. Very clean. Modern finishes.  Firm comfortable bed.  Smaller room but space used well. Would return. Would recommend!","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great Spot! ","lang":"en","publishedDate":"2023-08-20","publishedPlatform":"OTHER","rating":5,"text":"10\/10 would recommend! The staff is beyond accommodating, friendly and professional. They let me know when my room was available early, before check in, so I could rest before a reservation. They offered complimentary breakfast! The room was spotless and the overall hotel was clean. The general vibe was chill and quiet. It is in a good location, walking distance to cool museums and food spots. Will definitely be staying here again! ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Not Bad","lang":"en","publishedDate":"2023-08-19","publishedPlatform":"MOBILE","rating":5,"text":"Everything in New York is expensive, for a small room at almost $300… i am unsure about how i feel.\n\nRoom was spotless and quiet. We stayed on the 6th floor. They dont have body washes but soap. The soap leaves a feeling behind after using it, i only used it for my hands because of that.\n\nThe staff are always corteous and friendly. Kaina was very welcoming and so was the other hostess. The guy who handled luggages was also helpful.\n\nThere are three subway stations near the hotel which is good and we felt safe while we walked around. \n\nLiked the idea of making your own waffle. Breakfast was ok, it was enough. It made up for the price point ;p\n\nMight think twice about staying again.\nI may need to research more about other areas and other hotels.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"A Very Pleasant Stay","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"MOBILE","rating":5,"text":"The hotel was wonderful. The staff was wonderful. Beds and pillows very comfortable. Bedding was heavenly. Hotel safe and secure. Only admittance after 9pm is with your room key. Rooms were spotless and new. Entire hotel was spotless. Bathrooms lovely and small yet plenty of storage and shelves to put products. Great selection of in-room shampoo, soaps, etc. On the first night we were delivered a lovely little snack basket for our stay with a hand written thank you note. I live in the NY Metro area and work in NYC. This trip was so my daughter could get to her ballet intensive around the corner. She’s 14 and I felt very comfortable with her being alone coming\/going mid-day with the staff present while I was at work. They continually asked her if she needed anything. Also included with our stay was a lovely breakfast of eggs, meats, veggies, potatoes daily with other quick options line yogurts, cereals, fresh muffins and pastries, juices, etc. Highly recommend the Soho Best Western Plus.","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Clean and comfortable","lang":"en","publishedDate":"2023-08-16","publishedPlatform":"OTHER","rating":4,"text":"Very clean, free hot breakfast, room was comfortable, good water pressure in shower. They provide ear plugs, because it is loud, request room not street facing if you can. Close to canal st and little Italy. ","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"BW Plus  Soho","lang":"en","publishedDate":"2023-08-15","publishedPlatform":"OTHER","rating":5,"text":"Excellent hotel. It’s new and immaculate. Our room had a very comfortable bed.  The shower had great water pressure.  We loved the breakfast buffet that is served until  10 am. The staff is friendly and helpful.  We felt welcomed. We’ll return. Thanks so much Kaina and Nicole at the front desk are wonderful ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Nytt, moderne, rent og effektivt.","lang":"no","publishedDate":"2023-08-15","publishedPlatform":"OTHER","rating":4,"text":"Nytt, moderne, rent og effektivt. Ikke veldig store rom, men god nok plass til bagasje og personlige eiendeler for en uke. Vi er en familie på 5 og hadde 2 rom. God og variert frokost. Svært hyggelige og hjelpsomme ansatte både i resepsjon, renhold og ved frokost. Ligger i et sentralt og spennende område både med tanke på shopping, t-bane og restauranter.  Mvh Anne med familie","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great hotel","lang":"en","publishedDate":"2023-08-13","publishedPlatform":"OTHER","rating":5,"text":"The hotel is situated in a perfect place where you can go to Chinatown or little Italy jump on the subway to go to time square or the Bronx. The hotel was clean the beds were comfortable and the staff was amazing. Always willing to assist.\nI will definitely come back and stay at Best Western Plus Soho.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Pleasant Stay","lang":"en","publishedDate":"2023-08-11","publishedPlatform":"MOBILE","rating":5,"text":"We were in NYC for our honeymoon and we loved our stay at Best Western. The staff was very professional and incredibly helpful. A special thanks to Nichole, Deky and the rest of the staff which welcomed us during our stay. Breakfast was good, but I personally did not like the coffee (maybe the only improvement point). Overall I strongly recommend the hotel also for his convenient location, next to many subway stations.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best of the Best(Western)","lang":"en","publishedDate":"2023-08-11","publishedPlatform":"MOBILE","rating":5,"text":"As I Best Western Rewards Diamond Select member- the highest rewards tier possible- I have stayed in many Best Westerns across America, over 50 nights in the last year alone. One Best Western stands out above all: The Best Western Plus Soho in New York City. And it’s not even close- this sparkling gem in Manhattan is the crown jewel of the BW family of hotels, and in my experience ranks first in every category you can name.\nFirst off, it’s the cleanest hotel I’ve ever set foot in. Yes, it’s just under a year old, but every time I ventured out of my room I saw staff meticulously cleaning in a way you just don’t see- once I saw two employees scrubbing the grooves below the elevator door with toothbrushes! Every inch of the place looks like brand new, and in NYC that isn’t an easy feat. The entire staff here seems to pitch in, and what a friendly, welcoming staff they are! As a Diamond Select level BW Rewards member, I am used to getting a little extra customer service, but the warmth of these employees surpassed all expectations! The people at the front desk were so genuinely sweet and accommodating, welcoming me cheerily and asking me how my stay is going and do I need anything every time I passed through the lobby. Then I met Tommy, the hotel’s general manager, and I realized that warmth and  professionalism starts at the top. What a nice guy! He, like all the staff I encounter during my stay, seemed genuinely concerned about my stay being as pleasant as possible, and I’ll tell you, it was, thanks to Tommy and Co.\nOne of my favorite aspects of staying at BW is the free breakfast buffet, and here’s another category where BW Plus Soho knocks it out of the park. One morning they served breakfast burritos, which had never sounded good to me before, but boy was I wrong if they are all as delicious as the ones Isaac the breakfast guy made. They were amazing! And like everyone else there, Isaac was super nice and genuinely solicitous about making sure everything was great, and it was! I even accidentally ate a vegetarian breakfast burrito made with imitation meat, and until I realized what it was, between you and me, I liked it! They have many delectable options in their beautiful breakfast area, and as always, it was complimentary with the nights stay. What a way to start my day! Hats off to Isaac and crew.\nThe one negative I can say is there are only around 50 rooms, and with the wonderful experience one has staying there, you can imagine those rooms sell pretty fast, so book in advance. Thank you Tommy and staff of the Best Western Plus Soho for my best hotel stay ever! I will be back, I hope sooner rather than later!","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Excelente hotel volvería mil veces","lang":"es","publishedDate":"2023-08-10","publishedPlatform":"MOBILE","rating":5,"text":"El mejor hotel ! Realmente es un hotel nuevo en excelentes condiciones y con muy buen gusto ! Si bien las habitacion son chicas son muy cómodas y tienen hasta Netflix ! El desayuno es excelente con juegos frescos y todo lo que puedas necesitar . Aún así lo mejor es el personal ! Zandelle en la recepción hizo todo lo posible para mimarme ! Me dejaron entrar antes ya que tenían una única habitación disponible y hasta me ayudaron a arreglar mi zapatilla que se rompió en la caminata ! Autora también muy amable que tuvo la amabilidad de mandar a comprar  el pegamento . Cristina en el desayuno muy agradable también ! Realmente una experiencia para sentirse como en casa.","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Spent a great NYC vacation week here!","lang":"en","publishedDate":"2023-08-07","publishedPlatform":"OTHER","rating":5,"text":"My boyfriend and I enjoyed a small, QUIET, clean room here. Great location, plenty of restaurants and shopping in the neighborhood. The staff was super friendly and helpful. We'd absolutely stay here again!","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great Hotel in the center of Chinatown ","lang":"en","publishedDate":"2023-08-07","publishedPlatform":"MOBILE","rating":4,"text":"Great hotel just in the middle of Chinatown and only like 3 minutes away from Canal Street subway station.\n\nBreakfast could offer a little bit more choice, but besides this everything was perfect.\nStaff was extraordinarily friendly and supportive.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Helpful and Friendly Staff","lang":"en","publishedDate":"2023-07-31","publishedPlatform":"MOBILE","rating":5,"text":"The front desk and breakfast room staff members were helpful and friendly.  I use a mobility scooter and the staff went out of their way to be helpful. Isaac carried my coffee, made delicious waffles for me and delivered them to my table when he noticed that it was challenging for me to navigate the breakfast buffet.  Kaina who works at the front desk was friendly and warm, helping to make my visit to NYC a positive experience. Thank you!","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Amazing Stay!","lang":"en","publishedDate":"2023-07-31","publishedPlatform":"OTHER","rating":5,"text":"Oh I almost hate to leave a review cause it will sell out-lol!! This property is like coming home for me and for someone who travels constantly, that’s a big deal. I absolutely love this space and it certainly rivals the boutique hotels in the city.\n\nThe decor is absolute stunning, cleanliness is beyond excellent, service is impeccable (thank you Tom, Nichole, Kaina, Zendalye and Rayonce), the amenities come in handy and the area is so convenient. I can walk almost anywhere and if it’s too hot to do that, the trains, buses, ferry are all close by. \n\nI truly appreciate the dedication to customer satisfaction and precise attention to detail. It makes a huge difference in the experience guests have.","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"A perfect stay","lang":"en","publishedDate":"2023-07-29","publishedPlatform":"OTHER","rating":5,"text":"It was clean, well managed and extremely comfortable. The pillows and bed were very comfortable. The breakfast was very good too. Everyone was welcoming and efficient. We also want to give a special shout out to Nicole for giving us a beautiful anniversary basket in our room with snacks and drinks. It was a very sweet surprise. We will definitely be staying here again in your next trip into the city.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Loved my stay here","lang":"en","publishedDate":"2023-07-24","publishedPlatform":"OTHER","rating":5,"text":"I loved my stay here. Clean, modern design; room was very quiet and comfortable, small but space to move around. Staff was helpful and friendly. Their complimentary breakfast was tasty, breakfast area was always clean and well stocked, options changed daily and was fresh.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great hotel in Soho and staff that makes a difference!","lang":"en","publishedDate":"2023-07-19","publishedPlatform":"OTHER","rating":5,"text":"Second time for me, great hotel, good location, very nice breakfast buffet. Clean and well equipped room but above all - great customer service, staff is always very nice and courteous. Specifically Zandalee (Sasha) went above and beyond and was extremely helpful during my stay. Definitely coming back!","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great location in SoHo\/Village area at a decent price!","lang":"en","publishedDate":"2023-07-19","publishedPlatform":"OTHER","rating":5,"text":"I stayed at this hotel for one night in March-23. Very clean and fresh hotel with a very good location if you like the neighborhoods around SoHo and Greenwich Village etc. Quite small rooms but that is also the case in most hotels in NYC. Good breakfast buffet. Very reasonably priced unlike most things in Manhattan. Helpful and friendly staff. Would definitely return.","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Compassionate & caring, staff went above & beyond!","lang":"en","publishedDate":"2023-07-14","publishedPlatform":"OTHER","rating":5,"text":"Everyone at the front desk were so kind & extremely helpful. I cannot thank them enough! I just had leg surgery a few days earlier & ran out of chux (waterproof bed pads). I told the woman at the front7 desk & she told me not to worry! Within an hour, she contacted me to let me know that she was able to obtain some chux for the duration of my stay! Impeccable customer service & beautiful, very clean hotel. Thanks to everyone one there, so kind!  Jason T.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Good for the price","lang":"en","publishedDate":"2023-07-10","publishedPlatform":"MOBILE","rating":4,"text":"Good points:\n- modern and clean\n- price\n- size of room (we stayed in a suite)\n- fast internet\n- 2 large tvs (but only 1 remote)\n- very friendly check-in staff at reception\n- close to subway\n\nRoom for improvement:\n- the sofa bed for our daughter was noisy, lumpy and uncomfortable. It needs a mattress topper otherwise the springs can be felt when sleeping ( and she doesn’t weigh much). \n- 3 of us in the room but towels for only 2 people were supplied.  Asked for more towels but only supplied extra towels for 2 more days (we were staying 3 more). \n- we could not change the air conditioning as the control unit is locked behind a Perspex box. The room was really cold when we first arrived and the thankfully the box was unlocked so we could set it to heat and 70. The next day the box was locked and set to 74 and cool which was ok.\n- breakfast buffet was very hit and miss.  First day was good with plenty of food. The next day there was 1 bottle of fresh milk left, no fruit yoghurts and no more available as apparently they were waiting on a delivery. One cereal container had run out and was not replenished. The next day we could see the milk delivery on the floor and we waited for it to be made available for guests to use but it never was. I had to ask for 2 bottles but none was ever put out for the other guests. The last day was fantastic - change of personnel and suddenly there was an abundance of food again - lots of milk and the cereal was replenished.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Stay here!!","lang":"en","publishedDate":"2023-07-07","publishedPlatform":"OTHER","rating":5,"text":"This was a great stay! All of the staff were helpful, kk d and happy! The hotel was clean and the staff took pride in keeping it clean. The rooms were small but very nice. The breakfast changed a little daily. ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great Stay in SoHo","lang":"en","publishedDate":"2023-07-06","publishedPlatform":"MOBILE","rating":5,"text":"The location cannot be beat. The women who checked us in were absolutely fantastic. Erica Ascanio and her team made us boys feel right at home. Can’t wait until our next stay. The rooms were extremely clean. Once again, I cannot overstate the location. You walk out the door and you are surrounded by SoHo, little Italy, Chinatown and TriBeCa.","travelDate":"2023-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"My great New York experience","lang":"en","publishedDate":"2023-07-01","publishedPlatform":"OTHER","rating":5,"text":"This hotel is a hidden gem in New York. It’s walking distance from canal street; little Italy and china town. The hotel manager and staff were very professional and accommodating.   When my cab pulled up in front of the hotel, the manager immediately greeted me; and assigned my room. The rooms are small, but very clean. The breakfast was very good. I was only there for two nights, but I enjoyed my stay and will return. As stated this hotel is located in the best parts of New York. There was a walk in customer who only wanted to stay one night they found a room for him and didn’t raise a fuss or look down at him for his last minute decision. There are only 52 rooms in this hotel so if you are interested in stayed here plan to book early. ","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Wonderful hotel!","lang":"en","publishedDate":"2023-06-30","publishedPlatform":"OTHER","rating":5,"text":"The hotel room was clean, clean, clean!! Awesome front desk staff who were so friendly and helpful!! Breakfast had a wide selection of food, hot, and varied day to day! We would stay here again for sure!","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"This hotel is gorgeous","lang":"zhCN","publishedDate":"2023-06-28","publishedPlatform":"OTHER","rating":5,"text":"你好！I came from China. I lived Best Western Plus Soho Hotel by chance. I have stayed here for 27 days since JUNE . I 'm really fond of here.The staff are very  friendly and enthusiastic! The front reception named Erika is very approachable , polite, friendly very great! and She is good at communicating. I like her very much! \nThe hotel is quite clean and neat. There are all kinds of facilities including free wifi ，a safe ,an iron and so on .The room is cleaned every day.  I feel comfortable here.I like the breakfast. They offer a lot of rich food. Everything here is beautiful! Next time  I will still choose this hotel！\n2023年5月30日我从中国来到纽约。开始时入住民宿。但由于噪音太大卫生环境较差难以忍受无法入睡不得不退订。从入住就沟通2天才解决。损失一大笔费用最后搞定。深夜朋友又帮我预订酒店。怀着忐忑心情进入酒店，办理入住。进入房间第一感觉房间好小。后来感觉越来越好。房间干净整洁。灯光充足。床两边配置插座和usb接口。还有个带USb接口的时钟。真是太棒了！床头桌上有咖啡机。房间床下有保险箱很隐蔽。有熨斗和烫衣板。卫生间有吹风机。洗护用品很不错，用后头发顺滑。酒店早餐丰富品种多。蓝莓酸奶是我的最爱。酒店免费提供健身房，几手每晚都去。哈哈哈😄😄😄最后尤其要提到是这里工作人员都非常友好！无论前台接待人员还是早餐室配餐人员、清洁人员等都非常善良热情友好！面带笑容，易打交道。这里特别感谢前台接待人员她的名字叫Erika。她是个十分热情热心的人，态度非常非常友好，易沟通好相处！可惜我的英语口语听力不好，只能简单简单交流！我喜欢她。我非常喜欢这里！喜欢这里每一个人👍👍👍希望下次再来时还可以入住。强烈推荐大家住这个酒店！","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Very pleased","lang":"en","publishedDate":"2023-06-27","publishedPlatform":"OTHER","rating":5,"text":"I was a guest at the Best Western SOHO and I recommend it highly.  For New York City this place was a great deal for the price.  I took my wife there to celebrate our anniversary and she was very pleased.  The rooms were comfortable and clean. The staff was very friendly and what I personally enjoyed most was that it is located in a swank neighborhood. There are plenty of nice restaurants, bars and coffer shops within walking distance. We did not need a car for our stay.  And we were not afraid to walk the street each night.  If you are staying in Manhattan I recommend the the Best Western Soho. ","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Empfehlenswert","lang":"de","publishedDate":"2023-06-25","publishedPlatform":"MOBILE","rating":5,"text":"Wir wurden sehr freundlich empfangen. Ein sehr sauberes Hotel mit gutem Frühstück. Das Hotel liegt in der Nähe einer U-Bahn Station, so dass man alle Sehenswürdigkeiten schnell erreichen kann. \nBeim nächsten Besuch in New York würden wir das Hotel wieder buchen. \nSehr empfehlenswert!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"GREAT LOCATION, PRICE, STAFF, & AMENITIES in SOHO!!!","lang":"en","publishedDate":"2023-06-22","publishedPlatform":"OTHER","rating":5,"text":"I was in the city for some TV taping and choose this hotel for the price and location... it had only been open 5 months, too! It resides on a cute little street...seemed quiet and I was in a front facing room. It is in a GREAT LOCATION in Soho!! The hotel is at the Canal St. Subway Station. It pretty much resides in Chinatown and is just a short walk to the Brooklyn Bridge, Ghostbusters Headquarters, and WTC\/Battery Park...with just a short walk to great food in the neighborhood as well! I loved that there was a 7-11 around the corner on the way to the train, too! The staff at this hotel were super friendly and the hotel was super clean! I loved the fresh filtered water dispenser in the lobby and had a super cool latte\/coffee machine, too! The breakfast offered had an awesome spread as well! This place was great for the price and rooms were well thought out! \nThanks for a good nights sleep and NYC experience, Best Western Plus, Soho! I will be back!","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"My new favorite place to stay in NYC","lang":"en","publishedDate":"2023-06-18","publishedPlatform":"OTHER","rating":5,"text":"After a long commute from the Catskills to NYC, I arrived at the Best Western in Soho a couple of hours early from my bus ride and didn't know what to expect as so many other hotels I've stayed at were very strict with their check-in times.\n\nThe manager Erika welcomed me with a great smile like and helped me check in early which let me get some much needed rest from my 3+ hour commute. She gave me a little tour of the lobby which is equipped with comfy seating options, coffee machines, and looked spotless. She made me feel like family and not just another guest.\n\nWhen I got up to the room, everything was very clean and the room was plenty spacious for what you usually find in NYC. There was a TV with access to streaming apps (Netflix, Youtube, Pandora) and a nice little sitting area with a desk and plenty of outlets to charge up. There were also a variety of lighting options to choose and blackout curtains to drown out the lights for a good night's rest. Bed was large and very comfy with plenty of pillows and warm sheets.\n\nThe bathroom was immaculate and came with plenty of clean towels to freshen up before heading out, and the little amenities like the citrus shampoo and conditioner were great as well.\n\nThank you Erika and Best Western for making my city trip special and I look forward to my next stay!","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Good location","lang":"en","publishedDate":"2023-06-14","publishedPlatform":"OTHER","rating":4,"text":"I stayed at this hotel on the front and back end of a long trip for a layover. The first stay was good, the room was ready when I arrived. I was given a room facing the street and it was noisy around midnight as the many trucks were in the area. Also the AC wasn't working too good and I called the front desk and was told someone would look into it, but my room was warm all night. On my second stay I was given a room in the back of the hotel and that was great because there was no street noise. Also I arrived early and my room was ready and the AC was much better this time. Breakfast has a good selection of food. The location is near lots of restaurants and a busy subway stop. The rooms are clean. The room is small, best for solo travelers.","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Shining from the inside out!","lang":"en","publishedDate":"2023-06-12","publishedPlatform":"OTHER","rating":5,"text":"Location -10! Subway is RIGHT THERE as well as so many gems to walk to!\nErika- amazing multi tasker, kind and efficient!\nCarlos- he takes pride in cleanliness that hotel GLEAMS! He had some amazing clean windows and he's always smiling!\nLastly Chef Issac- little touches in the breakfast I can see\nFresh asparagus? Potatoes with spices and peppers- not the usual bland food service types- (you know, the flavorless ones screaming to be touched with salt or pepper)\nIssac takes pride in his area \nEverything was restocked quickly-\nNo sticky surfaces\nEverything got to temp and just wow!\nKudos to your staff there\nWe'll be back!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"The place to stay in nyc","lang":"en","publishedDate":"2023-06-12","publishedPlatform":"OTHER","rating":5,"text":"The cleanest well designed, excellent service and perfect location.\nIf you want to stay for a decent price in NYC,  That’s the one.\nOn top of that excellent breakfast.\nDon’t expect a large room, but it’s perfect for two. ","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Loved my stay!","lang":"en","publishedDate":"2023-06-06","publishedPlatform":"OTHER","rating":5,"text":"This was a great stay. I’ve stayed in many hotels but this one stood out so I had to write a review. Loved the Hospitality, cleanliness, and most of all the pillows felt like I was sleeping on clouds. I need me some of those!!","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best Breakfast in the area","lang":"en","publishedDate":"2023-05-28","publishedPlatform":"OTHER","rating":5,"text":"I have to say, This is the first time I like breakfast from a hotel. The staff is very professional and friendly. I stay for 4 nights and had a great time. the Manager Ericka, nicole, and kaina always greet us every time they see us. Great service, good location.","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"When in Soho","lang":"en","publishedDate":"2023-05-17","publishedPlatform":"OTHER","rating":5,"text":"I hate to give Soho Best Western a 5 star rating because I don't want everyone to stay here..haha..but I have too.\nLocation is fantastic a walk away from Little Italy and Chinatown. 1 min from the Subway.\nThe staff were incredible..kind helpful and so very friendly.\nDefinitely will stay here again on my next trip to NYC!!!!!!\nWith love and thanks from Canada 🇨🇦 ","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"GREAT LOCATION, CLEAN & FRIENDLY, KNOWLEDGEABLE STAFF!! Little Italy, China Town and Brooklyn Bridge a short walk.","lang":"en","publishedDate":"2023-05-10","publishedPlatform":"MOBILE","rating":5,"text":"We enjoyed this location very much. Little Italy is within a couple blocks, plus Chinatown and many other NYC must see places are well within a short walk. The Brooklyn Bridge, Washington Bridge, the Subway are all nearby. My room was quaint, but clean and efficient. They do have larger rooms and if you get on the higher floor (8) you can actually see the top of the Empire State Building. My room was quiet, because it was on the 4th floor, which worked fine for me. My friends room was higher up, and a bit noisy when the window was open, but clean. The front desk, and continental buffet staff were wonderful. We only went for breakfast once, but it had a nice variety. There is a gym too, that looked decently equipped. The lobby is nice. There are no restaurants in the hotel, but really no need as there are plenty of them right there, in little Italy and Chinatown. It was easy to spot our hotel when walking back, with a couple great landmarks like the TD bank and 7-11 store right there. The neighbourhood felt safe too. I will be back for sure.","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Excellent For Everything","lang":"en","publishedDate":"2023-05-10","publishedPlatform":"OTHER","rating":5,"text":"Excellent customer service. I was a solo traveler with a bike and had a problem finding a taxi or uber to take me and my bike.  The staff arranged a ride for me and even helped me to get the bike in the taxi! Kaina, Nichoel, Adriel and Erika were the best!  They were even excited for my bike ride!  Hospitality at its finest!  My room was clean and really band new!  Highly recommend!","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great option except brown facet water.","lang":"en","publishedDate":"2023-05-07","publishedPlatform":"OTHER","rating":4,"text":"The space is small but has everything you need. Very clean and modern..would recommend. Staff was very knowledgeable and helpful.  Centrally located for stores and resturants. Only negative is that the facet water was brown when you first turned it on. ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"⭐️ ⭐️⭐️⭐️⭐️","lang":"en","publishedDate":"2023-05-04","publishedPlatform":"OTHER","rating":5,"text":"FANTASTIC 5 STAR EXPERIENCE \nEverything in the hotel is immaculate!\nRecommend staying here for anyone.\nIt’s walking distance to every site in soho, downtown and many great restaurants around.\nBest value in the city.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"I’m definitely coming back","lang":"en","publishedDate":"2023-05-02","publishedPlatform":"OTHER","rating":5,"text":"The hotel is totally new! The breakfast is superb - the best I’ve ever eaten at a best western. The bed is great, the quiet side of the hotel is completely quiet - no street noise! The rooms are all new and beautiful. Bathrooms are super swank. The service from all staff is wonderful. Shout out to Erica, Kaina, Adriel, Tom and Michael. Shopping and restaurants are two blocks away. ","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Pet and Family friendly hotel ","lang":"en","publishedDate":"2023-04-27","publishedPlatform":"OTHER","rating":5,"text":"My daughter and I spent two nights. We also brought her dog. They were very accommodating to us and her gig was the first one to stay in the hotel since they went Pet Friendly. The hotel is located nearby to nice restaurants, cafes and bars. Subway access is around the corner. ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great room and service at amazing price","lang":"en","publishedDate":"2023-04-25","publishedPlatform":"OTHER","rating":5,"text":"The staff at Best Western was excellent. Tom, Isaac, Kaina, David, all very nice and super helpful. \nI was really surprised by how they want above and beyond to accommodate different needs that might arise during a stay.\nI really liked the room, which was always super clean and comfortable. I thought the gym was super comprehensive and the free-breakfast really good.\nI've stayed before at more expensive boutique hotels in the area that have all these useless gadgets or look cool and the service is not good, breakfast is not included, and most importantly, staff isn't as professional.\nI will be staying at Best Western Plus, SoHo again on my next work trips in June and October.","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Homelike the  Best Western Plus Soho Hotel near Chinatown, great location. Stay here will be a great option.","lang":"en","publishedDate":"2023-04-21","publishedPlatform":"OTHER","rating":5,"text":"Very nice new renovation room like home with the comfortable bed, I like the lights under the bed, and unexpected the window can open to let the fresh air comes in. \n\nThe host is very warm and friendly, generous giving us extra complimentary breakfast after our long journey arriving the hotel in the early morning. ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23753531,"title":"Great price for a new and clean hotel","lang":"en","publishedDate":"2023-04-20","publishedPlatform":"OTHER","rating":5,"text":"So nice to stay at a newly renovated and beautiful hotel for a reasonable price. \n\nBed was very comfortable. Lighting was tasteful and the room was simple, clean, and stylish. \n\nTommy at the front desk was a treasure, and I really felt welcome and happy in a fancy part of town. ","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"All Star Service","lang":"en","publishedDate":"2023-04-19","publishedPlatform":"MOBILE","rating":5,"text":"This is a great place to stay. I had booked a different hotel and was not able to check in because they had a problem with the company card. I found the Best Western SOHO and Adriel made me feel welcome. He made sure to work out my reservation and got me a place to stay. Without him I would have been on the street for the night!","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23753531,"title":"Excellent customer service ","lang":"en","publishedDate":"2023-04-16","publishedPlatform":"OTHER","rating":5,"text":"I had a last minute overnight in the city. Nichole at the front desk was extremely patient in helping set up my reservation. Excellent customer service. The room was clean and comfortable. Thank you!.","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Friendly staff, but not eco friendly","lang":"en","publishedDate":"2023-04-15","publishedPlatform":"MOBILE","rating":4,"text":"Excellent location.  Staff friendly.  Rooms confortable.  We had an excellent time in NY city!  The only reason why I’m giving 4 stars vs 5 is because they are using disposable dishes at breakfast.  Not eco friendly at all.  Also having Gluten Free bred in the freezer would be a little plus for Cœliaque people like me.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"Una joya en NYC","lang":"es","publishedDate":"2023-04-11","publishedPlatform":"MOBILE","rating":5,"text":"buena ubicación, hotel nuevo. personal amable. habitacion de tamaño ok para NYC. todo limpio. cama muy comoda. hay caja fuerte y amenities en el baño, secador de pelo incluido. buena ducha. cambio de toallas diarios. buen aislamiento del ruido de la calle y una cortina blackout en la habitación permitieron que durmieramos muy bien todas las noches. el desayuno es un plus. limpieza de habitacion diaria sin problemas\n\nEl unico comentario negativo que le haria es que los huevos del desayuno, no eran naturales, eran deshidratados. solo ese detalle podria mejorar lo demas todo ok","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Excellent place to stay if you want a clean, comfortable, spacious room with accommodating staff and new, modern room","lang":"en","publishedDate":"2023-04-04","publishedPlatform":"OTHER","rating":5,"text":"I have nothing but good things to say about Best Western PLUS. \n\nI selected this hotel because the location was ideal, being easy walking distance to where I needed to go. It is set right around Chinatown\/Soho and plenty of nearby shops, restaurants, subway station, etc. it’s great for anyone looking for the Chinatown shopping experience. Very walkable and easily navigated for even the novice NYC visitor. The hotel, I believe is pretty new, or at least recently renovated. Very modern, city chic decor which was pleasant compared to the dated design choices you see in some hotels. The color palette and patterns are calm and non-stimulating. \n\nThe rooms are especially large for what you’d expect to find for this price point in Soho. I stayed in a single queen room and had plenty of space to move around. Bedside desk with chair which was great for getting some work done or dining in.  Closet area with plenty of hangers and clothing bags for garments as well as a shelf above, ironing board\/iron and luggage stand. They truly optimized space in the design of this room. Platform bed with trendy lighting underneath, as well as trundle style drawer on either side of the bed, one of which had a safe. Bathroom was gorgeous, glass shower door, bowl sink, comfortable modern toilet and adorable glass shelves for toiletries. Smart TV with options for cable as well as some streaming services. I used Netflix and had no issues. Multiple locks on the door as well as covered peephole made me feel safe. No window view, but to be expected in the area at this price. It is worth mentioning that I did have a large window with two sets of privacy shades, one which allowed filtered light and one which provided black out, which is great for getting sleep during the day. The bed was very comfortable, clean linens, soft fluffy pillows that are easy to adjust to level of preferred firmness. \n\nI ordered in food delivery and front desk called to ask if I’d like the delivery brought to my door or if I preferred to come down to the lobby to grab it myself. It’s a minor detail but something I appreciated. I also had a friend who visited while I was there and they had him wait in the lobby for me to confirm I was expecting a guest. Again, minor detail but in the interest of safety for a solo traveling woman I appreciated this. \n\nCheck-in was quick and easy, taking only a few minutes which was nice because I was on a time crunch when I first arrived. I did call ahead to request early check-in and was told it was an option, for a fee, based on availability, but they offered the option to hold my bags if my room wasn’t ready. When I arrived they were able to accommodate early check-in, thankfully. I was checked in at front desk by Erika Ascanio, who greeted me with a warm and welcoming smile. She was very pleasant and helpful, answering any questions I had. There’s something to be said about encountering professional hospitality after a long trip, and Erika certainly was able to provide that. \n\nAfter the first night, I had a mid-morning obligation and went out for a few hours. When I returned I found that my room had been made up. Bed was made, towels restocked, trash emptied, surfaces wiped down etc. I was glad they’d made quick work of using the time I was gone and it was refreshing to return to a clean, tidy room. \n\nI stayed for one more night and then checked out early the next morning to return home. I was helped by Thomas Carpenter at checkout, and he was just one of the nicest people ever. Very personable in a genuinely authentic way. He made it a point to remind me of their complimentary breakfast, which I would’ve gladly taken advantage of had I not been eager to get on the road. He also gave me his business card for my next stay. The friendly interaction really set the tone for my day, and I was able to leave the hotel and get on the road for a long drive in a good mood thanks to his kindness. \n\nAll in all, this hotel is ideal for travelers that don’t necessarily want to pay overly high prices, but still want to get the NYC vibe while having a clean, safe place to lay their head that’s in a great Manhattan location. I’ve stayed in a few different hotels in this same area and this one ticks all of the boxes for affordability, comfort, safety, and space. The genuinely lovely, friendly, helpful staff is icing on the cake. I would recommend staying here, and will be booking here again when I return in June. ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23753531,"title":"Muy buen hotel","lang":"es","publishedDate":"2023-04-04","publishedPlatform":"OTHER","rating":5,"text":"El desayuno tiene tiene mucha variedad. El hotel está siempre limpio, nuestra habitación muy cómodas con neveras, planchas TV, caja de seguridad. La chica que es manager la veíamos por todos lados. Fue a saludarnos a todos al desayuno y ya luego la mismo en el front desk y en la tarde ayudando a limpiar el frente. No recuerdo su nombre pero es hispana cabello rubio negro muy simpática. ","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Really nice, new and clean hotel in the city","lang":"en","publishedDate":"2023-03-25","publishedPlatform":"OTHER","rating":5,"text":"Hotel was really nice. We stayed there for an entire week to explore the city for the first time and it was great. The hotel manager and other staff members were lovely and very helpful when necessary. Rooms were very new and they were cleaned everyday. The location is also very good. The subway is a few min walk way and you’re really connected to the city. The hotel is in walking distance of the Brooklyn bridge and the financial district. Breakfast is included which is nice. I would definitely recommend staying at this hotel when you’re visiting New York. ","travelDate":"2023-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Recommended for a nice stay in NYC","lang":"en","publishedDate":"2023-03-18","publishedPlatform":"MOBILE","rating":5,"text":"Great location close to Chinatown and Tribeca. Easy access to subway. The room is smallish but very clean and comfortable. Nice shower. Amenities are great. Nice coffee in the lobby 24\/7. Very friendly and helpful staff especially Lathan. Nice breakfast.\n","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Highly recommended","lang":"en","publishedDate":"2023-03-15","publishedPlatform":"MOBILE","rating":5,"text":"This hotel is great and clearly recommended. Very clean, lovely staff, nice room (the bed was extremely comfortable), good breakfast. There’s coffee all day, and the coffee is very well drinkable ( this coming from a European not easy to please concerning coffee). Very quiet, even though in the city.  The location is perfect, subway right around the corner and in walking distance to the best parts of the city.\nWe‘ll be back next time.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"New York march","lang":"en","publishedDate":"2023-03-08","publishedPlatform":"MOBILE","rating":5,"text":"Great location and extraordinary service provided B-Y the hotel team . Delicious breakfast .the rooms are very clean .Temperatures excellent considerin how vols was the City. The reception is very comfortable and you can buy some food as well","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23753531,"title":"Ottimo hotel","lang":"it","publishedDate":"2023-02-25","publishedPlatform":"MOBILE","rating":5,"text":"Hotel confortevole, nuovo, ben arredato,  cambio asciugami quotidiano, staff molto gentile e pronto ad aiutarti. Posizione ottima, ci sono varie linee della metro, anche per andare in aeroporto. Buona la colazione. Caffè caldo sempre disponibile. Consigliato!!!","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Best place in SoHo","lang":"en","publishedDate":"2023-02-24","publishedPlatform":"OTHER","rating":5,"text":"Great place to stay!! I love the staff, and the breakfast. My stay with the friends was perfect because of the great service provided. The rooms are confortable, the area is safe and is close to everything. ","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23753531,"title":"Elite Client Service & Cute Chic Hotel","lang":"en","publishedDate":"2023-02-13","publishedPlatform":"OTHER","rating":5,"text":"amazing stay at this hotel! It exceeded my expectations. The location is perfect, and it is super close to the metro! The hotel just opened last month so everything is brand new, the hotel is a great price considering  all the amenities. Hotel staff memebers are attentive to detail and were extremely helpful. This hotel demonstrates what elite client service is. I would definitely recommend staying here","travelDate":"2023-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23753531,"title":"6\/5 stars","lang":"en","publishedDate":"2023-01-30","publishedPlatform":"MOBILE","rating":5,"text":"AMAZING HOTEL!! Opened just a month ago!\nBreakfast, Housekeeping, Reception staff are all super stars! \nNo matter the time of the day you will always see the staff with a smile on their face which is just such a refreshing feeling in such a big city like New York. \nMy favorite park of this hotel beside the staff is their fitness center, very well circulated, equipped to be able to get a full body work out. All rooms only have queen beds which is great! Rooms are so nice and clean, size is expected for a hotel in the big apple. Once this hotel opens up their Bar\/Restaurant it will 1000% be a GEM in the lower Manhattan area. \nShout out to: Kaina, Ari, Ray and Adriel!","travelDate":"2023-01","tripType":"NONE"}
