{"helpfulVotes":0,"locationId":23542350,"title":"Not the best!","lang":"en","publishedDate":"2024-04-10","publishedPlatform":"OTHER","rating":2,"text":"We checked into the perfectly located hotel and first impressions were fabulous… the room was super clean, spacious and well suited to our needs for our 3 night stay in New York. We later returned to the room in the evening for our first night sleep, the noise from the outside street which could be heard from the 5th floor room was unbearable and made for a very bad nights sleep. We spoke to the hotel manager the following morning who basically dismissed our claims as “no one else on the 5th floor” had complained about the noise. We were eventually moved to the 15th floor after a good 5 minute discussion with the manager about the meaning of good customer service which made for a better night sleep on our last 2 nights. Please bear in mind if staying at this hotel that the sound proofing is terrible, we could also hear peoples conversations from the room next door. Reception staff were very friendly and helpful, however would not stay at this hotel again due to the abysmal sound proofing and attitude of the manager. As someone who has worked in the travel industry for over 11 years this was certainly one of the worst hotel experiences I’ve had.","travelDate":"2024-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Friendly, clean and a great location","lang":"en","publishedDate":"2022-12-29","publishedPlatform":"MOBILE","rating":5,"text":"A fantastic stay with some great staff! \n\nWe felt very welcome and the facilities were lovely and clean. A small mentioned also for Khaoula, she was especially great throughout our stay.\n\nThere was complimentary coffee and tea available each morning. \n\nWe look forward to coming back in the future.","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"WOW! A great NYC stay!!","lang":"en","publishedDate":"2024-04-04","publishedPlatform":"OTHER","rating":5,"text":"What a great hotel! Super clean and convenient to everything! Khaoula made our stay.  She was so helpful, friendly, kind and knowledgeable! What an asset to BW!! She was so helpful to my husband when he called a couple of times prior to our arrival and then when they met, she was like an old friend. We would come back to stay here because of her!!! Thank you for a great stay. The Burchett family","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"I wanna come back!!!","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":5,"text":"I want to congratulate the management for finding and hiring Khaoula, the MVP works the front desk in the evenings and let me tell you, I have never felt so welcome staying in a hotel.  She made my stay feel like I was home and I appreciate it.\nVery good location with attractions walking distance away.\nThe room was very nice and clean and modern.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"great short stay and helpful reception team","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":5,"text":"Had a great short stay —————-location is perfect, friendly and helpful reception. Special thanks and appreciation to khaoula who kindly assist me in connecting to the shuttle service and when I have issue with my airport transfer booking","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excellent location & price","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":5,"text":"We had an excellent stay at the BW Empire. I’m a rewards member & we received an excellent price for 3 days in NYC.  It was really comforting to have a 24 hour staffed desk. The staff are so accommodating. We were not able to get a reservation anywhere for Super Bowl, the hotel opened up a small restaurant area and allowed us to order in food and watch the game. Overall we had an excellent stay.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"New York au best western premier empire hôtel ","lang":"fr","publishedDate":"2024-02-29","publishedPlatform":"MOBILE","rating":5,"text":"Un sejour de 8 jours dans ce Super hôtel et une hôtesse Khaoula formidable et qui parle Français , un rayon de soleil quand on la voit a l'entrée de l'hotel,  je recommande sans hésitation  à proximité de tous , le top . Une chambre au 17e très fonctionnel. ","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Modern new built hotel","lang":"en","publishedDate":"2024-02-25","publishedPlatform":"MOBILE","rating":4,"text":"The room was small but very clean and had modern facilities.  I liked the fact that at the breakfast area there was fresh drinking water and that you could sit at a table during the day.  Both female receptionist staff  Khaoula and Christina were very helpful, friendly and professional.  I paid a $100 deposit against the room 1602 and I now am looking forward to receiving such as soon as possible.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"A great NYC stay that won’t break the bank!","lang":"en","publishedDate":"2024-02-25","publishedPlatform":"MOBILE","rating":5,"text":"Superb. Really.\nCheck in: quick, efficient, super polite. \nElevator:clean, well maintained, fast.\nRoom : Clean (super clean), comfy. Big for an NYC room. Nice bathroom.\nSuper friendly staff at all times. Check out was easy.\nNotes: no free breakfast- but they do have a coffee shop and breakfast offering for a few. (With so many places to eat in the city, this was not a concern for us.\n\nLastly, it was nice to be a little outside the Times Square tourist area. Close enough to walk or Uber- far enough to avoid smells\/noises! \n\nParking garage next door. (We did not use it as we took a train).\n\nI recommend staying here!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Really recommendet - i would come back.","lang":"en","publishedDate":"2024-02-24","publishedPlatform":"OTHER","rating":5,"text":"A Hotel in the middle of everything: Close to Emire state building, subway and 5th avenue. The room was clean and friendly with a super view to empire state building (from 17th floor).\nThe guys at the receptions were super friendly and willing to help. Thanks Christina! :)\nAs there was no breakfast in the hotel a good cafe is close by to enjoy the NYC style breakfast.\nI really enjoyed the stay and would come back if possible.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"clean and near everything","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":5,"text":"Great Location to everything,   We took Lyft everywhere, most places were within 20 minutes of the hotel .  Great Staff, Very Helpful!   Great Bang for your $$.  Highly Recommended!   Me and my kids will be back soon!!!","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"친절한직원, 좋은 위치, 리조트피 없음.","lang":"ko","publishedDate":"2024-02-20","publishedPlatform":"OTHER","rating":5,"text":"6박 숙박했습니다. 여기저기 걸어다니기에 위치 좋습니다. 코리아타운 가까워서 많이 사다 먹었고, 근처에 홀푸드마켓도 장 보기 좋습니다. 무엇보다 직원들이 친절하고 친근하게 대해줘서 좋았어요. Khaoula라는 직원은 한국을 정말 좋아한다면서 매우 친절하게 잘 대해줬습니다. 멋진 미소와 쾌활한 목소리로 늘 기분좋게 해주는 직원이었어요. :)\n \n중학생2명과 성인1명이 트윈베드룸 이용했는데, 방이 넓지는 않지만 거의 잠만 자니까 불편함은 없었습니다. 매일 방정리는 해주었고, 욕실에 비누, 샴푸, 컨디셔너, 바디로션 있어요. usb 연결 핸드폰 충전할 수 있고, 다리미, 다리미판 있어요. 객실  내부 시설은 단순합니다. 커피포트, 냉장고는 없습니다. 리조트 피는 없었고, 보증금은 100달러였는데, 카드로 해서 청구되지 않았습니다.\n\n1층에 레몬 넣은 시원한 물 있습니다. 체크인 할 때 전자레인지 쓸 수 있다고 설명은 해주었는데, 영어가 부족해서 제대로 알아듣지는 못했어요.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Beware the hidden fees","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"OTHER","rating":3,"text":"The comfortable room and good location were offset by a very unpleasant check-in experience in which the hotel demanded additional taxes and fees even though the third-party, Super.com, said these were included in the total price I had already paid them. Both the hotel and Super.com were difficult to deal with, as no manager initially was available at the hotel and Super, despite promising to cover the additional taxes\/fees, has not kept its word. Apart from this, the stay was comfortable. But beware these games of resort fees, etc. that now seem to be endemic in the NYC hotel industry. It's a deceptive trade practice and it's wrong.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"We will be back!","lang":"en","publishedDate":"2024-02-17","publishedPlatform":"MOBILE","rating":5,"text":"Wonderful welcoming front desk staff. We were four people in a double with lots of luggage and they gave us a bigger room- super kind! The room was modern and large for NY and had been redone recently! Great price and value. Amazing location- walkable to all and to subway. Lots of restaurants nearby. We will be back!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Feb stay ","lang":"en","publishedDate":"2024-02-16","publishedPlatform":"MOBILE","rating":4,"text":"Stayed here for three nights, myself, partner and son. The hotel is quite small in comparison to some with 7 rooms on each floor but it's actually quite nice as it never felt busy and loud. The reception staff are really friendly and the hotel is spotless clean. We arrived a little early but got checked in to our room no problem. They stored our bags for us on the last day too. The room we had had two double beds, really comfy. The room was a decent size with iron and iron board and hairdryer, tv, tea and coffee facilities, no fridge though which would have been a bonus but not a biggie. We didn't use the cafe at the back so can't comment. There is a vending machine and ice machine on the bottom floor. It's a little out the way compared to hotels at times square, but you're just off 5th avenue abd a 10 min walk to times square so not that bad and the plus side is its a bit quieter. ","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Stay in NYC","lang":"en","publishedDate":"2024-02-12","publishedPlatform":"OTHER","rating":5,"text":"Very quiet room with ample space.  Very clean and comfy.  Great location.  Staff was very welcoming and friendly.  The view was nice and it was enough space for my whole family.  Bathroom was well stocked.","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"All good at this NYC hotel","lang":"en","publishedDate":"2024-02-11","publishedPlatform":"OTHER","rating":4,"text":"Great location, great service, great sleep on 4-day business trip to NYC. I was able to walk to my meetings and catch a Broadway show afterward. Friendly staff always ready to lend a helping hand. \nRemember to scan your keycard in the elevator, so it moves!","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Tutto fumo e niente arrosto","lang":"it","publishedDate":"2024-02-11","publishedPlatform":"MOBILE","rating":3,"text":"Albergo esteticamente stupendo, camere ampie e moderne, letti comodissimi e posizione tra le migliori che si possano desiderare a Manhattan. Ottima anche la fornitura gratis di te, acqua e caffè. Tuttavia ho riscontrato una carenza di organizzazione e personale arrogante: ogni giorno chiedevamo al mattino che la stanza venisse rifatta alla reception, ma al nostro ritorno la trovavamo sempre sporca e dovevamo scendere a litigare con la reception per far pulire la stanza, aspettare 20 minuti e poi salire venendo anche guardati male dal personale.\nAttenzione anche alla colazione, si paga a parte, quando avevamo prenotato noi l’avevamo scoperto solo al momento del check-in.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Warm, engaging staff made our brief stay a pleasure","lang":"en","publishedDate":"2024-02-06","publishedPlatform":"OTHER","rating":5,"text":"Everytghing about this little hotel was awesome, but the front desk was really great, lots of personality, lots of info, lots of smiles...we now have a place to stay every time we come to new york....","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Estupendo!","lang":"es","publishedDate":"2024-02-01","publishedPlatform":"OTHER","rating":5,"text":"El hotel no es muy grande, pero está nuevo y limpio, además de que el personal era muy amable. \n\nLa ubicación es excelente, cerca del metro y de atracciones turísticas. Sin dudas volveré a alojar aquí cuando regrese a Nueva York ","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"The Best of Midtown Locations lots to see","lang":"en","publishedDate":"2024-01-25","publishedPlatform":"MOBILE","rating":4,"text":"Location, location, Excellent location, walking distance from Penn Station. Very good neighborhood for restaurants and attractions like High Line, Macy’s Herald Square. Comfortable beds and competitive pricing. Welcoming staff, nice decor , very clean, friendly management. I had a special guest experience for my birthday this time . The views from upper floors are spectacular. Lack of amenities like restaurant, gym, pool, prevent my giving 5 stars. Great Rewards Program. Desk staff very nice and accommodating. Kaula is my newest BFF! I shall return 🙏","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"SUPER SERVICE * TOP-LAGE","lang":"de","publishedDate":"2024-01-18","publishedPlatform":"OTHER","rating":5,"text":"Das Hotel liegt für einen Stadttrip ideal, keine 200 m vom ESB. Viele Attraktionen in der 5th Ave lassen sich zu Fuß erreichen. Die Zimmer sind NY typisch eher als klein zu bezeichnen. Ausreichend für 2, aber ohne Kleiderschrank, dafür eine Stange und Bügel für Jacken etc.  Betten sind okay gewesen. Ich mit meinen fast 2m hatte kein Problem.  Frühstück hatten wir nicht, Kaffee waren wir meist zu spät. \nPreis \/ Leistung absolut in Ordnung. Wir würden nochmal buchen.\nABER DAS WICHTIGSTE:\nDas Personal ist absolut spitze ! Wir waren schon in vielen Hotels, aber der Service hier, insbesondere von Khaoula, PHÄNOMENAL ! Hilfsbereit, freundlich, immer ansprechbar. Interessiert an unseren Erlebnissen, unglaublich. Das gibt es so selten Heutzutage. Khaoula war ein echter Schutz, Employee of the month für uns ! Allein wegen Ihr würden wir schon wiederkommen. Der Rest des Teams ist ebenfalls sehr freundlich und immer ansprechbar. So hätten wir das gerne öfter. Einen Applaus für Alle.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Recent stay at Best Western Empire Hotel","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"OTHER","rating":5,"text":"I've been utilizing this Best Western location for many years because of how friendly and helpful the staff continue to be towards me. Their rooms are clean, modern, warm, and cozy. Complimentary cold and refreshing lemon water right outside the elevator, and although the breakfast isn't complimentary, several hot & delicious options are available to choose from for a good price.This hotel is also in a very good location, especially if you would like to explore the east side of Manhattan whether by walking, using the train, or lyft, taxi, Uber. The closest train station is on 28th and 5th Ave. It's the R train and its about a 5min walk. There are several restaurants to choose from especially Koreatown being a 7-10 min walk as well. ","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Ótima localização, quartos bem cuidados e modernos.","lang":"pt","publishedDate":"2024-01-14","publishedPlatform":"OTHER","rating":5,"text":"Um hotel muito bem localizado, você consegue ir a pé a todos os lugares de manhattan.  Apartamentos ótimos, modernos e bem cuidados.  A atenção dos recepcionistas foi incrível, aproveito para agradecer à Khaola e ao Sham, além de muito simpáticos foram extremamente atenciosos. A única observação é que os colchões das camas são muito macios e afundam. O restante perfeito.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Superbe hôtel à Manhattan !","lang":"fr","publishedDate":"2024-01-13","publishedPlatform":"OTHER","rating":5,"text":"Très bel hôtel avec une situation extraordinaire à Manhattan, près de l'Empire State Building, près des métros et près de la 5ème Avenue.  Facile à y arriver depuis l'aéroport JFK.  Hôtel très propre et calme.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Très bien!","lang":"fr","publishedDate":"2024-01-11","publishedPlatform":"OTHER","rating":5,"text":"Hôtel très bien situé dans Manhattan, près Empire State building, 34 ème rue, différents square et parcs, Times Square, \nEtc, etc.\nPersonnel accueillant et répond bien à des demandes spécifiques. \nBravo à chacune\/chacun…. Et plus particulièrement â Christina et Khaoula pour la très agréable discussion avec elles la veille de notre départ!!! \n« Khaoula: continuez vos révisions pour maintenir votre beau niveau de langue française »!.\n\nÀ l’an janvier 2025 !","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excelente!","lang":"pt","publishedDate":"2024-01-08","publishedPlatform":"OTHER","rating":5,"text":"O hotel é bem moderno e limpo. Centralizado e próximo a estações de metrô. Adorei o café da manhã! Super Recomendo e voltaria com certeza! A atendente Afsheen foi super atenciosa conosco em todos os momentos da estadia!","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Small but good location","lang":"en","publishedDate":"2024-01-07","publishedPlatform":"OTHER","rating":3,"text":"Great location!! Manager wouldn’t budge on a price adjustment. Smaller than expected but clean and friendly service. Not much of a lobby but again very clean.  Would consider staying here again if I ever came to this part of NYC. ","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Awesome hotel","lang":"en","publishedDate":"2024-01-02","publishedPlatform":"OTHER","rating":5,"text":"Great location, friendly staff, large clean room. Christina at the front desk is amazing. She bent over backwards for us and truly made our stay special. Would recommend this property to everyone coming to NYC!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Perfection Fantastic Hotel ","lang":"en","publishedDate":"2023-12-30","publishedPlatform":"OTHER","rating":5,"text":"We have stayed in many hotels in NY however this is the best by far . Spotless ,really comfy beds , nice lounge area. The customer service I can’t rate highly enough . My goodness what can I say I have never experienced service like it . My friend Helene and I were made to feel so welcome from the first minute we entered the hotel . Nothing was a bother to them .  Special mention to all staff special mention to Khadula. Wishing everyone all the best for 2024. Mary and Helene","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Stellar and Immaculate Hotel in the Heart of the Action","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"MOBILE","rating":5,"text":"Came here on a solo leisure trip to the city based on the previous stellar reviews. So here’s another one! This was one of the cleanest, nicest, friendliest (Jay Singh and Khaoula) hotels I’ve ever stayed in my entire life. The room was so immaculate. Every detail was covered. And the location is about as perfect as you can get in all of NYC. I literally cried when I had to leave. I long to return. I lived to the online hype, and then some!","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Esperienza molto positiva, lo consiglio.","lang":"it","publishedDate":"2023-12-27","publishedPlatform":"OTHER","rating":5,"text":"Hotel centrale, pulito ed accogliente. Sì raggiungono a piedi le attrazioni principali. Il personale è gentile, sorridente e disponibile. Un particolare grazie a Khadula per la sua cordialità. Ottima esperienza, consigliato.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great hotel","lang":"en","publishedDate":"2023-12-22","publishedPlatform":"OTHER","rating":5,"text":"Great place for the price and location. Tge personnel is friendly and polite. I recommend this place. Everything is nearby: restaurants, shops, train and bus stations. I traveled with my 6 yo son and it was absolutely safe.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Another great stay as usual, this time with the family as well","lang":"en","publishedDate":"2023-12-21","publishedPlatform":"OTHER","rating":5,"text":"I really appreciate the opportunity to stay at this hotel - the rooms have good beds, they are clean, the shower is good.  The staff make you feel very welcome.  It’s ideally placed to get around Manhattan easily.  I have stayed at this hotel a lot of times and plan to continue to do so.  I usually travel for business but on the last trip I travelled with family and the team were very helpful on making that a great stay for us all.  Very grateful.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Amazing Experience ","lang":"en","publishedDate":"2023-12-20","publishedPlatform":"OTHER","rating":5,"text":"My friends and I had a wonderful experience at the BW-ESH! We came for a weekend trip and were well served by the friendly staff, in particular Miss. Khaoula, who was exceptionally friendly and was extremely helpful locating sites across Manhattan.\nLocation is 10\/10, I would highly recommend. \n\nThanks for all your help Khaoula!","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Place to Stay","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"OTHER","rating":5,"text":"Such a super cute hotel. Clean with great security. Front desk girls are so very nice and helpful. Room is a little small for more than two people but is very nice and clean. Will happily stay in this hotel again!!","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Fantastic hotel","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"MOBILE","rating":5,"text":"This is the second time I’ve stayed here this year. First time was just a weekend but I had such a great experience that I booked here for a 5 day dream Christmas trip with my mom. From the moment we walked in to the time we checked out it was fantastic. The front desk staff greeted you every time you entered and exited, and upon check in the lady at the desk (didn’t get her name) explained everything we needed to know, offered late check-out and a welcome gift due to my BW Rewards status. The new breakfast bar is a nice addition with plenty of grab and go options (fees separate from room). The room was very clean and had everything we need. Despite being near the heart of Midtown it was very quiet at night. Walking distance to major attractions and destinations and close to many subway stations. Will stay here again if in New York. Well done staff at BW Empire State!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Gerne wieder!","lang":"de","publishedDate":"2023-12-17","publishedPlatform":"OTHER","rating":5,"text":"Sehr gute zentrale Lage, Times Square, Rockefeller Center, Hudson Yard etc. sind fußläufig zu erreichen, Empire State Building ist um die Ecke.\nZimmer sind klein aber zweckmäßig, Bad ist neu renoviert. Sehr bequeme Betten!\nMitarbeiter sind alle sehr freundlich!","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"A Great Staff can make all the difference…","lang":"en","publishedDate":"2023-12-17","publishedPlatform":"OTHER","rating":4,"text":"Convenience, transportation accessibility, location, price all great, but one thing stood above all else…The Staff.  Led by Khaoula who I had many interactions with made this trip!  Traveling solo and having lived in nyc for years led me to stay close to my former neighborhood.  There was only one drawback to the hotel and that was the pillows which were a size of a larger throw pillow one would put on their sofa.  When I brought this up to Khaoula she was understanding and immediately sent more pillows up to my room.  Yes they were similar size but made it better.  I do think that corporate might want to rethink the decision to have such pillows since they do not have to invest in new bedding since the pillow cases were standard size and folded back to refit smaller pillows.  It would also probably make housekeeping job easier, which by the way the housekeeping staff was awesome. Again HUGE shout out to Khaoula who made this solo traveler’s trip so much more special.  Pillows make this a 4 star rating, but staff 5+++ stars","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great location, staff and rooms","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"OTHER","rating":5,"text":"The hotel has an excellent location closeby to severals sights e.g. the Empire State Building, the Flatiron Building, the Grand Central Station and others. It is within walking distance to subway stations and therefore a great accomodation for tourists. Despite this central location the street is surprisingly quiet.\nThe rooms are clean and well furnished, however, there are not many possibilities to put clothes in. The beds are very comfortable and the wifi works all fine.\nThe hotel has a lobby where one can consume food brought from outside. In the morning breakfast items are also offered there.\nBecause of all what's mentioned above our stay was already very enjoyable, yet the staff made it perfect. Everyone was very kind, I specifically want to mention Khaoula who was very nice, attentive and helpful. Thank you for the wonderful stay!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Best service and cleanest in NYC!","lang":"en","publishedDate":"2023-12-04","publishedPlatform":"OTHER","rating":5,"text":"I stay at this Best Western every time I’m in NYC.I’m a priority member and stay in a lot of Best Westerns and this is my fave.  Everything is always perfect - amazing employees, the cleanliness is always pristine, the location is great for subways and a short walk to anywhere including Times Suare and the beds annd pillows  are so comfy. I would like to say Christina at the front desk is awesome and so efficient-her smile is always welcoming and makes me happy to be there. You guys make New York shine!! ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"DO NOT BOOK AT BW OR THIS LOCATION","lang":"en","publishedDate":"2023-11-26","publishedPlatform":"OTHER","rating":1,"text":"DO NOT BOOK.  The management and staff is not willing to work with you.  We booked another location and were moved to this one as soon as we checked in.  This was 7 blocks away from our original location and the subway during Thanksgiving but we rolled with it at first.  Until we looked at the price and saw this location was $1,000 cheaper each room than what we had booked the year before.  The manager was never at the location and we couldn't get any one to help at either location- herald square or this one.  Also, all sites say free breakfast- there isn't a breakfast.  You have to pay.  Called customer service 3 times.  Finally spoke to someone very nice today.  However, the hotel managers have the final say in what is given to the people staying at the hotel and they denied any request for a refund.  The best BW could offer me was a $100 gift card- to split between 3 rooms.  What a joke!  The Herald Square location is working with this location to increase prices and not help any hotel goer.  After finding out this is a franchise and customer service can literally do nothing if something happens, we will never stay at a BW again.  ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great stay at the Best Western Premier Empire Hotel.","lang":"en","publishedDate":"2023-11-25","publishedPlatform":"OTHER","rating":5,"text":"We have stayed at the Best Western Premier Empire State Hotel multiple times. The location is perfect, close to everything in Midtown. The rooms are clean and the bathrooms have a good shower flow. But the best part about the hotel is the welcoming front desk. They go above and beyond to make your stay a pleasant experience. I love staying there whenever I go to Manhattan.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excellent accommodation!!!","lang":"en","publishedDate":"2023-11-24","publishedPlatform":"OTHER","rating":5,"text":"The hotel staff are extremely friendly, accommodating, professional and very helpful.  We arrived several hours prior to check in and they had a room ready and allowed us to check in early.  The location is PERFECT as it is very central and within walking distance to many attractions, great shopping, restaurants and several different subway lines. The hotel was very clean, beds were extremely comfortable and very quiet considering it is situated in the heart of Manhattan. I would recommend this hotel to anyone wishing to have all the comforts of home while travelling.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Nice experience!","lang":"it","publishedDate":"2023-11-23","publishedPlatform":"OTHER","rating":3,"text":"Nice and calm hotel in a perfect and strategic position!Khaoula was the best “thing” in this experience!\nHotel carino e tranquillo in una posizione strategica. Conoscere khaoula è stata la cosa migliore di questo soggiorno!","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23542350,"title":"Good location ok room","lang":"en","publishedDate":"2023-11-14","publishedPlatform":"OTHER","rating":3,"text":"The location of this hotel is great. Walking distance to the bus stops and subways. Lots of restaurants around in the area. But the room didn't have a closet just a metal rack to hang your clothes. There is a small dining room in the building for breakfast of prepackaged items but that came out of the oven cold. May not be bad for NYC prices but not one I would go back to.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Wie zu Hause in New York","lang":"de","publishedDate":"2023-11-10","publishedPlatform":"OTHER","rating":5,"text":"Durch einen glücklichen Zufall wurden wir von unserem ursprünglichen Hotel in Queens in das Best Western Premier Empire State Hotel umgebucht. An der Rezeption hat uns Khaoula sehr herzlich empfangen und unbürokratisch die Umbuchung geregelt. Wir mussten uns um nichts mehr kümmen und haben uns super aufgehoben gefühlt! Ansonsten ist das Hotel natürlich top: Kurze Wege zu allen Sehenswürdigkeiten, sehr angenehme und ruhige Zimmer, unkomplizierte Möglichkeit, zu frühstücken. Und immer ein freundliches Wort am Empfang!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Hotel and staff so kind","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"I always enjoy being greeted by a wonderful young lady.  I know I am misspelling her name but it's Kahula  or Paoola I believe and she was here on Sunday when I checked in.  ALways so kind, efficient and just sweet as can be.  She is dark haired and just has a great smile and very warm.  She's a great asset to this hotel, many guests, me included are tired from a long trip and her smile and wonderful attitude makes me want to keep coming back.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Halloween stay","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"Very good experience and stay at this hotel. All personnal very concerned to our comfort, and especially Khaoula who gave us advice for Halloween and the subway tracks !\nFor the last whole day they kept our suitcases until 7:30pm before we leave, while we were still visiting NYC, that's also a positive point.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Bien situé ","lang":"fr","publishedDate":"2023-10-31","publishedPlatform":"OTHER","rating":4,"text":"Hotel très bien situé. \nChambre propre mais un peu petite pour chambre familiale. Personnel à  l'écoute.  \nPossibilite de prendre un petit déjeuner sur place mais de qualité très moyenne. Fontaine à eau à l accueil très appréciable.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Hotel très bien situé , très propre et calme","lang":"fr","publishedDate":"2023-10-29","publishedPlatform":"OTHER","rating":5,"text":"Le personnel est à l écoute et très charmant.\nLes chambres sont très propres et le service quotidien parfait.\nL hôtel est calme et très bien insonorisé - aucun bruit.\nLe manager a été très professionnel et a très gentiment accepté de nous dédommager d'une nuit en moins au dernier moment - ce malgré le prepaiement via booking non remboursable : très commercial et professionnel.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Bon rapport qualité prix","lang":"fr","publishedDate":"2023-10-24","publishedPlatform":"MOBILE","rating":4,"text":"Hotel très bien placé, à 200 mètres de la 5eme avenue, à 5 minutes de l’empire State Building, 15 mn de Time Square.\nJolie chambre, neuve, manque un peu de rangement, mais on est à NY.\nBon rapport qualité Prix.\nHôtesse d’accueil qui parle français et qui est adorable.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"KHAOULA and AFSHEEN!!!!!","lang":"en","publishedDate":"2023-10-23","publishedPlatform":"OTHER","rating":5,"text":"Khaoula and Ashen made our visit WONDERFUL....so helpful, eager to be friendly, kindly , worked hard to make our stay the BEST in NYC. \n\nAny hotel needs these two. Never experienced such great representatives at a hotel..Best Western...you should be PROUD of these TWO. Move them up the management ladder. They are WINNERS!!!!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Autunno  in New York.","lang":"it","publishedDate":"2023-10-22","publishedPlatform":"OTHER","rating":5,"text":"il Best Western Empire di New York, e' un ottimo Hotel, con camere comode. pulite ed uno staff eccellente: efficienti, simpatici e molto disponili.\n Un saluto in particolare a Khaoula e Christina. Grazie e arrivederci da Carla, Angela e Gian Marco  Dall'Ara-Molinari","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23542350,"title":"Not worth the Money","lang":"en","publishedDate":"2023-10-16","publishedPlatform":"OTHER","rating":2,"text":"For the price paid the hotel was very basic. There was only one chair in the room, the lighting was challenging. The promised servicing of the room was non existent. It was however quite clean. The staff at the desk was friendly. The new coffee shop that was touted to to provide an upscale experience was not that at all. I dumped the coffee.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Family Vacation","lang":"en","publishedDate":"2023-10-09","publishedPlatform":"OTHER","rating":3,"text":"Because of a mix-up in the reservation, we were scheduled to check-in 1 day before we actually arrived in NYC. The manager was unwilling to work with us at all regarding this situation and charged us for the 3 nights when we only stayed 2. This made our stay at this hotel cost $469.00 per night. Staff was friendly, rooms were small but clean, location close to train station which we wanted but totally unwilling to work with us regarding the reservation mix-up.","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Good hotel","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"OTHER","rating":5,"text":"We were sent to this hotel as the Herald Square hotel no longer exists. We were given a very friendly welcome and a room because available immediately which was very helpful. The rooms are a good size with very comfortable beds. We ate our breakfast in the new coffee shop downstairs and it was very good and reasonably priced. Unfortunately this hotel was not where we had planned to be for shops et cetera. We had planned to visit it is just off fifth Avenue. We prefer to be nearer Macy’s. Otherwise we would definitely use this hotel again.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Everything great!","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":5,"text":"The staff was friendly, the entire hotel was clean and quiet. The location was perfect for where we needed to go and we could find plenty of stuff to do nearby. All the amenities were open. No issues at all.","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23542350,"title":"Hotel .s too expensive","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":1,"text":"The worst value for my money I have gotten in a hotel anywhere. The rooms are way too small, no closet , no restaurant on site and the staff were indifferent. \nThe only thing that was good , it was clean","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Fantastic ","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"MOBILE","rating":5,"text":"The room was quite spacious compared to the other options available at midtown Manhattan. The staff at the reception (Arsheen and Jay)  were polite , friendly and enhanced our experience with their great hospitality. The Location was superb , subway stations were at an arms reach and Times square was a 10 min walk .\nSpecial mention to the housekeeping staff, our rooms were cleaned impeccably everyday\nArsheen and Jay at the reception were kind enough to get us an early check in as well.\nWe'll stay here again whenever we visit Manhattan next ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Thank You, Sheen!","lang":"en","publishedDate":"2023-09-14","publishedPlatform":"OTHER","rating":5,"text":"I was blown away by Sheen's helpfulness. Sheen works at the front desk and went above and beyond to help me out. When you're asking someone for help, its such a weight off your shoulders when the person obliges and is happy to do so. Thank you so much! ","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excellent experience","lang":"en","publishedDate":"2023-09-11","publishedPlatform":"OTHER","rating":5,"text":"Friendly reception, clean, well-appointed room and not too small, great location near Penn Station at a good price. I would highly recommend this for anyone wanting a decent, well-priced room in Manhattan.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Rekommenderar detta hotell för den som önskar ett fräscht hotellet som ligger centralt för ett rimligt pris.","lang":"sv","publishedDate":"2023-09-08","publishedPlatform":"MOBILE","rating":5,"text":"Personalen på hotellet var mycket trevliga och hjälpsamma.\nHotellet ligger centralt och det är lätt att ta sig till olika sevärdheter på Manhattan. Det var en lung tvärgata och Inga otrevligheter utanför hotellet. \nRumen var små men både fina och fräscha. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Nice and new ","lang":"en","publishedDate":"2023-09-06","publishedPlatform":"OTHER","rating":5,"text":"Good comfortable place. This is a very new hotel and is very clean. The rooms are also good given NY standards. They also have a small seating area on the first floor and have a paid cafe with good priced food options. The area is really good with lots of restaurants around and empire state building and Times Square are not too far away. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":23542350,"title":"I wish I could give less than one star.","lang":"en","publishedDate":"2023-09-05","publishedPlatform":"OTHER","rating":1,"text":"This hotel was a nightmare to deal with from the get go. We should have run on the first incident but you book these chain hotels to avoid issues right? \nWe originally had booked to stay in the best western hotel in Herald square as the location was perfect for the things we wanted to do during our week in nyc. We arrive there early evening after a massive day of travel and a very expensive Uber from the airport, to be told by the reception that our room was no longer available??? No one had bothered to contact us despite having BOTH of our emails on file AND the ability to message us directly via the booking.com app, which they had prior to discuss a different enquiry. Anyway, we were told that if we walked ‘just 20 mins, that way’  the herald square hotel would had a room for us for the same price. That was the extent of any explanation. Right, let’s wrangle all of our luggage during peak hour nyc in the middle of summer. Off we go, praying this hotel actually exists. Thankfully it does and we are determined to not let this ruin our time in the city. \nHalfway through our week long stay I made a considerably large purchase at Gucci. I arrived back to the hotel with the purchase in its lime green shopping bag and keepsafe box they give you to keep your items in. The next day I took the actual bag out with me for the day and had left the extra straps for the bag in the box in the line green bag right next to my luggage. We get back to our room late arvo, and the room has been remade, but the bag and box has disappeared. I go straight down to reception and explain what had happened and the receptionist told me to go back to my room to wait and he would ring me once they had looked through the trash. About two minutes after getting back to the room he calls and says it’s not there. I ask what happens now and he tells me his manager will be in tomorrow and he is the only one who can access the security cameras. \nSo the next morning I go back down to reception and ask to speak to the manager, and surprise! He’s not here today, he’s back tomorrow. Perfect. Every time I pass through reception I ask if there has been any progress and get the same answer. \nDay three the manager is finally here and confirms my things have been thrown in the trash. Three days ago, so they’re long gone. He then tells me that I ‘shouldn’t have left them in the box if I didn’t want them to be thrown away’ I should’ve taken it all out with me, and that ‘I’ve still got the actual bag, so what’s the problem?’ Keeping in mind this is over $800usd worth of brand new Gucci products that have gone missing at the hands of the hotel.\n I genuinely couldn’t believe the nonchalant attitude I received from the employees, but I was absolutely disgusted at how the manager responded to this issue. The lack of urgency to help me solve this incident was ridiculous as well, not one staff member took it seriously. It was like it was an actual joke. I spent thousands on dollars to stay in this hotel, and more thousands on my purchase. To be treated like a laughing stock. It was like a pair of socks had gone missing. I didn’t even get as much as a sorry. He was adamant it was my fault, but said he’d knock $100 off our bill. Which hasn’t happened.\n Imagine if I had broken or stolen something from the room and then just refused to accept responsibility and resolve it. Absolutely unacceptable. I wish I could give it less than one star.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Perfekt für NYC Trip - perfekte Lage, gemütlich ausgestattet und sehr sauber","lang":"de","publishedDate":"2023-08-27","publishedPlatform":"MOBILE","rating":5,"text":"Sehr nettes Hotel in perfekter Lage\nDie Zimmer sind sind gemütlich, sehr sauber und super ausgestattet. Mein besonderer Dank gilt Christina an der Rezeption- sie war super freundlich, sehr hilfsbereit und sehr kompetent. Wir konnten mit allen Wünschen zu ihr kommen…  Wir kommen wieder!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Last minute trip","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":4,"text":"Daughter and I had less than a week to arrive in NY for a funeral, this hotel had a garage directly next door, so perfect location bc we needed a rental car to go back and front to queens and Brooklyn. I read other reviews about the room size .. I didn’t have issue plus we only slept in the room ( we had one king size bed) conveniently close to trains to take us up to Harlem and Central Park ","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Very central location, perfect hotel, great staff!!","lang":"en","publishedDate":"2023-08-24","publishedPlatform":"OTHER","rating":5,"text":"In a very central area on Midtown, few steps from Empire State Bulding. The hotel is a perfect place to visit Manhattan.\nThe room has everything you need, the bed is very big and confortable.\nBathroom and shower are also perfect.\nStaff is REALLY great.. I need to mention Afsheen and Jay, they really took care about me, giving me all the informations I need and being always friendly and available to accomodate any request or need I had.\nThank you so much, I had a great stay!","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Wonderful NYC hotel","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"MOBILE","rating":5,"text":"We stayed 2 nights at this hotel and it was a great hotel. The rooms were very clean and the beds were very comfy to come back to after long days exploring the city. The only little issue is that water seemed to leak from the shower door but that’s what towels are for. The housekeeping is by request but if you need extra towels they will gladly give you them at the front desk. Check in was quick and easy. Khaoula was so friendly and welcoming. She explained about the elevators, wifi, housekeeping and the breakfast offered for purchase. She also gave us a great recommendation for a great slice of pizza nearby. We were greeted by all staff as we came and went. The location of the hotel is great. Walking distance to Times Square, Empire State Building\/Herald Square, Madison square park\/Flatiron building and a few blocks from major subway lines. Loved it so much I booked this place for my trip back in December!","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Father and son trip to nyc","lang":"en","publishedDate":"2023-08-15","publishedPlatform":"OTHER","rating":5,"text":"I just got back today Aug 15 from NYC and stayed at the Best Western empire state and it was absolutely amazing. I can't say enough about the staff's kindness and attention to detail by all. In particular, I have to mention the kindness of the manager Jay who was amazing from the second I walked in the door after that Khaoula was nothing but amazing, and kind and her smile radiated throughout the whole lobby every time we walked by. Stay at this hotel for its location but more because of the people who work there.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Good hotel in central location","lang":"en","publishedDate":"2023-08-12","publishedPlatform":"MOBILE","rating":4,"text":"The hotel is centrally located on Manhattan, close to 5th avenue. Rooms are smallish, and you could hear noise in the hallway and from outside quite clearly in the room. But beds were comfortable, and were made every day.\nThe staff was really service minded and friendly.\nThe hotel had free coffee, tea and icewater in the lobby, which was nice. Not in the morning though, probably because they want guests to buy something from the breakfast menu.\nWould stay here again, especially if something was done to soundproof the rooms.","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Best Hotel Staff - Khaoula","lang":"en","publishedDate":"2023-08-11","publishedPlatform":"OTHER","rating":5,"text":"Khaoula is the greatest hotel staff I've ever interacted with! She was so incredibly helpful, accommodating, and enthusiastic during my stay! Definitely enhanced my NY experience. She is a true expert in customer experience!","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Value with modern amenities","lang":"en","publishedDate":"2023-08-07","publishedPlatform":"OTHER","rating":5,"text":"We stayed two nights - my sons and I - and had a seemless experience. The room is modern and while small really uses space well. This location cannot be beat for those looking to see the major sites. The Empire State Building is two blocks away. The only thing I would have wanted more is two queens instead of two doubles, as a group of 3 of us. ","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great experience & customer service, would definitely stay again","lang":"en","publishedDate":"2023-07-31","publishedPlatform":"OTHER","rating":5,"text":"Stayed at this hotel mid June 2023 with my S\/O on our first trip to NYC. Room was excellent, had a modern feel and very clean\/tidy. Great value for the price point, especially considering location and proximity to some of the classic NYC landmarks. \n\nThe receptionist (Christina) and her manager (Khaoula) were very welcoming and provided quick and efficient check-in services. They provided some great recommendations for food and local businesses to check out and happily answered any of our questions. They both went above and beyond to make us feel very comfortable as first timers in the city. \n\nWe will definitely be staying at this location again on our next trip! ","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"One of BEST HOTELS","lang":"en","publishedDate":"2023-07-29","publishedPlatform":"OTHER","rating":5,"text":"We loved this hotel because of best customer service, very pleasant and knowledgeable staff, very clean and  modern Hotel Room. Awesome breakfast and prompt housekeeping services. They also have office with computers, fast WiFi . Hotel is located right in the middle of Manhattan next to Empire State Building. Great Value, Very Content. \n\nThank you, \nTatya  K.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Tremendous NYC value!","lang":"en","publishedDate":"2023-07-28","publishedPlatform":"OTHER","rating":5,"text":"This is not a mega-hotel... quick service at the front desk and no waiting for elevators!  The staff is very friendly.  The rooms are modern, clean, comfortable, and reasonably sized for NYC.  Conveniently located near the Empire State Building,","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Highly recommend this hotel for its location, cleanliness and warm and helpful staff!","lang":"en","publishedDate":"2023-07-27","publishedPlatform":"OTHER","rating":5,"text":"My husband and I recently returned from our stay at the Best Western Premier Empire State Hotel. Our experience and the staff far surpassed our expectations!  Our room was very clean and the staff were extremely friendly and helpful.  They even helped me solve phone issues I was having and provided my blistering feet from walking the streets of NYC with some much needed band-aids!  The location of the hotel was great for anyone wanting to explore all directions of the city.  Khalid, Khaoula, Afsheen and Christina - Thank you for helping to make our trip to NYC so wonderful!","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Above and beyond","lang":"en","publishedDate":"2023-07-27","publishedPlatform":"OTHER","rating":5,"text":"Clean rooms, great location and fantastic service. Khaoula and the front desk staff were incredibly helpful when our flight was cancelled on a busy long weekend and we had to stay an extra night. We'll be back. Thank you","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great experience ","lang":"en","publishedDate":"2023-07-26","publishedPlatform":"OTHER","rating":5,"text":"I had originally reserved at Best Western Herald Square but they changed me last minute to this hotel so I did not know if I would like it.\n\nI had a great time there. The room is small but very comfortable beds, and it is newly renovated. The bathroom is perfect, small but new and everything works fine.\n\nThey had breakfast for $15 dlls if you needed it. \n\nBut the great service from Afsheen and Jay was the best. They always tried to help in everything. From helping me with directions, check in early, and they had a great attitude! Always happy and welcoming! Thanks!","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excelente opción y buena relación costo-beneficio. Gran atención.","lang":"es","publishedDate":"2023-07-26","publishedPlatform":"OTHER","rating":5,"text":"Excelente ubicación, buena limpieza, atención, servicio post-checkout, gran gentileza y gran atención por parte de AF Sheen y Jay, siempre listos a ayudar y aconsejar. Buenas almohadas y acomodación en general. Te tienen las maletas al finalizar la reserva y puedes utilizar el baño si lo requieres.  Agua helada, té, aromáticas y café gratuitos en la recepción. Para la zona en que te encuentras, el precio es bueno. ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great experience at the hotel","lang":"en","publishedDate":"2023-07-25","publishedPlatform":"OTHER","rating":5,"text":"We a great stay at the Best Western Premier Empire State Hotel over the weekend. The hotel is well situated in Manhattan (minutes from Madison Square Park and surrounded by many shops and restaurants) and the staff were exceptional. We really enjoyed the breakfast spread every morning. Yasmin was especially welcoming and made us feel at home.","travelDate":"2023-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Much above expectations","lang":"en","publishedDate":"2023-07-23","publishedPlatform":"OTHER","rating":5,"text":"Actually, for selfish reasons I do not want to recommend this hotel as it is too good and I want to get a room here again. :-)\n\nIn terms of price, it is a gem in New York's hotel jungle. \nVery good location, quiet and well-kept.\nFeels really fresh and clean.\nProfessional staff with a very high level of service.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"A great stay","lang":"en","publishedDate":"2023-07-22","publishedPlatform":"OTHER","rating":5,"text":"Stayed for one night. On arrival staff were wonderful on reception and check in was quick and easy. We had two rooms on the 12th floor, a king and a double. The rooms were clean, bedding excellent quality, all the amenities you need for a stay and the towels were good quality. The hotel is handy for Penn Station (about a 10-15 minute walk), Broadway, Times Square and a lot of other places to visit. All in all a little gem of a hotel and reasonably priced. We didn’t have breakfast there so can’t comment on that.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Emma","lang":"sv","publishedDate":"2023-07-21","publishedPlatform":"OTHER","rating":5,"text":"Fint läge mitt på Manhattan, vi kunde gå till det mesta och precis runt hörnet finns Empire State Building, Flat Iron Building och två tunnelbanelinjer. Rummen hade god standard och sängarna var sköna. Städningen av rummet var utan anmärkning.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Perfect spot","lang":"en","publishedDate":"2023-07-08","publishedPlatform":"OTHER","rating":5,"text":"This hotel offers you great value for the location. Centrally located in Manhattan, steps from the Empire State Building, flat iron building, subway, shops, restaurants. We were easily able to enjoy breakfast at the hotel before we started our day because it was the best value for a family 4. Great variety of items to chose from - scrambled eggs, mushroom omelette, bacon, waffles, cereal, yogurt etc. you can’t beat the price in the area. It cost $30 for all 4 as kids eat free. We did breakfast elsewhere one day and it cost us over $80. \n\nThe rooms are snug but we aren’t there to sleep in the city that never sleeps lol. \nThe location is quiet and clean. \n\nIf you drive to NYC just be aware of the crazy fees to park overnight. ","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Ich werde es beim nächsten NYC-Aufenthalt wieder buchen!","lang":"de","publishedDate":"2023-07-08","publishedPlatform":"OTHER","rating":5,"text":"Ein tolles Hotel mitten in Midtown, das Empire State Building direkt um die Ecke. Die Zimmer sind toll, die Betten ein Traum!!! Jeden Tag Zimmerservice wenn gewünscht, die Dusche macht Spaß. In der Lobby gibt es immer Eiswasser, Kaffee und heißes Wasser\/Tee. Im Keller steht ein Eiswürfel-Automat, leider erst am letzten Tag gesehen. Das Personal an der Rezeption ist sehr nett und begrüßt einen immer mit einem Lächeln und erfüllt einem alle Wünsche! Wenn ich wieder nach NewYork komme werde ich dieses Hotel wieder buchen!  Liebe Grüße an Khaoula, i will miss your smile!    C U next year!","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great hotel, perfect location, and amazing staff.","lang":"en","publishedDate":"2023-07-01","publishedPlatform":"OTHER","rating":5,"text":"This is a very nice hotel with very helpful staff, I would like to thank Christina for being so helpful, the whole team are great!  Hotel is clean, coffee, tea and water in reception, large comfy beds and good hot powerful showers.  Were able to store luggage so we could go out and make the most of our last day.  Location is perfect, right by the Empire State building and penn station, we were able to train from Penn Station to Union station in Washington DC in 3 hrs, sight seeing in both cites was amazing!  On trip advisor this was one of the cheapest hotels, I cannot see why, much better than the Crown Plaza in times square and 2\/3 the price.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Hotel bien ubicado, moderno , personal agradable. Volvería","lang":"es","publishedDate":"2023-06-25","publishedPlatform":"MOBILE","rating":4,"text":"Fuimos en familia, mi esposa y mis dos hijos de 16 y 20 años. Ubicacion estratégica . Cerca de Times  Square ,atracciones turísticas y subte. Limpio y es un hotel moderno en cuanto construcción . Muy agradable la atención del personal. Una de las recepcionista Khaoula, nos facilitó información que nos fue valiosa como turistas y fue muy agradable. Tiene una máquina expendedora de café y agua que te salva en muchas ocasiones. El desayuno es pago como casi todos los lugares en New York. 15 Dolares cada uno, caro para el cambio por la realidad Argentina. Desayuno típico americano normal. Podes comprar para cenar o almorzar y comer en un pequeño sector habilitado para tal fin en planta baja. La habitación media chica pero no más que cualquier hotel promedio de Manhattan, es una característica de los hoteles de la zona. Volvería en otro viaje a la ciudad","travelDate":"2023-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Awesome stay","lang":"en","publishedDate":"2023-06-17","publishedPlatform":"OTHER","rating":5,"text":"My wife and I stayed at this hotel during a work\/leisure combo stay and had an awesome stay based on its location, condition, service, and price\/value. We highly recommend the BW Premier Empire State. ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Perfect roms, great location and with amazing staff.","lang":"en","publishedDate":"2023-06-14","publishedPlatform":"OTHER","rating":5,"text":"Excellent staff, very helpful the entire stay (reception, facilities service, house keeping, with a special shout-out to Khaoula). Perfect location, in a great neighborhood, with easy subway excess and great food options all around. Great rooms, we had the quietest stay with best sleep here in NY (compared to 5 other hotels during our trip). After checkout, the staff continued to be just perfect hosts, storing luggage until the end of the day and allowing us to freshen up, have a coffee and wait for our taxi (arranged by hotel).  Thank you.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Fabulous hotel in a great location","lang":"en","publishedDate":"2023-06-08","publishedPlatform":"MOBILE","rating":4,"text":"We stayed at this hotel for 5 nights last week,  hotel staff were very friendly and welcoming.   Our room was lovely, spacious and clean,  we were told to advise reception if we wanted our room cleaning.  Great location and quiet of a night,  we could see the Empire State Building out of our window to the left and the Chrysler Building to the right.  Would recommend anyone staying at this hotel and would stay there again. ","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Hotel in an excellent location.","lang":"en","publishedDate":"2023-06-05","publishedPlatform":"OTHER","rating":4,"text":"The room was clean, the staff is very nice and helpful. There is no refrigerator in the room, as is customary in America..The rooms are a bit small. I personally had a bad sleeping experience, the mattress was in a very bad condition.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"GREAT STAY!!!","lang":"en","publishedDate":"2023-06-05","publishedPlatform":"OTHER","rating":5,"text":"I must say that this was a great stay, one of the best Best Western's that I have stayed at, regarding cleanliness and staff support.  My wife was impressed by the staff as a whole.  The exceeded expectations clearly.  Great stay!","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Unforgettable Stay in New York","lang":"en","publishedDate":"2023-06-05","publishedPlatform":"OTHER","rating":5,"text":"Excellent location near all the top tourist venues. Very helpful and friendly hotel staff who deal with all service request efficiently and with a smile! The room was comfortable and the housekeeping very good .As a bonus we could see the Empire State building from our window which was a very pleasant surprise. I highly rate this hotel, especially if this is your first visit to New York. I am already planning my next visit at this hotel and this time I will stay longer than 7 nights. Well done to all the staff at Best Western, you are a 5 star team and congratulations to the hotel owners for running such a professional team!","travelDate":"2023-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"NYC Hotel","lang":"en","publishedDate":"2023-06-04","publishedPlatform":"OTHER","rating":4,"text":"The hotel was located in a great spot, very convenient for walking and subway.  We had one small incident, the shower door didn't seal well and we had water running out of the bathroom into the room!  It was taken care of promptly.\n\nThe best thing was Khaoula who worked the front desk.  She rocks!!  Excellent suggestions for places to eat and how to get around the city.  She outshined the other employees, what a gem.  Best Western needs to reward her!","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Stay here in NYC!","lang":"en","publishedDate":"2023-06-03","publishedPlatform":"MOBILE","rating":5,"text":"Perfect place to stay in NYC! Super close to Times Square (just a few blocks, easy to walk), but right out of the noise and chaos. Very comfortable and clean rooms, kind staff at front desk.  Nice amenities in lobby and rooms too. We'd stay here again!","travelDate":"2023-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Quick side trip while attending NCAA Div ll National Rowing Championships","lang":"en","publishedDate":"2023-05-31","publishedPlatform":"OTHER","rating":5,"text":"Our daughter's Varsity Rowing team qualified for the National Rowing Championships being hosted in Pennsauken, NJ.  We couldn't travel this far (West Coast Canada) and not see the Big Apple, so we booked 2 nights in Manhattan.  Best Western is our go to accommodation and the Best Western Premier Empire State Hotel did not disappoint! All staff were super friendly, helpful and professional.  Our room was spotless and well appointed.  Location, being just a block and a half from the Empire State Building was perfect to head out in all directions to easily see a multitude of attractions.  We would stay here again, and will certainly recommend to friends and family.","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"convenient and comfortable hotel","lang":"en","publishedDate":"2023-05-30","publishedPlatform":"OTHER","rating":4,"text":"Unpretentious hotel in ideal location, close to main sites - a stone's throw from Empire State Building.\nRoom very comfortable and service friendly.\nNY Library and Bryant Park nearby, Grand Central Station too.\nTimes Square a good walk and Central Park too.\n","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Thanks to Khaoula","lang":"en","publishedDate":"2023-05-24","publishedPlatform":"OTHER","rating":5,"text":"We were 3 French friends including one person in a wheelchair, the hotel is very well located and clean.\nOur first room lacked a little space for my friend in a wheelchair and thanks to Khaoula, receptionist at the hotel, we were able to change rooms.\nKhaoula did not only that, she simply brightened my stay by her kindness, attentions and smiles.\nIt is rare to find such a nice and professional person in life, the stay would not have been the same without her and I thank her again with this comment.","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Place to Stay!","lang":"en","publishedDate":"2023-05-24","publishedPlatform":"OTHER","rating":5,"text":"This is a great location with friendly and helpful staff. We were close to everywhere that we wanted to visit. The room was nice and very clean. The beds were really comfortable. We were very happy with this hotel!","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excellent New York City location","lang":"en","publishedDate":"2023-05-19","publishedPlatform":"OTHER","rating":5,"text":"I would recommend this Best Western location. Nestled between Madison and Park Ave and within east walking distance of multiple quality restaurants, shops, Times Square, etc. We had a view of the Empire State Building. Staff were super helpful. Rooms were clean and well maintained. I would stay here again. ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great stay","lang":"en","publishedDate":"2023-05-16","publishedPlatform":"OTHER","rating":5,"text":"Overall wonderful stay. Great value for the location. Good shower pressure and really comfortable bed. Stayed in nyc numerous times. Stones throw to Herald square. I’ll definitely be back and recommend this location.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Conforto e localização privilegiada","lang":"pt","publishedDate":"2023-05-16","publishedPlatform":"MOBILE","rating":5,"text":"Hotel bem localizado, quarto confortável e limpo. Possui amenidades, como água gelada, chá e café disponíveis no lobby. Pessoal da recepção muito atencioso em atender a todas as necessidades dos hóspedes. Estadia incrível. Recomendamos.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23542350,"title":"Hotel consigliatissimo","lang":"it","publishedDate":"2023-05-10","publishedPlatform":"OTHER","rating":5,"text":"Hotel ottimo, come tutti i servizi igienici e assistenza reception, in particolare Khaoula, ragazza dolcissima e gentilissima, sempre disponibile e attenta ad ogni nostro bisogno. Consiglio questo hotel anche per l'ottima posizione.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great value for the price","lang":"en","publishedDate":"2023-05-08","publishedPlatform":"OTHER","rating":5,"text":"Great value for the price. Clean and comfortable. Not the largest rooms, but common for Manhattan and large enough. Bed was great. Free coffee and water in lobby. Really nice staff. Would gladly stay again if the price-value ration remains the same.","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"STAY HERE...BEST HOTEL IN NYC","lang":"en","publishedDate":"2023-05-06","publishedPlatform":"OTHER","rating":5,"text":"There is nothing bad to say about this place. Beginning with the check in (we arrived about 2 hrs ahead of check in time) and asked about leaving our bags there so we could get out to the city without baggage. They were kind enough to let us check in early at no extra cost. Room was super clear, small (but it is NYC) and you are really only there to sleep so it was no problem. I cannot emphasize how clean it was and how exceptionally friendly their staff is. The young lady who checked us in (I'm slapping myself for not getting her name) is probably the friendliest hotel staff I have encountered in a long time. She was working the morning shift on May 5th. Staff is vigilant and greets you each time to go in or out, that made us feel welcome and safe (because they offered to give directions and recommendations).  Location is excellent, shielded from the chaos of 5th street and within walking distance to Time Square\/Rockefeller Plaza (one in out party was on a wheelchair and we still walked there so its close). We didn't try the breakfast because the day time walking made us sleep in, but it sounded amazing. I would recommend this place in a heartbeat, if I ever come to the Big Apple again...this is def the place for me!!!","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great location, friendly staff","lang":"en","publishedDate":"2023-05-06","publishedPlatform":"OTHER","rating":5,"text":"Great location, just 3 blocks from Empire State Building & the subway. Not much street noise from our room. There are only 6 rooms per floor. I had a king room & the space was enough for the 2 of us. We were able to get early check in and they let us leave our luggage before checking in & after checking out. Check in\/check out process was quick & easy. We would definitely stay again! ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Boa localização com custo\/benefício adequado","lang":"pt","publishedDate":"2023-05-05","publishedPlatform":"MOBILE","rating":4,"text":"Excelente localização, instalações muito confortáveis, limpeza adequada, mas deve ser solicitada, conforto térmico.\nO banheiro é excelente, ducha ótima, box perfeito.\nPonto que necessita atenção: isolamento acústico dos apartamentos é falho. O som dos corredores, dos elevadores é ouvido dos aposentos.\nElevadores demorados nos horários críticos.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great hotel in good location","lang":"en","publishedDate":"2023-04-29","publishedPlatform":"OTHER","rating":5,"text":"Yes, the rooms are smaller than expected as others have mentioned, but as many say, you're there to sleep. Beds were comfy. Clean rooms and attentive room service. Friendly staff. Location was great, down a quiet street between two main ones. Yes, elevator was slow, as some have also mentioned, but not a big deal, unless you're in a rush. First floor space available to work, if needed. Didn't get to try the breakfast. Small coffee\/tea brewer available in room. Cab service to airport available at front desk. A little pricier than regular cab service, but they get you there fast (and you feel like a celeb). Make sure that it's a cab and not a private service called for you.","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"A disastrous stay","lang":"en","publishedDate":"2023-04-26","publishedPlatform":"OTHER","rating":1,"text":"Tiny rooms that we couldn't move in.\nShower leaks into the bathroom\nRain leaked into our room from a closed window.\nWalls are paper thin and we heard doors  slamming all night.\n\nWorst of all, the hotel did not put any signs to indicate wet stairs. I fell and was bruised pretty badly. When I asked to see or call a manager, I was told there was no manager available at 1:30am.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Buen lugar para alojarse","lang":"es","publishedDate":"2023-04-21","publishedPlatform":"MOBILE","rating":4,"text":"Era nuestro 16 viaje a NY y lo elegimos porque queríamos quedarnos en la zona de Macys. El personal es muy amable y hacen lo posible por ayudarte. Las habitaciones son bastante pequeñas pero bien equipadas, aunque se hacen justas para moverse 2 personas  en la doble de una cama de matrimonio o 3 personas en la que tiene 2 camas dobles.\nOfrecen servicio de transporte al aeropuerto con precio adecuado , y servicio de desayuno aunque nunca lo probamos porque desayunábamos fuera.","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Nice room and great service","lang":"en","publishedDate":"2023-04-13","publishedPlatform":"OTHER","rating":5,"text":"Central position, nice and clean room and a great service by Khaoula at the front desk. Reasonable price. My trip was for business but will recommend it for leisure travel as well. Breakfast was the only thing that was ok.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23542350,"title":"Excellente","lang":"fr","publishedDate":"2023-04-12","publishedPlatform":"OTHER","rating":5,"text":"Excellent hôtel très bien situé ! Chambre propre et literie hyper confortable !\nPersonnel très agréable et gros plus Khaoula parle français et nous a beaucoup aidé !\nJ'y retournerai sans hésiter nous y avons séjourné 7 nuits par contre nous n'avons pas pris le petit déjeuner pour partir tôt le matin \nDe l'eau du café et du thé sont à volonté dans le hall de l'hôtel vous pouvez même manger dans un espace réservé vos plats à emporter","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"A Week in NYC at a Great Hotel","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":5,"text":"I just spent a week in NYC on a business trip. I stayed at my favorite NYC hotel, the Best Western Premier Empire State Hotel. I have been there before and loved it every time. The front desk staff warmly greeted me on my arrival. I must praise the Gen. Mgr. Jay Singh, who hires the most caring and helpful staff. The hotel feels like a second home to me. Special praise to the women at the front desk,Khoula and Afsheen. One of the best parts of the hotel is that a great breakfast is included,prepared by Maria and Daisy. The food is really good and the breakfast room is spotless.  I loved my room and the maid service was excellent. The complimentary coffee,tea and ice water in the lobby adds a special touch. Gen Mgr.Jay Singh, you are a true professional!","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"מלון מושלם למטיילים בניו יורק","lang":"iw","publishedDate":"2023-04-08","publishedPlatform":"OTHER","rating":5,"text":"מלון מצוין, שירות הכי טוב שאפשר לבקש, סגנית המנהל- קחולה הינה מקסימה לבבית ומסבירת פנים ותמיד עם חיוך! \nהמלון נקי ומסודר, ארוחת בוקר טובה עם מגוון רחב של אפשרויות והמיקום מעולה.\nתודה לצוות ובעיקר לקחולה היקרה.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"데스크의 직원분이 매우 친절하고 방도 좋습니다","lang":"ko","publishedDate":"2023-03-31","publishedPlatform":"OTHER","rating":5,"text":"신혼여행으로 이 호텔을 선택하였습니다\n데스크에 있는 카우라(KHAOULA) 직원분이 매우 친절하고 밝게 응대해주셨습니다\n덕분에 뉴욕에서 첫날을 기분좋게 보냈습니다\n다음날 체크아웃 할 때도 밝게 인사해주셔서 너무 좋앟습니다\n방도 매우 깨끗하고 좋아 다음에 뉴욕을 방문하더라도 꼭 다시 방문하고 싶습니다\n\n이 호텔은 안전한 골목에 위치해있고 주변 지하철 역이랑도 가깝습니다\n","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Service!  Great Location!","lang":"en","publishedDate":"2023-03-31","publishedPlatform":"OTHER","rating":5,"text":"The hotel is a little jewel nestled near the Empire State Building.  We walked the city north and south from this great location.  The front desk staff are extremely personable and helpful.  Can't wait to come back!","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Family Vacation","lang":"en","publishedDate":"2023-03-26","publishedPlatform":"MOBILE","rating":5,"text":"Great experience… high level hotel …. Top quality staff!!! But Khaoula…. Was really the best! We spent 5 days at the top in a marvellous city an fantastic hotel. Position is strategic. Rooms are big and very very comfortable… we Elio come back sono","travelDate":"2023-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23542350,"title":"Ein gutes Hotel in guter Lage mit besonders freundlichem Personal!","lang":"de","publishedDate":"2023-03-21","publishedPlatform":"OTHER","rating":5,"text":"Eigentlich sind wir zufällig in diesem Hotel gelandet, weil unser gebuchtes Hotel uns hierhin umgebucht hat. \nDie Lage ist klasse, die Zimmer gefühlt etwas größer, als die sonst in New York recht beengten Räume und das Bad ebenso.\nAuch das Bett war sehr gut. Einziger \"Kritikpunkt\" wäre aus meiner Sicht die Geräuschkulisse. Ein Großteil sicher der zentralen Lage geschuldet, aber die Fenster könnten sicher noch etwas besser schallisoliert sein.\nEine Besonderheit zudem die Möglichkeit, im Foyer kostenlos Kaffee, heißes Wasser und gekühltes Wasser (ohne Chlor-Geschmack ;-)) zu bekommen.\n\nWas diese Reise auszeichnete und von anderen abhob, war das Drumherum und die Atmosphäre im Hotel: Das Personal war besonders freundlich, man fühlte sich schon ab dem Einchecken willkommen. Ich übernachte beruflich häufig in Hotels und immer wird man mit einem \"herzlich Willkommen\" begrüßt. Das besondere hier war, dass man irgendwie das Gefühl hatte, dass das wirklich ernst gemeint war, es kam von Herzen.\nUnser Dank für einen schönen Aufenthalt gilt besonders Khaoula, die uns beim Einchecken dieses Gefühl des Willkommenseins vermittelt hat.\n ","travelDate":"2023-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Stay","lang":"en","publishedDate":"2023-03-15","publishedPlatform":"OTHER","rating":5,"text":"Location is excellent, walking distance to times Square, empire state building and lot of attractions. Close to korean town with excellent cheap eats. \nStarr are very friendly and helpful. Afsheen at front desk delivers excellent service. Fridge was available upon request in iur room as we needed it to store food for kids. \nLounge area with free coffee, hot water and iced water was a bonus. Microwave is also available in the lulounge. Will definitely come back. ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23542350,"title":"We’d definitely come back again","lang":"en","publishedDate":"2023-03-15","publishedPlatform":"OTHER","rating":5,"text":"We loved our stay! Despite being located in Manhattan, the room was very quiet and comfortable. We also really enjoyed the hot coffee, tea and water in the lobby. There was nothing at the bar during our stay, but we still enjoyed the lounge area one of the nights. Lastly, we felt really safe here. The hotel is in a great location, there was always someone at the front desk,  and we needed our keycard to access our room and even the specific floors on the elevator for extra security. ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"GREAT value & excellent hotel in NYC","lang":"en","publishedDate":"2023-03-13","publishedPlatform":"OTHER","rating":5,"text":"I stayed here for 3 nights for work and for the price it was TERRIFIC! Rooms are on the small side, but it IS New York, but the quality of sheets, pillows, towels and toiletries were great. Daily housekeeping was so appreciated.  \n\nThe Staff was excellent. The check in manager (Khaola) was incredibly professional, friendly, helpful and generally a darling! She remembered me every night when I came back in the evening!!\n\nThe lobby was spotless and welcoming. Appreciated the all day coffee and tea. The \"living room\" off the lobby was also a great place to get a bit of work done or meet.\n\nThe location was great - away from the pot smoke and general mess  in Times Square  - but still accessible by subway. A few terrific upscale coffee shops nearby. \n\nI would not hesitate to stay here again.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23542350,"title":"Flo","lang":"fr","publishedDate":"2023-03-13","publishedPlatform":"OTHER","rating":5,"text":"Nous avons été très bien reçu par tout le personnel et notamment Khaoula à l'accueil qui s'est très bien occupée de nous, car en plus elle parle farnçais....\nL hotel est très bien placé pour visiter , très propre et bien chauffé, pas de bruit de la rue et la chambre est faite tout les jours. Le petit déjeuné est copieux et varié. restaurants variés en face de l hotel.","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Hotel!","lang":"en","publishedDate":"2023-03-03","publishedPlatform":"MOBILE","rating":5,"text":"This hotel exceeded our expectations. Jay and his staff were very friendly and professional. The hotel was clean and bright and an excellent value.  The rooms were very comfortable    The location was central . We highly recommend it.","travelDate":"2023-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23542350,"title":"Super","lang":"fr","publishedDate":"2023-02-28","publishedPlatform":"OTHER","rating":5,"text":"Super propres, très bien situer et personnel très accueillant. Lit confortable et peu de bruit extérieure.Je recommande a 100%\nSeul bémols le déjeuner n’est pas super mais plusieurs restaurants de déjeuner au alentour","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Séjour fabuleux","lang":"fr","publishedDate":"2023-02-28","publishedPlatform":"MOBILE","rating":5,"text":"Hôtel propre, prestations de haut niveau . Lit confortable, pas de bruit et le Personnel sympathique surtout KHAWLA ! Souriante, réactive, elle parle anglais français et arabe ! Merci beaucoup khawla. Je reviendrai à cet hôtel et je le recommande fortement. \nBien cordialement \nabdel Majid de Paris","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Worth a visit!","lang":"en","publishedDate":"2023-02-27","publishedPlatform":"OTHER","rating":5,"text":"the hotel was definitely a 10\/10 my girlfriend and i liked it very much it was very clean the location was perfect and everyone at the reception no matter if early late or night shift was always polite and helpful with greetings to Afsheen. the breakfast was also very tasty. it is definitely worth a visit and we will be back. many thanks for everything from Justin and Alexandra","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"최고의 Receptionist가 있는 호텔!!","lang":"ko","publishedDate":"2023-02-24","publishedPlatform":"OTHER","rating":5,"text":"호텔 객실\/위치\/가격 모두 최고였습니다. 한인마트와 가까워서 한국인들이 머물기 좋을 것 같아요.\n특히나 Receptionist들, Kaoula 와 Afsheen가 굉장히 친절하게 응대해주고, 또 굉장히 많은 도움을 주었습니다. 완전 강추하는 호텔이에요!\nThank you again Koula and Afsheen! :)","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"KHAN","lang":"en","publishedDate":"2023-02-19","publishedPlatform":"OTHER","rating":4,"text":"we had in first a lot of problem, a reservation in a best western QUEENS it was very bad because they cancelled our reservation 4 days before!\nBut finally we find the best western premier empire state and the staff were very nice with us in particular KHAN! Thanks a lot at him, he is very smiling and nice, we will come back just for said « hello » at him ahah !\nInes Eden and Maelle.","travelDate":"2023-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great experience","lang":"en","publishedDate":"2023-02-17","publishedPlatform":"OTHER","rating":5,"text":"This hotel was a  perfect place to stay for us while we were busy enjoying NYC and taking care of some business.  Everything you'd need in a room and wonderfully friendly and helpful gentlemen at the front desk.  The young women receptionists--not so much.  Stick with the men and you'll be fine.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Fantastic Hotel in a Great Location","lang":"en","publishedDate":"2023-02-13","publishedPlatform":"OTHER","rating":5,"text":"We have just returned from a fantastic trip in New York City. The hotel had everything we needed. The staff especially Khaoula and Khan were exceptional. So friendly and helpful. Always a smiling face and a warm greeting. They went to extra lengths when our flight home was cancelled and did everything to help us. Our room was spotless and very comfortable. The complimentary tea\/coffee and water in the foyer were very welcome after a long day out and about. Can't wait to go back!!!","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Bel hotel ..mais","lang":"fr","publishedDate":"2023-02-13","publishedPlatform":"OTHER","rating":3,"text":"Petit déjeuner a fuir, bien trop cher et à 200m vous avez un PDJ bien plus copieux a 50% d autre part, inutile de vous presenter en salle de petit déjeuner sans avoir paye d avance à la reception..moi je n ai pas aime cette approche","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Best Western, Premier Empire, State Hotel, New York","lang":"en","publishedDate":"2023-02-13","publishedPlatform":"MOBILE","rating":5,"text":"What a great hotel, very friendly staff. On arrival. Staff noticed it was my girlfriend‘s birthday and upgraded our room free of charge due to this hotel is very clean and staff are very helpful. One staff member was super helpful. Khadula was absolutely brilliant","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"KHAOULA Bouziane and Best Western","lang":"en","publishedDate":"2023-02-12","publishedPlatform":"OTHER","rating":5,"text":"Number one KHAOULA Bouziane is the main reason while I will go back. This wonderful sweet young lady knowledge of New York and Hotel surroundings is just incredible, I oversaw the hotel flaws because of her. Will I go back? Absolutely YES! Just because Khaola has my back!!! ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"High standard customer service","lang":"en","publishedDate":"2023-02-07","publishedPlatform":"OTHER","rating":5,"text":"I stayed there for 2 nights...Both Shein and Munseer provide gold standard customer service.  Shein is very attentive and made sure to make this stay a very comfortable one for me. \nGreat location and great staff!","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Bel endroit et belle rencontre","lang":"fr","publishedDate":"2023-02-03","publishedPlatform":"MOBILE","rating":5,"text":"L’hôtel est très bien situé, vous êtes accueillis chaleureusement par Khaloula à la réception, un vrai rayon de soleil, qui prend soin de vous durant tout le long de votre séjour. La chambre est spacieuse et propre. Le lit est comfortable et vraiment douillet. Je vous recommande  à 100% cet hôtel pour votre séjour à NY","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Perfect for a business trip in midtown","lang":"en","publishedDate":"2023-02-01","publishedPlatform":"OTHER","rating":5,"text":"I booked this hotel because it was the most affordable in the midtown area, near the office I would be working out of but also near Penn Station. However when I entered, I was very pleasantly surprised. Great value for money. First, they were very accommodating with keeping my luggage safe when I first arrived, and even offered to let me check in early. However I was in a hurry so I just left my luggage downstairs. Upon returning later that night, Khaloula was so helpful. She gave me my luggage I had previously checked in, we chatted briefly, and she gave me a free upgrade to a room on a higher floor with a great view of the empire state building! I've stayed in Manhattan fairly often, but this may be the first time I get a view thats more than just a brick wall. It was a touch I greatly appreciated.\n\nThe room itself is clean, simple, kinda small but hey it's midtown New York, what do you expect? But for what I needed, it was perfect. Bed was comfy, great view at night, solid wifi. Highly recommend for other business travelers.","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Estadia incrível!","lang":"pt","publishedDate":"2023-01-30","publishedPlatform":"OTHER","rating":5,"text":"Estive com minha família neste hotel entre os dias 13 e 17 de novembro. A estadia foi perfeita! O staff é super amigável, prestativo e fizeram todo o possível pra tornar nossa estadia a melhor possível. O quarto não era enorme, mas bem novo, muito limpo, com frigobar (um raridade) e as camas são muito confortáveis. No lobby sempre há café e chá disponíveis. A localização é excelente, o lugar é tranquilo, há transporte público acessível e opções de alimentação bem pertinho (inclusive Trader Joe's e Whole Foods a poucas quadras). Mas tenho que ressaltar: o destaque é mesmo a equipe! \nAdoramos a estadia e pretendemos voltar sempre!\n","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23542350,"title":"Stuck in an Elevator; Hotel Didn't Care, Stay at Your Own Risk!","lang":"en","publishedDate":"2023-01-29","publishedPlatform":"OTHER","rating":2,"text":"First, I want to say that Premier hotels are supposed to be better hotels than the standard BW-branded hotel.  If you were looking only at the building (just over a year old) you might be fooled into believing that this is a Premier hotel, but beyond the look there isn't much Premier about it.  I don't think BW should continue to market this hotel in its current brand class.  \nThat said, I stayed two nights in this hotel because of the geographic proximity to some meetings.  The location is very good, if you can get OUT of the hotel.  On the second night, as I was leaving for a dinner, I got stuck in the elevator.  The telephone button in the elevator didn't work.  My cell phone did, but the front desk could barely hear me.  The staff did indicate they would send help, but were noncommittal about when that would arrive.  The receptionist did not know my name or my room or whether I was a guest or visitor, but she was very against my calling the fire department.  I decided to ask NYFD (Ladder 24 gets 5 stars) to get me out, and once they were called they got me out of the elevator relatively quickly from the time they were dispatched.  That said, the hotel played no part in helping me, and once I got out and left for the night, upon return the elevator was still out of service.   I missed dinner because the restaurant closed.  The next day the hotel indicated they had done more than the Fire Dep't (totally untrue).  I also learned that the hotel is used to the elevator not working - again, new hotel, new elevators, but the hotel knows there's a problem (likely electrical) and they haven't fixed it.  While some staff members are nice (hence I'm rating this hotel poor as opposed to terrible), management is terrible and fails to take responsibility.","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23542350,"title":"Very supportive service staff and great location!","lang":"en","publishedDate":"2023-01-28","publishedPlatform":"OTHER","rating":5,"text":"We booked a night at the hotel as friends and accidently booked a queensize bed.\nThe super kind staff member Khaoula helped us with our problem and helped us find another room - Thanks again for that!\n\nRoom was in nice condition, clean bathroom and beds were comfy. Only small thing was that the air conditioning took very long to get heated but also that did not change our opinion here.\n\nDefinitely recommended if you want to spend a night in the middle of NYC for an affordable budget","travelDate":"2023-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Weekend stay","lang":"en","publishedDate":"2023-01-16","publishedPlatform":"OTHER","rating":5,"text":"Great location very good value a new hotel walking distance to subway friendly helpful staff \nFree breakfast away from traffic so no noise at night restaurants and bars close by. It was only two stops to Times Square on 28 th st subway ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Khaula","lang":"en","publishedDate":"2023-01-15","publishedPlatform":"OTHER","rating":5,"text":"First, I’d like to give a special thanks to Khaoula, the receptionist; she is very nice, sweet, helpful, welcoming, and all of the above. She honestly deserves the manager or assistant manager position; she and all of her colleagues are all dressed professionally and nicely as well, but she was literally the best. In addition to my review of the Best Western Premier Empire State Hotel, the rooms are very nice and clean, all the staff are wonderful, housekeeping is very nice and helpful, and it fulfilled all my needs in a timely manner... I greatly appreciated Khaoula for making my experience wonderful. This brings my review of the Best Western Premier Empire State Hotel to a close. I will definitely be returning to this wonderful hotel. ~Khamari ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Fantastic experience!","lang":"en","publishedDate":"2023-01-06","publishedPlatform":"OTHER","rating":5,"text":"Superlative staff! New & clean rooms and bathrooms albeit small - BUT you are in the heart of Manhattan next to the Empire State! The staff is 5 stars! Khoula gave me her personal heater once when the heating system in the lobby wasn’t working and I had some very important work to do there.  Marie the breakfast lady was my son’s favourite. Check in by Druhv was the smoothest ever! Jay was most personable and Afsheen was very helpful with our airport drop. Suggestion to please keep the left over breads, donuts, bagels and croissants from breakfast, next to the tea\/coffee station in the lobby, instead of throwing it away. This way BW can curtail its wastage too! My husband has said the next time we come to NYC, we are definitely staying here again! ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"¡Muy buen hotel para alojarte!","lang":"es","publishedDate":"2022-12-25","publishedPlatform":"OTHER","rating":4,"text":"Mi madre y yo estuvimos un total de 5 noches. Su mayor punto fuerte es que es un hotel muy céntrico, el servicio por parte de los trabajadores fue estupendo. Las instalaciones son bastante buenas, hay una zona con mesas y sillones para descansar o cenar si traes comida de la calle, además dispone de dispensadores de café y agua fría y caliente con bolsitas de té, totalmente gratis y 24 horas.\nEn la planta baja está la zona de desayuno (bastante completo), a nosotras nos regalaron el primer día de desayuno.\nCon respecto a las habitaciones están bastante bien, equipadas con una pequeña neverita, plancha, TV, y el baño con gel y champú, crema corporal, gorro para la ducha, secador de pelo y suficientes toallas. Lo que más destacaría son las camas, el colchón es comodísimo. Algo que deja de desear es la limpieza y además  solo limpian días alternos, si quieres más días puedes pedirlo en recepción.\nEn general es un hotel muy bueno, lo recomiendo sin duda. ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Parfait ","lang":"fr","publishedDate":"2022-12-19","publishedPlatform":"OTHER","rating":5,"text":"L’hôtel est propre et il est très bien placé. Il y a une cafetière avec café et thé à disposition. Nous avons la chance d’avoir une hôtesse se prénommant KHAOULA qui parle français et qui fait preuve d’un professionnalisme exemplaire. Elle est très disponible, à l’inécouté de nos demandes et d’une gentillesse incroyable. Elle nous a convaincu et lors de notre prochain séjour, nous reviendrons dans cet établissement sans hésitation. ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"First Time to visit the Big Apple","lang":"en","publishedDate":"2022-12-13","publishedPlatform":"OTHER","rating":5,"text":"management has assembled a team of first class people in customer service. Every staff member always greeted us with a smile. The hotel is very clean, elevators are fast. I would like to point out one of the front desk clerks. Khaoula was always welcoming when my family entered the hotel saying hello and calling us by name. Her customer service skills are AWESOME and this location is lucky to have her!!!!","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"👍🏽👍🏽👍🏽","lang":"de","publishedDate":"2022-12-12","publishedPlatform":"OTHER","rating":5,"text":"Sehr nette Geste vor allem die (Khaoula) war sehr korrekt. Die Zimmer waren sauber und das Hotel allgemein schön. Das Hotel befindet sich in einer sehr zentralen Lage. Zwei Block zum Subway. \n\nDanke für die schöne Zeit","travelDate":"2022-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"10 out of 10 experience","lang":"en","publishedDate":"2022-12-11","publishedPlatform":"OTHER","rating":5,"text":"Khaoula is the best receptionist I have ever encountered while visiting a hotel. Her smile and personality made the trip and stay 10x better! Would stay at this hotel again just because of the experience she provided! ","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Khaoula is the best","lang":"en","publishedDate":"2022-12-10","publishedPlatform":"OTHER","rating":5,"text":"Khaoula was the most amazing concierge and hostess. Great communication, even better customer service! Seriously, great experience. From check-in to check out to keeping my jacket safe… Thanks Khaoula :)","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"미국여행에서 가장 만족스러웠던 호텔","lang":"ko","publishedDate":"2022-12-07","publishedPlatform":"OTHER","rating":5,"text":"제목 그대로 미국여행에서 가장 만족스러웠던 호텔이었습니다. 1. 가성비가 좋아 여행경비를 절약할 수 있었어요. 2. 뉴욕 시내를 걸어서 다니기 편한 위치에 있어서 편했고 한인마트도 가까이 있었어요. 3. 무엇보다도 직원들이 모두 하나같이 친절했습니다. 특히 khaoula라는 직원은 우리가 한국인임을 알아보고 한국말로 인사를 건내주었어요 첫날 비가오고 먼거리를 운전해서 저녁에 도착하였는데 심신이 지쳐 있을때 그녀의 친절한 응대는 매우 커다란 위로와 안도감을 주었습니다. 너무너무 감사했어요~~","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Glad I switched","lang":"en","publishedDate":"2022-12-06","publishedPlatform":"OTHER","rating":5,"text":"A truly delightful, no nonsense,clean hotel . The rooms clean and just the right size for those who visit the city.  The staff was excellent.  Khaoula and the other front desk staff were extremely helpful, kind,fun, and efficient. Made for a worry free stay. And did I mention the lusciously comfortable beds?! Thank you","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Prestations médiocres pour un prix élevé","lang":"fr","publishedDate":"2022-12-01","publishedPlatform":"OTHER","rating":2,"text":"Petit déjeuner seulement si le personnel est présent sinon salle fermée et obligation d'aller à l'extérieur. Le mitigeur de la douche était défectueux. Les parties communes, couloir des chambres, n'étaient pas propres.","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"The most amazing wonderful front desk staff members in NYC","lang":"en","publishedDate":"2022-11-26","publishedPlatform":"OTHER","rating":5,"text":"I would like to tell all visitors in Manhattan who r looking for a real special nice warm welcoming high standard beautiful hotel pls pls listen to me and try out this hotel first and u will not regret , because they r blessed with the super very most top top best professional educated kind good-hearted staff that u have never met in any other hotel in the city , and i must pint point the 3 very very very top most blessed staff members by their names and they r ''''''''KHAOULA ''''''' JAY ''''''' AFSHEEN ''''''' those 3 r real walking angles and they will make SURE that u will always want to come back to this wonderful stay like i do . May God bless u all with happy holidays and a very happy upcoming new years . Israel Apter . Colorado .","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"A Hidden Gem in New York ","lang":"en","publishedDate":"2022-11-25","publishedPlatform":"OTHER","rating":5,"text":"My stay at the Best Western Premier Empire State was absolutely wonderful and made travelling around the heart of Midtown Manhattan so much easier than I had previously thought. What was especially impressive about this hotel was that it is in a safe, relatively quiet location with perfectly clean rooms and generous amenities. One aspect of our stay which we found to be particularly impressive was the completely free coffee, tea and water. This might sound fairly insignificant, although having visited a number of other New York hotels with friends, it is surprising how rare it is to find such amenities free of charge. This is excellent for morning coffee as well as allowing you to fill up a water bottle for the day - in the process saving you a fair amount of money. The location is sublime, with Central Park, Fifth Avenue, Times Square and the Empire State Building within good walking distance. There are also plenty of shops around, including the likes of CVS, Walgreens and other convenience stores - useful if you need any necessities. You really do get an excellent value for money here and I must say I am very pleased with the service we received. The single BEST aspect of this hotel is the staff, though. They were very friendly when we arrived and was always helpful when we spoke with her. Some of the staff I did not get the names of but they were all kind, courteous and professional. The hidden gem of this hotel is definitely Khaoula - an absolutely phenomenonal member of staff. She always greeted us with an unparalleled enthusiasm and warm, beaming smile, which made us feel very much at home. Also, (not taking anything away from the other staff) Khaoula is an extremely hard worker who, is always doing her best to cheer up every guest. I am not exaggerating when I say that she might just be one of the best in her profession. What a beautiful person! Like I said, I think everyone working at that hotel deserves high praise. If you are thinking about staying here (and I spent an age trying to decide where) then in my experience this is the place. Absolutely brilliant.\n\n","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"I would Never Recommend this hotel especially if you are coming from out town. They DO NOT ACCOMMODATE PARKING for their","lang":"en","publishedDate":"2022-11-25","publishedPlatform":"OTHER","rating":2,"text":"I would Never Recommend this hotel especially if you are coming from out town. They DO NOT ACCOMMODATE PARKING for their GUESTS at ALL. You have to pay for parking $80 a day plus if you wanted to drive out and site see you MUST PAY another fee of $80 and you must be back by 12midnight or you would have to look for somewhere else to park your vehicle. The staff was AWESOME however the EXECUTIVE KING ROOM with MINI FRIDGE is EXTREMELY SMALL REALLY SMALL","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Best Location and Quality Hospitality","lang":"en","publishedDate":"2022-11-24","publishedPlatform":"OTHER","rating":4,"text":"Aside from this hotels’ cleanliness and convenient location! \n\nIt’s refreshing to have met Khaoula; from providing unmatched professionalism, a warm smile coupled with effortless five star hospitality. \n\nHaving that experience, I rave five star quality in my opinion. Thx for making me feel at home!!  ","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"24 hour stop in NYC","lang":"en","publishedDate":"2022-11-21","publishedPlatform":"OTHER","rating":5,"text":"The front desk employees were amazing when checking in and out.   The area was very quiet at night and the views were amazing.  I would definitely  stay here again.  'Easy to walk to from the subway and it was a great location from all the locations we wanted to see.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Safe?","lang":"en","publishedDate":"2022-11-15","publishedPlatform":"OTHER","rating":3,"text":"I didn’t use the necklace my Grandmom gave me since Im scared I might lose it outside or around the city, so I usually leave it in our hotel room . But im just frustrated I lost it there too 😥\nStaff were nice ,  clean room, but Im not sure anymore in comes of the security and safety of my things . :(","travelDate":"2022-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Superbe séjour à Manhattan ","lang":"fr","publishedDate":"2022-11-14","publishedPlatform":"OTHER","rating":5,"text":"Hôtel très bien situé (a deux pas de l’empire state building) et très propre. Personnel très accueillant et très à l’écoute avec une mention spéciale pour Khaoula. Buffet petit dej très bon rapport qualité prix. Très bon hôtel que nous recommandons.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Clean, modern and good value for the cost. Great location.","lang":"en","publishedDate":"2022-11-13","publishedPlatform":"MOBILE","rating":5,"text":"Excellent new, modern hotel close to MSG, Grand Central and Times Square. Very reasonably priced. Hotel staff were very friendly and the hotel was very clean.\nReally enjoyed the coffee and fresh water in the lobby which was available 24\/7. Only negatives are the walls are paper thin. We could hear people talking in the next room as well as having sex. Also the breakfast was not great. There were no eggs or bacon when we got there at 8 am and were never replenished in the half hour we were there. Disappointing but there were lots of breakfast options around. \nDid appreciate the late check out option of an extra hour as well as the front desk arranging for a taxi when we departed for the airport. Would definitely stay here again.","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23542350,"title":"Great customer service","lang":"en","publishedDate":"2022-11-10","publishedPlatform":"OTHER","rating":5,"text":"Honestly the receptionist. Was so helpful and sweet she helped me on several occasions i stay here a lot because of her. Has been nothing but a pleasure honestly . I thought she was management with how she handled the situation. Thank you Khaoula! I will be looking forward to seeing you everytime when i stay in Manhattan.","travelDate":"2022-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Khaoula Deserves a raise !","lang":"en","publishedDate":"2022-11-07","publishedPlatform":"OTHER","rating":5,"text":"Khaoula, at the front desk, gave us the best customer service that even 5 stars hôtels doesn’t give. Please give this girl a raise, she deserves it ! She was genuinely smiling all the time we were passing by and was very helpful with all our requests. I would definitely recommend this hotel not only for Khaoula but also because it is very well located: walking distance from great rooftops, restaurants and grocery stores. The room has a decent size, the bed was very comfy and the Wi-Fi was fast. Thank you, I would definitely come back again!","travelDate":"2022-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great service ⭐️⭐️⭐️⭐️⭐️","lang":"en","publishedDate":"2022-11-03","publishedPlatform":"OTHER","rating":5,"text":"Thank you so much for a great 8 day stay 😀 \nAnd a special thank you to Khaoula for great service!\nShe really made our stay so pleasant 🙂\nAlways with a smile and so helpful to answer questions and just so kind and professional.\nWe will definitely come back with a service like that ⭐️⭐️⭐️⭐️⭐️\n\nThe hotel is located in close proximity to restaurants, delis, smaller supermarkets and the tourist sights on Manhattan.\n\nIt’s clean, the room was perfect and a good environment in general in the hotel - we had a great view from the 18th floor towards Empire State Building and the classic water tanks.\n\nWe can strongly recommend this hotel if you are going to Manhattan.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Avis sur l’hôtel","lang":"fr","publishedDate":"2022-11-01","publishedPlatform":"MOBILE","rating":5,"text":"Hôtel parfaitement situé pour visiter les quartiers de New York.\nUn accueil dans l hôtel au TOP.\nMention spéciale à KHAOULA, hôtesse d accueil de l’hôtel, très gentille et aimable.\nElle nous a accueilli de fort belle manière avec des petites attentions chaque jour.","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Wonderful hotel!","lang":"en","publishedDate":"2022-10-30","publishedPlatform":"OTHER","rating":5,"text":"The hotel is great for its price!\nIt is a very clean room, with a king-size bed, and it's in the heart of Manhattan!\nthe staff was very warm and helpful!\nThanks you Khawla, you make your stay wonderful!","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Ett dygn i New York (Mellanlandning)","lang":"sv","publishedDate":"2022-10-30","publishedPlatform":"OTHER","rating":3,"text":"Hotellrummet var okej och personalen var trevliga och hjälpsamma. Sen priset, enligt mitt tycke var det ett väldigt högt pris med tanke på att det bara ingick ett rum. Ingen frukost eller andra aktiviteter på hotellet. Sova för 5300kr. Men men, detta är väl New York😃","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"NYC trip","lang":"en","publishedDate":"2022-10-29","publishedPlatform":"MOBILE","rating":3,"text":"3 stars mainly because I feel it's too expensive for what you get. \nFront desk was very friendly and extremely helpful.  Especially Khaoula and Lola. They willingly answered all of our questions and helped us navigate the city. \nRoom did the trick, just hard to spend roughly $1,100 bucks for a 3 night stay and not have any amenities or a super clean\/nice room. Guess I'm not used to NYC prices because that much money where I am from will get you an amazing suite! Room was small and basic. Bathroom could have been cleaner. \nLocation was pretty good. Within walking distance of a lot of things and felt safe enough walking to it late at night from Times Square.","travelDate":"2022-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Friendly and helpful staff\/ expensive for just a room","lang":"en","publishedDate":"2022-10-29","publishedPlatform":"OTHER","rating":3,"text":"It was expensive and the room was small.  The bathroom was very tiny. The toilet paper falls off, we had used bar soap left in the shower.  it was not clean. Khaoula at the front desk was very helpful though and friendly. ","travelDate":"2022-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Clean and reasonably priced","lang":"en","publishedDate":"2022-10-25","publishedPlatform":"OTHER","rating":5,"text":"We found this hotel to be very clean and at a reasonable price for NYC.  The beds and pillows were comfortable and the room size was adequate for 2 people.  We did not notice outside noise once we were in our room.  The front desk was very helpful.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Very nice hotel with excellent employees","lang":"en","publishedDate":"2022-10-23","publishedPlatform":"OTHER","rating":5,"text":"It was a very nice hotel: clean, fine beds and nearby all sights. The hotelemployees  were very kind and helpfull! Especially Lola who helped us print our boarding cards the night before leaving. We were very satisfied!","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Hotel in New York","lang":"en","publishedDate":"2022-10-17","publishedPlatform":"OTHER","rating":5,"text":"Stayed at the Best Western Empire State Hotel.  The hotel was exceptionally clean and the room was bigger than you would expect in New York. We felt safe at all times. The hotel is about a year old so it is pretty updated.  Coffee pot in the room which is a big plus for me.  The hotel staff went out of their way to help with  transportation questions and the best way to get where we were going.  It is right by Korean town and had some good food out the door and down the block.  I would stay there again.","travelDate":null,"tripType":null}
{"helpfulVotes":0,"locationId":23542350,"title":"Molto soddisfatta","lang":"it","publishedDate":"2022-10-10","publishedPlatform":"OTHER","rating":4,"text":"Location fantastica, le camere un po’ piccole ma pulitissime.\nLo staff è gentilissimo e disponibile.\nIn camera c’è la macchinetta per il thè e il\nCaffè.\nLa colazione su richiesta, costa solo 10$ a persona ed è un ricco buffet dolce e salato.\nIl caffè e il the sono sempre disponibili al piano terra, così come l’acqua e il ghiaccio","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Staff and Terrific Hotel!!","lang":"en","publishedDate":"2022-10-02","publishedPlatform":"OTHER","rating":5,"text":"Khaoula was extremely helpful during a time crunch on a business trip a few weeks ago.  Also, the hotel is well located, has a good feel to it and creates and overall excellent travel experience.  Really happy that I chose this hotel!!","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Beautiful smiles all day long","lang":"en","publishedDate":"2022-10-01","publishedPlatform":"OTHER","rating":5,"text":"Shout out to the staff, Khaoula and Lola welcomed us every time we entered the lobby and wished us well as we went out sightseeing.  Very personal which I never experienced before.  The hotel was very clean and the location was very close to the subway and the Empire State Bldg, times square a couple of blocks away.  I highly recommend this hotel.  We were very comfortable.  I would stay here anytime again.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23542350,"title":"Exceeded my expectations considerably","lang":"en","publishedDate":"2022-09-22","publishedPlatform":"OTHER","rating":5,"text":"I wasn't expecting a lot from a budget hotel and was ready for a disappointing experience. However, I was very pleasantly surprised by a number of factors. From the start, I was impressed with the level of friendliness by the reception. They were warm and very helpful. Then my room was perfectly formed, having all the key attributes such as a lovely big and comfortable bed, nice soft sheets, space for my suitcase, a nice open closet, coffee and tea, ironing board and iron. The room seemed to be designed very well. The bathroom was lovely with white marble. Importantly, the room was very clean and crisp!","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great, Restful Centrally-Located Spot in the City","lang":"en","publishedDate":"2022-09-18","publishedPlatform":"OTHER","rating":5,"text":"My husband and I were thankful to have a place to stay that was walkable to and from our business meetings and conference that we were in town for. \nEvery night was restful and enjoyable with the excellent, friendly staff and refreshing water station and hot tea\/coffee station to come back to. \n\nWe definitely aim to stay here again on our next NYC trip. ","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Very good stay as usual","lang":"en","publishedDate":"2022-09-15","publishedPlatform":"OTHER","rating":5,"text":"I stay at this hotel every month here for work and what I like is that  the rooms are always clean and the staff are awesome by being very helpful and friendly.  I will continue to use this hotel since it's very good and convenient to everything.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excelente ubicacion","lang":"es","publishedDate":"2022-09-07","publishedPlatform":"MOBILE","rating":3,"text":"Sinceramente, elegi este alojamiento por las buenss criticas que tenia. Yo voy a contar exactamente mi experiencia.\nLa situacion es extraordinaria, pq esta situado en medio camino de todo, ya que esta a 200 mts del empire state y de la 5 avenida.\nSinceramente, las fotos no tienen nada que ver con la habitacion. Si, las camas comodiiiiiiisimas , pero para subirte en ella tenias que entrar de lado. Lo peor respecto a la habitacion, la poca o nula limpieza, no que no la limpien sino lo pides, que tambien, pero es que el dia de la llegada habia en el baño pelos por todas partes y no precisamente nuestros.\nEl desayuno correcto, a mi me parecio bien el unico problema es que tienen solo 2 ascensores que compartes con las chicas de la limpieza y sus carros, asi que el primer dia tarde 15 minutos en llegar al desayuno ya que no se como los tienen programados pero subes y bajas parando por todos los pisos.\nUna cosa si que twngo que comentar, eso que pone todo el mundo del deposito que te bloquean de 164 dolares no es asi, o por lo menos a mi nada me bloquearon, bueno, miento 1 dolar para comprobar que la tarjeta era valida.\nResumiendo........situacion fabulosa, cama muy comoda y poco mas.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Very good hotel in the budget class","lang":"en","publishedDate":"2022-09-06","publishedPlatform":"OTHER","rating":5,"text":"Perfect location at midtown.  Nice rooms which are well designed and not too small.  Walking distance from Pen Station.  Close to the subway.  The staff is service minded and nice.  Gonna book this hotel even next time when we are supposed to visit Manhattan.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"New York Family Encounter","lang":"en","publishedDate":"2022-09-05","publishedPlatform":"OTHER","rating":5,"text":"Excellent service from start to end. Rooms were clean and have enough space. They have all American breakfast!  Great location, close to all attractions and subway stations. I Highly recommend this hotel.","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"No frills but 100% functional, clean and friendly staff.","lang":"en","publishedDate":"2022-09-04","publishedPlatform":"MOBILE","rating":4,"text":"No frills hotel which possibly influences my judgement as I may be too well accustomed. When on a budget, this is the perfect place. \nWe felt very welcome and enjoyed our stay. \nAll staff was very friendly and manager offered late check-our. Would happily return - if on a budget. ;)","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Dobra miejscówka na NY","lang":"pl","publishedDate":"2022-09-04","publishedPlatform":"MOBILE","rating":5,"text":"Hotel jest doskonale zlokalizowany. Jest cichy i nic w nocy nie przeszkadza. Na dole jest bardzo przydatna woda, herbata i kawa oraz maszyna do lody (w cenie). Niezwykle miła i pomocni pracownicy recepcji. Khaoula skradła nasze serca. Pokoje są dość małe ale nie przeszkadzało nam to bardzo","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23542350,"title":"Very decent hotel","lang":"en","publishedDate":"2022-09-03","publishedPlatform":"MOBILE","rating":4,"text":"BW Premier Empire State is in a great location (East 30th between Madison & 5th). Easy to get a cab or take a bus or the subway. \n\nBreakfast seemed to be included with our stay - we took advantage once but had other plans for the other mornings.\n\nRoom we stayed in was very decent. But be prepared for very thin walls! If the guests in the room next to yours are loud or like to party from 12-4 AM, well then, you won't get much sleep!\n\nYou have to request housekeeping during your stay. We were there for 3 nights and didn't require housekeeping. Likely would have if we stayed longer.\n\nI would consider staying here again but I'd be concerned about noisy neighbours.","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Lesure with family","lang":"en","publishedDate":"2022-08-31","publishedPlatform":"OTHER","rating":5,"text":"Very good location of the hotel.\nRooms are cleaned and no noise\nSmall breakfast only Thursday and the week end : was included with the room\nNo view in this hotel\nNo roof top\nService in good mais uou need to ask to have a daly cleaning in the room","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Good price for money! Excellent location!","lang":"en","publishedDate":"2022-08-28","publishedPlatform":"MOBILE","rating":5,"text":"After two months of returning from my trip, it’s still worth to share my experience as been part of the industry. \n\n-Positive:\n\n-Location is great and súper central to all main attractions in NYC.\n-Despite of the location and it’s likelihood of been quite noisy, its isolation is quite good ( I stayed in level 11 )\n-HUGE COMPLIMENT TO MARY, who is in charge of breakfasts in the hotel! She prepares all food  daily and quite fresh and balanced. Yet, her service is amazing! Highly recommended and fully balanced options.\n\nTo improve:\n\n- From my point of view, I would suggest to lock the doors after certain time and just allow access to whoever is guest with the usage of room keys. Although I did not feel insecure at any time, I reckon the city is that active that you can see any sort of characters on the street and it would be worth to protect the property, and of course, guest integrity.\n\nI will 100% recommend to stay at Best Western at Empire State!!","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Clean, good location","lang":"en","publishedDate":"2022-08-27","publishedPlatform":"OTHER","rating":4,"text":"Right off of Fifth Avenue and 30th Street.  If you like to walk or take public transportation, this is a great location.  The hotel was clean and the room was small, but had all that was needed.  The front desk staff was wonderful, friendly, and accommodating when I needed to leave my bag before my room was ready so I can get to my planned activities.  I may consider staying here in the future.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Nel centro del quartiere finanziario ad un prezzo abbordabile. ","lang":"it","publishedDate":"2022-08-23","publishedPlatform":"MOBILE","rating":4,"text":"Ottima posizione. Gentilissimi alla reception. Camera con 2 letti matrimoniali (e non ci stava fisicamente null'altro). 2 ascensori ma solo 1 funzionante. Vi hanno offerto la colazione gratuitamente (per nulla da disprezzare con i costi di NY). Colazione buona, varia e abbondante. Molto gentili anche i camerieri ","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Atención genial.","lang":"es","publishedDate":"2022-08-15","publishedPlatform":"OTHER","rating":5,"text":"Utilicé el servicio de consigna de maletas que ofrece el hotel (de pago) Además de estar muy bien de precio la atención de los trabajadores fue inmejorable. Afsheen la chica que nos atendió fue muy profesional y simpática,nos ayudó en todo lo que necesitamos fue todo muy rápido tanto la entrega como la retirada del equipaje. Repetiría sin duda. Además el hotel tiene muy buena ubicación y por dentro está limpisimo con instalaciones muy modernas.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great service and good price","lang":"en","publishedDate":"2022-08-15","publishedPlatform":"OTHER","rating":5,"text":"This place provides a great service to her customers. After staying here for a week, we decided to stay a couple of days longer. They provided great help to book the extra days. I will be staying there again in November. The manager, Jay Singh, even gave me a discount for my stay in November.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"worth it close to all attractions","lang":"en","publishedDate":"2022-08-15","publishedPlatform":"OTHER","rating":5,"text":"Our stay was real comfortable especially when they provided us with hot breakfast . Mary who was in charge of breakfast was real kind and sweet made our mornings great that trickled down to a great day in the city.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Pulizia (??)","lang":"it","publishedDate":"2022-08-11","publishedPlatform":"OTHER","rating":4,"text":"Buon rapporto qualità prezzo (io ho pagato ad aprile)calcolando la zona dove si trova. \nL’unica nota negativa: chissà perché le pulizie (cioè rifare il letto e cambiare asciugamani) le fanno a giorni alterni e non sperare tolgano la polvere.\nSe richiedi alla reception, metti il cartello alla porta, chiedi alla cameriera del piano non è affatto certo che la “ripuliscano “… insisti e almeno prendi gli asciugamani nuovi. \nIl prezzo della colazione mi sembra onesto se però mangi parecchio. Altrimenti fuori un cornetto lo paghi circa 4dollari.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Very friendly staff","lang":"en","publishedDate":"2022-08-10","publishedPlatform":"OTHER","rating":5,"text":"I enjoyed my stay here . The hotel was very clean , quiet and the staff members were very nice specially the young lady named KHAOULA . She was very pleasant and helpful, she made us not wanna leave that place . Definitely a person this hotel needs to keep !","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Cozy and affordable in a great midtown location!","lang":"en","publishedDate":"2022-08-08","publishedPlatform":"OTHER","rating":5,"text":"The location of the Best Western Premier Empire State Hotel is great as it allows for a healthy walk to Central Park via 5th ave, 6th ave, or Broadway passing several key sights on the way, including the Empire State Building, Bryant Park, Times Square, Rockefeller Center, and the MoMA. The hotel is situated right next to a parking garage and this was super convenient for us to bring our bags in. Abraham provided great service with a smile, which isn't always easy to find in Manhattan. The hotel front desk had friendly staff and permitted early check-in hours before the advertised time. We opted to go for the breakfast buffet, and it was a great decision. One floor below the main they have ample seating allowing for a comfortable breakfast to fuel up before heading out on long walks for the day. The breakfast opened at 7 am and is super convenient to get ready and head downstairs before starting our exploration of the city. We stayed two nights and both days we were treated to a diverse set of items for the hot breakfast. We loved filling our water bottles with ice-cold lemon water before commencing our walk. The rooms are typical Manhattan size, but they've done a fantastic job maximizing counter space with drawers and cupboards to organize items from your luggage. We also had a mini fridge and a discrete safe available in our room. We will certainly stay at this location again when visiting NYC.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"All is great UNTIL you deal with the parking garage they recommend.","lang":"en","publishedDate":"2022-08-05","publishedPlatform":"OTHER","rating":4,"text":"Hotel room is spacious enough for two adults.  Nice king size bed and updated bathroom with excellent water pressure in the shower.  Real estate is narrow and tall there.  6 rooms per floor and there are 21 floors.  Regarding front desk staff, Tara is awesome and knowledgeable about restaurant recommendations in the area. They also were able to accommodate early check in, which was great.  They also offer lemon water in the lobby, which was a nice touch after spending 3 hours at the stadium watching the mets in 85 degree heat.  Hallway is narrow, so keep that in mind when packing luggage.  Price point is on point!  Here comes the ONLY negative review which is not of the hotel, but the parking garage they recommend.  Do NOT use Meyers garage on 9 west 35th street!!!!!  Hotel clerk said they offer their hotel guests a $42\/day parking rate.  Upon entering garage, we knew we would be one hour late after the 24 hours and we were told they would charge $20 for that extra hour.  So we were expecting to pay $62 for parking.  We arrived within the hour after 24 hours like we said we would.  And the total was $79.  Trying to talk to these people, was like dealing with a mexican cartel.  Even though the validation sticker on the back says $42, the “manager” of the garage, says he doesnt offer hotel validation at that price and went on to say that of you come back late after the 24 hours the discount is null and void and you pay the regular rate.  So first it was we dont offer validation (and he said this very trashy)..then went on to say well you came back late, the discount is off the table.  None of this made any sense.  Upon calling the Best Western, the manager Jay tried saying well, do you have a large truck or van?  No.  We have a Rav4.  Small vehicle. And he also said he tells his guests to get there before the 24 hours is up.  We were not told this at check in (from the front desk staff.::it was not Jay the manager)  AND when we asked at the garage, again, we were told we would get the discount and then pay hourly for each hour after.   In the end, if you have a vehicle to park, use any garage but the garage the hotel recommends. They scam people and upon reading reviews of the garage, they play the same scam on other’s.  You are forced to pay because they have your car and keys.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Fantastic stay at the Empire Suits!","lang":"en","publishedDate":"2022-08-01","publishedPlatform":"OTHER","rating":5,"text":"This hotel is in a great location. The front desk workers are all fantastic, and very helpful. The rooms are very clean and comfortable. I stayed here on a weekly for business, and I was never let down. Would highly recommend this hotel to anyone visiting New York!","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"New York juillet 2022","lang":"fr","publishedDate":"2022-07-30","publishedPlatform":"OTHER","rating":3,"text":"Hotel bien situé au cœur de Manhattan. Accueil correct (ànotre arrivée nous sommes tombés sur une hôtesse sympathiquequi parlait un excellentfrançais !), hotel confortable. Pas de petit déjeuner possible tous les jours ! Chambre uniquement faite sur demande ... et insistance ! ","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23542350,"title":"Efficient and Welcoming Stay","lang":"en","publishedDate":"2022-07-27","publishedPlatform":"OTHER","rating":5,"text":"We stayed at Best Western Premier Empire State Hotel earlier this month. The hotel is new (it opened in August 2021). Each floor just has six rooms. The rooms are efficient (typical of Manhattan NY hotel in size) and have all the basic needed amenities. We had booked two rooms. Our rooms were clean and functional. Check in staff led my manager- Jay Singh were very welcoming, accommodative and helpful. They let us check in to one of our rooms at least 4-5 hours before check-in time so that we could store the luggage and even helped us chalk our itinerary for the couple of days based on places that we wanted to see and gave us pointers on subway routes. They also allowed to have a late dinner (after 11:30 pm) in the small lounge area besides the elevators and stored our luggage after we checked out. Overall, we had a pleasant experience during our stay.  If you are looking for a new hotel that is reasonably priced and has welcoming staff, Best Western Premier Empire State Hotel, is worth a consideration.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23542350,"title":"A centrally located, quiet hotel with great service","lang":"en","publishedDate":"2022-07-23","publishedPlatform":"OTHER","rating":5,"text":"We had the great pleasure of staying at the hotel for 10 days. We got a very nice room on floor 16 with a pleasant view to the north.  \n\nGood beds.  Nice cleaning.  Very high level of service.  The hotel is centrally located, close to everything, but at the same time there is a nice calmness.  \n\nWe would love to stay here again.","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23542350,"title":"Great hotel!","lang":"en","publishedDate":"2022-07-20","publishedPlatform":"OTHER","rating":5,"text":"Hotel is in a great location. There were construction materials outside the hotel entrance, but the inside of the hotel was clean, stylish, and well-organized, and the hotel staff were friendly and courteous. The bedroom and bathroom were clean, well furnished and very comfortable. Our room had a view of the Manhattan skyline, and it was extremely quiet. All in all, an excellent experience!","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Lola at the front desk was great","lang":"en","publishedDate":"2022-07-18","publishedPlatform":"OTHER","rating":4,"text":"First of all, I think this is a good hotel for the price if you got the right expectations. I stayed once before this trip, but when I arrived the AC in my room was making a loud noise. Lola at the front desk helped transfer me to another, quieter room. I do not recommend getting a room on the top floor, the views were not good, and the layout was really poor compared to the other rooms.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23542350,"title":"Best experience in New York","lang":"en","publishedDate":"2022-07-07","publishedPlatform":"MOBILE","rating":5,"text":"From the beginning it was an amazing experience, the check in at the front desk with Tara, she was super helpful in everything I needed. The room was in perfect condition, amazing beds and breathtaking views.\nNot to mention the incredible service in the breakfast area with Mary, she was a sweetheart, kudos to her. 100% recommended if you are planning to stay in Manhattan","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23542350,"title":"Clean comfy room","lang":"en","publishedDate":"2022-06-30","publishedPlatform":"OTHER","rating":5,"text":"Our hotel room, 2 doubles, had laminated floors, which we like! Everyone that worked the front desk was kind and courteous.  They had ice water on hand which is great with the heat. The room had everything you need, a little coffee maker, shampoo etc. We did not have breakfast because our schedule would not allow. I would stay her again and again!","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":2,"locationId":23542350,"title":"very nice hotel","lang":"en","publishedDate":"2022-06-30","publishedPlatform":"MOBILE","rating":4,"text":"The best western is a great family hotel to stay at. On every floor there is only six rooms the rooms are a little small but there is enough room to walk around. The shower tiles mite need to be replaced. The  beds are very comfy and clean. the breakfast lady’s name is Mary and she is very nice and she crept all the tables nice and clean. the fruit was not the greatest and I think they could of added a couple more choices but everything else was good. thought there is a little of  construction work outside but there is no noise so it’s not that bad.","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":23542350,"title":"Good value for money hotel with a great location.","lang":"en","publishedDate":"2022-06-28","publishedPlatform":"OTHER","rating":4,"text":"Stayed at the hotel for three weeks with my two adult kids. \nWhen I started looking for a place to stay in midtown NYC, the hotel would come out as one of the better value hotels. Great that it didn’t have as much of the hidden charges of some hotels that come out initially as cheaper on a per night basis, but then are actually way more expensive when you factor in all the extras.\n\nFor the rate and the fact that this is NYC, room size is okay if you are going to use it primarily as a place to sleep in. Obviously, the space in the room is not what you would get in other hotels in other cities for the rate, but as I said, this is NYC. Any lack of space in the room (especially when you are all still awake and looking to use gadgets, watch tv, etc) is compensated by the living room in the lobby area where you can do some work on a laptop, eat, or simply just hang out if you feel too crowded in the room when you get back from your activities for the day. There is also free cold water, coffee, tea in the lobby. The basement has two computers you can use or print docs from, two extra bathrooms for hotel guests, and a dining area.\n\nDouble bed is big enough for two adults.  No issues with the showers as water pressure was strong throughout our stay and the temperature control was consistent throughout. Our toilet bowl clogged up twice though but the hotel fixed it immediately during both occasions. When we did discover the bathrooms in the basement after a few days in the hotel, we actually used it more for our bathroom needs (especially for no. 2- HA HA), to avoid any further clogging of the bathroom. It was actually better since we essentially had an extra bathroom for the three of us and we didn’t have to wait for one another to use the one in our room. There was no refrigerator in our room but I really did not see the need for it as water is readily available in the lobby. I do know that some rooms do have a ref. No gym on the grounds also. No issues with WIFI throughout.\n\nGiven current COVID restrictions, rooms though across the US don’t get daily clean ups. Obviously getting the room fixed up everyday with fresh new towels would be great, but no issues here given that is the world we live in now. \n\nHotel is definitely in a great location as it is walking distance to many of NYC’s attractions. If you don’t feel like making the 30+ minute walks to certain sites, the hotel is near several subway stations in both the east and west sides. \n\nNo issues with the staff as all were generally courteous. General Manager was very accommodating and would go out of his way to let guests know of certain updates in the hotel.\n\nSome suggestions:\n1.\tIt would be good if the guests were informed both verbally and perhaps given a one page print out upon check in of some of the amenities in the hotel. We actually did not know there was a basement with a dining area, two bathrooms, a mini-business center, until a few days into our stay. We made use of the area a lot in our stay.\n2.\tThere was an open area beside the living room area of the lobby which I was not sure was open for use or not. I did see some guests use it at least once but one time I asked, the receptionist at that time said she wasn’t sure if it was really open due to current COVID restrictions.\n3.\tI personally had no issue with people using the living room to eat since we did so ourselves, but it may be good for the hotel staff to let people know that there is a dining area at the basement. There were times when some groups of guests of 4 or more would have several plates or take out boxes laid out on tables. It might be better if dining, especially big groups, were done at the dining area in the basement or in the outside area (if open) and the living room lobby was more for people to work, have coffee, or just hang out in. Actually, if it is possible, the receptionist or one of the staff could show at least one member of the guests’ party upon check in, the different areas of the hotel. \n4.\tThe last suggestion would involve the booking of transports for leaving hotel guests. The hotel booked our transport arrangements to JFK Airport. Driver arrived on time and we did make it to JFK in one piece. It would be good practice though if guests are advised even without their asking what the expected price of the service may be. I don’t expect it to be the same for all but I believe a general range can be established for some of the more standard drop-offs like JFK, LA Guardia, etc. The guests should also be advised if they will be better of paying in cash or card. While I know it may be beyond the capacity of the hotel, it should be explored if they can make arrangements for a certain pool of drivers to service their needs or ask their guests to rate their drivers they booked as well.\n\nThe one we got for our ride to JFK was not a particularly good driver. Instead of having his phone on a stand on the dashboard, he had it on his lap. He would constantly look at it for updates I guess which of course is not really a safe way to drive. We also had not yet reached the airport and he was already asking for payment. I asked if I could pay by card and he said yes. Not sure if Lyft or Uber drivers have swipe machines, but might be better to do so since this one didn’t have one and he was having problems inputting the payment on his phone. I eventually asked for my card back and just paid him in cash. Still, it would have been good if the hotel advised what the expected charges may be even if I didn’t ask and if I would be better off paying in cash or card. And if the latter, what to expect on how card payments would be processed.\n\nAll in all though, given the cost, the location, and the current facilities, I would recommend the hotel if it is in your budget and you are looking at it primarily as a place to sleep in while in the city and one that is near to many attractions either via walk or subway.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"The best breakfast service ever!","lang":"en","publishedDate":"2022-06-27","publishedPlatform":"MOBILE","rating":5,"text":"I’ve never been more happy than I was when Mary the girl at the kitchen helped me at the breakfast hour, the food was delicious, there was plenty of choices and she was extra helpful! Super recommend and i hope there was a service like Mary’s in Every hotel","travelDate":"2022-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23542350,"title":"Impecable Servicio!","lang":"es","publishedDate":"2022-06-25","publishedPlatform":"MOBILE","rating":5,"text":"Excelente hotel para ir por primera vez a NY. Está ubicado en la calle 30, entre la 5ta y Madison. La vista desde nuestra habitación no era una maravilla pero tampoco desagradaba. Los recepcionistas nos dieron un excelente trato, mucha cordialidad y atenciones. Las instalaciones muy limpias y ordenadas. Los ascensores funcionaron correctamente. En la habitación, hay bastante espacio, aire acondicionado y buena aislación. El baño impecable con una copiosa ducha, con agua caliente siempre que se necesitara. En general, es un hotel muy funcional, de precios asequibles, muy bien ubicado y de infraestructura prácticamente nueva. Totalmente recomendable!","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excellent stay","lang":"en","publishedDate":"2022-06-23","publishedPlatform":"OTHER","rating":5,"text":"Good location,\nExcellent staff, very attentive.\n24\/7 of cold water, coffee, and tea.\nGood Wi-Fi       \nComfortable bed and pillows\n\nIt could be good to have a small refrigerator in the room, especially in summer.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Trip to NYC","lang":"en","publishedDate":"2022-06-19","publishedPlatform":"OTHER","rating":5,"text":"I was extremely satisfied with my stay at the Best Western Premier Empire State Hotel. The hotel manager Jay and his staff were absolutely fantastic. The room was spotless,bed very comfortable,bathroom perfect size. Complimentary coffee and tea in the lobby was great. I have only praise for this hotel. I'm looking forward to returning in a few months.\nCorey Breier","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Amazing location & Great Staff","lang":"en","publishedDate":"2022-06-18","publishedPlatform":"OTHER","rating":5,"text":"I lived there for almost of one week recently. Its an amazing location in heart of manhattan with lot of places on either accessible by walk or metro which just 300m away. Another plus point is great staff which is very polite & helpful and always available for any kind help.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Bon rapport qualité-prix en plein centre de Manhattan","lang":"fr","publishedDate":"2022-06-10","publishedPlatform":"OTHER","rating":5,"text":"Bon rapport qualité-prix. Le lit est très confortable, les chambres sont neuves. La propreté pourrait être meilleure (il y avait quelques traces sur la tête de lit, le bas de la porte de la salle de bain était rongé par l'humidité) mais... c'est un hôtel en plein cœur de Manhattan, et quand on est à Manhattan, on ne reste pas longtemps dans sa chambre. Je suis donc très satisfait de mon séjour.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great hotel","lang":"en","publishedDate":"2022-06-07","publishedPlatform":"MOBILE","rating":5,"text":"We loved this modern and clean hotel. It is so central yet the street it's on is quieter than neighbouring streets. The rooms were lovely, modern and clean. Shower was lovely and hot as you like and spacious. I loved the coffee machine in the room too for first thing in the morning, as well as coffee machines, fresh chilled water and boiled water available in the lobby. There seem to only be 3 rooms on each floor which means the lift was never busy and not much noise from corridors Staff were extremely helpful, polite and friendly. We were there for 6 days at end of May visiting from UK and would definitely stay here again!","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great hotel","lang":"en","publishedDate":"2022-05-17","publishedPlatform":"OTHER","rating":5,"text":"This was the cheapest hotel I could find that looked okay so I wasn't sure what to expect, but it was fantastic. It's brand new and the rooms are designed really well. My room looked contemporary, was neat as a pin and extremely comfortable. It's pretty quiet (on a side street) and you're right in the middle of the city so it's easy to head anywhere. Plus the staff was really nice. I loved staying here.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":2,"locationId":23542350,"title":"Not Transgender Frendly","lang":"en","publishedDate":"2022-05-05","publishedPlatform":"OTHER","rating":2,"text":"I checked in and the lady behind the counter was fine enough. I went to the room and before that I took some water from the water station  next to the elevator. Only a few feet away from where I checked in. I heard the lady say to someone “Transgender on 4th” meaning my floor. I went back and she was totally shocked I was still there. I never spoke to her again. I was not refunded my 100 USD but westpac bank in Australia charged this back. The good is hotel in great location that’s it.","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":4,"locationId":23542350,"title":"No Refund for Deposit - Poor customer service","lang":"en","publishedDate":"2022-05-03","publishedPlatform":"OTHER","rating":1,"text":"I have had enough of this hotel. They charged me 101 USD deposit on arrival which is fine. This was deducted from my card. My bank in the UK has also agreed that 101 USD was taken out and paid to the Best Western as per screenshot. \n\nCalled the hotel who told me that I will be refunded 5-7 days. That’s fine. No refund. Called the hotel who advised me to wait to last Friday and still no refund. \n\nSo I sent an email and no one replied. It’s only when I called for a 3rd time Jay the Asst general manager emailed me saying it’s released on the 22nd April. To wait. I waited. Then a completely different message it’s only an authorisation. I sent proof this was not the case as the money was indeed deducted and paid to Best Western. He sent me a screenshot saying it was refunded but any person can see that the 100 USD has NOT been refunded from his screenshot (Attached)\n\nI told him again the money has been refunded and all he has to do is speak to his accounts as he will see a surplus of 101 USD. Did he? Nope. He told me to contact my bank. I have already and the money has been taken. \n\nSo I ended up the conversation saying I am now taking this further as he obviously has no power in the hotel so I will find someone who can.  I have proof. They do not. \n\nThe moral of this story is that refuse to pay this charge if you can.","travelDate":"2022-04","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23542350,"title":"Great staff","lang":"en","publishedDate":"2022-05-02","publishedPlatform":"MOBILE","rating":5,"text":"I can really recommend this place. Especially Lola. Lola was the best and super helpful! She made every effort to help with the booking and was very kind. I will come back to this place. Central located and nice spacious rooms. Thanks again Lola!","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great Place To Stay In NYC!","lang":"en","publishedDate":"2022-04-25","publishedPlatform":"OTHER","rating":5,"text":"Given the Covid Times we live in, Best Western Empire State is a great hotel to stay in. My room was very clean and comfortable. I appreciate the front desk staff being up front about the housekeeping limitations due to Covid safety, etc. Whenever I needed to have a question answered or a request, it was fulfilled in a short amount of time.  When I needed my stay extended on my business the staff was very gracious and supportive in helping me do so. Lola\/Lolita was especially great in helping me make new arrangements. She, along with the staff overall were professional and friendly. My housekeeping requests were honored and I look forward to my return. Great location too!\n\nFlorante G.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Service is lacking","lang":"en","publishedDate":"2022-04-22","publishedPlatform":"OTHER","rating":2,"text":"This is a decent hotel but some things bothered me.\n\nPros:\n- We arrived early and they let us check in early because there was a room available.\n- Rooms are quiet and clean.\n\nCons:\n- The phone in our room didn't work so we had to go downstairs to talk to front desk.\n- I requested fresh towels on our last day and was told that they would send it up to the room but never received them.\n- I left behind my favorite robe in the room and I called them to ask about it. I was told that they would call be back but they never did so I had to call them again. They said they didn't find it. Pretty sure housekeeping kept it. :(","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Friendly and helpful staff","lang":"en","publishedDate":"2022-04-18","publishedPlatform":"OTHER","rating":5,"text":"Our first trip as a family of 5 to NY. Our prebooked apartment accomodation fell through and this hotel was recommended by locals. The wonderful front desk staff rescued us from a horrible stressful emergency. We felt so looked after we booked the rooms for the remainder of our stay. No question or request was too trivial and the advice and tips they gave us were spot on. Standard rooms were clean and comfortable, good sound proofing from outside noise. Superb location for all major sights. If I'm ever in NY again I will head straight back there.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Friendly staff","lang":"en","publishedDate":"2022-04-08","publishedPlatform":"OTHER","rating":5,"text":"The guy working at night is awesome and very helpful \nI bearly remember his name youesf 5 stars for him and location was good everything was nearby and it was my first and good experience in New York will plan again to visit again will recommend this hotel to my friends and family","travelDate":"2022-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"You’re not in Kansas anymore! :)","lang":"en","publishedDate":"2022-04-04","publishedPlatform":"MOBILE","rating":3,"text":"We are from the Midwest and we may have different expectations than a New Yorker. \n\nWe don’t consider this to be a Premier location. The website says New Construction, it is a new remodel, NOT new construction. The narrow hallways where the rooms are have a dark, dank appearance & feel. \n\nThe rooms are tightly spaced and the doors are literally side by side, room layout is super small & the walls are very thin. Street sounds went on all night long, along with partying neighbors in the next room. I always pack earplugs & that helped a lot to filter the noise out. \n\nA single King bed is placed in a room that would nicely fit a Queen bed & chair. There is no sitting area in the room, no walk around room. The bathroom was so tight with no space for toiletries & no space to turn around because the door is in the way. No fridge, no microwave, no closet, no breakfast. The lobby coffee & water was out most days.\n\nThe plus we found was the staff was very kind & accommodating, housekeeping was very nice as well. They seemed to all do their jobs very well. This location is central to the subways which was convenient.  For travelers new to NYC, no onsite parking, you must secure your own with off site vendors.","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Decent value for money","lang":"en","publishedDate":"2022-04-01","publishedPlatform":"MOBILE","rating":4,"text":"My husband and I stayed here for 5 nights. Lovely, friendly and obliging staff. Wonderful comfy bed. It is a short walk to the 33rd street subway station on the green line which is super easy to get uptown and downtown easily.  It is a close walk to both 5th and Park for lots of eating and coffee options. \n\nOverall excellent value for money as it wasn’t too pricey compared to other options in Manhattan.","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Great cozy stay for 2","lang":"en","publishedDate":"2022-03-28","publishedPlatform":"MOBILE","rating":5,"text":"We stayed in a room with a king bed. Yes the rooms are small but if there’s 2 of you and you’re really only using the room to sleep and hangout for a few hours a day then it’s perfect for 2 people. Any more then 2 per room and I wouldn’t recommend it. Rooms were clean and staff was nice!","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Excellent room for a reasonable price","lang":"en","publishedDate":"2022-02-22","publishedPlatform":"MOBILE","rating":5,"text":"Amazing room for the price and in a great area.  we slept like babies in the beds very clean. Lolita was the best great customer service! Bathrooms are very roomy we loved the shower heads (just the right amount of pressure. Cleaning staff was on point new bedding daily.","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23542350,"title":"Excellent Value","lang":"en","publishedDate":"2022-02-15","publishedPlatform":"MOBILE","rating":5,"text":"This hotel is one of the best values in NYC. We paid less than $150 per night (including fees and taxes) and the hotel is comparable to those charging $300 per night. \n\nIt is brand new and being kept up to excellent standards. When we stay at a new hotel, I look to see if it will “last”, especially at lower cost\/brands. BW Empire State has not been made cheaply (good fixtures, furniture, etc) so I would expect it to keep its value. \n\nYes, the rooms are pretty small (like many in NYC), but so well planned and laid out, it is very comfortable for an extended stay (desk\/stool; long bench\/stool - we used that as a little dining table), hanging space and drawers. They provided us with a refrigerator upon request that was helpful. \n\nThere are some cons that I would deduct 1\/2 point for. First, there is poor soundproofing of the rooms. We heard our neighbors a lot. We sleep with ear plugs, but still heard the loud noises (especially the group that partied at 3am).  Luckily they only stayed a couple of nights. Second, on two separate days our room key cards stopped working (and we had not kept them near our phones or cc’s). Maybe they are working out that glitch. \n\nI would keep my eye on the reviews going forward; if it keeps up its quality and pricing, this is a good option for a NYC stay.","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Really the Best :)","lang":"en","publishedDate":"2022-01-27","publishedPlatform":"MOBILE","rating":5,"text":"I love this hotel. Everything worked well and staff were very polite and helpful and made sure my stay was a pleasant one. The free coffee in the lobby is the best I’ve ever tasted. I got a few packs to take back home with me. Subway, bus stops within walking distance and plenty of places to eat out and have food delivered. No room service due to Covid restrictions, but you can request for new fresh towels and garbage\/rubbish to be removed from the room before 11am. Thank you and I’ll be back.","travelDate":"2022-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23542350,"title":"Stay somewhere else, being new doesn't mean its great","lang":"en","publishedDate":"2021-12-25","publishedPlatform":"OTHER","rating":2,"text":"I decided to stay here due to it being a new location while having an in hotel bar and I trusted the brand, but I was fooled.  Between shoddy construction lack of finishing the room and low staffing it wasn't a great stay.\n\nPositive:\nLocation very convenient to train and bus stops\nGave me additional blanket due to half of our family liking it cooler\n\nNegatives:\nRoom Safe not installed, just sitting in the drawer not usable\nTV was still in \"display\" mode causing a menu to always pop up on the screen\nHalls and Elevator scratched up and damaged (already?)\nThe bar hasn't been opened yet (though still listed as having one on their website)\nonly 3 drawers to utilize in a room for 4.\nPoor sound proofing, the hallways and rooms on the same floor you can hear all the sounds.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Modern en gastvrij hotel","lang":"nl","publishedDate":"2021-11-23","publishedPlatform":"MOBILE","rating":5,"text":"Recent gerenoveerd hotel van de Best Western keten.  Het hotel is kleinschalig maar biedt voldoende ruimte. Vanwege COVID waren de eetgelegenheden niet in gebruik. Het hotel is schoon en veilig. Housekeeping is op aanvraag en gewoon gratis. Dit werd netjes vooraf gecommuniceerd. In de buurt zitten diverse lekkere ontbijt tentjes, zoals NOMAD. De kamer is modern en beschikt over heerlijke bedden, waarbij het raam ook ter ventilatie overdag open kan. Enige wat ik miste was een klein koelkastje op de kamer. Het hotel onderscheid zich voornamelijk in het vriendelijke personeel, die alle moeite nemen om je te helpen wegwijs te raken in het hotel en in de stad. In het bijzonder Samantha, Stephanie, Monica (hope I write your names correctly). Ook is het geen probleem om gratis de koffers te stallen. \n\nKortom, perfect hotel voor een stedentrip NYC.","travelDate":"2021-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23542350,"title":"Comfortable","lang":"en","publishedDate":"2021-11-23","publishedPlatform":"OTHER","rating":5,"text":"Spend two nights over the weekend after some other plans fell through. Staff were consistently courteous and helpful. The room was clean, well-stocked, and comfortable. Would definitely stay there again next time I'm in NYC!","travelDate":"2021-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23542350,"title":"Amazing hotel with even more amazing staff!","lang":"en","publishedDate":"2021-11-22","publishedPlatform":"OTHER","rating":5,"text":"Been there for 10 days, it was the best experience I've ever had in any hotel.\nI got my room and found out I had trouble with the AC, 5 minutes after I got a new room.\nThe smile from the hotel crew from morning until night was a pleasure for me each time I went in or out of the hotel.\nThe location is just perfect, around 15-20 minutes walk from every main place at Manhattan, and there's also a subway in 4 minutes walk range. \nI have no words to describe how incredible this hotel is and how much of an upgrade it did to my whole trip.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Clean, Comfortable, Perfect Location","lang":"en","publishedDate":"2021-11-02","publishedPlatform":"OTHER","rating":5,"text":"Had a wonderful stay at this brand new property. The location is perfect and just a couple blocks from the empire state building. We were able to walk to all the major tourist attractions. All the rooms are so clean and the beds were very comfortable! Best part was the rate we booked at.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23542350,"title":"Comfortable and Happy Stay","lang":"en","publishedDate":"2021-10-31","publishedPlatform":"MOBILE","rating":5,"text":"This is new Hotel Quick check in and efficient staff everyone was so kind to us we got there before check in time the front desk staff went out of there way to get us room since we had long travel rooms are comfortable and cozy so much to do walking distance will definitely recommend and most definitely return back to this hotel.","travelDate":"2021-10","tripType":"FRIENDS"}
