{"helpfulVotes":1,"locationId":23092379,"title":"amazing cipriani","lang":"en","publishedDate":"2024-04-01","publishedPlatform":"OTHER","rating":5,"text":"i would like to say Casa Cipriani really goes above and beyond to service his guests. i booked a room for my boyfriend's birthday, since he likes good hotels. upon my arrival, to my surprise, my room was upgraded to suite (without charging me additional), with champaign and cake. the suite is very very nice, with big windows to both sides (as it is at corner). all the staff at hotels are super kind and friendly. the friends we invited over all are very impressed by our suite and the club at 5th floor. jazz is really good too. special thanks to Stefano (director of front desk), Juan at the restaurant bar. Juan was very caring and thoughtful, made my normally a bit demanding boyfriend very happy. ohh, the mattress at hotel is amazing too. i have long term back problem. the mattress is perfect for me, firm but with a bit soft touch. next time i buy new mattress at home, i shall go check our which branch Cipriani has -:)","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Thank you Casa Cipriani","lang":"en","publishedDate":"2023-08-01","publishedPlatform":"OTHER","rating":5,"text":"This was perhaps the best experience I've ever had in a hotel. The staff was incredible and hospitable. From the moment I checked in from the moment I left, the staff exceeded my expectations. Matteol, Sal, and Gabirele were all fantastic!\n\nThe room was also fantastic; clean, comfortable, and beautiful. It was everything that I wanted for my trip. I definitely plan to return to Casa Cipriani and cannot express how grateful I am for my wonderful stay there.","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"Exquisite on so many levels","lang":"en","publishedDate":"2024-03-14","publishedPlatform":"OTHER","rating":5,"text":"Our stay at Casa Cipriani was perfect from the moment we stepped out of our taxi and were greeted by the charming staff at the door. The lobby area was wonderfully calm after a long-haul flight, and the staff was so attentive that you felt almost like you were being greeted by friends. The bedrooms are exquisitely finished with such a high standard of attention to detail with lovely, unique, special touches. We enjoyed a drink in the Living Room overlooking the stunning river view and didn't ever want to leave. The food in the restaurant was the best pasta I've had outside of Italy; we returned the next day for lunch, ordering the same dishes again. We only stayed two days, but the staff remembered our breakfast preferences from the day before, which didn't go unnoticed. Casa Cipriani is our favourite club; there is nowhere else we would want to stay in New York.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Heavenly hotel","lang":"en","publishedDate":"2024-03-07","publishedPlatform":"MOBILE","rating":5,"text":"Absolute perfection! Amazing food, decoration, rooms, service , cleanliness, details, amenities! Simply one of the best places I have stayed in,if not the best!\nWorth every cent! An example of what a great hotel should be like! \nBravo for the amazing job!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23092379,"title":"Beautiful property, stunning views, and even better people","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"MOBILE","rating":5,"text":"Casa Cipriani is obviously stunningly beautiful -- both the hotel itself is exquisitely designed and appointed, and the sweeping views of Brooklyn and the bay are unparalleled by anything I’ve seen in Manhattan. The food is obviously great, too, being powered by a well known global powerhouse brand. All the Cip classics are on tap here. The rooms are comfortable, well appointed and modern; super comfy beds and sheets. The rainfall showers are the best I’ve experienced in a hotel. The bathrooms are stunning (though at this price point having Toto bidets would have been nice), and the Waterworks fixtures are killer. It’s clear a ton of thought when into the design in every single space on property. \n\nBut what sets Casa Cipriani truly part from its peers and puts it squarely at the TOP of the heap of high end luxury hotels in New York is the service. It’s outstanding. I was blown away. From the gentlemen at the valet stand and the bellhops when you pull up for the first time, to Sophia at the front desk guiding you through check in, to the ladies helming the club level, everyone in the spa, the entire dining team… to a person they were so friendly, accommodating, and pleasant. I can’t say enough about their hospitality.\n\nI rarely feel compelled to write reviews, good or bad. But Casa Cipriani is so excellent it’s deserving of all the praise it receives. Thank you to everyone who made my wife and I’s stay amazing; we can’t wait to come back.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23092379,"title":"a joke","lang":"en","publishedDate":"2024-01-01","publishedPlatform":"OTHER","rating":1,"text":"There is no restaurant at this five Star Hotel, only a private club for people over 21. Then why the 5 stars ?\n\nNo more veal ragu available.... I asked for pasta aglio oilio. The manager said that they have no garlic (this one can't be made up)","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23092379,"title":"Checks Off All The Boxes For A Hotel Of Greatness.","lang":"en","publishedDate":"2023-12-15","publishedPlatform":"OTHER","rating":5,"text":"Perched on the water in lower Manhattan, in the landmark Beaux-Arts Battery Maritime Building, is the Casa Cipriani. The Casa sports a dual hospitality personality, namely, a hotel & a members club where luxury reins 'summa cum laude'...why the house car is an Aston Martin. I soaked up my spacious Junior River View Suite adorned with mahogany floors, bespoke Italian furnishings, Art-Deco light fixtures, an adorable work desk and artwork on the wall. The suite was embedded with high tech appliances like electronic shades, selectable lighting and other futuristic tools. The bath was marbleized with heated floor and walk-in shower. The pinnacle room amenity, however, was the terrace affording me an exception views of  attractions like the Brooklyn Bridge.........why I could almost shake hands with the Statue of Liberty. One never has to leave the Casa with such a bevy of dining and drinking options where you will find the Club Restaurant, the Jazz Cafe, the Club Bar, the Promenade Bar and the Living Room. Aside from the abundance of bars, the Living Room is a communal experience while the Club is where dinner is served in Italian style with items like carpaccio and other pasta classics.........I tested the carpaccio..........it was great. Other highlights of this property is the spa & wellness area in addition to a fitness center, but perhaps the biggest draw is the membership club. \n\nSo, if you want a Big Apple hotel with luxury to the max........,,,,...then try the................\nCasa Cipriani.............it  checks off all the boxes for a hotel of greatness.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23092379,"title":"Amazing all together","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"Amazing all together: beautiful design details in the room and throughout the hotel, Very professional team.\nI loved staying there and will definitely return.\nA little intimate gem in the heart of nyc :)","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23092379,"title":"Exceptional, Exclusive Hotel Visit","lang":"en","publishedDate":"2023-10-26","publishedPlatform":"OTHER","rating":5,"text":"Casa Cipriani is the type of hotel that I am SO happy I visited and experienced otherwise, I would not know what to expect.\n\nWhat I found was amazing hotel service, gorgeous accommodations, breathtaking views and exceptional bedding.\n\nI was visiting in town before a conference and this was my perfect getaway to unwind prior.  I invited my sister to join me and we had a lovely girls mini getaway.\n\nThe front desk was so welcoming and warm.  What a great way to start a luxurious and elevated hotel visit!  I appreciate name recognition.\n\nThe hotel gives river cruise luxury vibes which I adore!\n\nMy suite was stunning and the views with the balcony were another level of beauty!  \nViews of the statue of liberty?!  SO unique and special for my NYC visit!\n\nThe bedding was my favorite ... it felt like butter. :-)\nThe suite was so well appointed with everything in the position you would want it in.  IE: plugs next to the bed, hotel slippers, eye masks, etc.\n\nThe restaurant had the BEST pasta!  I enjoyed the lobster, tomato, green bean salad which had a generous amount of lobster.  I also especially loved the pasta with mushrooms ... I will now crave this during every NYC visit! lol\n\nSomething else I was surprised to experience is their fabulous spa and fitness center!  I had my first ever cryotherapy which was VERY cool! \n\nThank you Casa Cipriani for a 10\/10, luxurious, exclusive visit!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23092379,"title":"Exceptionally luxe experience ","lang":"en","publishedDate":"2023-10-19","publishedPlatform":"OTHER","rating":5,"text":"Casa Cipriani exceeds expectations in every way. I work in hotels and travel half the year, so I’m rather particular. I had a few nights in the city for business meetings in FiDi, and wanted to be close by, but on the water. The building itself is a work of art, the staff are amazing, and the feeling that you've arrived somewhere truly special is immediate. \n\nI checked in at 8am (knowing i was rolling the dice), and while my room wasn't ready, I was escorted upstairs to have tea and start my work day from the club floor where i got to enjoy a posh tea service overlooking the East River. A few lounges behind me, an investor was meeting with a fashion designer who had brought him an armful of new coats to try on (that’s the vibe here - bit of business, bit of pleasure, all in good fun). I see why people are members here. \n\ninstead of having me come back downstairs to get my keys when my room was ready (less than an hour later), someone brought my keys to me and my luggage was waiting for me in my room. \n\nthe room is stunning. A nautical design nod embraces the views through more gorgeous windows. The bathroom is so luxe - i could live in there. electric shades are always my favorite touch in a room — the ultimate in convenience, along with slippers and a robe.  At night, i invited friends to join me at the jazz club for dinner - such an intimate and cool concept. Food was excellent. (Though a pizza for lunch ended up being my #1). we had drinks beforehand at the cozy bar on the club floor — even for a week night, it was a buzzing scene. (Dress code applies, be aware.) \n\nI had a casual breakfast at the main restaurant before heading out (reluctantly), and the house car brought me to my meeting a few blocks away. (I didn’t book it, but they made it happen for me). I enjoyed chatting with the door man on my way in and out (Marcus)- he was fantastic, and I can’t wait to see him again on my next visit. ","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"A+ hotel in a quieter area down by the south street seaport","lang":"en","publishedDate":"2023-10-19","publishedPlatform":"OTHER","rating":5,"text":"Spacious suite, super comfortable, one of my favorite 5* hotels in Manhattan.\nI will most likely stay there on all future trips.\nIts proximity to the subway is great, and I like having a bit of privacy in the ever-busy City. The club on the fifth floor is unique and private, with music and food for everyone. It's a game-changer.","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Perfect Stay in NYC","lang":"en","publishedDate":"2023-10-19","publishedPlatform":"OTHER","rating":5,"text":"Absolutely loved my recent visit to Casa Cipriani.  It was my second time staying and this hotel might be my new favorite hotel in NYC.  Room decor was very comfortably stylish and the quality of everything was a 10\/10.   The food and entertainment areas were comfortably busy, so you always felt the vibe but never overwhelmed or under - cared for.  The views from my room and the roof were breathtaking.  And I couldn’t ask for a better gym setup.   The majority of staff was able to recognize and address me by name which I love and catered to every need.  I also love the privacy and location and all around felt like I never had to \/ wanted to leave.  ","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"A chic and cozy room and a fantastic club with great views","lang":"en","publishedDate":"2023-10-18","publishedPlatform":"OTHER","rating":5,"text":"The rooms are timeless, warm and nautical with wooden accents and beautiful views; the beds are amazing and the staff is friendly and helpful. Loved visiting the gym and the jazz club and finding personalized service every step of the way. An elevated experience all around that I highly recommend for those looking for a unique luxury stay in NYC! ","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Casa Cipriani NYC - amazing hotel","lang":"en","publishedDate":"2023-09-14","publishedPlatform":"OTHER","rating":5,"text":"The hotel was truly exceptional, easily ranking among my top favorites in New York City. Its unique waterfront location lends an authentic vacation vibe, accentuated by breathtaking views. This establishment exudes a distinct sense of sophistication and luxury, making it an excellent choice for discerning travelers.\n\nWhat sets this hotel apart is its remarkable fitness and spa facilities, unquestionably among the finest in the city. The vibrant and exciting nightclub on-site adds to the allure, making it a standout scene in the NYC nightlife.\n\nThe culinary offerings are nothing short of extraordinary, with Cipriani restaurant being a particular highlight. The dining experience is elevated to new heights here, and the ambiance is second to none. As for the accommodations, the rooms and bathrooms are impeccably designed, with notable features such as the Dyson air dryer. Waking up to the breathtaking water views is an unforgettable experience in itself.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Like a warm hug","lang":"en","publishedDate":"2023-09-13","publishedPlatform":"OTHER","rating":5,"text":"I stayed at this property, after a crazy experience due to the earthquake in Morocco and a cancelled flight to Miami. I was due to have a layover only in JFK and it turned in to an overnight in the city.\n\nThe hotel welcomed me, late at night, with open arms. I was shown to my room and a fruit plate awaited me, along with a much needed silk sleep mask.\n\nThe room was absolutely beautifully appointed - luxurious linens, bottled water and fluffy robes, with slippers like pillows.\n\nI slept like a log and woke up refreshed.\n\nOrdered breakfast to the room and the concierge helped with several items that I needed assistance with.\n\nThen I headed to the spa and had an incredible (much needed) Cryotherapy session, followed by a sauna session with a face mask.\n\nThe stay was a short one, but I will DEFINITELY return. The team were so welcoming - Marcus on the door, Lauren on the Front Desk and Samantha in the spa were stand out.\n\nSuch a different offering for New York and one that should not be missed.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Stunning building and decor, a stylish 8\/10 from me","lang":"en","publishedDate":"2023-08-30","publishedPlatform":"MOBILE","rating":4,"text":"First stay and it was a leap of faith, having joined Casa Cipriani in Milan (without yet visiting it) as an alternative to our usual Soho House stays in Meatpacking.\n\nLocation: it’s on the southernmost tip of Manhattan, occupying what used to be the old Governor’s Island ferry terminal. That now leaves from next door, meaning the occasional boat horn blowing, plus there’s the private heliport next door, but these never felt like a nuisance, more signs of a living city. The building itself is stunning and has been beautifully restored and decorated to resemble a grand ocean liner, with wood panelled corridors and nautical themed decor, but not overdoing it. The standard and quality of finishes is second to none.\n\nOur room was a junior suite facing the river. It had great views (but no outdoor space), a large bedroom (and a very comfortable bed), an excellent walk-in wardrobe with a bench on which to open luggage easily (Rimowa owners will know what I mean), and plenty of hangers and drawers. The bathroom was ‘accessible’ (which I believe means a wider door) and large, but only had one sink and the shower inside the bath, which wet you standing outside the first time you turned it on. There wasn’t really any storage space in the bathroom for wash bags etc. The sink didn’t hold water. The fittings are gold but tasteful.\n\nLighting controls were difficult to figure out. Room service was quick. The concierge was competent. Beware the dress code (no shorts after midday). The valet Marcus was excellent.\n\nComplaints: There was a mix-up with a second room booked in advance (which they didn’t have so offered us an upsell when we arrived for $2.5k a night). The hotel tried to charge us $1400\/night for our room until we showed them proof we had been quoted $1200 (we booked direct). The biggest mood dampener was booking a table outside on the terrace for dinner on our last night, and being made to wait 45 minutes as “we don’t guarantee tables outside”, only to be finally squeezed into a table between two others, where within minutes a fellow diner complained we were too close to her. Not great when you’re already weighing up whether this is to be your future NYC ‘go to’ hotel.\n\nWith extras the five night stay cost about $10.5k. I liked it, my wife less so. It has character and I’m sure they will iron out issues. If you smoke, especially cigars, you’ll appreciate the rooftop bar. We’ll see whose choice prevails on our next NYC trip!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Amazing stay amazing staff","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"OTHER","rating":5,"text":"Quiet, luxurious hotel in a traditional and modern style. Outstanding staff welcoming at your arrival, the rooms are spacious and beautifully appointed, with a marble bathroom with a cascade shower that makes it unique. Beautiful restaurant with a view of the Brooklyn Bridge, The service all across is friendly and attentive, going the extra mile and making sure that everyone stays is memorable.   \nI highly recommend Casa Cipriani I could stay here forever.\n","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"An Unforgettable Cipriani Experience!","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"OTHER","rating":5,"text":"I had the absolute pleasure of staying at Casa Cipriani for one night and absolutely LOVED my experience from start to finish. It is an incredibly unique product that transports you to another place once you step inside. My room overlooked the river and had all the amenities I could ever need. The rooms are equipped with impressive technology and an amazing rain shower in the bathroom. The hotel has lovely suites with ample outdoor space, and some with incredible views of the Statue of Liberty and Brooklyn Bridge. The Cipriani restaurant is a place to see and be seen with a vibe that makes you want to stay all night long. The F&B was outstanding, as was the attentive service. For a night cap, you can't miss the Jazz Cafe next to the restaurant - this was an absolute highlight and the dessert was delicious!  The hotel has also done a great job with the spa & wellness concepts, which is a must in a city like NY. It's only the beginning of an amazing journey for this exceptional property and I can't wait to see what they continue to execute and offer their guests and their members. As a NY local I look forward to visiting time and time again. ","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"Exceptional NYC Hotel ","lang":"en","publishedDate":"2023-08-15","publishedPlatform":"OTHER","rating":5,"text":"I had an excellent stay at Casa Cipriani in July. The room was impeccable in both design and comfort. The service throughout the property was flawless. We were able to enjoy the private club on the 5th floor, the food was incredible and the views outstanding! Overall a phenomenal hotel, we can't wait to visit again soon. ","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"A Splendid New York Getaway","lang":"en","publishedDate":"2023-08-06","publishedPlatform":"OTHER","rating":5,"text":"I enjoyed a sunny New York weekend in March in a one-bedroom water view suite with a large balcony which I was thankfully able to use due to more mild than usual late winter weather.  My view of Brooklyn was delightful; and to the far right, Lady Liberty was visible.  I found service to be outstanding, from front desk to food and beverage staff to housekeeping.  My suite was bright, cheery, flooded with natural daylight.  The bedding and bathroom exuded luxury, and the work-space is well thought-out.  I was very impressed with food and beverage quality both in the jazz club, the rooftop restaurant, and the bar.  The property does have a very clubby atmosphere and could feel “cliquey” to outsiders unless prepared that this is…indeed…a private club with year-round membership….and on a weekend evening it seems most everyone knows everyone else.  A welcome concept is the discouragement of photography throughout, hopefully fending off the Instagram crowd.  I call the property sophisticated, discreet, classy, and elegant.  The interior design is impeccable, preserving the historic quality of the building while presenting a fitting (water-side) nautical theme.  The location could give people pause, but one of my goals in staying there was to see how much I could amuse myself in the neighborhood, which did not disappoint.  Plenty to do, see, taste, and take in.  I especially enjoyed strolling over the Brooklyn Bridge to have lunch at Pedros in Dumbo, then back across the much less traveled but architecturally fascinating Manhattan Bridge which dumps you off in the heart of Chinatown.  In the area are shops, parks and even museums I would never have explored had I not stayed here; and the location is an excellent gateway for exploration of the magnificently conceived 9\/11 Memorial.  For those who can’t leave the gym at home, no disappointment here—it’s all state-of-the art.  For a city hotel, it feels exceptionally quiet and peaceful, even when relatively full as it was the weekend of my stay.  The only noise factor arises from the comings and goings of the boats chugging back and forth to Governors Island, but I found a certain charm in the sounds and activity.  I consider this hotel for near top honors in a city where luxury hotel competition is fierce. I’ve seen reviews about billing issues, none of which I experienced.  It is stylish and charming, all aided by a friendly, relaxed, and attentive staff.  I would stay here again and will recommend to friends. ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"Amazing experience from start to finish!","lang":"en","publishedDate":"2023-07-25","publishedPlatform":"OTHER","rating":5,"text":"I recently stayed at Casa Cipriani with my partner for a staycation and it exceeded all expectations! The arrival process was friendly and efficient with staff prepared to welcome us. After being whisked up to our stunning suite, we had a thoughtful welcome amenity which we enjoyed on our terrace overlooking iconic views of NYC. \n\nThe restaurant and members club were top notch with phenomenal food & drink as well as a fashionable and chic crowd! The jazz club was a ton of fun and a great way to end such a classic New York night! \n\nThe spa and gym were exactly what I needed the next day to relax after such an epic evening. Can’t wait to stay again!","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"An amazing place!","lang":"en","publishedDate":"2023-07-24","publishedPlatform":"OTHER","rating":5,"text":"I had the most amazing staycation weekend at Casa with my partner. Our room was incredible and it was wonderful to be in the ferry building and look out over the water and see boats come and go. We had cocktails on the rooftop and ate at the Club Restaurant for dinner and breakfast. Both were among the best meals I’ve ever had in NY due to both the quality food and service. We also had room service for lunch and it was great to enjoy the views. We didn’t use the spa but the gym is huge. The hotel is modern luxury with a classic feel. ","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Part Hotel, Part Private Club—Wholly Exceptional","lang":"en","publishedDate":"2023-07-24","publishedPlatform":"OTHER","rating":5,"text":"Staying at Casa Cipriani in New York was unlike any other hotel experience I’ve had in the city in the very best way. Half private club, half hotel, the experience was wholly exceptional. \n\nThe design of the hotel was particularly impressive. Glossy wood walls and nautical inspired touches, the space is beautiful. My room overlooked the water and had an impressive terrace to enjoy breakfasts and watch the ferry boats come and go. \n\nThe main floor is where all the action is, which the terrace bar, lounge, and restaurants. People watching at its very best (just don’t take any pictures).for hotel goers that like to sweat, the gym is top notch. \n\nDinner was fantastic, with incredible Italian fare by Cipriani and impeccable service. Not a bad seat in the house. \n\nOverall, my 24 hours at the hotel was a retreat in every way. I cannot wait to return one day soon. ","travelDate":"2022-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"It was very nice and I was very happy","lang":"en","publishedDate":"2023-07-24","publishedPlatform":"MOBILE","rating":5,"text":"top notch service, the staff was very friendly and always wanted to help. Top quality fittings and finishes. The room was beautiful with super comfy bed and spacious bathroom.\nAmazing location. the food is excellent! this is a must in NY!!!","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Hotel with the BEST VIEW of NYC","lang":"en","publishedDate":"2023-07-21","publishedPlatform":"OTHER","rating":5,"text":"For reference, I used to live near the hotel...Casa Cipriani brings with it a wonderful energy and vibrancy that Southern Manhattan needed back. The decor as you'd expect is stunning, the service stellar and the views in every direction will take your breath away. The hotel is right on the water + it literally feels like you are sailing on the most well appointed cruise liner from a different era. Breakfast or lunch on the terrace is a must do whether you are a guest or a member. You feel like you are walking onto the chicest of movie sets for cocktails + dinner at the Pickering Bar. Casa also have a state of the art spa + fitness center for members + hotel guests.\n\nPack a bag + journey on with me,\n@MichaelaGuzy","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Best Experience","lang":"en","publishedDate":"2023-07-19","publishedPlatform":"OTHER","rating":5,"text":"Wow! I am in love with this property . For me personally Casa has the most elegant interior design, space size with unique location . \nOutstanding service with most delicious cuisine. \nThe property staff were amazing ! All ! We absolutely love Casa and will definitely come back . ","travelDate":"2023-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Amazing Vibe, Service and Views","lang":"en","publishedDate":"2023-07-18","publishedPlatform":"OTHER","rating":5,"text":"Incredible views, service and food. The members club levels are beautifully curated and such a plus to have as a part of your hotel stay. The perfect spot to entertain, have meetings or even just a good cocktail. (Delicious Martini) ","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"An amazing Luxury property an amazing location and Experience. The team at Casa is just brilliant and very welcoming  ","lang":"en","publishedDate":"2023-07-16","publishedPlatform":"OTHER","rating":5,"text":"I stayed at Casa Cipriani NYC for two nights in February 2023 and I was blown away by the experience. The hotel is located in the historic Battery Maritime Building, which has been beautifully restored and decorated with maritime-inspired themes and art. The location is amazing, right on the water with stunning views of the Brooklyn Bridge and the Statue of Liberty.\n\nThe room was spacious, elegant and comfortable, with a private balcony where I enjoyed my morning coffee and evening wine. The bed was heavenly, the bathroom was luxurious and the amenities were top-notch. The staff was friendly, attentive and professional, and they made me feel very welcome and pampered.\n\nThe hotel also has a private members club, which I had access to as a guest. The club has a restaurant, a bar, a lounge, a library, a spa and a fitness center. The food was delicious, the drinks were superb and the atmosphere was cozy and sophisticated. I met some interesting people there and had some great conversations.\n\nCasa Cipriani NYC is more than just a hotel, it’s a destination. It’s where home feels like an escape. I highly recommend it to anyone looking for a unique and memorable stay in New York City.","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"Best luxury room product in nyc ","lang":"en","publishedDate":"2023-07-16","publishedPlatform":"OTHER","rating":5,"text":"Most incredibly and impeccably designed rooms in NYC. Amazing gym. Private social club is actually exclusive and a huge draw for the hotel. Nothing beats getting Cipriani bolognese anytime, even at 5am after a late night out.  ","travelDate":"2022-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23092379,"title":"Classic and timeless location with Palace service.","lang":"en","publishedDate":"2023-07-16","publishedPlatform":"MOBILE","rating":5,"text":"Classic and timeless location with Palace service.\nLovely 3 days overall from the In Room Dining to the the Jazz Cafe, the restaurant and the Club Lounge, everything blend perfectly to make you feel at home while being offered a service worthy of the best Parisian Palaces.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Amazing!","lang":"en","publishedDate":"2023-07-16","publishedPlatform":"OTHER","rating":5,"text":"I slept like a baby! This house is the epitome of luxury. If looking for a true 5 star experience in downtown NYC look no further.The views from my room were spectacular. The service was impeccable. The gym and spa were very impressive especially the Cryotherapy!","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23092379,"title":"Magical Place","lang":"en","publishedDate":"2023-07-15","publishedPlatform":"OTHER","rating":5,"text":"This hotel is a true jewel in every aspect, from the service to the restaurant, the location, the iconic building and the beautiful rooms. A once of a kind experience, the attention to detail is unmatched. Secluded above the East River, you see the city, but you don't feel inside of it. Magical! ","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Amazing","lang":"en","publishedDate":"2023-07-14","publishedPlatform":"OTHER","rating":5,"text":"I had the pleasure of staying at Casa Cipriani New York in October 2022.\nI stayed in a Junior Suite overlooking the East River and the Brooklyn Bridge which was stunning. It was quite possibly the most beautiful and elegant and high finish hotel that I have ever stayed in. The service\/staff were Italian and I felt like I was in Europe.\nI would highly recommend this hotel and stay there again. It has an excellent variety of different bars\/restaurants and lounges. My favourite was the Main Club restaurant terrace. The lights on the Brooklyn Bridge at night were magical. The gym was quite possibly the most aesthetically beautiful gym I have ever seen in my life.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Chic Stay in the City!","lang":"en","publishedDate":"2023-07-13","publishedPlatform":"OTHER","rating":5,"text":"I stayed at Casa Cipriani in April and loved my stay. I stayed in a Premier Suite with a terrace overlooking the East River. I was able to do yoga on the terrace at sunrise and watched the sunrise over the Brooklyn Bridge. The hotel is exceptional. I also had in room dining breakfast on my terrace. I felt like I was in Europe. The Jazz Café is a must on a Friday night, the band were sensational. The food is Venetian and the cocktail list extensive. A MUST stay.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Overrated","lang":"en","publishedDate":"2023-06-10","publishedPlatform":"OTHER","rating":3,"text":"Lame. Overrated especially for the exorbitant  price. Small rooms, yes designed to resemble a historic luxury cruise ship, and while the hotel did not seem busy at all, we had a view overlooking the rooftop next door. The bathroom was good. I wish I had read the reviews prior to booking. \n\nThe South Seaport area is alive and thriving. Tin Building food market awesome. Many new waterfront restaurants as well as classics in the square.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"What a shame!!! Staff training needed","lang":"en","publishedDate":"2023-01-12","publishedPlatform":"MOBILE","rating":3,"text":"When we first realised this is where we would like to stay, I was focused on booking.  When it got to the booking stage that’s when things went slightly wrong (and a bad vibe was set). The lady I’d been speaking to regarding the booking had left for the day so I got to speak to her colleague (who clearly didn’t want a family staying in one of his suites over new year🤷🏻‍♀️). I then go to speak to Huni? Who also gave a general negative vibe about us staying in one the most exclusive!!! Hotel “with children” My children are, 14, 17 and 19 (hardly rampaging toddlers). I was given strict instructions at to what they should be wearing when arriving and that they would have to out of sight and never allowed on the 5th floor after 5pm.  Ok so we took this all on board and after a very long flight from Heathrow, arrived at hotel to be told again that if we wanted to eat in the restaurant that they would have to change.  They didn’t look untidy, they had got changed in the airport loo to make themselves smarter.  We went to the fifth floor worrying that we would be smart enough.  We arrived to see the table opposite us with teenagers wearing t shirts and less than smart.  Then later a bunch of men come in with trainers on!!!!! We are English and both of these tables were not! I can draw my own conclusions regarding this.  The food!, well the pizza was amazing, but the pasta!? I’ve travelled all over Italy and eaten so many amazing pasta dishes (Al dente!!) more like un cooked.  None of us ate any of the pasta dishes.  Service in the restaurant was fantastic and staff were lovely.\n\nThe visit to the bar was embarrassing and not at ok or what I would have expected!!! So this would be the night of the 30th and we decided to have a nightcap in the lovely bar (without the children 14,17 & 19 year old children). The female bar tender who physically turned her head away from us as we walked to the bar!!! She was physically unable to show how unhappy she was with being asked to prepare two drinks for us.  She said nothing!!! Not welcome, how can I help you, what would you like or even, enjoy as she served the drinks!!! Nothing, just a disgusted look on her face.  When she did serve the drinks she put them on the bar, which was soaking with booze or water from other drinks served before us.  This was the last straw.  I confronted her and said a nicer attitude would be very much what I was looking for and a clean bar!!!! She apologised in a very sarcastic manner.  I walked away from the bar.  I’m hugely disappointed with this hotel.  You can’t do this to customers and expect a reputation which will attract the people who can and are will to pay the prices you charge.  The room service is another saga (which I really don’t have the energy for). You guys have a lot to learn, not 5 star I’m afraid, your pushing 4.","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23092379,"title":"Not luxury but expensive","lang":"en","publishedDate":"2022-11-21","publishedPlatform":"OTHER","rating":3,"text":"Prefer to stay around midtown when in the city but we wanted to give this club hotel a try. We arrived with high expectations and while Casa Cipriani restaurants are among our favorite Italian restaurants, the hotel part of the building isn't there yet. Overall we had a good time, Suites are solid, and the views of the statue of liberty are the best in New York. Service felt somewhat impersonal for the amount of money we'd spent at check out. thank you","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":2,"locationId":23092379,"title":"Hotel is nice but be careful of erroneous charges and bad service!!","lang":"en","publishedDate":"2022-10-12","publishedPlatform":"OTHER","rating":1,"text":"The hotel is in a beautiful location on the water, the rooms are nicely decorated and views are wonderful.\n\nDo NOT use the Amex Fine Hotels benefit to book this property, you will be disappointed! There was no upgrade at check in, first disappointment which is minor and not guaranteed. The BIG issue was the erroneous charges! I was charged by AMEX at the time of booking. When I checked into the hotel they put a hold on my card for incidentals, this was fine by us. The next morning I saw my AMEX had been charged again by Casa Cipriani for the room. I called the front desk and they acknowledged the glitch and said the charge would be removed. When I checked out they again confirmed the pending charge would drop off. 3 days later the charge posted so I called the property. They claim to have no record of charging me and said it must be an AMeX issue!! The Charge from AMEX shows up as AMEX Fine Hotels, the charge from Casa Cirprini shows up under their name! The manager was rude and also said “you booked through Expedia” which i guess is who AMEX uses for their bookings and treated me like I was second class. I called AMeX and they are handling but what a mess and waste of time for an ok property that is over priced! Don’t stay here if using AMEX- just don’t!!\nIn looking at other reviews I see this “glitch” happens often! Shame on you Casa Cipriani!","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Would not recommend the Hotel","lang":"en","publishedDate":"2022-09-09","publishedPlatform":"OTHER","rating":1,"text":"From making our reservation to check out our experience was not what was expected of a Cipriani property.  Our room had a toilet that wouldn't stop running, TV didn't work most of the stay and the room smelled at night when we returned.  They charged our credit card 4 times what the room should cost the day we checked in to the hotel. Even though it was only a hold on our credit card it was excessive, upsetting and not authorized by us. When we complained they said there was no one available to take care of the charge at the moment. We spent way too much time speaking to different employees and management for the small courtesy's the manager extended to us. The club has spectacular views and food and service were amazing. However, I would not recommend staying at the hotel until they get their act together.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23092379,"title":"Excellent hôtel et restaurant","lang":"fr","publishedDate":"2022-08-06","publishedPlatform":"OTHER","rating":5,"text":"C’est un très bel hôtel situé dans une partie réhabilitée du port d’où partent les bateaux à destination de Staten Island et des autres îles touristiques. \nUne rénovation de très grande qualité avec un style art déco. Les chambres sont très belles avec une jolie vue et le restaurant sur le toit est magnifique.\nLe personnel est adorable et efficace. \nVraiment un très bel établissement à découvrir sans tarder. Nous ne manquerons pas d’y revenir lors d’un prochain séjour à New York.\nNe changez rien!!","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23092379,"title":"Surprise trip !","lang":"es","publishedDate":"2022-07-06","publishedPlatform":"MOBILE","rating":5,"text":"Solo nos quedamos dos noches ! Viaje sorpresa de cumpleaños sin duda para volver con más tiempo para disfrutar al máximo , gracias por una maravillosa estadía todo el equipo va más allá del servicio para hacer feliz a sus guest ! Recomendable totalmente !","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23092379,"title":"A  fantasy like old world luxury liner experience in a new hotel.","lang":"en","publishedDate":"2022-07-04","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is luxurious and charming. It has an appropriate nautical design with an elegant old world feel. The Fulton suite is the perfect balance of form and function. You feel like you are in a stately opulent suite of a grand luxury liner. Since the hotel is new, everything is crisp and perfect. All the latest tech is subtly integrated, so as not to distract from your fantasy voyage. But, none of this would work without the old world service to match the design. Casa Cipriani has it in spades. I don’t know what kind of training program Casa Ciprani has, but their entire team, to a person, executes on a level that I have rarely experienced in my thirty years of high end luxury travel. This review does not do it justice. You must experience it for yourself.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Must Go !","lang":"en","publishedDate":"2022-05-18","publishedPlatform":"MOBILE","rating":5,"text":"Incredible food and service. The most unbelievable vibe and views in New York City. Everything about this place is top-notch and magical. The service is unmatchable and I highly recommend you try it. They have a bunch of off menu items which I recommend !","travelDate":"2022-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23092379,"title":"Great view, fun experience, private club","lang":"en","publishedDate":"2022-05-17","publishedPlatform":"MOBILE","rating":4,"text":"What a spectacular space.  To die for views of NY harbor, Staten Island ferry coming in and out.  Brooklyn, Governors Island, the Verrazano.  \nGood cocktails. Not the biggest pour but an old school Harry’s Bar Martini makes me think of traveling to Venice with my father only a few decades after Ernie H actually raised a glass there \nMenu had plenty of options. Food was solid but not sublime. \nDesserts were best part. The cakes and gelatos were strong. \nThe crowd is wealthy and not afraid to flaunt it.  Lotta energy. \nService was good. \nHappy to have gone, happier that work paid for it.  \nFun night - walked back to Brooklyn over the BB.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23092379,"title":"Luxury Club with amazing bedrooms","lang":"en","publishedDate":"2022-03-19","publishedPlatform":"MOBILE","rating":5,"text":"This is a lovely hotel and club. I went for a standard room which was amazing. For New York the rooms are large beautifully appointed and furnished and the beds were very comfortable \nThe hotel is located next to the Statten Island Ferry Terminal and one minutes walk from the 1 Subway line that takes you into midtown in 20 minutes \nOn checkin the staff couldn’t have been more helpful \nThe restaurant on the 5th floor is stunning with amazing views and food.\nThe service at this place is amazing a special mention to the doormen they were amazing \nI can’t wait for my next business trip and will definitely be staying here","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":23092379,"title":"The best hotel in New York","lang":"en","publishedDate":"2021-11-11","publishedPlatform":"OTHER","rating":5,"text":"Fantastic F&B, rooms and suites! Classic Cipriani service at the club, restaurants and hotel. The view from this property is absolutely unique to detach from the vibrant city of New York. The interior design is sublime!","travelDate":"2021-10","tripType":"NONE"}
