{"helpfulVotes":0,"locationId":287626,"title":"NY on top","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":4,"text":"Beautiful hotel very trendy great location for non-touristy New York all around you can visit a lot of an important number of tourist places museum restaurants new places for visitors. super equipped hotel with super fashionable nightclub, high cost but all of NY is very expensive","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"A lovely stay, will be back.","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is clean, well located in the meatpacking district. The staff are friendly and welcoming. The fitness room is great. The bathroom was a good size and the toiletries are high quality. They provide a hair straightener and the diffusers for the hairdryer. A nice touch. The robes and slippers are also a nice touch. The desk chair was comfortable for my husband to work at.  My only quibble was no coffee in the room.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Fantastic Hotel","lang":"en","publishedDate":"2024-03-23","publishedPlatform":"OTHER","rating":5,"text":"This hotel is amazing from top to bottom.  \nUnderstated class. \nThe bed and pillows were so comfortable. \nWould suggest the deluxe room that has a small sitting area. \nThe location couldn’t be better. Walking distance to many restaurants, The Whitney, Chelsea Market and the Hudson River. \nStaff goes above and beyond!\nA bit pricey but WELL worth it!\nSecond time staying here- can’t wait to return.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Sets it self apart: great vibes, superb location.","lang":"en","publishedDate":"2024-03-08","publishedPlatform":"OTHER","rating":5,"text":"This is our hotel if we go to New York, class above the rest. Great location in the meatpacking district and walking easy to West village, Chelsea and Greenwich.\nNot too big, not many tourists: classy and interesting people. The Team is great and you will feel at home soon, all decorated with modern art, nice rooms and great atmosphere: try to rooftop bar and pool.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Wonderful Hotel in great neighborhood","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"MOBILE","rating":5,"text":"The room was wonderful ; location great ; area nice ; hotel staff top notch !!\n\nSpacious room for New York Hotel \n\nWell furnished. Gym was great \n\nEasy access with wide streets\n\nWe will stay again \n\nNice coffee shop in lobby .\nVery well staffed and cooks lot be nicer","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":287626,"title":"Underwhelming","lang":"en","publishedDate":"2024-02-27","publishedPlatform":"OTHER","rating":3,"text":"Given the brand - and all the reviews  - I thought we'd be stepping into the swankiest, luxe hotel possibly ever! Eh. I've seen nicer lobbies in bus stations. Well, I don't actually go to bus stations, so that's not true. But it's what I'd imagine a bus station lobby might look like, with a little cafe crammed into the corner, and a couple sad little chairs insufficient for the 15 people waiting around because some technical glitch was holding up things at the front desk... \n\nI will say that poor staff, struggling mightily through who knows what was going on, were all troupers (this is how you spell it, people!), dealing with cranky guests with grace and best efforts. And the valets and bellman were unfailingly friendly and helpful throughout our stay. Very welcoming.\n\nRooms are nice - the window seat is a charming touch, though if your neighbors are sitting in theirs... hi?! \n\nFor what you're paying, though, things should be a little nicer - street- and neighboring room-noise (including a barking dog) got annoying at times. And why is there no coffee maker in the room? I can't be the only person who would like a cup of coffee - even a mediocre one - before having to get dressed to go get one. Our sink was clogged (though fixed quickly), but that's kinda gross, and inconvenient for us to schedule its repair. \n\nLocation was great (well, other than the robbery at Gucci across the street) with everything the Village and Chelsea have to offer within a few minute's walk. All in all, not what I was expecting, but not terrible. If half star ratings were possible, I'd give it a 3.5 for the price.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Modern hotel","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"MOBILE","rating":5,"text":"Modern, clean hotel. Loved meat packing district. Friendly staff. Always had security at front door and elevator. Would stay again. Next to Google office and Chelsea Market. King size beds. No problems at all. Easy subway access. Away from tourist trap of Tomes Square.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Very disappointed","lang":"en","publishedDate":"2024-02-13","publishedPlatform":"MOBILE","rating":2,"text":"We are currently at the hotel but have had so many issues I felt I should document now.\n\nThoroughly disappointed with our experience since arriving last night. This morning I requested the manger contact me on arrival, just followed this up and the message to contact me didn’t reach her !\n\nSo here goes\n\n1, on arrival we were told there was an IT issue so guests were unable to have keys for their rooms but security would need to let you in everytime you wanted access. What was more shocking was that the security men told me this has been the case for 2 weeks now !!\n\n2, we had requested a room with 2 beds. They hadn’t seen this, and I was told sue to the “IT” issue they could not move us to the correct room.\n\n3, I had selected this hotel (never again) due to rooftop bar, pool and restaurant. On arrival we were told it was closed till Wednesday (when we leave). \n\n4, food in the restaurant Chester’s was poor. I ordered roast chicken with “vegetables”, I received Roast chicken on a bed of carrots. To be fair they did not charge us.\n\n5, manager was pleasant but did not feel she did enough to placate us die this disappointing experience.\n\nThis place is certainly not in the league of best hotels in New York like they were when based on Park Avenue.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Not My First nor Last Stay","lang":"en","publishedDate":"2024-02-02","publishedPlatform":"MOBILE","rating":5,"text":"Gansevoort Meatpacking is located in one of the hottest spots in NYC, so definitely it is always my first choice. Besides the location, the spacious rooms, the cleanliness and the staff will always make it my first choice. The staff is very friendly and professional. Also, the food is delicious. Thank you  Gansevoort Team for absolutely everything. \n\nNour","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"So Much Going For It.","lang":"en","publishedDate":"2024-01-31","publishedPlatform":"OTHER","rating":4,"text":"The Gansevoort is a swanky landmark hotel stuffed in the Meatpacking District of NYC. My Deluxe King room was appreciated with its sofa bed and bay window and collage of walnut crescenda, desk and armoire. The desk chair popped in blue, a floating shelf perched over the tv, a backlight headboard graced the bed and the room was outfitted with high-tech room appliances. The bath was accessed via a decorative barn door, subway tiled and adorned with black matte hardware. Culinary offerings include 2 ground floor restaurants. On one side of the main entrance is the Chester.........a Bistro, and bustling spot for American bites and cocktails. On the other side is the European-inspired Coffee + Cocktails serving up Mediterranean delights. Tucked away in a corner of the Rooftop Lounge is the Saishin omakase venue that highlights traditional Japanese cuisine like Hamachi, Madai, Akami and more.......I selected the King Salmon....very flavorful. The 45 foot long rooftop pool is the hotel's most distinctive asset and sports an indoor & outdoor portion and a Scandinavian look brought to life by night lighting. So, if you seek an urban retreat with destination dining, a sleek Rooftop Lounge and a shopping & attractions mecca....then try the......\n...............Gansevoort Meatpacking NYC................so much going for it.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":287626,"title":"The coolest spot in town","lang":"en","publishedDate":"2024-01-31","publishedPlatform":"OTHER","rating":5,"text":"The hotel is in an excellent location with a wonderful restaurant. We enjoyed a martini in the bar by the lobby before heading out and loved our bartender.\nStaff was hospitable and went above and beyond to make sure we enjoyed our stay. Made us feel like true VIPs! I can't wait to go back","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"Premier NYC hotel","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"OTHER","rating":5,"text":"The Gansevoort Hotel occupies the upper echelon of Manhattan’s many boutique hotels. It’s located at the junction of the West Village\/Meatpacking\/Chelsea neighborhoods. We have visited NYC dozens of times and have easily concluded this hotel has them all beat. It has the perfect blend of unpretentious luxury and style with a rock-star staff. This, our fifth stay,  was made special by Gabriella their assistant manager who meticulously planned a special birthday celebration. Available to answer any questions we had, even on her days off! How’s that for service?\nThis hotel is the complete package where everyone from the housekeeping staff to the hotel owner strives to make you feel welcome.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"The Gansevroot Hotel is outstanding: the accommodations, service, staff, location and amenities!!","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"MOBILE","rating":5,"text":"We thoroughly enjoyed our stay at the Gansevroot Hotel\/Meatpacking district in NYC! Our stay was expertly coordinated by Lauren Nordstrom, Manager of Front Office and Front Desk Operations. She selected an excellent suite with beautiful views of NYC, and arranged for a surprise plate of delicious homemade chocolates that made our stay that much “sweeter!” Upon arrival we were greeted with a very warm welcome by Marcel who immediately recognized us from our previous stay 11 months before!! We were so pleasantly surprised!! Raul was immediate in his attention to greet us too, and efficiently collected our bags while we checked-in with the two Front Desk Agents, Nikole & Precious, both professional and  very pleasant!! Raul escorted us to our room and thoughtfully & strategically placed all our bags in perfect locations for ease of unpacking!! Later in the evening we invited 4  friends to join us at the beautifully renovated Gansevroot Rooftop Bar where we were greeted by a lovely hostess who seated us at the perfect table for our group!Immediately we were approached by a very tall, lean, and very friendly cocktail waiter who was extremely attentive to our table and provided the best service we have ever experienced in any bar setting!! (Especially since we were an “older” group of people, lol!)  At the end of our excellent stay at the The Gansevroot, we were greeted by the Front Desk Agent  Michael who was genuinely interested in our overall satisfaction with our accommodations and our stay!! He was eager to pass along our remarks to his managers!! We were very well cared for and we enjoyed the amenities of the hotel: impressively new and improved, workout center, the heated, outdoor rooftop pool, coffee shop and we look forward to the restaurants on our next visit!!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Great to stay in cool area","lang":"en","publishedDate":"2024-01-14","publishedPlatform":"OTHER","rating":4,"text":"Nice hotel in good location with lots around it. Quieter but cooler area to stay vs. midtown.   Close to Google and other local businesses as well as Chelsea Market and the Highline.   Note that there are bars and restaurants downstairs so it can be noisy sometimes.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"NYE with Gansevoort","lang":"en","publishedDate":"2024-01-05","publishedPlatform":"MOBILE","rating":5,"text":"Greta hotel in a great area. Having stayed in Times Square the previous 4 nights it was great to get out to a quieter area that was full of character. \n\nThe deluxe queen rooms were spacious and modern and we booked two nights to attend the rooftop NYE event. The host Gabriella was an absolute legend, she assist with our booking whilst we were overseas and was there on the night to ensure we had an amazing time and were looked after.\n\nThe crowd was great and the drinks were flowing. We’d probably pre order less food and more bottles if we were doing it again but it all worked out and we had a great night!\n\nWe will be back for sure 👌","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Lindo hotel en Meatpacking District","lang":"es","publishedDate":"2023-12-22","publishedPlatform":"MOBILE","rating":5,"text":"La ubicación fuera del bullicio de Midtown me parece la mejor. Rodeada de muchas tiendas lindas y deliciosos restaurantes. El servicio es muy bueno, con gente muy amable y servicial. Las vistas al río a la hora del sunset son estupendas. Sin duda me volvería a hospedar","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Great Option in Lower Manhattan","lang":"en","publishedDate":"2023-12-16","publishedPlatform":"MOBILE","rating":4,"text":"We stayed at the Ganesvoort for two nights for a quick Christmas in NY trip.   The location and the room were the stars of the hotel.  We reserved a Grand Deluxe King and it was a beautiful and recently renovated room.   It was large by NY standards, quiet, and comfortable.  The hotel is in the heart of the meatpacking district and you could not ask for a better location to explore the bottom half of Manhattan.    We did do a broadway show and visited the Christmas sites in and around Rockefeller Center and it was an easy subway ride with the station a block away.   There is a rooftop bar which we did not visit.  The lobby bar and restaurant were both pretty average and not worth visiting in a city with so many great options close by.    We drove and valet parking was about what we expected…ridiculously expensive at $85, but that’s sort of the going rate to park a car for 24 hours in the city.    Finally the service level was fine, but not up to the rest of the hotel.  Nothing tragic, but oddly a lack of pro activity.  Both checking in and checking out we were struggling with our luggage and the doorman and the valet sort of stood by and watched.   Again, not tragic, but not up to what you’d expect from a high end NYC hotel.   I rated it 4, but would have given it 4.5 stars if permitted.   I’d definitely consider going back again.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Not worth the money","lang":"en","publishedDate":"2023-12-08","publishedPlatform":"OTHER","rating":2,"text":"It is a clean hotel but nothing special. Certainly is not value for money, it is expensive for being ordinary. There is no lounge to relax in, we were asked to leave the bar area because of a private function, where are guests expected to go! We had to pay $8 for a litre of water. Will not be returning nor recommending.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"Great hotel with prompt service","lang":"en","publishedDate":"2023-11-25","publishedPlatform":"OTHER","rating":5,"text":"I stayed at this hotel for 20 nights and it was great. I'm a former New Yorker, and needed a hotel for an extended stay due to the new Air B & B laws in New York. The staff was the highlight! Especially Marcel and John Ross: they made a long trip seamless. The reception desk, housekeeping, restaurant and room service were also very helpful and prompt. I'll return! Thanks Again! ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Top location, great people and the right place to be ( especally for german friends!","lang":"en","publishedDate":"2023-11-25","publishedPlatform":"OTHER","rating":5,"text":"We enjoyed a marvellos  time at a outstanding place. Great roof top pool, exzellent view, outstanding restaurant and —- really important warm and dedicates service personell ( mainlyGabriela Hurst!,)\nComing back to N Y - this would be our place to stay!","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"10\/10","lang":"en","publishedDate":"2023-11-15","publishedPlatform":"OTHER","rating":5,"text":"My firm hosted an event on the rooftop last week and it was absolutely wonderful!! Gabriella was incredible to work with- we decided to do our event very last minute and she managed to make it perfect on such short notice. The space is gorgeous and the staff was great! We will definitely host another event here!","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"I would definitely put this on my list of \"hotels to return to\"!","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"OTHER","rating":4,"text":"Awesome location for our needs and good sized rooms.  Bathroom was also roomy and clean.  We had a great view of the Hudson River, which we didn't expect. Another positive was that we were able to walk from Moynahan Station, which is not something everyone will want to do, but it is a nice walk if you want some fresh air after a train ride!  The only downside was that I have been unable to retrieve a couple of articles of clothing which I left behind.  I called less than 24 hours after check out and told the staff my room number and exactly where the clothes were and they said they didn't find anything in the room.  That does not leave the best taste in my mouth.  Obviously my mistake, but I would like to think people are honest enough to turn in items which guests might leave behind.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Location, location, location","lang":"en","publishedDate":"2023-11-08","publishedPlatform":"OTHER","rating":4,"text":"This is a solid 4-star hotel and I would definitely stay here again due to the pros.\n\nPros: Location, Location, Location; plus Clean, Free Wifi, Staff is friendly and good. \n\nCons: Soft mattresses and lumpy pillows; no 24-hr room service and food choices are not edible, including terrible wait staffs in both eating spots; room temperature can't be self regulated; exterior noise at hotel is loud 24-hours a day; furnishings felt low level for a pricey hotel like this.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Great Experience","lang":"en","publishedDate":"2023-11-07","publishedPlatform":"OTHER","rating":5,"text":"Great location and great hotel.  Friendly and attentive service.  We had a birthday celebration on the roof top for 20 people which was great.   Gabby from the event planning staff was fantastic at coordinating everything.  We will be back.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Thank you Gabriella & the Gansevoort.","lang":"en","publishedDate":"2023-11-02","publishedPlatform":"OTHER","rating":5,"text":"Our organisation hosted a semi-private event on the Gansevoort Rooftop, and it was flawless. Our point of contact was Gabriella, and she truly went above and beyond for our organisation; she was incredibly responsive and professional and tailored the event to just how we imagined it. On the evening, Nino was incredibly hospitable and we are grateful to our wonderful host Sprok. What a setting, and service! Thank you, Gabriella, we will be requesting your service each time! ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Gansevoort NYC decides to grow up. ","lang":"en","publishedDate":"2023-10-22","publishedPlatform":"OTHER","rating":5,"text":"I am going to be honest, I reserved the Gansevoort with some trepidation. 20 years ago the Meatpacking district became a nightclub Mecca in New York. Alot of hotels opened to capture the crowds. As I always say ,hotels catering to the party crowd always take a beating, and loose their luster very quickly. Gansevoort was one of those hotels , along with the likes of the Dream Downtown, Soho House, The Standard, etc.  The issue is when I travel to NYC , the Meatpacking district is my base, so when I heard the Gansevoort had gone through a renovation, I jumped at the chance to actually stay in the Meatpacking district. \nI was not expecting much , as the Gansevoort hotels have been closing. However, I was pleasantly surprised. The hotel has managed to exceed its original luster, while attracting  a more mature client base, reflecting the maturity of the Meatpacking district as well. Obviously I don't look for the same things in a hotel as I did 20 years ago. I am happy there is a hotel now in the area that decided to grow with me and the times.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Not a luxury hotel. ","lang":"en","publishedDate":"2023-10-17","publishedPlatform":"OTHER","rating":3,"text":"A fancy hotel in an upscale neighborhood with no heat (not tuned on yet),  horrible construction noise from 7am at nearby building. No fans in bathroom. No ceiling light made room dark. $8 Waterbottles set next to bed...\nBathroom door is a slider that wouldn't stay shut nor lock. Minimal lobby space.  \nNice staff. \nGorgeous rooftop pool with views of the river and lots of seating for sunbathing.  Cozy rooftop bar with separate (and quieter) group area. ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Een aanrader","lang":"nl","publishedDate":"2023-10-11","publishedPlatform":"MOBILE","rating":4,"text":"Dit hotel is in het voor NY rustig gelegen meatpacking district ons favoriete gedeelte van Manhattan vanwege de laagbouw en minder hectisch dorpse gevoel.\nOok zijn er veel goed restaurants te vinden.\nHet is dicht bij verschillende bezienswaardigheden. \nWij vonden de nieuw ingerichte lobby iets minder mooi dan vroeger maar dat is smaak kwestie.\nHet personeel is vriendelijk en behulpzaam.\nDe kamers zijn redelijk van formaat en het is fijn dat een raam open kan.\nWe hebben dan ook met raam open geslapen omdat het zo rustig was s’avonds.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Absolutely love this hotel, location and the excellent staff at reception, lobby bar and the doormen.","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"OTHER","rating":5,"text":"My first time not staying in Mid-Town and I will never go back, thanks' much to the great location of this hotel, the surrounding amenities, restaurants coupled with the excellent service in the hotel itself. Lively lobby bar with even a trio playing jazz was a great option. A surprisingly in-depth menu there. How they manage the area is to be commended, they always found me a spot. I cant wait to return. ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"An oasis in Manhattan","lang":"en","publishedDate":"2023-09-26","publishedPlatform":"MOBILE","rating":5,"text":"The Gansevoort could not be better located if you want to explore the best of the Village, Highline, and Chelsea.  It's a newer building with all the amenities:  pool, rooftop bar, restaurants, outdoor cafe, etc., etc.  The staff is also extremely friendly and welcoming.  We only stayed two nights, but it quickly felt like home.\n\nMy only gripe is the price.  Our room ended up, after taxes, a few breakfast\/drink charges, etc., over $800 per night.  I realize this is true of EVERY hotel in New York now, but it prompted us to shorten our 3-day weekend to 2.  Money truly seems to evaporate when you are in Manhattan.\n\nThe hotel has a perfect vibe that is hip\/urban but also down-to-earth and friendly.  We'll return definitely.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Recommend Rooftop for Work Happy Hour","lang":"en","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"I took my team out for happy hour and worked with Gabriella Hurst to plan this casual gathering. She was excellent to work with, very responsive and so accommodating! If you have a group over 8, I highly recommend asking for her assistance and choosing Gansevoort Meatpacking! ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Kindness Counts ","lang":"en","publishedDate":"2023-09-17","publishedPlatform":"OTHER","rating":5,"text":"My daughter and I had a great stay at the Gansevoort.  Our 2 bedroom suite was small but clean and cool and had everything we needed. The location is great for shopping, and is far from the more tourist parts of the city.  My daughter is allergic to a lot - and the manager was kind enough to purchase a small air cleaner for the room - and it made a big difference. Two thumbs up. ","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Excellent Behind-the-Scenes Service","lang":"en","publishedDate":"2023-09-13","publishedPlatform":"OTHER","rating":5,"text":"This is a review for those people who do the hard yards behind the scenes!  I was having a tremendous amount of difficulty getting an extremely important package to a client staying at the Gansevoort NYC.  Rene from Guest Services went above and beyond to help me with UPS and when it finally arrived, he went out of his way to rush it to my client, essentially saving our team a lot of problems.  He was friendly and professional from the moment he picked up the phone and managed to put me at ease, as I felt confident that he had my back.  Thank you, Rene!  And thank you to the charming Gabriella Hurst who also assisted me later in the week.  What a team!  I will DEFINITELY be staying with you the next time I visit NYC.  ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Hospitalidade ZERO","lang":"pt","publishedDate":"2023-09-11","publishedPlatform":"MOBILE","rating":2,"text":"Serviço bizarro no rooftop, piscina e bar do lobby.\nDesrespeitoso, ganancioso e zero hospitaleiro. Se você considerar que o hotel é o valor de um hotel de luxo, multiplique por 10 sua frustração. Não vale a estadia! A localização e o tamanho do quarto são as únicas qualidades.","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":287626,"title":"The best of the best","lang":"en","publishedDate":"2023-09-11","publishedPlatform":"OTHER","rating":5,"text":"This is a very classy, clean and quiet hotel in a very hip area of town. The location is amazing!\n\nFrom the moment I walked in (worse for wear from travel), the staff treated me so warmly and were like connecting with friends. I was blown away by this – it is a very nice hotel and I honestly didn't look like I belonged there but I was treated very nicely. \n\nThe room blew me away. The fixtures, linens and lighting are all high quality and well thought out. The amenities in the room:\n1. Marshall speaker\n2. Samsung tv that you can easily connect your phone to and stream content from your phone with a QR code (I'm not tech savvy and figured it out)\n3. Each room has a smart gym workout mirror\n4. Robes, slippers, stocked fridge and snacks\n5. I forgot my curling iron and the room had its own straightener\n6. Even the artwork in the rooms is top notch\n\nThe beds are comfortable, the headboard and nightstands good quality (and finally a hotel without a Gideon Bible!). I swam in the rooftop pool early morning and was delighted. Staff noticed and brought me a towel. \n\nTruly, this was one of my \"best ever\" hotel stays. ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":287626,"title":"Nightmare on Gansevoort St.","lang":"en","publishedDate":"2023-09-07","publishedPlatform":"OTHER","rating":1,"text":"What a disaster. The noise from adjacent rooftop restaurants and clubs made it impossible to sleep. They should issue a warning with every reservation. \nIt was so bad that I was ready to leave at 10:30pm , on a Tuesday! \nWhen I asked the front desk “is this normal? when do the usually quiet down?” Instead of answering my questions he just said, “I’ve never had a complaint before.” \nI would never go back and would warn everyone I know traveling to NY not to go there either.\n\n","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Great Hotel in an Unbeatable Location","lang":"en","publishedDate":"2023-09-05","publishedPlatform":"OTHER","rating":5,"text":"A very nice, newish hotel in the Meatpacking district. Very close to the highline, Chelsea market, jazz clubs, restaurants, etc. Staff is very friendly, clean rooms. The pool closes at 6pm which is was a bit annoying as several others would have stayed until at least sunset (7:30pm) for drinks and food. Our A\/C also wouldn't adjust and was at a very frigid 63 degrees the entire time. A great stay overall and we hope to make it our \"home\" hotel.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Good place, great food and service, great atmosphere","lang":"en","publishedDate":"2023-08-22","publishedPlatform":"OTHER","rating":5,"text":"I called to book a table for 8 people in the rooftop bar.  I found the process easy, the booking agent (Gabriella) was very responsive and courteous, she called back when she said we would.  I didn't get the typical NY take-it-or-leave-it attitude.  The bar was hopping but not overflowing, it was comfortably buzzy.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Fantastic Team","lang":"en","publishedDate":"2023-08-14","publishedPlatform":"OTHER","rating":5,"text":"Wonderful team that assisted in setting up a business lunch! We had a group of 13 people, and required a private meeting space. \nThey catered lunch for us, and provided a wonderful event. \nFantastic all around!\n5 Stars!!","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":287626,"title":"Five stars all around!","lang":"en","publishedDate":"2023-08-10","publishedPlatform":"OTHER","rating":5,"text":"Wonderful experience at the Gansevoort! The customer service was superb and the spotless, spacious suite, was more than ample for our family of four. We were pampered for five nights and will absolutely return. The location can't be beat on the border of the Meatpacking district and Greenwich Village...a million times better than the hustle of mid-town\/Times Square and ideal for experiencing neighborhood life in Manhattan.  Surrounding restaurants are plenty, subway a stones throw away, and the rooftop pool was great for the kids with excellent views.  Highly recommend!","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Gabriella is THE BEST!","lang":"en","publishedDate":"2023-08-10","publishedPlatform":"OTHER","rating":5,"text":"Gabriella was so attentive in helping me organize a corporate dinner. The ask was very last minute but she ensured all of my questions were answered and she even gave me a follow up call to ensure I was all set. 5 stars!","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"An elegant hotel in the heart of Chelsea","lang":"en","publishedDate":"2023-08-08","publishedPlatform":"OTHER","rating":5,"text":"We were delighted with our four days at the Gansevoort - the rooms were very spacious, quiet, with plush bedding and bath linens. Housekeeping tidied up beautifully daily. The lobby cafe and adjacent restaurant were both perfect for brunch, coffee and a pick-me-up. We didn't have time to enjoy the rooftop bar or pool, but will do that next time. The front desk and concierge services were so efficient and professional. Overall we had a 10\/10 experience, and will always stay here when visiting our son. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"L’avis d’un professionnel de la restauration et de L’hotellerie","lang":"fr","publishedDate":"2023-07-31","publishedPlatform":"MOBILE","rating":4,"text":"Très bel hôtel , chambre, magnifique, dommage que la piscine ferme aussitôt, malheureusement la partie restauration n’est pas à la hauteur, j’ai eu l’occasion de rencontrer le nouveau directeur qui est un homme absolument charmant, pas mal de petits réglages à faire, mais franchement, un très bel hôtel","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":287626,"title":"Dreadful, would not recommend dining here","lang":"en","publishedDate":"2023-07-31","publishedPlatform":"OTHER","rating":1,"text":"Went for dinner for a special occasion \nHugely disappointed\nUnusual for USA, but the service was dreadful and the noise unbelievable \nFood was ok, saved really by the sushi which was good, everything else about the evening was decidedly mediocre ","travelDate":"2023-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"NYC TRIP ","lang":"en","publishedDate":"2023-07-13","publishedPlatform":"OTHER","rating":5,"text":"We had the most magical time at the Gansevort Hotel.  We especially appreciated Lauren Nordstrom who was so efficient, thoughtful, personable and a real asset to the hotel management.  Raul and Mike at the front desk were so helpful in making sure we had everything we needed. The rooms are beautiful and the atmosphere is so welcoming! We would return in a heartbeat.  ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"The perfect visit","lang":"en","publishedDate":"2023-07-12","publishedPlatform":"OTHER","rating":5,"text":"We loved staying here!  The staff, including Mike at the desk and Raul-the bellman, were extremely nice, helpful and went the extra mile to make our visit magical.  The rooms were super clean, modern and were very comfortable.  We all slept later than we usually do in this comfortable setting.  The rooftop was beautiful and a great place to see so many different places in the city.  \nWe will absolutely be visiting again and will only stay at the Gansevort!","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Marcel deserves a tip!  He was very helpful.","lang":"en","publishedDate":"2023-07-07","publishedPlatform":"OTHER","rating":5,"text":"Love this hotel. Marcel was very helpful with my luggage when checking out and I didn’t have cash for a tip so I’d like him to be recognized by the establishment. Thank you!  All other service was also great but I had cash the entire time for tips except upon checkout.  I was also able to secure a late checkout. I stayed in a one bedroom suite which was also wonderful. Highly recommend the hotel. Only suggestion is the rooftop club shouldn’t close at midnight. It should stay open until 2AM which really means 1:30.  I couldn’t get upstairs at 11:30 last night for an after dinner drink and to enjoy the night view.  Overall, thumbs up and highly recommend the hotel. Ps: don’t forget to reward Marcel. Thanks again. ","travelDate":"2023-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"The Gansevoort is Great!","lang":"en","publishedDate":"2023-07-07","publishedPlatform":"OTHER","rating":5,"text":"We loved staying at the Gansevoort Hotel in the Meatpacking District.  Our rooms were clean and stylish and very comfortable.  The views were fantastic! And the service was great - they still have turndown service which most other hotels seem to have forgotten.  Great shopping and restaurants in the area, as well.  We will definitely be back!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Disappointing and dingy","lang":"en","publishedDate":"2023-06-25","publishedPlatform":"MOBILE","rating":2,"text":"Me and my partner booked one night at the Gansevoort for Pride weekend. We were expecting a swanky NY hotel, that i've often passed in the streets, or heard of people staying at, and it looks beautiful. The room was $685 for one night, a lot of money but we expected a lot too. I know this isn't a four seasons, but i expected a really nice experience.\nUpon check in we asked if we could get a lower floor room because my partner has a fear of heights and elevators.\nThey couldn't accommodate and the 9th floor was the lowest room they had. We got into the elevators, which frankly appeared like freight elevators, their state looked extremely poor and dingy. OK.\n\nWhen we got to our room, our key card folder said to just use \"OK Google\" because there's a smart nest thermostat in it. Well, sorry to spoil the story but there was no Google Nest. We had an old off brand thermostat. The room had messy caulk all over the molding and ceiling and floor. The aesthetic I guess they are going for is white and black, so for example white door, black handle. Well the black on the black handle had been shredded off so it looked like faded black into silver. Kind of like how you would imagine a hostel in Central Europe perhaps. There was a puddle of water in the bathroom next to the bathtub when we arrived, and a weird stain on the bed that we didn't realize until we laid down to go to sleep at 2 in the morning. No fridge in the room, but two cardboard boxed warm waters with \"$8\" on each of them. The toilet seat was black (remember the aesthetic) but looked like it was from an old apartment building and not in a good way. There was dirt and possibly mold in the corners of the bathroom.\n\nAfter waking up in the morning we called room service to order 4 hot coffees to the room, and they said the wait would be over an hour (?). So I got dressed and headed down to the restaurant to get them to bring up, and they (l'm not kidding) cost $32 for 4 160Z coffees. The coffee was fine. The woman at the restaurant was very nice.\n\nAll of this to say, I paid $650-$680? something like that for this room and I expected quite a lot. If this was a Marriott courtyard or a hotel in the $300-400 area I wouldn't be complaining about this at all. But if the Ritz Carlton and Four Seasons were $985 for the same night, that $300 difference should add up to more than just a basic room with out the amenities even promised on the hotel keycard folder.\n\nIf you're looking for a really nice hotel in NYC, I would honestly suggest looking elsewhere","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Birthday!","lang":"en","publishedDate":"2023-06-20","publishedPlatform":"OTHER","rating":5,"text":"I had an amazing time  for my birthday, the staff was nice , accommodating , professional. That made we sure we had everything that we needed ! Thanks ,Gabriella for making my party amazing and fun !!!! ","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"Gabriella at Concierge is reason enough to come here!","lang":"en","publishedDate":"2023-06-11","publishedPlatform":"OTHER","rating":5,"text":"Gabriella Hurst (Concierge) is an absolute rockstar!  We had a family member celebrating a milestone birthday at the hotel and she expertly guided us on how to source balloons and treats to be delivered to the hotel and then she took the time and care to display them in the guest's room and take a picture for us.  She made the entire process seamless and easy for us, without pushing us to buy from the hotel's offering.  I can't say enough about how wonderful and attentive she was.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Surprisingly Pleasant","lang":"en","publishedDate":"2023-06-03","publishedPlatform":"MOBILE","rating":5,"text":"Loved the hotel- amazing rooms, great views, excellent location, nice food options.\n\nWas surprised by how well done the rooms were done- wood floors, clean design and functional.\n\nHaving lived in that hood, I was expecting a bad party crowd but found it charming and welcoming.","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Nice to try once. Will go back to other hotels","lang":"en","publishedDate":"2023-05-27","publishedPlatform":"OTHER","rating":3,"text":"Good: location, easy walking distance to restaurants, West Village, Greenwich Village, High Line, room w\/ a view of World Trade Center, bathroom w\/ a tub (tub seems rare in NYC), sound sleep (didn't hear horn honks), rooftop pool with a view, gym, exclusive feel, robes, slippers for the mostly hard surface flooring.\n\nNot so good: One chair in the room for the desk. One chair for two people w\/ a queen bed, so the other must sit on the bed. I want to start the day off with coffee or tea. No coffee or tea in the room or the lobby in the morning when I was in the lobby before 7:30 am. Front desk workers said both nights when I was there coffee would be available in the lobby next morning, but was not. I would have been charged extra on top of the $700\/night for a coffee maker to be brought to the room and charged $2 a pod. Gee, thanks. I was told by front desk worker I could walk to a Starbucks for coffee. Instead I walked about 10 minutes to an upscale grocer w\/ a self-serve coffee bar that charged me only $2.50 w\/ condiments included. Still, I would have much rather preferred the comfort and privacy of sipping coffee in my room while getting dressed for the day than wandering the neighborhood for a basic hospitality beverage, and it was raining. No clock or radio in the room. Did not use the yoga mirror. Marshall speaker is a nice vibe touch, but it didn't power on and we didn't have a compatible cord to plug in our phones. \n\nIf you want to hang out at the rooftop or need to be in this neighborhood, then this is a good hotel. If you want the comforts of home away from home, with elegance, there are other hotels at better price points. ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Hotel bien situé et branché pour un séjour merveilleux","lang":"fr","publishedDate":"2023-05-02","publishedPlatform":"OTHER","rating":5,"text":"Nous avons passé 4 nuits  , mère\/fille dans une twin spacieuse avec une literie très confortable. Le service est chaleureux et efficace , le roof-top pour un cocktail et\/ou dîner fantastique , le café sur la rue sympa et bon. Situation remarquable , près de Chelsea et Greenwich, face au Chelsea Market , entouré de restaurants , cafés , et belles boutiques. Un séjour enchanteur , ce sera notre hôtel à chaque visite dans la grosse pomme!","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Our new favorite hotel in NYC!","lang":"en","publishedDate":"2023-04-30","publishedPlatform":"OTHER","rating":5,"text":"This hotel has been upgraded majorly since the renovation. Our rooms were large, very clean and super chic. Just perfect. SPECIAL SHOUTOUT TO GABRIELLA IN GUEST SERVICES WHO IS AN ABSOLUTE ANGEL AND HELPED PUT THE CHERRY ON TOP OF OUR STAY WITH A WONDERFUL LAST MINUTE RESERVATION. She is the best!!","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Gabriella Hurst is the GOAT!","lang":"en","publishedDate":"2023-04-27","publishedPlatform":"OTHER","rating":5,"text":"Gabriella Hurst is my favorite team member to work with at the Gansevoort! She is so super awesome: friendly, warm, effective, and helpful. It's a pleasure to talk to her anytime I am arranging a visit on my behalf of my boss!","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Gansevoort: A must stay","lang":"en","publishedDate":"2023-04-22","publishedPlatform":"OTHER","rating":5,"text":"The Gansevoort is a must stay. The experience as a whole is wonderful. Also, the rooftop is absolutely stunning with great views of the city. The Chester is a great spot for a night cap. A huge shoutout to the director of the front office Lauren for making our trip special, and Denzel, Jason, and Marcel for also being extremely helpful.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Hotel located in a busy area - room a bit too loud for me","lang":"en","publishedDate":"2023-04-19","publishedPlatform":"OTHER","rating":3,"text":"For the price ($700 per night) I was disappointed that my room was so loud and the service in the hotel lobby restaurant was poor.  We waited 30 minutes before anyone took our order.  While I was waiting a large cockroach crawled past me. I personally would not go here again, very pricey for what you get.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Great location but terrible service!","lang":"en","publishedDate":"2023-04-13","publishedPlatform":"MOBILE","rating":2,"text":"Nice location in the heart of the meatpacking district and ok rooms. More of a family hotel then for couples or business travelers. However the service from the staff was terrible - well below what you should expect at this price range. Can’t recommend it unfortunately.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":287626,"title":"The Gansevoort is a GEM in the heart of Chelsea!!!","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":5,"text":"Beautifully decorated! The staff is extremely friendly and helpful. Our room was clean, and the housekeeping was completely flexible with our schedule without question as we had several morning zoom meetings! The restaurant in the lobby was delicious with a great selection, and it had great healthy options as well.  It's located steps from the Starbucks roastery, Chelsea Market, and shopping! Such a fabulous NYC experience!","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"How to make a guest feel like THE MOST SPECIAL GUEST :))","lang":"en","publishedDate":"2023-04-05","publishedPlatform":"OTHER","rating":5,"text":"First - Gabriella is a dream! I miss her! My 11 year old son and I were visiting for spring break. I used to live in NYC and it was meaningful for me to bring my son there at an age where he can start to really absorb it. Not only did the staff at Gansevoort staff always treat us as if we were the only guests :)) and the most special, which feels so good! But when our flight was cancelled on our checkout day, they made it feel like no big deal to make new reservations for us and Gabriella very personally reached, so we knew if there were any more flight issues that she would make sure we were taken care of. It was such a special experience and we're so grateful to Gabriella and the entire staff. What a group. We can't wait to go back! ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"My stay at the Gansevoort","lang":"en","publishedDate":"2023-03-23","publishedPlatform":"OTHER","rating":5,"text":"The Gansevoort is a great place to rest and recharge on a business trip.  The staff was friendly and exceptionally helpful throughout my stay.  After my trip I needed some additional help and when I called Gabriella Hurst answered the phone.  She is an absolute ray of sunshine, bursting with positivity and energy even on an 8am call and a bonafide asset to the hotel.  I thought I was talking to an old friend. Thank you Gansevoort and Gabriella for making my stay and after interaction so pleasant.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Dinner and drinks with a view to match","lang":"en","publishedDate":"2023-03-23","publishedPlatform":"OTHER","rating":5,"text":"My company took our distributers to a dinner at the Gansevoort Rooftop. Our experience was flawless. Gabriella and Lisa made this dinner easy and made sure our group had an amazing time. Both of these ladies went above and beyond what was expected and I recommend the rooftop to everyone looking for a beautiful night in the meatpacking district. 10 out of 10","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"A Seriously Swanky Hotel.","lang":"en","publishedDate":"2023-03-19","publishedPlatform":"OTHER","rating":4,"text":"The Gansevoort  Meatpacking NYC is in the heart of the vibrant, cobblestone Meatpacking Packing District, one of the coolest places in the Big Apple.  With popular attractions such as the Whitney, the Highline and designer shopping just blocks away, it was ideal for my NYC exploring. The hotels brushes it's stylish innards  with modern decor and tantalizing art (even an original Banksy is installed).\n\nI was impressed with my Deluxe Room outfitted with high ceilings, large windows and sophisticated colour scheme. It featured an array of high-tech room appliances and great selection of in-room services, a fitness mirror and a desk. Bath was marbleized with stainless sinks and all the usual accoutrements.\n \nThe Gansevoort encases a fleet of dining and drinking venues. The Chester is a classic American bistro & bar that is open breakfast, lunch and dinner and serves food fare from avocado toast to nifty burgers. Gansevoort Rooftop is an escape oasis serving inventive cocktails and Mediterranean food. Saishin,  also located on the rooftop, is the place that caters to sushi lovers (not my cup of tea). Coffee + Cocktails, is an establishment with a European vibe and a reputation for its French Toast. A great way to start and finish the day; with a sensational  coffee and a comforting cocktail. There is a mid-sized gym and a popular heated  rooftop pool opened all year round.\n\nSo, if you are looking for accommodations in a prime location near the art galleries of Chelsea, smart boutiques of the Meatpacking Area and the brasserie styled restaurants of West Village...........then try the.....Gansevoort .......A Seriously Swanky Hotel. \n\n","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":287626,"title":"A great location but don’t expect too much","lang":"en","publishedDate":"2023-03-13","publishedPlatform":"MOBILE","rating":4,"text":"A nice hotel with a great location. Are you an experienced traveller your expectations shouldn’t be too high though. Nevertheless, all services provided are being conducted in a good manner but internationally compared they are average.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":287626,"title":"Loud and Proud","lang":"en","publishedDate":"2023-03-05","publishedPlatform":"MOBILE","rating":3,"text":"Nice location and the view of the Hudson River was good from the higher level room. The lobby has one couch and is small so meeting or waiting on friends inside the lobby is almost impossible- not great when it’s cold and raining outside. The average rating is due to the auto honking and sirens that seem to last deep into the night. I have stayed in NY many times and understand that there will always be street noise but this place was the loudest I have ever stayed in. For $600 per night plus a mandatory facility fee I expected more.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Great location, service","lang":"en","publishedDate":"2023-03-01","publishedPlatform":"MOBILE","rating":5,"text":"Travelled with my daughter, and some friends to a weekend getaway. Even when cold the kids loved swimming in roof top pool. Great service both at entrance as well as rooftop. Room was nice and beds comfortable.","travelDate":"2023-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Top notch friendly service! Great drinks and atmosphere!","lang":"en","publishedDate":"2023-02-26","publishedPlatform":"OTHER","rating":5,"text":"Had a wonderful first date experience with drinks, some eats, and desserts. Nino and Gina were top notch pros and handled our special request with grace and efficiency. \n\nAlso I had forgotten a copy of the receipt and has an incredible conversation with Gabriella Husrt. \n\nI’ll definitely be back soon! \n\nThank you all for a magical evening. \n\nI also hope to bring you film\/tv\/commercial\/photo shoots and other events if you can accommodate them!","travelDate":"2023-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"No focus on guest experience.","lang":"en","publishedDate":"2023-02-22","publishedPlatform":"MOBILE","rating":2,"text":"Great location and nice hotel, yet unfortunately very poor management. With no warning or care for the guest the management of the hotel had construction work start at 7am. Saws, drills and hammers. A total disregard for what it means to serve guest in the hospitality business. When contacting the front desk the only offer was an apology, no effort to stop the early morning disruption. With an upgrade to professional management this would be a great hotel.","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"HOME AWAY FROM HOME","lang":"en","publishedDate":"2023-02-16","publishedPlatform":"OTHER","rating":5,"text":"I stayed at The Gansevoort for over a week, during Fashion Week for business, and it felt like my home away from home. All of the staff were extremely helpful, kind, and proactive. They took great care of me in so many ways, modifying room service due to allergies and preferences, the house-keeping was always timely and precise, the service team (John Ross and Marcel) were always at the door greeting me with a smile and asking how my day was. The team assisted with on site events, couriers, packages, and made my life so much easier during such a busy time. I felt safe, seen and cared for every single day. A huge shout out to Gabriella and Tamara (guest services), Cristobal (F&B), Natalie (Marketing), Anton (GM), and every single front desk associate. I will be back to New York soon, and you can bet I will be staying at The Gansevoort again. ","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Stayed one night to go to Hopper Exhibit at the Whitney","lang":"en","publishedDate":"2023-02-04","publishedPlatform":"OTHER","rating":5,"text":"What a great hotel and location.  The Queen Room was great - loved the window overlooking the city with the electric shade.  Bed was comfortable and the room was clean and inviting.  The staff could not have been nicer.  We had a drink in the bar and breakfast in the small area downstairs.  My husband and I recommend this as a great place to say.  Within walking distance of lots of restaurants, shops and the Whitney.","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Gabriella is great!!!","lang":"en","publishedDate":"2023-02-02","publishedPlatform":"OTHER","rating":5,"text":"Gabriella Hurst is wonderful!!! She is a pleasure to speak with and helped book our dinner reservation with ease - very lovely and we are so thankful for her help. The Gansevoort is one of our favorite hotels in the city!!","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"MLK Day Sunday night getaway in the City turned out to be a pleasure. ","lang":"en","publishedDate":"2023-01-18","publishedPlatform":"MOBILE","rating":5,"text":"We truly enjoyed our time here. We had only one night because of our other schedules but it was great because it's located in a neighborhood full of restaurants and boutique-y stores plus The Whitney is a short walk down the street. The hotel itself has nice, comfortable rooms and is staffed by nice, accommodating people who were attentive to our every need.  Because it's located in a bustling part of the city parking can be tough but the hotel offers a reasonably priced valet service. In winter the prices are remarkably fair for a Manhattan hotel. ","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":287626,"title":"A wonderful NYC stay!","lang":"en","publishedDate":"2023-01-14","publishedPlatform":"OTHER","rating":5,"text":"First time in NY since before COVID and the Gansevoort was a perfect hotel to reignite our love for NYC.  The location is wonderful - right near the Whitney.  The room was beautiful, quiet and large (for NYC) with an expansive view of the Meatpacking district and the river.  We were on the 9th floor - it was quiet and peaceful.  The hotel is welcoming and beautifully maintained.  I asked for a coffee machine in the room, and there it was!  All staff were smiling and friendly.  This was an exceptional hotel experience and I look forward to returning.  ","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Loved our Gansevoorting stay!","lang":"en","publishedDate":"2023-01-10","publishedPlatform":"OTHER","rating":5,"text":"Over the years, we've stayed at many different hotels throughout Manhattan, whether for business or pleasure. The Gansevoort Meatpacking is our favorite one for reasons too numerous to list. In a few words, great location and impeccable service. The room was large, clean and comfortable, which isn't always the case when staying in the city. \nThe staff was welcoming, resourceful, pleasant and efficient. We also appreciated the help we got from Lauren during our stay.\nAs Arnold once said, ''I'll be back''!","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Amazing Service","lang":"en","publishedDate":"2023-01-02","publishedPlatform":"OTHER","rating":5,"text":"I booked the day before a stay and when I arrived (after check in time) the room type I booked was not available, but the hotel was unable to change my room tier in the system for some reason. Marisela Torres and Nicole were absolutely amazing, and were so concerned that I had to wait over an hour for a room to be ready for me. They ended up upgrading me because I had to wait so long, and were absolutely so kind about it. The room was lovely and the staff was so kind over the course of my stay because they were so sorry about the issues with the booking. Marisela was incredibly kind and took the time to make sure every moment and aspect of my stay was perfect, she was amazing!","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Favorite Hotel","lang":"en","publishedDate":"2023-01-01","publishedPlatform":"OTHER","rating":5,"text":"Our go to hotel every time we stay in the city! John Dzakpa, the bellman is so helpful & respectful. He truly goes the extra mile and makes our stay amazing every time we come. Can’t recommend this hotel and him enough!","travelDate":"2023-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"Great Layout and Service!","lang":"en","publishedDate":"2022-12-21","publishedPlatform":"OTHER","rating":5,"text":"Absolutely amazing Hotel! The beds and pillows are excellent. The room had a separate desk and sitting area with a door between that and bedroom with 2 separate HVAC units so you can regulate the room temperatures better. It also had a separate powder room which is great when staying with more than 1 person. The room was always clean, items refreshed each day and lots of drinking water! Loved this hotel. Will come again.","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":287626,"title":"The only positive about this hotel is the location ","lang":"en","publishedDate":"2022-12-12","publishedPlatform":"OTHER","rating":1,"text":"I will start with the one positive and that is the location, this hotel is in a good location with walking distance to lots of nice restaurants and sights but that is the only thing going for it.\n\nI am staggered how poor the customer service was at this hotel.  On arrival after a long haul flight from London I was told the room which I had written confirmation (double checked pre arrival) and verbal confirmation as I called ahead to confirm as well, was not the room I was getting and there was nothing that could be done as the hotel was fully booked.  The worst part was not even that this was the case despite all efforts to confirm a room with 2 beds one each for my friend and I but that the girl checking us in told me I had was the one who misunderstood and that was not my booking despite showing her the written confirmation.  She had the attitude of a spoilt teenager who did not want to be there, not the front of house one would expect of such hotel.  Finally we got to speak to a manager who could also do nothing but was marginally more polite than the first girl with the attude, we were given a free drink voucher in the bar whilst they out a fold out bed in our room.\n\nThis hotel has zero sound proofing, great if you are out until 4am every night, if you are not and you don't wish to listen to every single noise on the street I would look for another hotel with adequate noise proofing.\n\nThe rooftop bar is overrated, something close to a store cafe would be a better assessment.  The front of house again was poor, no consideration for guests v anyone who walks off the street and just told to sit whereever and go to the bar to get yourself a drink.\n\nI can honestly say I would never stay at this hotel again.","travelDate":"2022-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"Wonderful Experience","lang":"en","publishedDate":"2022-12-12","publishedPlatform":"OTHER","rating":5,"text":"Visiting NYC for the shows and sightseeing with my daughter, and we had an amazing experience at the Gansevoot.  From the accessibility by car, the views from the balcony, to the courteous and helpful staff, we were made to feel special as soon as we drove up. First impressions go a along way- and our first  was with the warmhearted Bellman John Dzakpa.  He immediately made us feel welcome, so genuine and sincere. My 13 year old daughter even acknowledged  \"how nice they are here\" The receptionist, and bar staff were also helpful, offering recommendations for local dining. The room was impeccable . But what stood out the most was the staff, with a special shout out to John, who felt like a friend by the time we left. Would definitely go back","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"My preferred go-to hotel in NYC","lang":"en","publishedDate":"2022-12-09","publishedPlatform":"OTHER","rating":5,"text":"I stay at this hotel OFTEN - my office is located nearby -and this is one of the best locations in NYC.\n\nWhat I'll also call out -- mannnny hotel rooms in NYC are teeny tiny (look at square ft before you book) -- but Gansevoort Meatpacking has tons of rooms that are pretty large.\n\nI also have to call out one of the staff here who is a BREATHE of fresh air-- Gabriella. She is warm, helpful, full of the best energy. I actually look forward to when I have the pleasure of engaging with her. ","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":287626,"title":"My fav hotel in nyc","lang":"en","publishedDate":"2022-12-05","publishedPlatform":"OTHER","rating":5,"text":"I visit New York several times a year and I have stayed at a bunch of different hotels over the years. But in November I came to New York on business and John Ross was so kind and so helpful at the Gansevoort that I decided to come back to the Gansevoort with my whole family. John Ross was working again when we came back over Thanksgiving week and he was super kind with my whole family. We love the location of the hotel and the rooms are super comfortable. I also like the views and the general vibe of the place. \n\nIf the Gansevoort management team is reading this please give John Ross a nice bonus for a job well done! We will be coming back many many times and I’ve already referred several friends to your hotel.","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":6,"locationId":287626,"title":"Pure Pomp.  Smoke and Mirrors.  ","lang":"en","publishedDate":"2022-11-25","publishedPlatform":"OTHER","rating":1,"text":"For the Ratchet; By the Ratchet.\n\nThe following is the email I sent to the General Manager.  For which I never received a reply.  I removed the names of employees.\n\nGood Morning General Manager, \n\nI've not had the moment to write you back as I've been quite busy.  I was married on the fifth and was entertaining family who flew in for the wedding.  \n\nI cannot begin to tell you how disappointing our stay at the Gansevoort was.  Aside from the deplorable state of room 1005, which had clearly not been properly cleaned for weeks; the overall experience of the stay left me wishing I'd never booked with you.  The only reason we did not depart to another property was that we were getting married.  Too many moving pieces for a move like that on such short notice.  And proximity to the wedding venue was of great concern.  \n\nAside from the state of the room I was very curtly informed upon arrival that the early checkin I'd been assured I had by your reservationist, was not available.  I told the woman working the desk that I had been promised an early check in when I'd called a week earlier.  She simply said that early check-in is not a guarantee and only a request.  No apology, no concern.  It was my problem.  This was the first of several charming exchanges I had with a Ms.  X as she is referred on my invoices.\n  \nIf I had been aware of that early check-in policy I would not have adjusted my travel Itenerary to be at the hotel early.  As you might imagine the hours and days immediately before getting married are quite valuable.  I would have used that time more efficiently than showing up for a room which was not ready.  And the less I spoke to your employees the better the stay would have been.\n\nThe approach Ms. X employs in her communicating with guests can be found over and over at your property.  The young lady who works the evening desk shift seems genuinely annoyed by my approaching her.  The only woman who works the door is also extremely annoyed about having to do her job.  The general sense I get from the woman working the door is disdain.  Interrupted only by the occasional rolling of her eyes.  It's as though someone forces her to go to that job every day.  And then doesn't pay her.  \n\nMy hospitality experience is extensive.  I've been in the industry for twenty two years.  Most of them in Manhattan.  I ran venue's X and X; amongst others.  It's as though your staff is under the impression that the name Gansevoort does the actual work for them.  They've collectively gotten their feet under the dinner table and now they get to relax.  And whatever problems arise are those of the guests.  \n\nI'm sure you have many guests who buy into the lure of Gansevoort.  I'm not one of them.  I'm not paying for a name.  I want the actual experience.  And the experience was an embarrassment.  Especially for the price we paid.  I'm not the person who wants to speak with the manager.  I'm not the person who calls out employees.  But this was outrageous.\n\nI'm really an easy going customer.  But not at $685.00 - $745.00 a night.  And I realize that with the money we spent we are still likely on the low end of money spent by your clientele.  But if this is as good as it gets for spending $5200.00 +\/- in your hotel than you should should make that information public.  So people know what they are actually going to get before they commit. \n\nYour bellhops and valet were good.  Genuine guys.  Actually looking to do their job without seeming incovieninced.   But that's it.\n\nGenuinely wishing we'd spent our money elsewhere,","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Fabulous boutique hotel, surprisingly family-friendly","lang":"en","publishedDate":"2022-11-16","publishedPlatform":"OTHER","rating":5,"text":"The hotel's location is extraordinary, walkable to countless wonderful experiences- the Whitney museum, the Highline, The Little Island, the heart of the West Village. Location really makes it stand out, but the staff goes above and beyond and the hotel itself is chic, super comfortable, really clean and overall wonderful. We ate at the lovely lobby bar\/restaurant upon arrival and also at the larger Chester restaurant. Both were fresh and delicious. The weekend we were there was cold and it was so nice to be inside and cosy at Chester, but with the large windows you feel like you are outside. I cannot recommend this hotel enough. We went with our small children and the hotel accommodated us with connecting rooms and were so gracious to our young\/rambunctious boys.  It was nice to pop up to the roof bar or the cosy lobby bar once the kids were down! Even though there is a super cool roof bar and the city is all around you, you do not hear a thing in your rooms. Overall a wonderful experience, highly recommended! ","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Amazing Customer Service","lang":"en","publishedDate":"2022-11-14","publishedPlatform":"OTHER","rating":5,"text":"A large group of us stayed at the Gansevoort for a big event in October and had the best time. Almost a month later I realized that I had ordered clothes and had them shipped to the hotel instead of my home address in California. I was panicked because these clothes were important and I needed them by the end of the week. I called the hotel and was directed to Gabriella to help me with this. I gave her all my information and she found the package and had it overnighted to me within an hour. This type of service is why this will be the only hotel I stay at in New York City. Thanks to the amazing team at the hotel who made this all possible.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Best Pannecotta I have ever had","lang":"en","publishedDate":"2022-11-12","publishedPlatform":"MOBILE","rating":5,"text":"Excellent restaurant, amazing cocktails and lovely food. So glad we stopped off here, can highly recommend.\nI had the Cinema Paradiso cocktail with a burger. The cocktail had a whipped egg yolk topping, reminiscent of a snowball but very tasty. Burger was cooked to perfection and really tasty.","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Great Customer Service","lang":"en","publishedDate":"2022-11-07","publishedPlatform":"OTHER","rating":5,"text":"I stayed at this hotel for a business trip, but decided to extend my stay to visit friends in the city. Marisela T. checked me in and was kind, welcoming, and accommodating. I really appreciated her help.","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"GUEST RELATIONS COORDINATOR","lang":"en","publishedDate":"2022-11-06","publishedPlatform":"OTHER","rating":5,"text":"Friends stayed at the GANSEVOORT MEATPACKING and i wanted to send some items to surprise them. I was lucky enough to get GABRIELLA HURST on the phone. She went above and beyond to achieve what I wanted. She sent me pictures and video so I can see how everything turned out. I was very appreciated for all that she did. She has a great attitude and is super personable. Thank you for all you did. ","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":287626,"title":"Terrible, negligent staff experience","lang":"en","publishedDate":"2022-10-18","publishedPlatform":"OTHER","rating":1,"text":"While a guest at the Gansevoort, I asked the front desk to schedule a Fedex pick up for 2 prepaid, ready-to-ship packages I needed sent. They assured me they could handle the pick up and I left them with the concierge and checked out. Unfortunately, my boxes were never shipped, my tracking shows the packages were never picked up.\n\nI am absolutely devastated because those packages carried perishable, invaluable contents: while traveling for work, I overnight pumped breast milk back to my infant at home. It's literally the only thing that allows me to travel for work while nursing. Any fellow traveling moms out there know that every feed is priceless and I lost about 4 days worth of milk to the Gansevoort.\n\nIf there was any issue with the package I expected them to contact me but no one ever did. Wondering if the concierge just didn't want to deal with it and tossed it? Pretty unforgivable.\n\nI just called the hotel to let them know what happened and the person talking to me seemed more concerned with finding out who did it than anything. I don't want any money, what I lost was irreplaceable, I just want them to retrain staff to be honest or empathetic to guests so no one goes through the same thing I did.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":287626,"title":"Avoid this hotel","lang":"en","publishedDate":"2022-10-13","publishedPlatform":"MOBILE","rating":1,"text":"We left the hotel after one night!! \nBig No! \nOne of the most basic poor hotel we’ve ever been. \nIt began with the unpleasant and inpatient front desk welcoming. We had problems with the credit card and the lady from the front desk team gave us a very unpleasant feeling. We and our family have suffered a real stress. Of course that after we spoke with visa everything was ok but the bad feeling and trauma that they gave us is something we will never forget. \nAfter we received the room we discovered that they sold us a second room that was not necessary just to double the price!!\nThere heat in the room didn’t work even after we switched rooms. It was very cold. \nThe breakfast was not good. \nIt took too long until we received the refund.   They really charged us instead of holding the money. \nThey also wanted to charge us for orthopaedic pillows. \nRidiculous. \nYou pay for a room with a balcony but they don’t let you smoke there and you have to sign when you arrive that it will cost 500$. That’s not acceptable when they even didn’t let me smoke outside the hotel on the sidewalk !!\nThey ruined our trip to New York. \nExcept Gabriella the concierge that was great, everything went wrong. Everything!\nThis is definitely not a 5 stars hotel. \nNever come back again.","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Great staff made a great stay","lang":"en","publishedDate":"2022-10-12","publishedPlatform":"OTHER","rating":5,"text":"Thanks so much to the Gansevoort team who made our team's stay terrific.  Particularly thank you to John Ross,  who anticipated our needs with a lot of kindness and grace (umbrellas, got luggage into my car without us asking and had my car out-front on time). And thank you to the staff in the restaurant for knowing our coffee preferences on day 2.  The team clearly has a good vibe and sense of purpose in their work, and creates moments that matter.  TY!","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Great Hospitality! Perfect location!","lang":"en","publishedDate":"2022-10-04","publishedPlatform":"OTHER","rating":5,"text":"Our accommodations were spectacular!  The entire staff at the Gansevoort were friendly, helpful and knowledgeable.  My contact, Gabriella, went above and beyond to unsure the family had all their reservations booked and confirmed.  She was so helpful and patient with all my changes!","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Fantastic staff, wonderful views","lang":"en","publishedDate":"2022-10-04","publishedPlatform":"OTHER","rating":4,"text":"We had pre-anniversary dinner drinks at the rooftop bar.  We were warmly welcomed and got a lovely table with fantastic views. I love cocktails, but am not a fan of masses of ice, but the bar staff were very accommodating and put minimum ice in for me. This was in great contrast to the previous evening, where the bar that we were in, refused to serve me a cocktail without ice. Thank you Gansevoort for your excellent hospitality","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"NYC getaway","lang":"en","publishedDate":"2022-10-02","publishedPlatform":"OTHER","rating":5,"text":"We have found our NYC home. I used to live in the city, and we love to come out ourselves and with our kids. We’ve stayed in other hotels near Union Square - great hotels - but this was hands down our best trip. The location is just beyond perfect. We spend most of our trip in this area and while it’s close to Union Square, walking out the door and being steps from everything including the Hudson River Parks is just beyond perfect. The view from our room was stunning. If we didn’t love wandering the city so much, we could have just sat on the couch staring out the window. We cannot wait to bring our kids back to this spot. Room was great, staff was very friendly. We loved it and cannot wait to come back!","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"GREAT HOTEL IN NYC","lang":"en","publishedDate":"2022-09-29","publishedPlatform":"OTHER","rating":5,"text":"This hotel had a great staff and very professional, and let me check out late.\nThe rooms were cleaned everyday, and the location was great with balconies located in the room.I would highly recommend this hotel for any business travelers,\nor anyone that is thinking about staying in NYC.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Perfect location, amazing concierge","lang":"en","publishedDate":"2022-09-28","publishedPlatform":"MOBILE","rating":5,"text":"The hotel was situated in the perfect location for our staycation with wonderful amenities—even though it was chilly, the rooftop pool was amazing. But our trip wouldn’t have been as special without help from the wonderful Gabriella who recommended a dining itinerary that was perfect for us. She made special arrangements for us to snag hard to get reservations and picked the perfect times for us to visit the pool. She even checked on us to make sure our stay was perfect. Highly recommend !","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Deeply Enjoyable Stay","lang":"en","publishedDate":"2022-09-19","publishedPlatform":"OTHER","rating":4,"text":"Gansevoort is a great hotel, the staff are friendly and efficient, the rooms are well appointed, chic and understated.  The beds are amazingly comfortable.  There is very little I could fault.\n\nBUT ... I would love a fresh coffee in my room first thing, there is a great banquette to sit on by the window and watch the world go by outside - but I want a coffee to do that, especially first thing. \n\nSecondly .. the fabled rooftop bar - seems to have let itself go a little.  If im going to pay 25 dollars for a negroni I want one that isnt made with Martini Rosso .. and I dont want the barman to go completely off piste with the ingredients of an Old fashioned either. \n\nWithout these 2 niggles it would have been 5 star all the way.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Fantastic Location","lang":"en","publishedDate":"2022-09-17","publishedPlatform":"OTHER","rating":4,"text":"We stayed for 2 nights en route to London; myself and my 17 year old daughter.  The location is great, right on the Highline, surrounded by nice shops and restaurants.  The staff were all very friendly and helpful.  There is a small gym and the rooms were a decent size for New York, with comfortable beds. I would definitely stay there again and recommend to a friend.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Amazing Customer Service","lang":"en","publishedDate":"2022-09-15","publishedPlatform":"OTHER","rating":5,"text":"I did not pesonally stay at this location but my boss did and I needed to contact the hotel to obtain the invoice\/folio. I spoke to Ms. G. Hurst who was phenomenal. \nThe fact that live person with a friendly voiced picked up after one ring (no automated machine) and was able to help me immediately (no holds, transfers), and made sure I received the email with information I requested left me flabbergasted. Kudos for providing real human interactions and solution-oriented service and particularly thanks to Ms. Hurst who was fun, approachable, helpful, and very polite.\n\nBravo","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":287626,"title":"Unbelievable Location, Fantastic Service, Superb Hotel!!","lang":"en","publishedDate":"2022-09-12","publishedPlatform":"OTHER","rating":5,"text":"As you can see by my reviews I've stayed at countless 5 star hotels nationwide, moving forward when I travel to NYC I'll always be in the West Village, Meatpacking District and I'll be staying at The Gansevoort. I recently returned from a friends 50th birthday in which I booked the Gansevoort, we called ahead on the way from JFK and they allowed me to order room service so our food arrived 15 minutes after checking in because we had to get to MSG to see Billy Joel!! The food was fantastic, service impeccable, the hotel was perfect in every way. Our room 1016 had unbelievable views, a great little balcony and the rooftop pool was a huge added bonus. The location is the BEST in the Meatpacking, Sammy the Manager at The Chester was incredibly accommodating and opened the kitchen to bring my friend a Birthday dessert after Billy Joel! I absolutely loved everything about The Gansevoort and look forward to returning with my wife!!","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Customer Service was excellent!","lang":"en","publishedDate":"2022-09-09","publishedPlatform":"OTHER","rating":5,"text":"Specifically, John Ross was very inviting every time we crossed paths in the hotel. He went above and beyond to make sure to anticipate any needs we had. Our trip to the Gansevoort felt like home because of the excellent customer service. Thank you!","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Me","lang":"en","publishedDate":"2022-09-09","publishedPlatform":"OTHER","rating":5,"text":"The entire staff were accommodating and warm. John Ross is a gem. He greets everyone with a smile and is super attentive to all the guests’ needs. When you’re thinking about what you need to happen next, he already has it in motion assuring you that you can begin relaxing during your stay.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Amazing location","lang":"en","publishedDate":"2022-09-05","publishedPlatform":"MOBILE","rating":5,"text":"Amazing location, very walkable and convenient. Nice rooftop pool area with great views and a mellow, family friendly feel. Staff were friendly and helpful throughout our stay.  Clean and comfortable rooms with nice amenities. Thanks for great service John R!","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"AC very poor","lang":"en","publishedDate":"2022-08-27","publishedPlatform":"MOBILE","rating":3,"text":"Fairly hot in nyc right now. Our AC is terrible in our room. If you don’t move it’s livable but taking a shower and getting ready is pretty awful. It feels really muggy and stale. I have asked the front desk 3 times for the engineer to fix it but there is no indication anybody has even come to the room. Certainly no follow up from he front desk. Just unimpressive for what this room costs per night.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Dissapointing","lang":"en","publishedDate":"2022-08-24","publishedPlatform":"OTHER","rating":3,"text":"Location is excellent, however I did not get one sleep at this hotel due to the noise.\n\nThere was an awful noise throughout the night and also a lot of slamming of doors that could be heard.\n\nReally disapointed","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Really good hotel in a superb part of town","lang":"en","publishedDate":"2022-08-19","publishedPlatform":"OTHER","rating":5,"text":"This hotel is loacted brilliantly in the artsy, hip and funky part of Manhattan. The hotel itself provides good service. Shout out to Nicole on reception and extra special thanks to John Dzakpa on the door - always a great welcome from him and such a lovely guy.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":1,"locationId":287626,"title":"3.5 Stars","lang":"en","publishedDate":"2022-08-15","publishedPlatform":"MOBILE","rating":3,"text":"3.5 Stars\n\nStaycation at the Gansevoort. \n\nThe good: nice room with decent space for New York City. Comfortable bed. Decent bathroom. Great area - can walk around to plenty of restaurants, bars, shopping, etc. Has a rooftop pool, bar, and restaurant.  Rooftop pool temperature was perfect (I believe it’s  heated). \n\nThe bad: prices. Maybe due to inflation, but the prices, even for New York City rooftops, seemed a little steep. \n\nMore bad: the pool. Seating is limited. Pool can get packed on a Saturday, including families with young children. Essentially have to sit on the floor on the side of the pool and run to her a seat when someone gets up and leaves. Seating is also that - actually seating. Only 2-3 lounges chairs. Everything else is a chair or couch. Can get food and drink poolside, but during peak weekend hours, it can take some time.  \n\nPool was great for people watching, though. \n\nOverall, if you don’t expect a nice, quiet relaxing time at the pool, it’s decent. Maybe better during the week.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Top notch hotel in a very safe part of New York that is convenient to so many different neighborhoods.","lang":"en","publishedDate":"2022-08-14","publishedPlatform":"MOBILE","rating":5,"text":"This was a beautiful hotel in a terrific part of New York City. It was surprising to me because the last time I was in New York the meatpacking district was very quiet with nothing but meatpacking going on. Now it is a place with so much energy, great restaurants, nice shopping and right next to the Highline. The hotel is gorgeous with beautiful views of the river. We stayed in a king room and it was very large with a pull out sofa, a very comfortable king size bed. The towels were really plush and the bathrooms were also very plush.There was more than ample room especially for a New York hotel. Also there is a lovely pool on the roof which we enjoyed using for our morning lap swim. Everyone at the hotel was lovely and very helpful. The service was terrific and the hotel itself is just beautiful. There is a rooftop restaurant and bar that has amazing views of Manhattan. I feel so spoiled having stayed there that when returning to New York, I don’t think I can stay anywhere else. This is a gem of a hotel in a great location.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Shout out to the staff!","lang":"en","publishedDate":"2022-08-13","publishedPlatform":"OTHER","rating":5,"text":"I discovered two weeks after I checked out that I had left behind a favorite dress. I contacted the hotel and Gabriella H in Guest Services went beyond the call of duty to locate my dress in Lost and Found and send it back to me. She provided the most seamless, expeditious and professional customer service I have ever received in my life. She was so attentive and responsible, what a SUPERSTAR!!!! The fact that the hotel had a process for returning lost items was impressive and the coordination amongst staff to get my dress back to me is much appreciated. Also a special thanks to James in Security for helping with this process. Thank you so much!","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Great hotel!","lang":"en","publishedDate":"2022-08-11","publishedPlatform":"MOBILE","rating":5,"text":"Stayed at this hotel for 3 nights with family (kids 11 and 4), we wouldn’t hesitate to return here. Staff are lovely and helpful, rooms spotless and spacious, rooftop pool was amazing with fantastic views. The location is excellent, close to many restaurants, Chelsea market, and the start of the high line.  Would definitely recommend.","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Great Customer Service!","lang":"en","publishedDate":"2022-08-04","publishedPlatform":"OTHER","rating":5,"text":"I stayed here for 2 weeks recently and had an absolutely amazing time. \nFrom the moment I walked in, I was greeted so kindly by JohnRoss. Every day when I would come in or out of the hotel, he would greet me with the biggest smile and always ask how I was doing, followed up with always offering help. He was very sweet and professional. This treatment made me really enjoy staying here. Which I will be coming back! The cleaning service was wonderful as well. All around, great staff, and LOVED my room, I had a nice view of South Manhattan.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":287626,"title":"The worst experience ever","lang":"en","publishedDate":"2022-08-02","publishedPlatform":"MOBILE","rating":1,"text":"Staying at this hotel was the worst experience we have ever had in NYC (during 20 years). \n\nThe bad experience started already before we even checked into the hotel. We had booked a transportation through the hotel (they tried to raise the price after we had already agreed on it and booked it) from the airport to the hotel with a child seat and reconfirmed the reservation before the arrival. Once we met the driver at the airport, we instantly noticed that the child seat was missing. The real struggle started at that point after an 9hr flight and multiple hours’ time difference, with a baby and a pregnant lady in our party, as when we instantly phoned the hotel and informed them of the situation, they apologised but at the same time said that we need to handle the situation by ourselves. Simultaneously the driver who originally came to pick us up left with his car and we were forced to return back to the terminal to start to fix the situation. Finally, after multiple calls and messages later, the transportation company’s driver went to buy a compatible child seat, returned to the airport after which WE spent almost an hour installing the car seat in the car at a busy pick-up spot. Finally, we arrived at the hotel 4 hours after our flight had landed, and all the while with nobody from the hotel having contacted us or having expressed any concern for our wellbeing or safety. \n\nWhen we arrived at the hotel, we were offered an upgrade on the lowest floor with hotel rooms right above the restaurant next to the elevators (in the original reservation we had asked for a room on high floors away from the elevators). As a result we refused that room and were moved to a suite one floor higher on the fourth floor. In addition we were offered the first night without charge, and instead of any further compensation we requested for, they said that we can leave the hotel earlier than what we had booked it for. So in between the lines, we read that after everything that had happened we are also undesired guests at the hotel.\n\nExcept for all this, the hotel is well located, but there were many issues in the room. For instance a fire alarm going off in our room and only after contacting the front desk we learned that it was probably a false alarm as well as the almost constant smell of weed and loud noise at nights from the surrounding bars in our room. \n\nAt the check out the hotel offered to compensate almost our full stay because of what had happened, but nonetheless, we definitely cannot recommend this place to anyone.","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Valeu muito a pena!","lang":"pt","publishedDate":"2022-08-02","publishedPlatform":"OTHER","rating":5,"text":"Ficamos muito satisfeitos com esse hotel. Em primeiro lugar, a localização: perfeita. É possível tomar café da manhã e jantar cada dia em um local diferente, todos ótimos! Em poucos minutos a pé estamos no Chelsea Market; na Little Island; no High Line; e têm uma Starbucks Reserva excelente bem pertinho. Além disso, os quartos e banheiros são novos e de ótimo tamanho, confortáveis. A equipe do hotel é super simpática e atenciosa; o pessoal do bar muito querido; e tem um Rooftop e uma piscina com uma linda vista e o serviço de camareiras era super rápido e eficiente!. Enfim, valeu muito a pena! Reservamos pelo Booking com antecedência e conseguimos uma boa tarifa.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Great luxury hotel. Perfect location","lang":"en","publishedDate":"2022-07-31","publishedPlatform":"MOBILE","rating":5,"text":"Everything was perfect in this hotel especially the rooftop pool and bar.\nThe rooms are super well equipped\nStaff is very cordial.\nLocation is perfect, with great restaurants around and 2 blocks away from Chelsea Market.\nCons: the drinks and cocktails at the pool bar are $26.00!","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Hôtel surévalué pour le prix. Expérience très décevante","lang":"en","publishedDate":"2022-07-26","publishedPlatform":"MOBILE","rating":1,"text":"The first moments upon arrival are perfect.  The valet, reception staff and especially the boy who took care of our luggage are exceptionally nice, polite and friendly.  The room is just fine for the price… No coffee machine, only one bathrobe and no ice machine in the hotel.  But where the experience is completely spoiled is at the rooftop bar restaurant and at the swimming pool… The staff is pretentious and not welcoming.  No cocktails or non-alcoholic beer and the most insulting thing is that access to the canopy \"the most pleasant and comfortable place in the place\" is reserved for the group of 6 people and more!!!  Seriously???  While most of the rooms are for 2 people???  And that there was no one there the whole time we were there?  In addition, the pool closes at 7 p.m.... So if you come for a day and have to leave early in the morning, that gives you 3 hours to enjoy it because check-in cannot be done before 4 p.m.  And at 4 p.m. it's already full and the guy at the entrance looks at you like you're an alien when you ask him if there's room.  In short, there are many nicer and more welcoming hotels in New York.  Your reputation is overvalued and you will never see me there again.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Great stay at Gansevoort Meatpacking NYC","lang":"en","publishedDate":"2022-07-19","publishedPlatform":"OTHER","rating":5,"text":"Stayed at Gansevoort Meatpacking NYC for a business trip. Perfect. Room was clean and comfortable. Staff was nice, smiling and helpful! \n\nRight beside a ton of great restaurants and not so far from The High Line, Soho, World Trade Center, etc.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Amazing experience","lang":"en","publishedDate":"2022-07-18","publishedPlatform":"OTHER","rating":5,"text":"We stayed 2 nights with our two daughters. We had an amazing time. The beds so comfortable and sheets were so luxurious.  Rooms were spacious and loved all the products- L'occataine. The staff were super and so helpful. Jodie  who served us coffee in the morning and cocktails in the evening was so efficient and friendly. The pool was superb. We could of spent all our time in the hotel, however it is located in such a great neighborhood, within walking distance to bars, restaurants, shopping not to mention little island and the high line. I would highly recommend the cocktails and sushi on the roof top.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"You’ll love it!","lang":"en","publishedDate":"2022-07-15","publishedPlatform":"MOBILE","rating":5,"text":"We booked the Gansevoort way in advance and was not our first stay at this exceptional place!\nIt was our first post-pandemic stay in the US and we got the same outstanding service as before. Special thanks to Gabriella Hurst for her great assisting us to get a hairdresser’s appointment as we were traveling in from Canada by car, this despite poor network coverage (far from easy): Thanks Gabriella!\nThe meatpacking offers a lot of possibilities: Use them, book the restaurants in advance!\nWe’ll be back and it won’t take us 2 Years","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":287626,"title":"Great hotel with pool","lang":"en","publishedDate":"2022-07-13","publishedPlatform":"MOBILE","rating":5,"text":"Stayed here for 2 nights with a friend and we loved it. Decent sized room and large bathroom. Robes and slippers provided. Rooftop pool was great during summer in New York. Friendly staff and housekeeping was lovely. Location is good for trains and Chelsea markets.","travelDate":"2022-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"Stellar Staff!","lang":"en","publishedDate":"2022-07-08","publishedPlatform":"OTHER","rating":5,"text":"I don't often write reviews but our recent stay at the Gansevoort warrants one. We were celebrating our 20th anniversary and due to a series of complications needed to cancel and rebook a number of times. When we finally made it in on July 4th, we were greeted with warmth, courtesy, water bottles and a super early check in! From the valet, to Lauren at the front desk, the entire staff could not have been nicer or more welcoming. The star of the show here, though, is John Ross who brought us to our room and seems to wear many hats. I think he should be promoted to manager immediately. His smile lights up a room and he gave us a fist bump every time we passed him in the lobby, it made us feel so special. He told us about fireworks on the Hudson from the roof (saving us a crowded trip to the East River) and was a huge help at check out with our car. Can't say enough good things, give this man a raise immediately!! The hotel itself is spectacular, from the fun location (Little Island, Highline, Chelsea Market) to the Banksy in the lobby to the very trendy rooftop pool (shout out to Clarisse who helped us find chairs.) I also loved that you could fit some of your own things in the mini-fridge and that they offer L'Occitane products that are individual, not attached to the wall like so many hotels now. We are already planning our next getaway in August so we can bring our teenage daughter who, if it's possible, will love it even more than we do. Thank you all for the anniversary treats and making it one to remember!","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Superb location, a peaceful haven in a crazy city!","lang":"en","publishedDate":"2022-07-07","publishedPlatform":"OTHER","rating":5,"text":"I would absolutely recommend this family owned hotel!  We stayed for a week and loved the location, away from the carnage and close enough to explore.  Heading over to Little Island at nigthtime is an absolute must!","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":1,"locationId":287626,"title":"Everything I hoped for... plus more","lang":"en","publishedDate":"2022-07-07","publishedPlatform":"OTHER","rating":5,"text":"Where do I start? While my daughter was away at college. I brought my wife and son to NYC for a spring get away (we live just outside Boston). I used to live in the meat packing district in the 90s, so I am always in awe with it's transformation. \n\nStepping foot in the The Gansevoort is like the first sip of coffee in the morning, or that much needed drink at the end of the day. The patio surrounding the hotel is a nice buffer from the street and provides a sense of importance as you are one of those who gets to go beyond the crowd and into the hotel. Once inside you are greeted by the warmth the guest services people and the perfect temperature and fragrant clean air.  There is a stylish little eatery in the lobby which is perfect to start your stay if you arrive before check in or a great place to end your stay with a snack before you hit the road after check-out. \n\nThe rooms are surprisingly large. With big bathrooms and walk-in showers. The place in clean (which for me is super important - and there are no pillows or throws that you need to put away for fear of those not being changed). The plugs are in all the right places as are the lights. The sheets and towels are top quality and the shower soaps and personal provisions are generous and luxurious. Each room also comes with a small balcony that provides a great view of the Meat Packing District (the hotel is among the taller buildings in the area so every room has a view - that's rare in NYC)\n\nThe rooftop lounge is awesome! Great drinks and food. Best bet to stick with apps. And the rooftop pool is so refreshing for a morning swim, It's heated, big enough for some laps. Offers an amazing view and provides such a vigor at the beginning of your day.  Words can't describe what it adds to your stay  - you just feel great afterwards. And that feeling makes the rest of the day so much better.  \n\nThe area is like a little Madison avenue. The surrounding stores offer a great selection of European luxury and American style. I highly recommend Belstaff - the British rugged clothing maker. Also the Highline is right there as in Chelsea Market and the most upscale Starbuck you'll ever see. \n\nThe Gansevoort was everything I hoped it would and more. It really made my trip to NYC with my family. I highly recommend!","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Ok but ? If I would return","lang":"en","publishedDate":"2022-07-07","publishedPlatform":"MOBILE","rating":3,"text":"Probably not stay again. First of all the staff was very good. Always available and friendly. Room service was efficient and the orders were always correct. However, from day one the air conditioning didn’t work well our room was warm and slightly humid after 3 requests they finally sent an engineer. He tried but was unsuccessful. He said a fan was available and it was brought to the room and it did help but it seems that it should have been fixed and not ignored the situation. Oh, they sent 4 cookies and a bottle of water to make up for the lack. One other thing. There was a gentleman working the front lobby. I think his name was John  and he was spectacular. He helped us get to places and in general was invaluable. It’s a shame the others were not as good. \n\nBrian kiel","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"July 4th weekend getaway","lang":"en","publishedDate":"2022-07-03","publishedPlatform":"OTHER","rating":5,"text":"From the moment we pulled up and was greeted by the most pleasant individual named  , Cem who went above and beyond anytime we saw him during our stay giving us great advice on where to visit , providing water as we were overheating after an am run , or holding our bags  upon departure I cannot say enough about our fabulous experience at the Gansevoort . \n\nEach front desk attendant and the additional bell men we had the pleasure of meeting  - naming John Ross and John were very friendly and helpful .\n\nThe rooms and property  are immaculate . Great  walkable location  to many bars , boutiques and restaurants . \n\nPool and rooftop restaurant \/ bar also impressive .\nOnly negative comment is staff at pool and rooftop bar , along with  staff of Coffee & Cocktail restaurant in lobby  not overly friendly with service only being fair . \n\nOverall will never stay anywhere else on my next visit to NYC .","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Pride Perfection","lang":"en","publishedDate":"2022-06-29","publishedPlatform":"MOBILE","rating":5,"text":"This hotel is perfection.  From the first person to great us (Gem) to the last person (Denzel) the Gansevoort is everything a luxury hotel in NYC should be.  Room service was rapid and delicious.  The pool sublime.  Not sure I’ll ever stay any other place.","travelDate":"2022-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":287626,"title":"The Gansevoort exceeded expectations","lang":"en","publishedDate":"2022-06-11","publishedPlatform":"OTHER","rating":5,"text":"My husband and I had a splendid weekend at The Gansevoort.\nTo begin, the staff is warm and accommodating; we were greeted as  we were entering  the lobby.\nOur hotel room provided  comfort and luxury; many amenities were provided; \nsuch as a Juliet balcony, one and 1\/2   gorgeous bathrooms  and a king size  bed with linens that were sumptuous.  The contemporary artwork is a beautiful creative touch. All was absolutely pristine in our suite. We could not have asked for more.\n\nThe menu  at the Gansevoort is varied and creative; simple fare such as burgers are always available.  (my husband's go-to for lunch)\nbut I had the tuna tartare  which was a memorable dish that I will definitely order again. The pumpkin tortelloni for dinner was exceptional. Attention to detail is evident with every dish. On our next visit I  will certainly try the sushi. \nThe heated roof top pool and bar is a treat. Such an inviting and self-indulgent experience.\nThe location of the Gansevoort is so convenient.\nWe walked to the Whitney Museum of American Art, the Chelsea Market, The High Line Park, and the new Little Island Pier. \nOur thanks to the staff; each and every person obviously does their best and cares about the guests.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"A very pleasant stay","lang":"en","publishedDate":"2022-05-25","publishedPlatform":"OTHER","rating":5,"text":"My wife and I both agreed this is one of the best hotels we stayed. The location is great. Everything is in walking distance. The front desk Pierre is very friendly and welcoming. The rooftop bar and swimming pool has great view and vibes. Will certainly comeback again.","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Great service - thanks Pierre!","lang":"en","publishedDate":"2022-05-20","publishedPlatform":"MOBILE","rating":5,"text":"Great service from Pierre Marisela at the front desk. I was in a real time crunch and he helped me get some things taken care of. My family and I have stayed here various times over the years and are pleased with some of the changes in recent times. Especially enjoy the new French style cafe … excellent Italian espresso!","travelDate":"2022-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":287626,"title":"Family Friendly","lang":"en","publishedDate":"2022-05-18","publishedPlatform":"MOBILE","rating":5,"text":"We were in the city with my 4 month old grandson who  needed to eat lunch.  Breastfeeding in NYC is not as easy as you might think, no one takes reservations, too much paparazzi exposure and above all the distractions for a 4 month old are insane ! \nWell we had concierge service from Pierre, loveliest and kindest Gansevoort employee! Provided discreet area for babies lunch! We are eternally grateful to this lovely, chic hotel  and Pierre above all!","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Beautiful boutique hotel with an amazing location.","lang":"en","publishedDate":"2022-05-17","publishedPlatform":"MOBILE","rating":5,"text":"Together with some friends we enjoyed a fantastic stay at the Gansevoort last weekend. \n\nThe area around the hotel has a superb vibe, full of restaurants, bars and situated within easy walking distance of Chelsea, the Village, Soho, High Line etc.\n\nThe hotel itself is chic, boutique in style, with lots of high end amenities and amazing staff who simply cannot do enough to please all of the time.\n\nHaving stayed in many different locations throughout New York in the past, I cannot recommend this hotel highly enough.","travelDate":"2022-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"The Perfect Weekend Away","lang":"en","publishedDate":"2022-04-29","publishedPlatform":"OTHER","rating":5,"text":"I had an amazing stay in the Gansvoort!! Our suite was perfect it had everything we wanted and we thought the workout mirror was so cool. We had a lovely evening in the rooftop bar with a great atmosphere and amazing views. We were so well taken care of, the staff are so friendly and helpful. The hotel is in the perfect location with so much to do. Would highly recommend staying here! Can't wait to return.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Cool spot to stay in NYC","lang":"en","publishedDate":"2022-04-20","publishedPlatform":"OTHER","rating":5,"text":"I've stayed here before and upon my return was pleasantly surprised to see that they've redone the whole place. First thing I noticed was a Banksy in the Lobby (amazing) and at check-in, the staff were super friendly. I requested a higher floor room and the front desk agent happily upgraded me. The area of the hotel has really improved. Hermes and Rolex are right across the street. Take a walk around and it feels like Soho used to. Also worth mentioning, I tried the new sushi bar on the rooftop, incredible food (and the view is even better)! Overall just a really nice place to be. Will visit again!","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":1,"locationId":287626,"title":"Gansevoort is back","lang":"en","publishedDate":"2022-04-20","publishedPlatform":"OTHER","rating":5,"text":"I hadn’t been to nyc in over a year. what a difference. Not only is the hotel Brand new, but the city feels alive.  the Meatpacking district is amazing. Little island (this new park pier) is so cool. Ask for a room with a view of it if available. The staff is attentive but not annoying. They were finishing another restaurant but i ate in the lobby café and the food was very good and bar was really luxurious. Drinks can be expensive but it’s nyc.","travelDate":"2022-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"Home from home in NYC","lang":"en","publishedDate":"2022-04-19","publishedPlatform":"OTHER","rating":5,"text":"This was my second two week stay at the Gansevoort in a year and I they can bank on my custom henceforth. The location is unrivaled, the staff are attentive, the food is superb (try the omakase on the roof).. The addition of the interactive workout Mirror in the rooms was an unexpected flourish this time. Thank you, team.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Perfect choice for a stay in NYC","lang":"en","publishedDate":"2022-04-18","publishedPlatform":"OTHER","rating":5,"text":"My boyfriend and I had a great weekend in the Gansevoort Meatpacking. Our suite was just perfect and the rooftop was a highlight! Great bar and pool with awesome views. We had absolutely everything we needed so highly recommend a stay here! The district is great too, there’s so much going on, loads of fun bars and Chelsea market is cool too. All in it was a wonderful stay and we were very well taken care of.","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"There is NO WHERE better in the city to stay!","lang":"en","publishedDate":"2022-04-15","publishedPlatform":"OTHER","rating":5,"text":"I had such a wonderful stay at the Gansevoort!! From check in to check out, everything was smoothless and pristine. John was so friendly, greeting us every time we came back from a beautiful day in the city. The hotel is so close to everything we need, my sorority sister alum friends and I had a great reunion staying here and visting Chelsea Market and the High Line. Make sure to check out their impeccable rooftop and don’t forget to order yourself an Ari Gold, they’re fantastic! Tell Evan, the sisters of Alpha Chi miss him dearly 😘😂","travelDate":"2021-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":287626,"title":"Best Hotel in NYC - Hands Down!","lang":"en","publishedDate":"2022-04-13","publishedPlatform":"OTHER","rating":5,"text":"The Gansevoort Hotel has been my go-to for over 15 years.  The staff is always friendly & courteous and the hotel is immaculate.  I recently went to NYC and per usual, made my reservation at the Gansevoort Hotel.  When arrived I was floored by the renovations.  The entire front, outdoor seating, restaurant, lobby and the rooms have all been completely renovated.  The hotel is absolutely gorgeous, and is hands-down the nicest hotel in Manhattan.  Great job!  I cannot wait to come back.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Lovely Hotel","lang":"en","publishedDate":"2022-04-08","publishedPlatform":"OTHER","rating":5,"text":"Firstly the location is king, so convenient and close to soho and other great trendy areas that are in walking distance \nThe hotel staff are always accommodating and friendly \nI loved the roof top pool with its spectacular 360 degree view of Manhattan , mesmerizing., I also enjoyed the sushi restaurant which is also on the roof.\nI had a great stay and can’t wait to go back , \nThank you to all the staff at the Gansevoort Hotel .","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Exceptional Staycation","lang":"en","publishedDate":"2022-03-22","publishedPlatform":"MOBILE","rating":5,"text":"Exceptional service and amazing ambience and amenities. From the moment we checked in for our long weekend staycation, we felt well taken off and very much at home (including our fur son, Yogi). The updates (since our previous stays, pre-pandemic) were tasteful and elevated. The option to use The Mirror in our room was fun!  Breakfasts at Cocktails & Coffee were yummy, and so were the cocktails next door.  Roof deck, inspiring!  We love this place and its surroundings so much!  Looking forward to continuing our tradition of making this place our home away from home.","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":287626,"title":"A pleasant surprise!","lang":"en","publishedDate":"2022-03-19","publishedPlatform":"OTHER","rating":5,"text":"This was my first stay at the Gansevoort and it was a pleasant surprise!  The staff are friendly and welcoming.   It’s in a great location with many restaurants (try the RH Rooftop Restaurant), Lucid Design Studio and shopping nearby.  I had a business meeting on the Rooftop and the hotel catering for breakfast and lunch was excellent.  I had breakfast one morning in Coffee + Cocktails where the service and food was perfect.  I loved the hotel so much I extended my stay another night instead of moving across town.  I hope to visit again soon!","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":287626,"title":"No air in winter\/spring. Beware","lang":"en","publishedDate":"2022-03-06","publishedPlatform":"OTHER","rating":1,"text":"Our room was so hat I called the front desk. They indicated that the hotel only has heat until the summer. Therefore, there is no way to cool down the rooms unless you want to open the windows and hear the noisy street and honking all night.  I told the desk that we would never have picked a hig end hotel that doesn’t have air, especially since it wasn’t disclosed. They said that’s just how it works in this hotel. Beware when you decide to stay here!","travelDate":"2022-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"The highlight of our trip","lang":"en","publishedDate":"2022-03-02","publishedPlatform":"OTHER","rating":5,"text":"I have visited New York a lot and stayed at many hotels but our stay at this hotel will easily rank as my most memorable. \n\nTraveling with family and teenage\/adult children of different ages can be challenging - particularly when the only thing they have in common is that they are all equally demanding. The hotel worked with us to find a great solution - a suite where we had 3 connected bedrooms\/sleeping areas and 3 bathrooms ensuring everyone had their own personal space, excellent views and most miraculously their own bathroom to get us all out the door on the time. I cannot emphasise enough how helpful the hotel team was in finding the right solution for us on this trip. \n\nThe location is fantastic - step out the door and you're in the heart of the Meatpacking District, surrounded by great shopping, restaurants and sightseeing. Inside the bedrooms are great - spacious, fantastic city views, extremely comfortable beds (you won't want to get out), and stylish bathrooms. They also have great luxurious touches like nice linens, fresh flowers, Loccitane toiletries and fitness mirrors. It is also surprising quiet to sleep with no street or city noise.\n\nThe public spaces are equally great. C&C restaurant on the ground floor was a great place to start the day with a really nice menu and good service. The rooftop restaurant and pool are really exceptional. Being able to take a swim in a heated pool overlooking all of Manhattan (in February!) is a really special experience.\n\nLast but not least, I can't say enough good things about the staff. Anton the general manager and his team are consummate professionals. Nothing we asked for was too much and they were so genuinely helpful, warm and friendly at every turn - whether it was rearranging cancelled tours, booking restaurants, offering recommendations, helping with luggage or just ensuring our rooms were impeccable. \n\nThank you for an exceptional stay. We will be back!","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"The service, the views, and location - pure perfection","lang":"en","publishedDate":"2022-03-01","publishedPlatform":"OTHER","rating":5,"text":"The hotel itself is thoughtfully designed and well-appointed, with everything from Smart Workout Mirrors (in the rooms!) to rainfall shower heads in the bathroom and a Peloton bike in the gym. My room was quiet, despite the hotel being very busy, and the bed was to die for. It was very cold during my visit, but the rooftop bar was toasty warm with attentive staff. I loved watching the sunset over the Hudson River in the afternoons. The hotel is around the corner from Chelsea Market, the Highline, the new Little Island at Hudson River Park (not to be missed!), and the Whitney. Never mind all the other incredible restaurants and easy subway access. If all of that wasn’t enough, the service is nothing short of exceptional. The staff is friendly and so kind. In an era where services have been deprioritized due to staffing, it was refreshing to see how much attention the staff paid to their guests; it felt like home.","travelDate":"2022-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":287626,"title":"Excellent experience, unbeatable price.","lang":"en","publishedDate":"2022-02-24","publishedPlatform":"MOBILE","rating":5,"text":"An excellent experience, all-around, at an unbeatable price. Very helpful and personable service. Our King Deluxe room was very comfortable (loved the bed, and our son’s pull-out was surprisingly luxurious). Auto-blinds opened to a beautiful view with great natural light. There was a Bluetooth speaker, smart TV, plentiful USB and electrical plugs, and nice hotel amenities from the pool to the L’Occitane shower minis.  Room does not have a microwave or hot-water thingy but the deli is like 3 mins away. \nC&C had good food and we enjoyed breakfast. Dining was no pricier than comparable options. \nConvenient location- nice neighborhood with plenty to do (shop, eat, museum, walk around, people-watch) and easy access to taxi or public transportation.\nI can’t emphasize how wonderful the staff was- Robin and Karen took care of us at the front desk, and Raul and Gem took perfect care of our luggage and valet service. If you’re driving, get valet service. It’s worth it.","travelDate":"2022-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Great hotel and location.","lang":"en","publishedDate":"2022-02-21","publishedPlatform":"MOBILE","rating":5,"text":"Loved the rooms which were clean, ample and beautifully designed. Great friendly staff. Superb coffee, lunch and cocktails at the coffee and cocktails bar.  Shout out to all the servers and bartenders there. Even the cold lemon tap water was great! Will definitely be back.","travelDate":"2022-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Anniversary trip to New York","lang":"en","publishedDate":"2022-02-06","publishedPlatform":"MOBILE","rating":5,"text":"I have just returned from a 4 day trip to NYC to celebrate our 25th wedding anniversary. \n\nWe were lucky to stay at the modern luxurious Gansevoort Hotel. Recently refurbished in 2021. \nThis hotel is in a fabulous location in the trendy area of the MeatPacking district. \nA stones throw away from fabulous bars, restaurants, designer shops, Chelsea Market and a few steps away from the start of the Highline. \nI absolutely loved the location and would definitely come back to this area again. \n\nThe hotel itself will not disappoint. \nWe had a beautiful double room with separate lounge area. Everything in the room was modern and luxurious. \nAs a woman I was impressed that the hairdryer and hair straighteners were of a good quality standard. \n\nThe staff in the hotel were super friendly and could not do enough for you. \nThe hotel has an incredible rooftop bar and swimming pool with views of the Hudson River. Also on the rooftop is a fabulous sushi restaurant called Saishin. \n\nThey also have a American Bistro restaurant on the ground floor called the Chester which offers drinks at their bar, lunch and dinner. Food was delicious. \n\nIf you have been to New York before and been to ‘old’ Manhattan hotels….I definitely recommend a change. Get down to the Meatpacking district and stay at the trendy Gansevoort hotel. It’s fabulous and I will definitely return.","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Great property","lang":"en","publishedDate":"2022-01-19","publishedPlatform":"OTHER","rating":5,"text":"Gansevoort NYC has been the \"place to be\" for a long time now, and with their recent renovation, they will continue their reign. I had a great experience there, stayed in the Manhattan Suite, it was magnificent!!!","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Christmas at the Ganswvoort","lang":"en","publishedDate":"2022-01-12","publishedPlatform":"OTHER","rating":5,"text":"We spent 7 nights of Christmas at this impeccably renovated Hotel. The warmest welcome from General Manager Anton and the Banksy in the lobby set the tone - and the rest of the hotel did not disappoint! \n\nWe had stunning views from our spacious rooms with balconies which were connected by a living area.  This made for a very harmonious family trip.  The beds, linen and robes were pure luxury after a long day sightseeing. The technology in the rooms and the perfectly equipped gym were not lost on our teenage sons.\n\nEnough cannot be said about the location..the nearby Highline is stunning by day and night. This walk never got old. There is a real neighbourhood feel with so much to do. We all loved the restaurants, and fabulous shops. Chelsea Market was a highlight and the golfers had a great time at the very impressive driving range at Chelsea Piers.\n\nChristmas Eve was spent at the exquisite Saishin Japanese restaurant on the top floor with panoramic views of the twinkling lights of Manhattan. We had the 12 course Omakase sushi which can only be experienced to be believed. 15 courses next time as we did not want it to end. Christmas morning started with a rooftop swim followed by a beautiful breakfast downstairs. A 5 minute cab ride to Madison Square Garden for a Knicks game made for a very different Christmas Day.\n\nAnton and his team are doing stellar work here.  We were made feel very special and will never forget our Christmas at the Gansvevoort Meatpaking.  We will back!","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":287626,"title":"Great stay and fantastic location","lang":"en","publishedDate":"2022-01-05","publishedPlatform":"OTHER","rating":5,"text":"We stayed here five nights with five people and I can only recommend this place. Location is fantastic just next to the Highline and Chelsea Market and with great views over the Hudson. We had booked 3 rooms through booking and the rooms and beds were quit small for 2 people. So we asked if we could get a different room, and the hotel offered us a great upgrade (one room with two beds and one room with a double bed) for 50 dollars a night per room. our room had also more space, an extra sofa and a great view over the Hudson. Rooms are recently renovated, clean and very nicely equipped. After three days we decided to extend our stay with two more nights and this was handled very well by the reservations manager (we kept the special booking rate and the same room). Nice roof terrace, friendly staff and a gym. Very good restaurants in the neighbourhood, 5 minutes walk to Greenwich Village, 15 minutes walk to Soho. Will definitely come back.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Perfectly situated","lang":"en","publishedDate":"2021-12-16","publishedPlatform":"OTHER","rating":5,"text":"This place is THE SPOT. Best rooms, amenities, vibe, staff, neighbourhood. Tonnes going on, access to everywhere, epic views of The Hudson, the Japanese omakase restaurant on the roof was the best expression fo this cuisine I've ever tasted. Sake pairing too. I'll stay here every NY visit, ad infinitum.","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Chris","lang":"en","publishedDate":"2021-12-15","publishedPlatform":"MOBILE","rating":5,"text":"I recently stayed at this hotel and was amazed with the reception from staff, especially from a gentleman  called John when I first arrived. The rooms were exceptionally clean and were updated in terms of technology. I was impressed with the Mirror gym equipment in my room which allowed me to work out first thing in the morning. I enjoyed my stay at the hotel!","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"No sleep possible because continuous high frequency noise by air conditioning all nighr long","lang":"en","publishedDate":"2021-12-05","publishedPlatform":"OTHER","rating":1,"text":"In a ‘king superior room’ on the 12 floor with a northeast view (#1203) at a rate of mote than $700 per night, the air conditioning, despite being turned off, continues emitting a continuos high frequecy sound non stop keeping you awake all night, preventing skeep. Serious housekeeping should have identified the problem prior to making the room available. We called the front desk who proposed to sent a technician who never showed up. After a second call one hour later, a technician came by , confirmed the high frequency noise problem but could not and could not solve it. The front desk daid they could not offer another room because the hotel is said to be full.\n\nOn a side note, the music a of the bar at the 14th floor can still be heard at the 12th floor, but the nuisance is very minor in comparison to the air conditioning noise.\n\nThe room refurbishment, compared with our stay 5 years ago is a plus and nicely done, although superficially performed in the bathroom. There is no central command for managing the lights, especially for turning off the night light in the bathroom which cannot be turned off and jeeps slightly illuminating the room. Eye shades are a must.\n\nSo , still nicely situated hotel in the meat packing district, nice rooms, but technology of air conditioning and lighting ruin the experience at more than 700 dollars per night.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Top notch service!","lang":"en","publishedDate":"2021-12-04","publishedPlatform":"OTHER","rating":5,"text":"I had a wonderful experience at this hotel!  The staff was tremendous.  Diego, in particular, was especially helpful.  My room was very comfortable and quiet.  The rooftop restaurant\/bar that overlooks the Hudson River and Little Island was terrific.  The location is perfect, with access to many restaurants and various sights.  The downtown vibe is great, and it's also easy to reach other parts of the city.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Amazing Customer Service","lang":"en","publishedDate":"2021-11-15","publishedPlatform":"OTHER","rating":5,"text":"I want to applaud the amazing customer service offered by Diego Castaneda (front desk lead).  He went above and beyond to ensure my room request was made possible.  I arrived in NY for a business trip, flights were delayed and my original hotel was distant from my other team members.  With that said, I approached Diego for assistance with booking a room at Gansevoort knowing there was a low chance of it working out as I was a walk in (no reservation), systems were closed, etc.  He was both professional and creative in making everything work and helping me secure a room tonight.  His genuine effort and accommodating approach offered one of the best hotel experiences I’ve had and I want to say THANK YOU!","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Dirty","lang":"en","publishedDate":"2021-11-04","publishedPlatform":"MOBILE","rating":2,"text":"There was a dirty sock in our room upon arrival. The caulking is dirty in the bathroom. Instead of taking the time to completely hide all electric cables, they’ve just let them be visible. Patches of this and that here and there. Toilet handle broken. Instead of investing in fixing things properly, they have invested in mirrors with a personal workout and yoga mats. Party on our hall. We were miserable in this hotel. Great location. Stay somewhere else in this location and you’ll be happy you spent your well earned money there.","travelDate":"2021-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Great place to stay for a nice weekend.","lang":"en","publishedDate":"2021-10-28","publishedPlatform":"OTHER","rating":5,"text":"The hotel was unbelievable and was the perfect place to stay while in town for the Orphaned Starfish Foundation Gala. The staff was very helpful, the food, at both the cafe and restaurant, was delicious and the rooftop had a beautiful view as you had a late night drink. The location was also great, as it was a short walk from several restaurants and Washington Square Park. Always look forward to my yearly stay and already cannot wait for next year.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Amazing Stay - Love the Renovation","lang":"en","publishedDate":"2021-10-27","publishedPlatform":"OTHER","rating":5,"text":"The Gansevoort has just underwent an absolutely amazing renovation and it provided us the perfect stay in New York City.  Every aspect of this hotel was just perfect, from the room decorations and functionality, the beautiful vibe throughout the hotel and the wonderful food and beverage offerings throughout the property.  But it was the service that makes this hotel completely stand out - from check in to check out, every team member at the hotel was so very welcoming, helpful and warm.  Thank you for this five day perfect stay in NYC and this will be the only property we ever stay here.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Two Recent Stays","lang":"en","publishedDate":"2021-10-25","publishedPlatform":"OTHER","rating":5,"text":"Terrific experience-stayed twice, once with my college age daughter and then with my wife. Each stay was great. Rooms were comfortable; upgraded last stay with a suite with an amazing view and common room. Pool and pop up sushi were awesome Front office manager Laura was so kind when a last minute emergency left a change in plans she could not have been more helpful. Cannot wait to return","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Great place to have a celebration","lang":"en","publishedDate":"2021-09-29","publishedPlatform":"OTHER","rating":5,"text":"I booked a 2 bedroom suite and planned a birthday weekend with friends from out of state. I was surprised by how helpful the hotel was in finding the best rooms etc.  \nthe rooftop pool is really an amazing site for anyone!  It’s a getaway from the hustle bustle of the city. The rooftop bar gets a little crazy but it’s fun to give it a try and the views are great.  The hotel is in a great location so during the day there are lots of places close by.  I will be back.  I recommend they put coffee makers in the rooms.  That had to be requested and for that caliber of a hotel, it should be included.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":287626,"title":"Best hotel in NYC","lang":"en","publishedDate":"2021-08-31","publishedPlatform":"MOBILE","rating":5,"text":"Hotel Gansevoort Meatpacking has undergone an outstanding, extensive renovation and provides the ultimate guest experience in every way. I stayed in NYC on business and the hotel surpassed every expectation. My guest room was exquisitely appointed; from the bed sheets, the electric shades that uncovered a jaw dropping view of the River to the spacious bathroom with perfect lighting. Let’s not forget the Occitane amenities which are simply delicious.\nAnd for those looking to throw in a workout, no need to leave your room as the Mirror offers a range of exercises if you do not care to work out in the 24\/7 full gym with boxing bag & gloves.\nAnd let’s not forgot the roof top with 360 views on Manhattan, where you can lounge or enjoy laps.\n\nTruly an amazing hotel and one worth every accolade. Congratulations and many thanks to Anton, the General Manager, Luciana, Director of Leisure Sales and the entire team for making my stay so wonderful.","travelDate":"2021-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":287626,"title":"Great mini vacation","lang":"en","publishedDate":"2021-08-19","publishedPlatform":"OTHER","rating":5,"text":"I have always wanted to stay at the Gansevoort, and it didn’t disappoint. The manager David was so helpful in helping us find some late night places to go for our last night.  Me and my wife are night owls and the Gansevoort didn’t disappoint with their overnight staff. The rooms were nice and my wife loved the robes. I will definitely stay again.","travelDate":"2021-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Perfect downtown NYC escapism ...","lang":"en","publishedDate":"2021-08-17","publishedPlatform":"MOBILE","rating":5,"text":"If you're looking for the ultimate NYC weekend getaway in these crazy times, this is the ONLY place you need to consider. Awesome rooms, wicked rooftop bar with a pool and a pop up sushi restaurant that gives Zuma and Nobu a run for their money. ","travelDate":"2021-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Great brithday weekend","lang":"en","publishedDate":"2021-08-17","publishedPlatform":"OTHER","rating":5,"text":"It was my wife's birthday this past weekend and the forecast was for it to be super hot outside so I wanted to surprise her with a staycation at a hotel with an outdoor pool. Anton (the GM), Robin, and their team were awesome and super accommodating in making it a special weekend. \n\nThey were able to get us early check-in for the suite, put the flowers I had delivered to the front desk in the suite before check-in, along with a nice note from the team and welcome desserts. They also had pool-side seats reserved for us. Overall great experience and I would definitely recommend it. Also, the renovations to the lobby, rooms, etc. are really nice.","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":287626,"title":"Gansevoort Gold","lang":"en","publishedDate":"2021-08-10","publishedPlatform":"MOBILE","rating":5,"text":"The newly renovated Gansevoort hotel is a real gem. Smack bang in the middle of New York’s Meatpacking district, it offers everything to everyone. The staff were super friendly and accommodating- no request was too big or small. The rooms are spacious and very comfortable with luxurious bed linen and views of the district’s many beautiful roof gardens. \n\nThere really is something for everyone to do in the ‘hood. From the stunning new Little Island, to the Whitney Museum and the High Line. The area is also full of great restaurants including the Chelsea Markets. \n\nA highlight for our family was the wonderful rooftop pool where we had many refreshing swims after each days sightseeing. The atmosphere around the pool was very friendly and there is excellent poolside service provided. \n\nThere are plenty of places to eat and hang out people watching in the hotel and the Japanese pop up Saishin is simply delicious and a stand out in Japanese cuisine. \n\nIf you are an art lover, be sure not to miss the Banksy in the lobby and the many more beautiful paintings throughout the hotel. \n\nAnton Moore, the Irish General Manager has brought his hospitality flair to this establishment and he along with the staff make every guest feel special. We can’t wait to return.","travelDate":"2021-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":287626,"title":"Great customer service","lang":"en","publishedDate":"2021-07-30","publishedPlatform":"OTHER","rating":4,"text":"The Gansevoort Hotel is in a perfect location. We were able to walk everywhere we wanted to go. This was our first trip back since the craziness of last year. I was initially disappointed with the hotel as we had issues with the temperature in our room and also some plumbing issues. The hotel staff and particularly the managers, Melvin and Laura, were eager to resolve my problems and make sure I had a comfortable stay. I definitely felt like they were concerned about my comfort and that they went above and beyond to make things right for me. While I was disappointed with the problems, the thing I will remember most is the EXCELLENT customer service I received.","travelDate":"2021-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Great location, rooftop bar & pool","lang":"en","publishedDate":"2021-07-19","publishedPlatform":"MOBILE","rating":5,"text":"The Gansevoort Hotel is in a fantastic location right in the middle of the Meatpacking district with lots of great restaurants and shops nearby. It’s a short walk to Chelsea Market,  the Highline, the West Side Highway Park and Little Island. The rooms are a reasonable size for NY city. The hotel just underwent an industrial modern renovation and is updated. The rooftop bar & pool have a great view of the Hudson River and the pool is a nice place to cool off on a hot day. \n\nThe negatives are ridiculously low water pressure and bath products that smell like Pine Sol. I would recommend asking for a room on a higher floor to avoid hearing music from the street at night.","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":287626,"title":"Best location, best team","lang":"en","publishedDate":"2021-07-14","publishedPlatform":"OTHER","rating":5,"text":"This hotel is brand new but the staff make it feel like they've been around forever.  The front desk team was so friendly (Diego and Erika!) and  made a real effort to make us feel special the entire stay.  Super attentive and effortlessly kind.\n\nThe neighborhood is perfect (easy walking distance the Highline, shopping, galleries and museums, great restaurants); the rooms are beautiful (we had a phenomenal view of the Hudson River); super comfy beds and nice linens; and fun technology in the rooms and throughout the hotel (great wireless, chargers, TV and movies, etc.).  There are multiple places to eat or grab a drink - each with a different feel so something for everyone (sports bar, cocktail lounge, cafe, etc.).  The pool is also great - a real treat to have an outdoor pool in NYC.\n\nMaybe a small thing but the whole place smells incredible - the fragrance isn't too strong but is subtly beautiful.  This is a nice change from the rest of NYC in the summer  and immediately makes you feel relaxed coming off of a busy street.  There are lots of subtly wonderful things like this that make the hotel a stand-out, particularly as most of the other hotels in this neighborhood feel dated and a little tired - this reimagined Gansevoort is a wonderful addition.","travelDate":"2021-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Wonderful stay!","lang":"en","publishedDate":"2021-06-29","publishedPlatform":"OTHER","rating":5,"text":"I moved out of NYC in 2020 (Covid) and have begun coming back regularly for work\/life. Stayed at the Gansevoort last week for the first time and it was hands down my best hotel stay yet in New York. Clean, sleek room and amenities were all wonderful and the entire staff is exceptional (particularly the manager Anton, can't say enough about him). This will be my go-to place going forward. Thanks again! I'll be back soon :)","travelDate":"2021-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":287626,"title":"Amazing Oasis in The Right Place","lang":"en","publishedDate":"2021-06-28","publishedPlatform":"OTHER","rating":5,"text":"From checking in, to seeing the views of the city from my two balconies, to spending many hours at the rooftop pool I had an amazing stay here. My trip was for pleasure and relaxation. All of this was achieved at the this property. The staff is very attentive, kind and experienced. The amenities are nice and clean. The location is perfect. You are a quick walk to a Starbucks reserve, Chelsea Market, The Highline and many of the best parts of the city.","travelDate":"2021-06","tripType":"NONE"}
