{"helpfulVotes":0,"locationId":25364280,"title":"great hotel","lang":"fr","publishedDate":"2024-04-03","publishedPlatform":"MOBILE","rating":5,"text":"it was great, very kind welcome. In Time Square so close to everything, metros, musicals which are great (personally we did the Lion King one). However, there is no room for breakfast in the morning at rush hour (around 9 a.m.). The rest on top. THANKS","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Excellent hotel, exceeded expectations!!","lang":"es","publishedDate":"2024-03-20","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is in an excellent location, on the corner of Times Square.\nThe staff was very friendly and always willing to help, I had a minor inconvenience and they resolved it quickly and well.\nThe rooms are a good size for 2 adults and are very well equipped, there were 4 of us and we stayed in 2 adjoining rooms, perfect for a family.\nThe breakfast was excellent, although during rush hour it is difficult to find a place to sit.\nThe only inconvenience is taking the elevator at breakfast time or in the afternoon.\nWe will surely return!!!\n\n","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"It is not a room for three adults","lang":"es","publishedDate":"2024-03-10","publishedPlatform":"MOBILE","rating":3,"text":"I got a room for three people. The 3rd bed was a sofa bed, very uncomfortable sleeping on springs, I asked the reception for an extra mattress or some solution, and the answer was we can't do anything.\nThe location is perfect, the hotel is very nice, a shame","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Very good hotel","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":4,"text":"We stayed in this hotel for 7 nights. The location was excellent, about a 5 minute walk from Times Square. Breakfast was included. There were two or three hot options daily, generally eggs, potatoes and bacon or sausages. There was a choice of cereals, juices, porridge, breads, toaster, yogurt, waffle maker, fruit etc. They also had breakfast rolls that you could take away. The breakfast area was busy so we went down before 8 am each day. The lifts have a system whereby you press your floor number on a key pad outside the lift and it flashes up which lift to take. The lifts coming down were sometimes busy at peak times. The room was very modern and had a kitchen area with microwave, fridge freezer, coffee maker and a wide range of delph, dishes, cutlery etc. The bathroom was modern too, The room had a sofa bed as well as a bed.  it's a new hotel. We loved the hotel and would stay there again. We used the 50th Street subway as it was quieter than the Times Square one and very close to the hotel. We walked almost everywhere. The only thing I wasn't happy about was that there was a 100 euro security deposit per night payable. While it wasn't taken out of the final room cost, it did mean there was a block of 700 euro on our bank account ( along with the room charge) until we checked out. At that point only the room charge was deducted. This may be standard in American hotels but if you have a limited budget you would be down 100 euro per night until you checked out. As I said it could be standard practice in America. I would still.stay in this hotel and recommend it.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"Needs some improvements","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":2,"text":"The rooms are tiny but well designed and new. The elevators are a disaster between 8am and 9am. I was on top floor 37. The elevator arrived with 5 people already on it that boarded in the hope of finally getting to lobby. The elevator filled up with about 10 people and there after stopped at many floors where people were waiting but could not fit in elevator. Of course this behavior of elevator makes things worse. The free breakfast was very crowded with cold sausage and 10 people in line to get orange juice. There was a false fire alarm followed by two announcements saying that it was a false alarm. The snack store self checkout did not work for me. The food available is overly woke with only \"health\" sodas lacking sufficient sugar. In contrast there were many kinds of candy bars. The doors are equipped with mighty door closers that make the doors hard to open followed by a very big slam when they close. This hotel is located in a tourist area near times square. I had to walk 10 blocks to find a drug store. But if you want to buy an I love NYC T shirt there are dozens of stores. The room did have a microwave and a dishwasher that I did not use.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364280,"title":"Pleasant stay","lang":"fr","publishedDate":"2024-03-06","publishedPlatform":"OTHER","rating":4,"text":"Very good hotel, we did not encounter any problems with the elevators during our stay but it is true that the breakfast is not very varied and that the queue at the waffle iron can be long after 7:30 a.m.!\nThe bedding is comfortable, the staff quite pleasant.\nThe ventilation made some noise the first night but after a few manipulations it didn't make any noise at all.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364280,"title":"Great hotel, amazing location! Friendly staff!","lang":"en","publishedDate":"2024-02-24","publishedPlatform":"MOBILE","rating":5,"text":"We stayed in the Home2 suites Times Square for 3 nights last week. After reading some negative reviews we were a bit apprehensive but we could not find a single fault with the hotel. The location was so central in the centre of Times Square but no noise problem. \nThe rooms were small but had everything you needed including a fridge and mini kitchenette. \nBreakfast was included and there was a great selection. A bit busy during certain times in the morning but that was to be expected so we made sure to be down early to avoid the queues. \nStaff were helpful and friendly.\nFor the location and price I will definitely be booking them again for my next visit and have already recommended them to a few friends.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"Don’t stay, they charge what they like from your card and say you haven’t showed up!","lang":"en","publishedDate":"2024-02-19","publishedPlatform":"MOBILE","rating":1,"text":"Good location, but that’s where the positives stopped. Hotel reception s completely incapable of running a hotel. I had booked and paid two rooms in full, including taxes and fees. I arrived first and explained my friend , who’s room was booked by myself , paid for with my card would either arrive later that day or next day since she had been off loaded from her flight with her son. Reception had some difficulties looking for her booking , at one point saying it was booked at the Hampton but they share reception. I found this odd to start with since both bookings where made at Home2suites , same type of rooms, but didn’t know if they had allocated next door. Next day my friend got on her flight so I would assist her and check her in, then being told they had cancelled the room because of no show! I had heard nothing of this from either Booking.com , whom I had the booking contract with, nor the hotel. I had stood in front of them explaining her stress of not getting on the planned flight due to storms in the UK day before leading to busy flights etc. I had to find and pay for her at an alternative hotel nearby since she was unknowingly in the air at the time, luckily there was availability. \nHome2suites agreed to honour the booking for the remainder of her stay, only after I pointed out they had available rooms the following 2 nights. \nWe spoke to the manager of the hotel and another member of the reception team who agreed to refund the one night where she had to pay for another room. We didn’t ask for  refund for first night since the room wasn’t needed etc. They said the refund would be returned to the booking card and I had to contact Booking.com for processing the refund back to me. \nOn my return to the UK I contacted Booking.com and they claim Home2suites denies there’s a refund due for the one night. I have again disputed this and they are contacting again. It is a week since our return and no nearer any resolution or response from the hotel. Home2suites has also taken an additional £318 from my credit card used for my room, despite all taxes and fees included in the full amount I paid Booking.com, checking out on time, no use of any services, no breakage in the room. My friend used her card to check in to her room once available. I have contacted the hotel twice regards to this fee but no reply. I have contacted Hilton on their website with no response. \n\nNext step is to dispute payment with Booking.com ( with their success rate so far I think I might as well skip that option) or my credit card company since this an unauthorised charge and no reply from the company which has charged me.  Booking.com refused to publish my review of the hotel due to a “non stayed reservation “ - which I think means the hotel said I did not stay there!! We were in rooms 1314 and 1312 which had their own hallway with secure door so you could leave doors open in between, as good as adjoining rooms. The breakfast was too busy, the wait for waffle making was approx 20 min every morning and items such as bagels and bananas kept running out.  A table was difficult to find, some mornings we had to sit on chairs without a table.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Home2 - the good, the bad and the ugly!","lang":"en","publishedDate":"2024-02-17","publishedPlatform":"MOBILE","rating":3,"text":"The Good:\n\nExcellent location just steps from Times Square.  \nEasy access to the Subway stations and many attractions such as the Empire State Building, Top of the Rock and Central Park are within easy walking distance. \n\nThe apartment was compact (as you expect in NYC) but had everything you needed for a short stay including a fridge\/freezer, coffee maker, toaster and microwave.  \n\nBreakfast provided each morning was a very welcome inclusion in our room rate and set us up for a day exploring.  \n\nThe fitness room\/gym was equipped with enough to keep you ticking over whilst away from home with a decent set of dumbbells, a bench, cables, some small kettlebells, a selection of functional training equipment and a range of cardio equipment.  \n\nHelpful and friendly reception staff.  We were made particularly welcome by an English chap when we checked in who took time to give us some hints and tips to get the most out of our stay.  \n\nThe Bad:\n\nYou have to get up early to avoid a hectic breakfast experience. Any time after 7:30am is too busy, there's nowhere to sit and the queues at the toasters and waffle station back up to block most of the buffet area. \n\nThe lifts (elevators) are an absolute nightmare!  I'm sure some of the issues are down to impatient people re-selecting but still it's a painful experience.   Twice I opted to walk the stairs to the 36th floor rather than wait for an elevator that may or may not take me there! \n\nBeds are much smaller than most hotels offer (however it was comfortable). \n\nA fire alarm system on floor 36 was going off the entire duration of our stay.  Reported but 4 days later it was still sounding. \n\nThe Ugly:\n\nThe ventilation system in the room is horrendously noisy.  Like a subway train rattling through your room! It also filled our room with marijuana smells one night. \n\nThere's no way of controlling it\/switching it off as we were advised it's centrally controlled.  It starts up many, many times during the night and will wake even the deepest of sleepers.  \n\nDespite all the good points raised, this alone would prevent me staying here again. \n\nIt's hard to imagine Hilton making such a disastrous decision in one of their accommodations but they have and it's insufferable.   We had poor sleep every night. Thank goodness the coffee was good in NYC!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"ESTADÍA FIN DE AÑO TIMES SQUARE HOYEL HOME2 By hilton Times Square","lang":"es","publishedDate":"2024-02-13","publishedPlatform":"MOBILE","rating":4,"text":"Para calificarlo, es difícil poner un puntaje general .\nLa ubicación es Espléndida , por tal 1.000 puntos ( frente al hotel Hard Rock, en el centro entre dos puntos muy importantes:a tres cuadras de Times Square, y a dos de Rockefeller Cebree. \nCuadra muy linda y segura: hay restaurante Mexicano , hay proveeduria con todo ( hasta comida caliente elaborada) y a dos cuadras el subte , que permite volver al aeropuerto  J.Kennedy con las valijas, ir a Soho, etc.\nPara venir desde el Aeropuerto J. kennedy , el subte nos dejó a 6 cuadras.\nRespecto a la infraestructura: se estrenó en agosto de 2023, por tal, todo nuevo, como a estrenar .\nDos temas a tener en cuenta importantísimo: NO ACEPTAN PAGO POR TARJETA DE DÉBITO, EFECTIVO NI TRANSFERENCIA DE OTRO BANCO ( aunque sea de Estados Unidos)\nSOLO SE PAGA CON  TARJETA DE CRÉDITO. \nEl desayuno es muy completo , comparando con hoteles de NY: Había familias de todos los países , y todos desayunando diferente pero cumpliendo con los gustos regionales .\nEL DETALLE A TEBER EN CUENTA ES LA CANTIDAD DE GENTE PARA DESAYUNAR Y LO DIFÍCIL DE CONSEGUIR MESAS, además del lugar acotado para servirse , por lo q hay q hacer cola ( más si se desayuna después de las 9 de la mañana)\nEsto podría solucionarse , agregando más áreas o islas para servirse, como hicieron, agregando el subsuelo con mesas y algo para proveerse ( pero no toda la variedad)\nSe podría solucionar con reservas de horarios , o no ingresar al área hasta que haya disponibilidad . Igualmente han incorporado mucho personal para limpiar rápidamente las mesas y para reponer todo para el desayuno.\nEl problema que más tiene , y esto no tiene solución, ya que considero un error del arquitecto, es que el área de hall de recepción es para todo y con tanto caudal de gente ( ya que son muchos pisos y muchos deptos por piso) , es que hay muchas familias acumuladas:\nA la derecha para que la recepción atienda a los huéspedes, a la izquierda, hay un sillón doble que suele estar lleno de personas esperando el check in ( ya que suelen llegar en distinto horario que el horario de check in) , además, ahí mismo está la barra para tomar algo o algunos se juntan a desayunar o merendar ( por la falta de lugar ; en el medio : cola para los ascensores. Son pocos para la cantidad de unidades y las familias deben acercarse para incorporar el piso a donde se dirigen, y recién ahí te indica qué número de ascensor podes tomar .\nEsto  parece mínimo, pero para estadías de más de 3 días , supera la paciencia ( hemos estado más de 20 minutos esperando)\nAveces para el desayuno, optábamos por elegir todo y subir a desayunar a la habitación para estar más tranquilos ( pero había q esperar para subir!!!!)\nNosotros alquilamos para 12 noches dos habitaciones para 3 personas ( no entran más porque no hay lugar para colocar las valijas . El Placard es muy pequeño para estadías prolongadas.\nOptamos por un dormitorio para nosotros ( matrimonio) y otro para mis hijos ( que son 3)\nEl equipamiento de las habitaciones es óptimo, en cuanto a lo comparable con otros en NY, tiene muebles de cocina, vajilla, amplia heladera y freezer, amplio horno microondas que es para cocinar , mesada con bacha , mesa y sillón con banquetas ( o sea para cenar los 5 estábamos óptimos), cafetera con café y té .\nNuestros hijos son de 15,21 y 27 años y estábamos cómodos todos juntos para cenar ( comprábamos en la proveeduria de en frente o a 6 cuadras ( en Whole Food , en Bryant Park , que hay de todo cocido y sushi) y lo dejábamos en la heladera para la cena. \nLa blanqueria es excelente, como los artículos de tocador, Shampoo y acondicionador.\nEl servicio de limpieza fue óptimo: todos los días vinieron al limpiar pero en el hotel nos informaron que cada dos o tres días limpian, salvo que necesites algún artículo, ropa blanca o limpieza ).\nEn el piso 11 , estaban mis hijos y fueron a hacer limpieza cada 3\/4 días y ellos tenían que solicitarlo.\nLa atención del personal de todas las áreas es excelente.\nFuimos a pasar fin de año y nos dieron brazalete para ingresar al hotel, ya que entre la 7 y la 5 cerraron todo por el Ball Drop de TIMES SQUARE.\nEn el último piso, tiene un Rooftop Top ( que no llegamos a conocerlo)\nTodo hermoso y cómodo , a excepción de este detalle de error de cálculo del arquitecto .\nGracias !","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Unhappy customer","lang":"en","publishedDate":"2024-02-08","publishedPlatform":"OTHER","rating":3,"text":"Lovely new hotel, great location, very small rooms though. However, I won't return and I don't rate the customer service. I was overcharged and I am still waiting to be refunded!!! I booked via hotels . com and I was overcharged when i got to the hotel.The hotel say they cannot see the extra transaction I am referring too, yet my bank provided the transaction details, authorisation code etc, which I provided to the hotel. I was charged the extra amount, it is on my credit card statement!! Waiting since November to be refunded and getting nowhere. I am being charged crazy interest by my bank. Waiting too long for this refund\nnow. As the saying goes, the customer is always right. I am entitled to my refund and getting frustrated waiting for it now. I have sent multiple emails and still getting nowhere.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Small and Noisy","lang":"en","publishedDate":"2024-01-30","publishedPlatform":"OTHER","rating":2,"text":"I am a Hilton Honors member and have stayed at numerous Hilton properties. While this hotel is clean and new, it does not merit having the word \"suites\" in its name. My room was so small and uncomfortably crowded when compared to rooms at Hilton Garden Inns that are open in NYC (or were there in recent years but have since closed). I can't imagine a family staying in one of these units. In addition,  there was no way to turn off the AC\/Heating fan. Even though there was a thermostat with a control panel with an option to turn off the fan, the fan kept blowing after the panel indicated that I had been successful in turning it off.  The constant loud roaring of the loud fan meant that I slept horribly for four nights. I was told at the desk that the hotel has a central heating and air conditioning system, so I'm not sure what the purpose of the control panel was. On a positive note, the staff was friendly, and I appreciated the 24-hour coffee. The location is very convenient to the theatre district, transportation, and dining, but I don't think I could be convinced to stay at this particular place again.","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":25364280,"title":"Home not sweet home","lang":"it","publishedDate":"2024-01-30","publishedPlatform":"MOBILE","rating":3,"text":"La cosa positiva è la posizione. Si trova ad un centinaia  di metri di distanza da Times Square e altrettanto dalla quinta strada. Vi è poi la scelta sulla fermata della  metro da preferire avendone due molto vicine. L’albergo in sé non è malissimo, le stanze non sono troppo grandi ma comunque confortevoli. Il primo giorno non è stata  fatta la stanza e la richiesta di preparare il letto aggiuntivo ci è stato comunicato che avremmo dovuto provvedere autonomamente. Nel momento del check-in viene consegnato un foglio in cui vengono indicati gli orari di afflusso per la colazione consigliando di farla tra le 6 e le 7am per evitare di trovare troppa gente.ritengo che andare in vacanza e svegliarsi così presto sia alquanto complicato anche per coloro che decidono di visitare New York tutto il giorno.il problema è che basta alzarsi un po’ più tardi per trovare lunghe file agli ascensori e nessun tavolo disponibile per la colazione.esiste una sala al piano interrato che non viene utilizzata e che potrebbe invece essere utile.la qualità della colazione è sufficiente e tenuto conto dei costi che comporterebbe farla esternamente si tratta di un discreto compromesso.pertanto il punto assolutamente positivo è la vicinanza dal 100quello negativo è un numero elevato di ospiti per una struttura non troppo grande. Esiste poi un rooftop la cui vista non è troppo spettacolare ma il locale è tranquillo e carino","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364280,"title":"Very slow front desk staff, very small room, but great location. I will look for another hotel and skip this next time.","lang":"en","publishedDate":"2024-01-27","publishedPlatform":"OTHER","rating":3,"text":"It has a fantastic location and is convenient to Times Square and many restaurants. It is a walkable distance to the Rockefeller Center. \n\nThe hotel lobby is usually very busy, and the front desk staff was very slow, understaffed, and not motivated to work faster. I could see staff sitting on their phones or chatting inside the backroom when in the front there were 10-12 people in the line waiting to get help. At one instance, there was only 1 person at the Front Desk, and she was answering all the calls and helping many people alone.\n\nThe hotel room entry was weird and not clearly marked, so it initially took a few minutes to figure out our room entrance in the floor hallway.\n\nWe booked a suite, but it was a very small room. The room had all the kitchenware, which was very helpful, especially when we were bringing food to go and feeding the kids in the room.\n\nI will look for some other hotel in the area next time","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"I just love this hotel!","lang":"en","publishedDate":"2024-01-25","publishedPlatform":"OTHER","rating":5,"text":"I absolutely love this hotel. Superb location. Typically small rooms, but comfortable and well appointed. Includes a full kitchen, which is such a benefit in New York City. Walkable to everything. Friendly staff. I would highly recommend.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364280,"title":"Si quieres ser robado, elige este hotel","lang":"es","publishedDate":"2024-01-22","publishedPlatform":"OTHER","rating":1,"text":"El hotel es lindo, nuevo y está bien ubicado. Sin embargo, durante nuestra estadía de 12 noches:\n- La alarma de incendio sonó 3 veces por la madrugada debido a un problema técnico.\n- Nos faltó un gorro de la habitación. Yo tampoco podía creerlo, trabajo en el rubro y me parece impensado que alguien le robe algo a un huésped pero luego de revisar todas nuestras pertenencias, el gorro no ha aparecido y el mismo nunca salió de la habitación.  \n- Al momento de hacer el check out, la mampostería del techo del lobby cedió y este comenzó a lloverse inundando toda la recepción. Ni siquiera pudimos realizar nuestro check out, tuvimos que salir corriendo por una puerta lateral con nuestras valijas. \nNo somos huéspedes quejosos, elegimos un piso bajo para no tener problemas con los ascensores, ni siquiera nos quejamos por el ruido insoportable del aire acondicionado pero estas situaciones ya han sido demasiado. No volvería y no lo recomiendo para nada!!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"Excelente ubicacion y muy funcional","lang":"es","publishedDate":"2024-01-19","publishedPlatform":"MOBILE","rating":4,"text":"La ubicacion es excelente, a 2 cuadras del Times Square y a 2 del Rockefeller Center, realmente ideal.\nEl hotel es nuevo, la habitación es pequeña, nosotros eramos 4, 2 adultos y 2 niños, cuando abriamos el sillon cama no se podia circular. Pero mas allá de eso la habitacion es super completa, tiene todo lo que se necesita. Microondas, lavavajillas, utensillos. Si necesitas se puede pedir una cocina a inducción, yo lo hice y me la dieron junto con una sartén. \nEs todo mini, el baño pequeño, la cocina pequeña pero si son 2 es suficiente, si son mas se tienen que ajustar.\nLo mas flojo es la limpieza ya que solo te hacen un \"refresh\" un dia si y un dia no, y una limpieza completa solo despues de 4 dias.\nEl refesh consiste en hacer la cama, sacar la basura y reponer papel, toallas, etc.\nEl desayuno es bastante bueno para un 3 estrellas, hay para hacer waffles, huevos revueltos, sandwiches, muffins, fruta, etc.\nPor el tema del ruido de la ventilación si, hay ruido intenso, es como estar en un avión. A nosotros nos afectó demasiado.\nY el tema de los ascensores no tuvimos problemas, y estabamos en el piso 32.\nVolveria por su ubicacion y funcionalidad.\nOjala conserven el estado de las habitaciones a lo largo de los años.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Terrible attendance!","lang":"en","publishedDate":"2024-01-18","publishedPlatform":"OTHER","rating":1,"text":"Terrible attendance! We had a problem in our bathroom and requested a service, but they suggested we change rooms, but they wanted to change us to a smaller one and when we didn't accept, the attendant was rude and started shouting. My 5-year-old son started crying, but she continued speaking loudly as if we were the ones who had caused the disturbance! Not to mention that all this trouble we had at 1 am!","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Great Option Near Times Square","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"OTHER","rating":4,"text":"This brand new hotel is an excellent option very near Times Square. The location is incomparable for the price. The rooms are very clean, well-laid out, and very quiet. They are small but most hotel rooms in NYC are small.  We appreciated the clever way that the small bathroom is arranged, the refrigerator, and the comfy bed. \n\nWe went to breakfast around 8:45 AM. We didn't have much trouble finding a table for two although the breakfast room was very crowded.  Choices at breakfast are the standard offering at a Home2Suites or Hampton Inn so don't expect anything too exciting.  On the other hand, it is a huge amenity to have breakfast included in the room rate in NYC. The breakfast offerings were frequently replenished and dirty plates were picked up quickly. \n\nAll of the staff who we dealt with pleasant and helpful. \n\nThe elevators do take a little getting used to but we didn't find them to be the disaster that other reviewers have. However, the elevators are small so be aware that guests on the lower floors may find it difficult to get into the first elevator that comes to your floor at morning rush hour. We were on an upper floor and had to cajole others on the elevator to make room for guests on lower floors. \n\nWe stayed in a water view room.  While we only saw a sliver of the Hudson River in the distance, the room had a small extra window that provided some extra sunlight and a nice view of a portion of Times Square. It was worth the small increase in price over a standard room.\n\nOur only annoyance with the hotel came on check-out morning. We prepared our luggage for check out and then took a walk to Central Park.  When we returned to our room, it was clear that housekeeping had been in the room because our dirty towels and trash were gone. No problem. It was the Friday morning before a long holiday weekend, so it made sense for housekeeping to get a jump on cleaning the room. The problem is that housekeeping took the chilled, refilled water bottles that we put on the counter so that we wouldn't forget them. We weren't pleased when we had to purchase a new single use water bottle at Moynihan Train Hall for over $6.00.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"DO NOT STAY HERE","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"MOBILE","rating":1,"text":"We are here for 5 nights. We have stayed at several Hilton properties in New York in this area. This by far has been the worlds worst experience ever. Do not book here! At first, I thought the other reviews here were crazy. However, after staying here, it’s been horrific. The fire alarm goes off throughout the day. It even went off at 2 AM the other night. I’ve had to call several times for housekeeping. And asked for someone to come refresh our room. we ran out of essentials like toilet paper. And I’ve read the other reviews. And for the general manager to say that it’s a new hotel and there’s some hiccups. Is ridiculous. The fire alarm should not go off throughout the day every single day. There is an issue and it needs to be addressed and it should’ve been addressed already. I should get a refund. Considering that they have not addressed these issues. This is absolutely ridiculous.I hate this place. 5 night in New York and you ruined my experience!!!! I’m literally standing in the hallway now. And the alarms are going off again. This is not OK..","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364280,"title":"Better hotels around the area","lang":"en","publishedDate":"2024-01-15","publishedPlatform":"OTHER","rating":3,"text":"Positives \n\nRate not too bad\n\nLocation steps from Times Sq \n\n24\/7 coffee \n\nGood elevator system for a tall hotel better than most in this area\n\nClean\n\nNew \n\nFridge & Microwave \n\nNegatives\n\nSmall bed like a child's\n\nPoor design of room with a useless table on wheels, a luggage stand taking up room in the closet and nowhere to put it as even the bed has no under storage, no drawers to put the cutlery to it stays on the counter getting dusty, 3 bins 2 under the useless table\n\nNever ending central air system that is loud and can't be stopped\n\nAC\/Heating can't be set it can be switched on or off but can't be set under 20c or provide heating \n\nShower fluctuations between cold and hot and an awful mixer which needs millimetre movements to stop you either burning or freezing\n\nNo shelf in the shower for your own shampoo etc\n\nHere 4 days so far and the fire alarm has gone off 3 times while I have been in my room including at 2am last night followed by announcements over the PA system in the room \n\nAwful selection of TV channels with no news networks, very few English channels many are Spanish including many movies channels and discovery etc, no business channels in Mid-town!, many sports or foreign channels the worst selection of any hotel I have stayed in \n\nBasement breakfast area all the seats on the tables, secondary breakfast counter not set up and most of the area used to store laundry","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364280,"title":"Pessimo ","lang":"it","publishedDate":"2024-01-15","publishedPlatform":"MOBILE","rating":1,"text":"La suite, camera disponibile più grande, è un buco; in 4 giorni non è stata mai pulita,frigo bar vuoto, pulizia iniziale scarsa, aria condizionata rumorosissima e non si può spegnere, acqua della doccia fredda, colazione scarsa per qualità e scelta von relativo personale di sala sgarbato.\nSolamente la posizione è eccellente ma di alberghi in quella zona ce ne sono tanti. \nSconsigliato ","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Wonderful Visit","lang":"en","publishedDate":"2024-01-13","publishedPlatform":"MOBILE","rating":5,"text":"I had a wonderful experience at staying at this hotel. The front desk staff was amazing and the room was perfect! Me and my family had a blast from the breakfast, staff greetings, and also any issue i had they were very attentive to fix it. I wish i could stay here longer.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Clean, Revert To Classic Elevators and Allow Guest Control Of Heating","lang":"en","publishedDate":"2024-01-09","publishedPlatform":"MOBILE","rating":3,"text":"Positives\n- The room was very clean.\n\n- All fixtures were in perfect order.\n\n- Though the room was incredibly small for the price, it met our needs. Space and hotels are very expensive in New York anyway.\n\n- Comfortable and clean beds, no bedbugs.\n- Buffet breakfast was excellent\n\nNegatives\n- The heating system was running constantly and there was no way to turn it off. This meant that we had to open the window to let out the hot air. As a result of this the noise kept us awake.\n\n- The elevator system was a complete mess. You had to enter your room number on a tablet and then scan your keycard. Then the tablet would assign you an elevator. This lead to problems as many people on the upper levels just caught the first elevator going to ground that came and this lead to unnecessary stops by the previously assigned elevator and frustration by the long line of people waiting at the bottom and the people on board the elevator.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Bien mais bruyant, Time square oblige","lang":"fr","publishedDate":"2024-01-02","publishedPlatform":"MOBILE","rating":4,"text":"Hôtel très bien placé quand on aime la foule et le bruit de Time square. Les chambres bien que petites sont bien agencées et équipées. Très bonne literie, le canapé lit est fait pour 1 seul jeune enfant. Un Target pas loin (en face de Mme Tussaud) pour les courses si vous voulez manger le soir dans la chambre, on vous déconseille le Deli juste en face , très cher et pas bon. Le personnel est agréable, le petit dej correct mais allez-y entre 6h et 7h, après trop de monde. Les ascenseurs sont parfaits la plupart du temps mais à partir de 9h30 jusqu’à 11h ils sont blindés, on a attendu pendant 45 minutes pour descendre les valises le dernier jour !!! Le rapport qualité prix (avec une offre voyage privé) est excellent.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364280,"title":"Rude bitter old guy working the line to check in.","lang":"en","publishedDate":"2023-12-31","publishedPlatform":"MOBILE","rating":2,"text":"The bitter old bald black guy was so rude. He had no ounce of politeness towards every guests that came in to check in. Not a “hello” or “welcome.” I asked him which elevator were we supposed to take to get to the rooftop and I got a rude response “I DON’T KNOW!” You work for the hotel and you don’t know? And if you truly didn’t know, get info from other staffs that do so you will know in case someone else asks you the same question. Honestly, he belongs at the DMV where hospitality isn’t required and rudeness is a must.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":25364280,"title":"A great, new Times Square hotel","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"OTHER","rating":4,"text":"I have been a longtime Hilton Diamond member and have stayed at Hilton brands, including many Home2 Suites, all across the country. I say this because some of the reviews I read on here seemed to come from people who haven't stayed in Times Square before. I think to fairly rate this hotel you have to be able to separate which issues should actually be attributed to this hotel versus which are typical of Times Square-area hotels in general. \n\nFor example, the lobby is packed at virtually all hours of the day. This is typical for Times Square hotels. The free breakfast is a zoo at peak times. Again, typical. It takes a long time to get an elevator. Typical. Elevators often open for you and are already packed with people. Typical. The front desk is usually so busy you have to wait for assistance. Typical. The rooms are very small. Typical. If you're going to get rattled by these things, I strongly suggest you consider staying in a different area of NYC that's not Times Square.\n\nHere are some great things about this hotel. There's a fast service lane for high-level Hilton Honors members. I never had to wait long to talk to someone. The hotel is brand new, clean, and very nice. (MANY hotels in this area are rundown.) The room size is compact, but well designed and appointed. My two adult children and I fit comfortably with two in the queen bed and one on the pullout. (The pullout is only big enough for one adult. Two small children could possibly share it in a pinch.) The room was extremely quiet; we never heard our neighbors, the elevators or commotion in the hallway. We heard a couple sirens outside but were never disrupted by street noise. The beds are comfortable. The staff is busy and frazzled (who wouldn't be?!!?), but service-oriented and trying hard. There's a free breakfast, which is rare in this area. The location is excellent. Anything you could possibly want or need is steps away.\n\nHere are the critiques I consider true hotel issues that need to be resolved to earn a 5th star. The \"smart elevator\" system simply doesn't work well. I have no idea who pitched this concept and what problem it was intended to solve, but it's a disaster. If I were Hilton, I'd scrap those tomorrow. They're a total mess and you can tell the staff is weary from having to apologize for them. Second, there is no way to communicate with the front desk aside from physically standing in line. No one answers the phone, and the Hilton app messaging is disabled. None of my needs were so critical that I couldn't go to the desk, but it's a concerning safety issue that guests cannot get ahold of anyone at the front desk when they need to.\n\nOverall, I would stay here again in a heartbeat and consider this an above average experience at a Times Square hotel. Thank you, Home2 Suites and team!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Horrible experience ","lang":"en","publishedDate":"2023-12-21","publishedPlatform":"OTHER","rating":1,"text":"I love Hilton but staying at this location was a terrible experience. Multiple calls to this hotel and no one answered. I call corporate to send a message and they said they did but it doesn’t look like the hotel either didn’t receive or didn’t acknowledge. I wanted late check out and being a Diamond member, I thought I would get some response- nothing. \nAt check in- I also encountered rude staff. I let them know my digital key was not working and they didn’t seem to want to help. I usually get my water upon check in, nothing. I got to the room and there is 1\/4 toilet paper. I called for more- nothing. I went to the lobby on my way out for my planned activities and waited in line and nothing. No one wanted to help. I went to one of the ladies working and was ignored. I finally went to the snack area and had to pay for water. I tried the next day for water bottles and finally someone helped. I called for toilet paper and finally someone helped.  Very displeased with this hotel. ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Don't leave your card details","lang":"en","publishedDate":"2023-12-21","publishedPlatform":"MOBILE","rating":3,"text":"Does anyone have the email address please? they asked for a credit card to take a $400 refundable deposit. now im back home they have taken a further £1065.49 from my card 😡... Now finding it very hard to get in contact with anyone. Other than this the stay was o.k just somewhere to lay our heads.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364280,"title":"Almost great","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"MOBILE","rating":3,"text":"To start, I tried to call the hotel at least a dozen times, with no answer, before we arrived - I also messaged them on FB and finally was able to find their email. I was surprising my senior mother with a trip to NY for Christmas (her dream), and when our flight got changed from arriving at 1425 to 0645, I wanted to see if we could secure an early check-in, especially since I hold Gold, and inquire if all of the alarm and noise issues had been resolved. Richard Taylor finally responded to me, and rather rudely. He told me I would just have to check that morning for early check-in, and then beat around the bush with the other stuff - I should have known then to move hotels, but I only had a few days at the point when I was finally able to get a response. Check in was an absolute nightmare. Seriously, probably the worst I have ever encountered - the staff were friendly, but very obviously overwhelmed, and I was told they were not honoring any early check-in's. Cool, the ass. GM Mr. Taylor could have easily told me that and been honest with the other stuff, and I could have changed hotels right then. They did allow us to eat breakfast, which was nice, but OMG busy and clustered. When we finally got into our room, just after 3, it was nice and spacious (for NYC). It was mostly clean (floors not so much), well appointed, and as most hotels, bad lighting. The shower liked to flucuate in temperature a lot, but had good pressure. The outside noise was blocked very well, but it didn't do anything for the incredibly annoying HVAC and random fire alarms. The rooms were stuffy and you couldn't change the temp, but it went on and off every 5 minutes - it was awful. The elevators were interesting, definitely better if you were in a higher floor, or low enough to take the stairs. Novel concept, but poor execution. You would be told an elevator (no controls on the inside), wait for it, just to get on and find out someone after you requested the same floor and it changed - you then have to get out wherever you land and try again. Now for the good - the location was absolutely perfect, steps from Broadway, subways, restaurants and right next door to the James Earl Jones theater. The staff were all kind and helpful, and the breakfast was an adequate start to your day, especially with NY prices. Overall, if they could streamline their check-in and figure out what the hell is going on with the HVAC and alarms, it could be an incredible property, but as of now, I wouldn't stay again.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Un buon Hotel che potrebbe fare molto meglio a livello di pulizia!","lang":"it","publishedDate":"2023-12-11","publishedPlatform":"OTHER","rating":3,"text":"Un hotel proprio al centro di times Square e vicino ai punti nevralgici della città: la 5th Evenue, Central Park, Rockefeller center e tanti altri posti da raggiungere a piedi in pochi minuti; una colazione abbondante e abbastanza varia senza nessuna fila, nonostante le dimensioni dell'hotel.\nUnica nota stonata le dimensioni delle stanze che non consentono neanche di camminare al proprio interno e la mancata pulizia delle stesse: riassettare i letti e cambiare gli asciugamani non significa pulire, una lamentela generalizzata che ci ha accompagnato per tutto il soggiorno a New York.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364280,"title":"Stay anywhere else if you can afford to.","lang":"en","publishedDate":"2023-12-10","publishedPlatform":"MOBILE","rating":2,"text":"If you can stay anywhere else, then you should. The rooms are tiny. The bathrooms look like they're on a cruise ship. There are no tubs in the entire hotel. The \"smart\" elevators are a nightmare, especially in the morning and a busy times you might wait 20 minutes for an elevator. Although the location is excellent, the staff is very friendly, and you do get free Wi-Fi and breakfast, you just feel like part of a massive, gross tourist crowd. The false alarms went off every single day and on Saturday night they went off twice after midnight, and then the announcer came on and loudly told us to resume our normal activities. Ridiculous. They only clean every other or every third day and the sheets are scratchy and awful. This is not a nice hotel.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Met my expectations ","lang":"en","publishedDate":"2023-12-04","publishedPlatform":"OTHER","rating":5,"text":"The room was clean, even though small was well situated. The bathroom was clean and well organized. The front staff made you feel like family. The hotel was great. Well put together. It was in close proximity to alot of stores and time Square. I would definitely stay here again.\n\nCons- Breakfast Choice could of been better.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Overall a decent choice but room not as spacious are practical as usual Home 2 Suite locations.","lang":"en","publishedDate":"2023-11-28","publishedPlatform":"OTHER","rating":3,"text":"Stayed at this property about a month after it opened. Seems most of the operating issues have been resolved. Still some of the complaints I read in previous reviews persist.\n\nIf you are trying to use the elevators at prime time (10 to Noon) expect a wait, and that you may not be able to board as the elevator car is at capacity.\n\nThe HVAC system in the room is noisy!  Seems to always be on, like the loudest white noise maching you ever heard.\n\nThe room was nicely decorated, and the bed was comfortable. Also really enjoyed the shower.\n\nWhile I booked this hotel for the \"suite\" factor, the room size isn't big enough for all the features they squeezed into it. The \"full\" kitchen takes up valuable real estate, and a floating working desk\/table doesn't have anywhere to go if you pull it out to use without blocking access to the closet and one side of the bed. So if you are one person in the room I guess it would be ok, but not if there are two of you. Also no drawers for clothes, and not really anywhere to \"live out of a suitcase\" unless you use the small sofa, which than cannot be used for anything else.\n\nThe hot breakfast was great, and we took the advice of eating early to avoid the crowds (need to secure a table  by 9am). \n\nThe staff we interacted with were all nice, friendly, and helpful. \n\nOverall, this would not be my first choice to stay at again in NYC, but I have stayed in much worse, so if the price was right would consider booking it again.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"Central location is a must!!","lang":"en","publishedDate":"2023-11-27","publishedPlatform":"OTHER","rating":5,"text":"This hotel is centrally located between Times Square and Rockefeller Center.  Plenty of Subway lines nearby make getting around the city easy.  If you're planning on going in November for the Thanksgiving Day parade, this hotel is on the same block as the parade route.  The staff here are excellent, very accommodating.  ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364280,"title":"Option for families needing 2 separate rooms","lang":"en","publishedDate":"2023-11-26","publishedPlatform":"OTHER","rating":4,"text":"The good: great location near times square; new hotel that was exceedingly clean; comfortable mattresses; breakfast included and was decent (consider eating upstairs in your room if the dining area is full which happened around 9am). We absolutely loved the option for families who need 2 rooms to book 2 separate rooms within a separate hall with a locked foyer door.  We did have to call the hotel itself to book this since they have to make a note in their reservation system. For NYC the room size isn't too bad.  \n\nThe weaknesses: Busy hotel and the front desk gets absolutely swamped at check-in time (please consider signage and roping similar to how airports queue lines); we had repeated issues with the digital key on the app and then even with key cards. We literally spent 39 minutes in line to get the key cards after the app digital key failed then had to visit the front desk again after those keys didn't open one of our rooms. The ventilation system did indeed cause a lot of noise as other reviews noted; however, we were able to use the control panel in the room to just turn it off and crack the outdoor window. There was indeed the fire alarm buzzing in the hallway near our rooms as noted in other reviews but luckily we had booked the 2 rooms within their own locked foyer so the noise was lessened since we were separated by our own foyer (I still used ear plugs- consider bringing them).  \n\nThe staff did seem to be doing their best and were friendly.  I would definitely stay again because of the ability to book 2 rooms within their own locked foyer and the competitive pricing of this option.  Definitely bring ear plugs, remember to turn off the ventilation noise at bed time, and be flexible.  Enjoy The City!\n","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":25364280,"title":"Excellent Hilton Addition to the Times Square Area","lang":"en","publishedDate":"2023-11-24","publishedPlatform":"OTHER","rating":5,"text":"Great new Hilton addition to the Times Square Hells Kitchen neighborhood within minutes of walking distance NYC icons such as Birdland Jazz Club, the theater district, and TKTS. Perfect option for extended stay travel and for families traveling. They do a great job recognizing their Hilton guests and the breakfast selection is excellent. Definitely returning. ","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":25364280,"title":"Great place to stay at the heart of NYC","lang":"en","publishedDate":"2023-11-20","publishedPlatform":"OTHER","rating":5,"text":"The personnel at the hotel are excellent and the stay was very comfortable. I highly recommend the property which has walkable access to Times Square.\nThe hotel provides an amazing breakfast and great room","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364280,"title":"Home2 Suites, gives you the feeling, like if you are  at Home","lang":"en","publishedDate":"2023-11-19","publishedPlatform":"OTHER","rating":5,"text":"ur stay at Home2 Suites was amazing, everything well organized start from the check in process, through and during our stay\nRealy we enjoyed our stay at the hotel since every thing we need was in walk distance from the Hotel   ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"Terrible service, terrible attitudes and terribly noisy air con...the Trifecta of badness","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"MOBILE","rating":1,"text":"Avoid at all costs. We booked 7 nights at this hotel and on arrival and check in found the air con sounded like a freight train going through the room every few minutes. We reported this to reception who advised us they would get someone to have a look at it while we went out for the evening. On our return at 9pm the noise sounded unchanged so we called reception and they sent up a maintenance guy as had no record as to whether anyone had gone up in our absence as they had initially planned. He tried various things for almost 15 minutes then admitted there was an issue and advised us to ask reception for another room. They sent someone to move us to a room that was equally loud and the staff member said that the hotel was having major issues with noise air con and lots of complaints on a daily basis. We complained and requested an alternative room and waited 15 minutes in the corridor on level 23 waiting for a staff member, before heading back to the lobby to find out what was going on. In the lobby the staff had no idea what was going on and eventually said a staff member had gone to inspect another room with the engineer which we were eventually offered. Let's just say no freight train but louder than any hotel I have ever stayed at. We asked to speak to the manager and be moved to a sister property or SOMEWHERE that we could actually sleep in peace for the seven nights we had booked. At this point it was almost 11pm and the night manager offered us a refund, advising us to try our luck at finding alternative accommodation in NYC. NOT HELPFUL. So,here we are...unable to sleep, in a room where you can't even switch the blinking air con off as being homeless or hugely out of pocket on a freezing November night was not how we wanted to spend our honeymoon. The manager said that because we had booked via expedia\/hotels.com they were UNABLE TO HELP US. I would never stay at a Hilton property again if this is how they treat their paying customers. ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"A Winner in Midtown","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"OTHER","rating":5,"text":"Excellent accomodations at very reasonable price in the heart of midtown.  Staff was very attentive, breakfast was free and fine.  Extremely innovative use of space in the room and a fun view of the street live.  Highly recommend the hotel and plan to stay again.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"Hair.  Yeah, hair.","lang":"en","publishedDate":"2023-11-10","publishedPlatform":"MOBILE","rating":2,"text":"The good:  Hotel is new and overall in good shape and the front desk staff was friendly at check-in.  Location is great and breakfast was well done (with plenty of warning around “peak” times though it wasn’t too bad).  Rate was reasonable as well.\n\nThe bad:  I was not crazy to find I was downgraded upon arrival (from a “corner” room I’d reserved to a standard).  But not a huge deal.\n\nThe ugly:  Although the sheets appeared to have been washed and the room otherwise cleaned, there were extensive amounts of (someone else’s) long, dark hair between the duvet and the top sheet.  I have absolutely no idea how something like that happens but it was really gross.  I probably should have demanded another room but had already settled in and was zonked and who knows what worse things lay in store in another room when something like that happens.  So I cleared it off and just tried to put it out of my mind.    Probably a mistake, admittedly.  I did advise the front desk the next day for awareness and got all of a sympathetic look.  I guess they are accustomed to hearing about issues at present.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364280,"title":"Very nice stay in Times Square 👍👍","lang":"en","publishedDate":"2023-11-09","publishedPlatform":"OTHER","rating":4,"text":"Initial reviews all negative however can only assume those folk have stayed at completely flawless hotels previously\n\nRooms well sized and cleaned regular . \n\nBreakfast busy but no major wait and good choices and regularly refreshed . \n\nStaff , fantastic , and any niggle dealt with immediately . \n\nValue wise fir TS an absolute steal \n\nA very good experience …… \n\n","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364280,"title":"New and problematic","lang":"en","publishedDate":"2023-10-28","publishedPlatform":"MOBILE","rating":3,"text":"It’s Brand new but it comes with the issues of being brand new. \nFirst my reservation was cancelled even if I told them I was only arriving at 8am after red eye flight.\nThen to check in the charged me early check in to a room I later come to find was the first time being used.\nThe wall switches wouldn’t turn the light off so at 10pm I was moved rooms with apologies or anything just here is the key.\nWhen I went downstairs there was a big line of people complaining of issues with their rooms like you can’t switch off the a\/c which I also got in my new room.\nBrekkie was minimalistic and the poor staff just kept running around.\nAll in all location wise is great but for the price I expected better","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":5,"locationId":25364280,"title":"Great new hotel with technical issues ","lang":"en","publishedDate":"2023-10-24","publishedPlatform":"OTHER","rating":3,"text":"I rarely put effort into writing reviews, but as this hotel location just opended and only has few reviews, I thought this would be helpful for fellow travellers. \n\nThis hotel just opended a few weeks ago. Its one large building opposite Hard Rock Hotel that has three Hilton brands under one roof (Motto, Home2 Suites and Hampton). Motto has a separate entrance \/ lobby, while Home2 and Hampton share lobby\/receptions and breakfast area. At guest floors, fire doors separate the \"brands\"\n\nWhat I liked: \nGreat location, right at Times Square, but still in a quiter side street. \nNew builing, rooms, facilities etc\nFree (basic) breakfast included and free coffee\/tea all day. A bit busy during rush hour. \nNice staff (they were really trying to do their best)\nRoom size was decent for a NYC hotel. Everthing you need for a stay.\n\nWe unfortunately experience several issues - most of them related to the rooms\/building and some of them to staff: \n\n1.\tThe guest rooms have a forced air vent that is extremly loud preventing us from getting a good night sIeep. I had informed hotel maintenance and they were not able to find a solution as the air flow cannot be reduced \/ turned-off. We even changed room to a lower floor but the situation was not better. This seemed to be the case for all rooms as I heard other guests complaining about it in the lobby. \n2.\tFor some reason the AC turns on automatically at night full blast despite being turned off. This happended mulitple times during the night and each time we woke up. \n3. Next to our room was a firealarm panal that emitted loud beep at night. I informed maintenance \/ reception but this wasnt fixed during the three nights of our stay. We woke up several times early in the morning arond 4-5 am due to this. \n4.\tOn our second night hotel staff was chatting loud outside our room, slamming doors and vacuuming for 15-20mins. This was past midnight. They only stopped after I stepped out of the room and asked them to leave the floor. \n5. The internet \/ wifi seemed at capacity as sometimes our devices had trouble connecting to the network. \n6.\tDuring our three night stay our rooms were not serviced. I called house keeping on day two but still when we came back in the evening room wasnt serviced. \n\nAgain I once the technical issues are fixed, this will be a great hotel. I also assume the staff\/service issues were execptional and will be adressed by the hotel managment. \n\nI had informed the reception about all issues and requested a reply \/ statement once fixed by the hotel manager. I also shared this with Hilton. ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":25364280,"title":"Go elsewhere","lang":"en","publishedDate":"2023-10-18","publishedPlatform":"MOBILE","rating":1,"text":"Hotel is overrun. Far too few  employees servicing check-in or the inevitable issues with their rooms. Only 3 of 5 elevators are functional so expect 10-20 minute delays at peak times. \n\nBreakfast is terrible. Eggs uncooked, any protein was charcoal. \n\nStaff seemed to be doing their best. \n\nHVAC has major problems","travelDate":"2023-10","tripType":"BUSINESS"}
