{"helpfulVotes":0,"locationId":80110,"title":"10 stars for service and comfort- I loved my stay","lang":"en","publishedDate":"2024-04-13","publishedPlatform":"OTHER","rating":5,"text":"This hotel is fabulous. Not only a great location with lovely spacious  rooms but what is even more outstanding was the service from every single staff member, each one went the extra mile and were so friendly and welcoming. Nothing was too much trouble. \n\nI was made to feel so welcome and a big shout out to Ian, who always greeted me with a smile and was so helpful.\n\nI will certainly be back with my family! \nThank you to everyone at hotel aka!","travelDate":"2024-04","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":80110,"title":"Quiet and restful in midtown","lang":"en","publishedDate":"2023-06-26","publishedPlatform":"OTHER","rating":5,"text":"Cozy boutique hotel in the middle of midtown Manhattan.  Easy to get to parks and subways.\nHotel was excellent and perfect for the short stays. Service staff was excellent. Quiet and restful stay. Thanks AKA.\n","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Stay With AKA","lang":"en","publishedDate":"2024-04-13","publishedPlatform":"OTHER","rating":5,"text":"The beds were really fluffy and the toilets were really clean. The workers was very great, especially Jeorge and Ian. The bar was colorful with it’s drinks and L.E.D’s. The television was working really good and I loved the hotel AKA. I suggest every people to come to this amazing and awesome hotel. Remember this name “AKA”.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Chris was great!!","lang":"en","publishedDate":"2024-04-12","publishedPlatform":"OTHER","rating":5,"text":"Chris was super helpful and nice. Really enjoyed speaking with him throughout my stay . Nice hotel in a good neighborhood. Had some small issues with the doom but they were quickly resolved. I’d stay here again and plan to , largely due to the kindness of the team","travelDate":"2024-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"I hope to come back soon!","lang":"en","publishedDate":"2024-04-12","publishedPlatform":"OTHER","rating":5,"text":"I spent my holiday week with my daughter and we loved the hotel. Great elegant interiors, all italian best furniture brands, contemporary modern but not cold,  room comfortable, great beds. I really prefer small hotel because they are more intimate and in few days all the staff recognise you and you feel at home. Thanks to Mr. Blake and Ian and to all the super qualified staff, i appreciate the discrete and gentle smiles of all of them. I truly suggest to book it! Monica ( milan )","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Location couldn't be better.","lang":"es","publishedDate":"2024-04-09","publishedPlatform":"OTHER","rating":5,"text":"I stayed at the hotel for the second time, the reason for my trip was for health appointments and I was accompanied by my wife. Once again my experience at the hotel was tremendous. I received very special treatment from all the hotel staff. Make the most of the fine restaurants near the hotel. I wouldn't hesitate for a second to select it again.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Christopher","lang":"en","publishedDate":"2024-04-07","publishedPlatform":"OTHER","rating":5,"text":"If you have the pleasure of dealing with Christopher during your stay you will have a great time at this hotel. Both kind and welcoming, his hospitality was stellar. The hotel is centrally located making it a great place to spend your time in NYC. The rooms are a little pinch though.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Great hotel, great service","lang":"en","publishedDate":"2024-04-06","publishedPlatform":"OTHER","rating":5,"text":"Great hotel with great service. I was especially grateful to Rebecca and Lourdes with the events team, Jorge at the front desk and Johnny at the front door. There is nothing better than working with kind people. Thanks for making my stay so great","travelDate":"2024-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Great weekend in midtown","lang":"en","publishedDate":"2024-03-31","publishedPlatform":"MOBILE","rating":5,"text":"We really enjoyed our stay for a weekend getaway at AKA Nomad. The room was comfortable - good bed and temperature control, not loud, and slightly larger than other Manhattan hotel rooms we've stayed in. As a bonus, we were upgraded to a penthouse terrace which had great views and bonus space. The staff were very friendly and helpful and we had an excellent drink in the bar. Convenient to Penn Station and getting both up and down town. Good value.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Nomad \/ Chris at the door","lang":"en","publishedDate":"2024-03-29","publishedPlatform":"OTHER","rating":4,"text":"Chris was a very good and helpfull fellow at the door in this hotel.\nHelped me with the luggage and information about restaurants in the neighbourhood of the hotel.\nVery modern rooms - small bathroom. Bartender Alex was also amazing. Nice cocktails.\n\nThank you Chris and Alex\n\nJohan","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Fantastic hotel in the city!","lang":"en","publishedDate":"2024-03-27","publishedPlatform":"OTHER","rating":5,"text":"Fantastic hotel. Very modern rooms and very clean. Cool bar on premise! What made them really stand out for me was their exceptional customer service. The staff were very friendly and accommodating while we were there. A week after I checked out, I noticed I was missing my coat! I called and they had found it and were keeping it on hold. The manager, Jorge, was so patient and helpful in making sure I got my jacket back. This type of wonderful customer service is hard to find today...but you will find it at Hotel AKA Nomad. This is my new \"go to\" hotel in the city!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Love it","lang":"en","publishedDate":"2024-03-26","publishedPlatform":"OTHER","rating":5,"text":"This  hotel is excellent. This is a honest review, we stayed here over the weekend and will definitely come back. The rooms are a good size, great decor and very clean. Pass my standards for cleanliness. The staff were all very friendly and accommodating. The bar and lobby are hip and have a good vibe. I have stayed in higher end hotels and this one is at par with those. We  didn’t have to wait for busy elevators, which is a bonus. Great location and parking lot close by for easy  access for parking. Thanks to cleaning staff for keeping our room super clean! What ever you’re doing keep doing it - great job to everyone at the AKA Nomad!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"MUST STAY AT AKA!","lang":"en","publishedDate":"2024-03-25","publishedPlatform":"OTHER","rating":5,"text":"Wow! What an experience! We loved staying at the AKA Nomad because of the service, the cleanliness, and the kindness that was shown the second we arrived. Chris, especially, was very helpful and went above and beyond to ensure our stay was spectacular! Thanks again to the AKA staff.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Amazing stay we loved it!","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"OTHER","rating":5,"text":"The room was spacious enough for two. Quiet, clean, just had all we needed to relax. Tasteful decor. The location is perfect. We had an amazing experience overall. The staff is super helpful and friendly. We will be back for another staycation!!!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"AKANomad is highly recommended!","lang":"en","publishedDate":"2024-03-23","publishedPlatform":"OTHER","rating":5,"text":"The entire team at AKA Nomad are amazing! Super helpful & accommodating and they go above & beyond to assist every guest. The AM & PM general managers are both true professionals and have helped me even during a very last minute reservation due to a canceled flight! Chris & Johnny are always there to help a hand with heavy luggage, giving neighborhood tips & reserving cabs to and from the airport with experienced drivers which btw are cheaper than taking Ubers. AKA Nomad is my second home and it is the only hotel I will be staying at on my trips to NYC! The hotel itself is magnificent & designed immaculately by the talented Pierro Lissoni.. beautiful yet simple finishes and interiors with the most beautiful bar lounge with the most hospitable and knowledgeable bartenders. Check this hotel out, you won’t be disappointed. Huge thanks to the entire team!","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Will be back","lang":"en","publishedDate":"2024-03-21","publishedPlatform":"OTHER","rating":5,"text":"Nice, newer hotel. On the small side, which was nice actually; it didn't feel crowded. Has all amenities. Great location.  Ian at the bell desk and the front desk staff were very helpful.  Common spaces were very clean.  Room was also very clean, even coffee maker and closets. Will definitely stay here again.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":80110,"title":"Nice hotel","lang":"en","publishedDate":"2024-03-20","publishedPlatform":"MOBILE","rating":5,"text":"Rooms are quite new, modern style, the bathroom has a big shower\nI would suggest it\nAt The concierge Johnny was really helpful, he gave a lot of good advice for food, cheaper taxi\nThe bar is very quiet, it is a perfect place for a drink and relax, enjoy!!","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Great location and even better customer service","lang":"en","publishedDate":"2024-03-20","publishedPlatform":"OTHER","rating":5,"text":"This hotel was amazing, in a central location near the Empire State Building, Koreatown and the NoMAD area. The bed was really comfortable and perfect after a long day walking NYC. Their number one item though is their customer service. Chris, Ian and Johnny were all amazing during our entire stay. Chris always asking about our day and letting us know if we need recommendations on restaurants or activities just to let him know. Johnny went above beyond, always helpful and setting up a ride to the airport for us from the hotel early into our trip. Johnny made sure we felt comfortable during our stay and always had such a great attitude.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Great location!  Great staff from the greeting at the door.","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"MOBILE","rating":5,"text":"Great location!  Great staff from the greeting at the door.  Rooms very comfortable, we got the prepaid rooms and they were able to accomodate our son next door!   We Loved the bar, menu and mixologists.   Would return any day, but next time we are upgrading to their suite.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Johnny and Ian are superstars.","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"OTHER","rating":5,"text":"My visit was excellent except for some overpriced drinks in the bar. We were served premium champagne ($38\/glass) even though we requested a lesser brand. The food service manager was not helpful at all. Also, my final receipt was never emailed to me as promised at  checkout.\nJohnny and Ian provided outstanding customer service. They were always available to handle baggage and provide useful info about the location. They saved the day despite earlier issues.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Amazing experience","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"MOBILE","rating":5,"text":"Chris and the entire staff are amazing! one of the best experience ever! I’ve been staying at Aka nomad for a week and every day has been perfect! The staff has been supporting me and my colleagues with taxis’ call, infos and many more. The entire hotel is super stylish, rooms are very comfortable, Recommended!","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Amazing stay at AKA Nomad Hotel 🗽","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":5,"text":"During my 9 days trip in NYC, I stayed at the AKA Nomad Hotel with my girlfriend. \nTo be honest, it was one of the best hotel I have ever stayed. The bedroom was very confortable, with the king size bed and the pillows. Every day the hotel staff gave us bottle of water and had a nice word for us.\nThis hotel has a very good location, you can do anything walking to discover the city. \nI would like to thanks specifically Jorge, Kunga and Christopher, the host staff of the hotel, who were very kind, sociable and helpful with us.\nSpecial mention for Christopher without whom this stay would not have been the same. Always smiling ans listening to us 😄. \nI would strongly recommend holidaymakers to stay in this hotel !!\nThanks for everything 🙏🏻","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Great stay- I would come back!","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":5,"text":"I really enjoyed my stay. Great locations, and the rooms are comfortable. The staff were exceptionally kind and helpful. Chris (and several other gentleman I did not get the name of unfortunately) was lovely. He greeted me every time he saw me, suggested nearby restaurants when asked, and helped hail a cab and load my suitcases in. They also stored my luggage after checkout since I had a late flight. My only negative feedback is that my hotel room was a bit too warm. It was unusually warm when I was there (70s in March) but it seemed like the only way to cool off the room was to open the window. However, that worked to cool it off, so it didn’t have an impact on my stay.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Great choice!","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"MOBILE","rating":5,"text":"I had a great 2-night stay at this hotel. Perfect location, modern and clean room, comfortable bed and good shower. My room had not only an iron but also a steamer for clothes, that was awesome! Also a Nespresso machice as courtesy. I didn’t have breakfast at the hotel, so I cannot rate it. Special thanks to Christopher, very kind and polite. Can’t wait to come back!","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Quiet and neat staying place that makes you feel like home.","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":5,"text":"Very good-looking room, really quiet, and the bed is really comfortable. All the staff are extremely friendly and helpful, especially the front desk and the doorman Christopher. Perfect stay overall! I’ll definitely come back again in the future.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Back again and loved it, thanks Christopher!","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"MOBILE","rating":5,"text":"Brilliant location, so central, lovely room and really great staff, special mention to Christopher who looked after us so well! We stayed at this hotel around 10 years ago and were very happy to return. Couldn’t be better for girls trip to NYC.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":80110,"title":"Kudos to Chris","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":5,"text":"I want to give a huge thank to Chris for helping us load the luggages on the car. He’s kind and friendly from the time we arrived to the point we were about to leave. All in all the service is great and people are patient to answer questions like which bagel shops do they recommend.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Good stay","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"MOBILE","rating":4,"text":"Good stay \nChris and all the gentlemen by the entrance were very polite and helpful. The cleaning staff are excellent. (Except from entering our room while we were sleeping even though we told them not to.) Very clean hotel. We were at 1020 and the smoke detector was flashing a bright light which was very disturbing at night. I’m sure it will be fixed. Overall, thank you for a good stay!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"AKA","lang":"en","publishedDate":"2024-03-10","publishedPlatform":"OTHER","rating":5,"text":"Comfortable and quiet hotel with options that meet all needs.  Large rooms offering good meeting spaces. The staff including Christopher were all extremely friendly. This is a well known group that does an excellent job. Highly recommend this hotel.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Nice, clean, well-designed hotel","lang":"en","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":4,"text":"AKA Nomad was a very nice, clean, well-designed hotel, our experience with their service was outstanding. The Guest Services Team was extremely attentive and even followed up with us after we checked out. I would definitely recommend this hotel to travelers in the city!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Great Midtown location","lang":"en","publishedDate":"2024-03-04","publishedPlatform":"OTHER","rating":3,"text":"Christopher was a great help! He was very attentive when it came to assisting us with our luggage and providing directions for any local restaurants. He always made sure to address us in a respectful manner. \n\nCons: Water ran cold during showers.","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":80110,"title":"My \"go-to\" NYC stay!","lang":"en","publishedDate":"2024-03-04","publishedPlatform":"OTHER","rating":5,"text":"I can't say enough amazing things about this hotel. This was my second time there, and it has definitely become my \"go-to\" location for a stay in NYC.\nI don't usually call out staff by name, but when I arrived, Leana at check-in is exactly the front desk ambassador that every hotel needs. And the door man Christopher was happy, welcoming, and a charming first impression.\nThe location of this hotel is fantastic, an easy walk to everywhere I needed to go. The room was clean, a great size, and had little touches (like your personalized welcome page on the TV and QR room controls) that put this hotel one step above.\nEven my 5am Sunday departure to the airport was met with cheery staff helpful to get me on my way.\nEvery chance I get I will come to this hotel - great price, great room, great staff, great vibe.\nThanks for a great stay!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Excellent all the way around","lang":"en","publishedDate":"2024-02-24","publishedPlatform":"OTHER","rating":5,"text":"Honestly, one of the nicest hotels I’ve ever stayed at. Location is prime, flatiron district next to tons of restaurants, shopping and a 6 train stop. We were able to get the one queen balcony room with a bathtub on the 16th floor. Very cool that they were able to accommodate our requests. Door guys Christopher and Ian were great.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"AKA Nomad Stay","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"OTHER","rating":5,"text":"Our suite was so clean and the bed was very comfortable. The fitness room, though small, had all the necessities. Staff came around frequently to assure we had all that we needed from more towels to refilling the mini bar. All staff was wonderful and friendly especially the doorman Chris.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Great Stay","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"OTHER","rating":5,"text":"Hotel aka NoMad had very friendly staff the entire weekend. Chris was an excellent additional hand whenever his services were needed. The entire staff were accommodating to whatever we requested.  I recommend staying at hotel aka nomad whenever staying in NYC.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"\"Excellent service overall. The rooms were spotless and well-maintained. Jonah and Cris went above and beyond to ensure","lang":"en","publishedDate":"2024-02-12","publishedPlatform":"MOBILE","rating":5,"text":"Excellent service overall. The rooms were spotless and well-maintained. Jonah and Cris went above and beyond to ensure our stay was enjoyable, offering fantastic recommendations for activities and dining options in the area. Highly recommended!","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Friendly staff, cool architecture","lang":"en","publishedDate":"2024-02-12","publishedPlatform":"OTHER","rating":5,"text":"Great little boutique hotel in the Nomad area of NYC. The staff was the most polite and accommodating I’ve encountered in NYC. We really appreciated the doorman Chris. He gave us good restaurant recommendations and in general provided excellent service.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Great stay - no complaints","lang":"en","publishedDate":"2024-02-09","publishedPlatform":"OTHER","rating":5,"text":"It was a great stay. Very clean and personable staff that attended to our requests in a timely manner. Would come again in the future. \n\nChristopher especially was very kind and attentive. \n\nThe only thing might be the walls are a little on the thin side, but nothing out of the ordinary compared to other hotel experiences.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"An awesome 7 day stay - perfect spot","lang":"en","publishedDate":"2024-02-07","publishedPlatform":"OTHER","rating":5,"text":"AKA - is simply superb. A real value for money spot with incredible design. I absolutely loved my 7 day stay here - it is perfect for business as its centrally located , easy and quick access to rooms as its only 14 floors. The room itself was well designed , serene and has quality finishes and the balcony view of the Empire State Bldg was incredible. I have stayed in a lot of NY hotels and definitely this will be my new regular one. Ofcourse there are grander hotels but if you are on a budget and want true value for money then this is it","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Excellent customer service","lang":"en","publishedDate":"2024-02-03","publishedPlatform":"MOBILE","rating":5,"text":"Great experience. The staff is very thoughtful and hospitable. My wife joined me for the weekend after I’d been working in NY for the week. The hotel team remembered that I mentioned our anniversary and they left a congratulatory note and pastries in our room. \n\nJohnny and Kunga made sure we had an excellent experience every time we were in the lobby. \n\nJohnny especially went above and beyond and arranged an airport ride for us at a flat rate. \n\nThe hotel location and rooms are great. But, the customer service is what keeps me coming back.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Great hotel in a great location","lang":"en","publishedDate":"2024-01-23","publishedPlatform":"OTHER","rating":5,"text":"Lovely hotel in a great location -- walking distance from Penn Station and multiple metro stops, as well as near interesting sights and lots of restaurants.   The staff are professional and helpful, the rooms spacious by NYC standards and the amenities are good.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"My great time at Aka NoMad","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"OTHER","rating":5,"text":"I have really enjoyed my time at Aka NoMad New York. The rooms were amazing the staff were incredibly nice especially both of the staff officers named Chris that both work in the afternoon\/night shift. They are extremely polite and they always have ensured that we always had the best time possible by giving us recommendations of places where to go and even having nice conversations with you about anything including the city of new york for new coming visitors. This hotel deserves even more credit than it already has.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"excellent hotel","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"OTHER","rating":5,"text":"I had a wonderful time staying in this hotel. The service was extraordinary.\nWe  had a blankie that got lost it was something very important for my child and they found it and send it back home!\n I will highly recommend staying in this hotel. Clean, well situated in the map and great service.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Disappearance!","lang":"pt","publishedDate":"2024-01-06","publishedPlatform":"OTHER","rating":2,"text":"The hotel has an excellent location and comfortable, airy rooms. However, I had a really annoying problem: one of my favorite pieces of clothing just went missing and the team says they didn't find anything.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Great hotel mid town ","lang":"en","publishedDate":"2024-01-05","publishedPlatform":"OTHER","rating":5,"text":"We stayed here as a family of 4 in the Christmas holiday period. We loved the people at the hotel (special mentioning is required for Blake, Jonah and Chris!) and we enjoyed the excellent location. Beds were comfortable. The family rooms we booked were not very spacious but that is to be expected for New York. We found the temperature in the rooms and the breakfast room way too high but apparently there is nothing that can be done about that.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Very nice hotel, very well located.","lang":"fr","publishedDate":"2024-01-01","publishedPlatform":"OTHER","rating":5,"text":"We have just had a very pleasant week-long stay at the Aka Nomad. It is a designer hotel, elegant, very comfortable room (small bathroom). No cleanliness issues. It is very well located, central in a quiet area. There is a bus station almost across the street from the hotel, the 6 subway station one block away, and 5th Avenue one block away. Point of improvement: expensive breakfast, with little savory choice in the formula at 29 dollars per person (no hot chocolate either). I recommend the Slate café right next to the hotel, which has lots of delicious choices and which opens from 8am. Lots of hotel guests meet there.\nToo bad the terrace is closed during this period. Hot chocolate offered between 1:30 p.m. and 3:30 p.m., a nice touch. The staff is attentive. We are already looking forward to coming back. I recommend the unlimited 7-day metrocard, which quickly pays for itself, and the entrance to the Met visitor parking lot, which is very little known (facing the Met, you have to go around the museum to the left, enter the parking lot and find the entrance on your RIGHT). Nathalie","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"First Rate Experience in NYC ","lang":"en","publishedDate":"2023-12-31","publishedPlatform":"OTHER","rating":5,"text":"I have nothing but wonderful things to say about our entire experience with AKA Nomad.  From the reservation experience, communication with the staff before arriving the wonderful location located just within walking distance of K-Town or my family and I love to enjoy the nightlife great shopping and great food. All of it was fantastic.  This is our first experience at this hotel, and this hotel chain in the world and I definitely would book this again in an upcoming trip to New York. The room had a lot of tiny little extras like bedside lamps and reading lights, espresso machines, refrigerator, upscale bathroom lighted closet just little things that make up a really grand experience.  It also felt tucked away enough on Madison Avenue that you weren’t hearing sirens and ambulances all night long as often can be my experience when staying in New York. The staff was very sweet accommodating, but not pushy caring but non-intrusive and the elevators are really fast and that always makes a difference. We splurged and had breakfast the first morning and we are so glad we did. The food was amazing. The staff was lovely and they sent us to our rooms with almond croissants. We will be back! Five Gold Stars. ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Great hotel and staff","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"MOBILE","rating":5,"text":"We had a lovely stay at the hotel. The rooms were large and very modern. The cleaning was a very high standard. Location was great  and pretty quiet at night noise wise at night.\n\nStaff were extremely friendly and always ready to help. Both Chris and Jonah ( Doorman) gave us fantastic recommendations for breakfasts . We tried 4 different places and all were brilliant.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Neat design, amazing staff and balcony with amazing views","lang":"en","publishedDate":"2023-12-25","publishedPlatform":"MOBILE","rating":4,"text":"Clean design, the room is spacious and comfortable. amazing staff and best location! I booked the room with a balcony and the rooms with balconies are totally amazing! such a rare thing to have this view outside your bed in the middle of manhattan.","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Warm and welcoming","lang":"en","publishedDate":"2023-12-23","publishedPlatform":"OTHER","rating":4,"text":"We had a lovely stay at hotel AKA Nomad. From the warm welcome by Doorman Chris to the smooth check in process, we felt right at home. The staff was accommodating and pleasant. At the end of our trip doorman Chris made sure we were taken care of till our Uber pulled away. All in all a delightful stay. ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Enjoyed the location of the Aka Nomad and the service too.","lang":"en","publishedDate":"2023-12-17","publishedPlatform":"MOBILE","rating":5,"text":"All we need in an NYC hotel. Modern, minimalist room with a great shower. The staff were quick to help us with anything that arose during our stay. The cocktails were first class at the small hotel bar. Doorman Christopher was very helpful even handed us an umbrella as we stepped out  in light sprinkles to grab a quick nightcap down the street. Highly recommend.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Disappointed because they continue to lie","lang":"en","publishedDate":"2023-12-17","publishedPlatform":"MOBILE","rating":1,"text":"Extremely disappointed will never be staying here again. We spoke to staff over the phone before arrival about having an early check in and was told different information upon arrival. We informed the hotel prior we would need early check in based on arriving early after an over night flight and having a service animal, we agreed that we would pay the $100 fee. However, the assistant manager at the desk was rude from the start of us entering the hotel, He was in a heated conversation with a guest who had requested an upgrade prior (also over the phone before arriving) which he was then denied & stated that would not be said over the phone. After helping him check in early, he then approached us stating “how can I help you if you want early check in it will be $300”. A $300 fee is more than a one night stay. We then asked what time can we expect a room, he could not provide us with a time as he stated the hotel is fully booked, however on their website it is not. So far very disappointed in the miscommunication from the hotel staff, main reason for selecting this hotel was the accommodations that were stated over the phone. They have requested we wait for our room with no other accommodations, we have been waiting in the hotel lobby for over 6 hours, with no update on when the room will be ready. We have asked multiple times for an update for time and none is provided. We have lost an entire day of our trip waiting for this hotel to attempt to accommodate its guests. Again, we spoke over he phone 24 hours prior and told there were plenty of rooms to accommodate us earlier.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"New Hidden Gem Hotel in NYC","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"OTHER","rating":5,"text":"We've stayed at AKA Rittenhouse in Philly many times, but this was our first stay at an AKA property in NYC and it won't be our last. The rooms were small but easily workable for my wife and I. It was a modern, newly renovated room, very very clean and COMFORTABLE. The bed was extremely comfortable. We are very picky about bed linens and they were high quality. The doormen Blake and TT were awesome. It was a very reasonable price as well, considering the high prices in NYC these days for decent hotel rooms. It was located at 31st and Madison was convenient for us. There are coffee makers in the room but a coffee shop a couple doors down that was quick and easy. Loved this place, will be back.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Nice service ","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"OTHER","rating":5,"text":"TT’s service was great .he helped us to get the cab and very friendly . Will recommend this hotel 🏨 to everyone it’s a great location near emptier state       It’s worth staying near mid town in this hotel ","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Hotel AKA NoMad ","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"OTHER","rating":4,"text":"Hotel AKA is a good standard 4 star hotel in a great location. The bathroom is slightly impractical that would be my only criticism. A special shout-out to Titi and Blake who were amazing and made the experience extra special. Jonny at night was also super friendly. ","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Great experience ","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"OTHER","rating":5,"text":"I had a great stay. My room was very quiet. There were plenty of quick food delivery options despite a great bar and lounge with small bites downstairs.  Service was wonderful, especially from the front door attendants and room attendants. Blake was awesome!","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"December perfection ","lang":"en","publishedDate":"2023-12-11","publishedPlatform":"OTHER","rating":5,"text":"The reviews were correct about the friendliness of the staff and that made the trip very nice. The doormen and front desk staff were wonderful. \nThe location is perfect and just around the corner from a subway stop and easy access  to uptown East side, so close to midtown activities, and lower Manhattan too. Highly recommend!!\nRooms were clean and tidy feeling, very nice coffee bar that was restocked daily, and the bedding was perfect- plump pillows and crisp white linen duvet and soft sheets for a perfect sleep. \nThe bathroom was beautifully decorated, but sadly just too small with not having a sink with counter space for toiletries. My only complaint is a wish for a larger bathroom space and a thermostat in the room that could be adjusted below 70 degrees, because even in winter, the room was not cool enough. We just opened the window for cooler air to let in.(not something you could do in the summer).\nWe bought a few bottles of wine to enjoy with friends coming into town and we sat in the lobby seating and the front office staff were very accommodating providing us with wine glasses for a relaxing visit. \nThe four of us family shared the room and it was a lovely stay. \n","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Great spot with wonderful service!","lang":"en","publishedDate":"2023-12-10","publishedPlatform":"MOBILE","rating":5,"text":"This was a fantastic boutique hotel in a great location. Service was impeccable. I needed help getting a last minute breakfast recommendation and reservation and they really came through. Special mention to T.T. who really came through with this and assisting with taxi\/Uber recommendations, timings to make sure I get to where I need to be and recommending great dining spots for this short stay. Service goes a long way and you get that here!","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Wonderful stay","lang":"en","publishedDate":"2023-12-07","publishedPlatform":"OTHER","rating":5,"text":"The hotel was clean, safe and had very comfortable accommodations. The front desk staff went above and beyond while I was there, brought me a hand written welcome note with macaroons and extra water, watched my luggage after I checked out, and even helped me get back to the train in time to get home. Everyone was very nice and the hotel was beautiful!! ","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Wonderful First Hotel Stay","lang":"en","publishedDate":"2023-12-01","publishedPlatform":"OTHER","rating":5,"text":"I had such a wonderful experience during my recent stay. Everyone from the doormen  to the front desk and management were all very accommodating and provided exceptional service.\n\nLourdes, the manager was so nice and took the time to address my needs and even gave me a personal tour of the hotel. \n\nChristopher, the doorman welcome me when I entered the hotel for the first time and welcomed me with a big senile and was so nice and engaging. \n\nAngel at the front desk was welcoming and considerate.  \n\nGeorge who is the hotel’s engineer was also very nice and quick to address my needs. \n\nT.T. was the doorman when I left the hotel and was also very nice and engaging. \n\nI have forgotten the names of all the front desk employees and doormen I crossed paths with  because I would mention everyone’s name at the hotel because they were all so nice and welcoming. \n\nI will definitely be back. The hotel was clean, modern,  comfortable and a great location. \n","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Chic comfortable hotel ","lang":"en","publishedDate":"2023-12-01","publishedPlatform":"OTHER","rating":5,"text":"Hotel AKA Nomad is a chic small hotel. The location is excellent, so many walkable locations nearby. The hotel is small and personal with a mellow vibe. The rooms are roomy enough and are well appointed and well decorated. The staff are kind and helpful. I highly recommend AKA Nomad for a stay in NYC ","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Amazing Team, Beautiful Hotel","lang":"en","publishedDate":"2023-11-28","publishedPlatform":"OTHER","rating":5,"text":"The hotel is great, but the staff will make you happy you chose this hotel. From the door men, front desk, breakfast wait staff, bartenders, to the cleaning crew, they're so kind & go out of their way to make your stay comfortable & pleasant. The door man literally ran across the street to get my luggage when the taxi driver dropped my on the wrong side.\n\nMy room was a generous size for NYC. I loved the snacks, Nespresso, & free waters. The new decor is beautiful, modern, albeit a bit dark. Bed was comfy, great shower. The lighting in the bathroom is my only wish for improvement. I'd definitely stay at the AKA Nomad again. ","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Lovely stay","lang":"en","publishedDate":"2023-11-26","publishedPlatform":"OTHER","rating":5,"text":"TT took great care of our family with excellent restaurant recommendations and set up a car for our return to the airport.\n\nHotel was very clean, quiet-no long waits for elevator, close to midtown activities.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Amazing Stay in NYC","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"MOBILE","rating":5,"text":"A big thank you to the AKA hotel doormen for exceptional service and a warm welcome during my stay. Their professionalism added to the overall positive experience.  \n\nIncredible housekeeping staff with one of the cleanest and loveliest rooms in Manhattan.\n\nHave a relaxing breakfast and enjoy warm hospitality from the restaurant staff. The food options are great too!","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Great Team at AKA NOMAD ","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"OTHER","rating":5,"text":"A big thank you to the AKA hotel doormen for exceptional service and a warm welcome during my stay. Their professionalism added to the overall positive experience. They are always there to assist with a gracious smile!","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Hotel was fine, Blake’s energy for helping everyone made it memorable. ","lang":"en","publishedDate":"2023-11-09","publishedPlatform":"OTHER","rating":4,"text":"Blake at the front door is an incredible asset to this hotel. The front desk help is also great. Was up late working on a project and front desk helped me out with printing an outline at 3am. The rooms are clean but small. Excellent location near Madison Square Park. ","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Thank you, Blake, Christopher and Andy!","lang":"en","publishedDate":"2023-11-09","publishedPlatform":"OTHER","rating":5,"text":"Hotel AKA Nomad was by far one my best stays in NY. While the space is beautiful and they’ve found a great way to accentuate a smaller room space, it was the kindness of the staff that made my stay exceptional. In particular, Blake, Christopher and Andy! These three gentlemen exceeded my expectations of customer service and they went above and beyond to make sure I had everything I needed during my stay. When coming to NY for business, the days can be long  and sometimes tough, but a smile and a kind word can make a big difference. I appreciate them.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Hotel AKA Nomad. ","lang":"en","publishedDate":"2023-11-08","publishedPlatform":"OTHER","rating":5,"text":"We visited hotel aka nomads the last week of October for my 40th birthday. The hotel was absolutely gorgeous the vibe was classy & elegant & the room was  amazing, very clean with coffee maker & small fridge. bathroom was tiny but we managed. The whole staff were very helpful & super nice, especially Leana & T.T.,  Leana was at the front desk she made sure to get us the room with a beautiful view since it was my 40th birthday 🥳 & we were staying for a week , it was so sweet of her & T.T. The Doorman\/Bellman was amazing he was very helpful & super sweet we really appreciated all of his help... The location of the hotel was just perfect close to time square, Korea town , fifth ave , flat iron building, lots of restaurants & much more ! we will definitely be back!  we’re already planning the next trip. I just want to especially thank Leana & T.T.  Again for the great experience. You made our family vacation very special…","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"There are some really nice people in NYC....just go to this hotel and find out!","lang":"en","publishedDate":"2023-11-06","publishedPlatform":"OTHER","rating":5,"text":"Excellent, friendly service. So very refreshing!!! The doorman was extremely accommodating. The bartender was kind and served a good poor. The receptionist was helpful. The room was clean and comfortable.  It was our first time at this hotel, but it won't be our last. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Great weekend! ","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"Ian the doorman was super helpful for us all weekend. Helping with bags, organizing rides for us. Hotel was clean & a great central location for our weekend. Looking forward to return again. Hotel bar staff was also great! ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Fantastic","lang":"en","publishedDate":"2023-11-03","publishedPlatform":"OTHER","rating":5,"text":"Spent bit more than a week at the hotel and had a fantastic time. The location is great and the pictures online arent as great as the hotel is when you visit. \n\nThe crew was amazingly friendly.. cleaning crew was very considerate and thoughtful, making me feel like home.\nCant forget the nice tips our dutch receptionist was giving us , very helpful!!! \n\nNew York City is a beautiful and busy town but time seems to stop inside the hotel and we werent bothered from the citys traffic and noise. \n\nIn conclusion Johnny and Mr titi at the door always made my day with a smile and their kindness .. Will definately be back soon , suggest same 100% !","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Excellent value, room size and location in NYC","lang":"en","publishedDate":"2023-11-02","publishedPlatform":"OTHER","rating":5,"text":"Really perfect location to get anywhere in NY easily. Staff was so helpful and warm. The room was spotless clean and certainly larger than my other experiences. Plenty of coffee and tea in the room so I didn’t have to rush downstairs in the morning. I highly recommend and will return. ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"T.T. Is great!","lang":"en","publishedDate":"2023-10-29","publishedPlatform":"OTHER","rating":4,"text":"T.T. And Ian were fantastic. They helped make my stay comfortable. They were helpful finding me and my friends reliable transportation around NY. T.T. was really attentive.\n\nThey charge you $100 for an early check in, which seems excessive. Most “luxury hotels” provide that service for free based on availability. ","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":80110,"title":"A great hotel and excellent service","lang":"en","publishedDate":"2023-10-29","publishedPlatform":"OTHER","rating":5,"text":"A fantastic experience from start to finish. Friendly and helpful staff who are always willing to go the extra mile to ensure your comfort. Special thanks to doormen and bellman, T.T and Ian. And front desk Andy for their great service.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Vittoria ","lang":"en","publishedDate":"2023-10-29","publishedPlatform":"OTHER","rating":5,"text":"TT and Ian really looked after us and made us feel welcome every time we would leave or arrive after a long day out - they made our week long stay special! Also all l the cleaners have been super nice and respectful of our space ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"A really great experience ","lang":"en","publishedDate":"2023-10-28","publishedPlatform":"OTHER","rating":5,"text":"Wonderful design hotel and warm atmosphere, optimal location in midtown east, perfect for any kind of activity in the big apple! Great aperitivo time in a sophisticated mood.\nAn place to come back soon!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Fantastic Boutique Design Hotel in the heart of Manhattan","lang":"en","publishedDate":"2023-10-23","publishedPlatform":"MOBILE","rating":5,"text":"I really like the AKA Nomad. The hotel is new. The Design is sophisticated and elegant. The rooms are bigger than the standard NYC rooms, that is a big plus.\n\nThe staff is super nice. Everyone is truly amazing and always trying to make you feel at home. I have been here 8 times now, and I always check in at night. J.W., that covers the reception at night, has always been super helpful and great in accommodating my requests!\n\nThe bar area at night is small but super cool!\nThe breakfast on the mezzanine floor is superlative. And worth to mention also the beautiful circular metal stair that leads from the lobby to the mezzanine: that makes your experience even better… like you walk on a set of a movie.\n\nGreat hotel, great location and great people!\n\nI would recommend it to everyone!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Spacious room with a proactive staff members ","lang":"en","publishedDate":"2023-10-20","publishedPlatform":"OTHER","rating":4,"text":"My experience at the hotel was nothing short of excellent. Two main reasons: (1) Spacious rooms: for a hotel room in NewYork it was pretty big\n(2) Excellent staff service: quick and nimble staff (Leana was very friendly and helpful)","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"GREATNESS","lang":"en","publishedDate":"2023-10-20","publishedPlatform":"OTHER","rating":5,"text":"From start to finish... Julia and Rebecca helped us with the travel for our large group... PERFECTION... The space was incredible... The rooms were exquisite. Couldnt have been happier...Was beyond impressed!!!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Fantastic Stay in NoMad","lang":"en","publishedDate":"2023-10-16","publishedPlatform":"OTHER","rating":5,"text":"Fantastic property, it’s new and incredibly clean and chic design. Rooms are well thought out, spacious, great toiletries and amenities. Location is central and the team is welcoming, kind and accommodating.","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Phenomenon Experience","lang":"en","publishedDate":"2023-10-13","publishedPlatform":"OTHER","rating":5,"text":"My experience was phenomenal from start to finish. Everyone was so friendly and accommodating. I felt welcomed as even before I stepped through the door, Johnny & Tam were amazing, offering restaurant recommendations, hailing cabs to make sure I had what I needed in a timely manner. Joselyn and Leana gave amazing recommendations for nightlife and restaurants. I travel often and my experience at AKA Nomad was among my top travel experiences. The room has a warm and elegant, yet functional layout with a very comfortable bed. The shower offered dual rain\/personal sprayer options that created a hot steam room atmosphere in the bathroom. Several beverages options were available including Rishi teas and Nespresso, all delicious. The only thing I would have like to see was an iron w\/ironing board in the room or at least access to more than just a steamer. There was an iron available on site, but another guest was using it so I had to do my presentation at NYU a little more wrinkled that I had hoped, but all in all.., Thank you team AKA Nomad, you made my trip to NYC unforgettable! ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Amazing AKA Nomad Staff","lang":"en","publishedDate":"2023-10-13","publishedPlatform":"OTHER","rating":5,"text":"From the moment I arrived, the staff at AKA Nomad were so welcoming and accommodating.  I felt like I was being welcomed by family.  Especially TT, JW, and Urins.  The hotel itself is absolutely stunning, chic and stylish and in an amazing location.  I highly recommend you check it out.  Thank you to all at AKA for a fabulous stay!!!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Beautiful hotel","lang":"en","publishedDate":"2023-10-13","publishedPlatform":"OTHER","rating":5,"text":"Had a great stay here. The rooms are a good size for NY and housekeeping came everyday to fix my room. My only complaint about the rooms is not enough lighting in the bathroom. \n\nEveryone at the hotel was so kind and helpful for anything I needed. Special thanks to T.T. for helping me get situated with a taxi on my way out:)","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"My Hotel AKA experience","lang":"en","publishedDate":"2023-10-10","publishedPlatform":"MOBILE","rating":5,"text":"I stay at Hotel AKA Nomad every time I’m in New York City. It’s a very welcoming experience with wonderful amenities and high attention to details. The team at the hotel is exceptional - friendly and familiar. I wholeheartedly recommend it!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":80110,"title":"Bad Service","lang":"en","publishedDate":"2023-10-10","publishedPlatform":"OTHER","rating":1,"text":"The service was very bad. My credit card and those of my companions were wrongly charged in an abusive manner. The people at the reception desk are quite bad-informed about the requirements for cancellation of erroneous transactions. I do not recommend anyone to stay at this hotel. You cannot trust it.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Friendly staff!","lang":"en","publishedDate":"2023-10-08","publishedPlatform":"OTHER","rating":5,"text":"I stayed at AKA Nomad in September of this year for business travels and had an absolutely outstanding experience. Great hotel, very clean, nice bar and staff was very friendly - especially JW. Would highly recommend!","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Great new hotel find in nyc! ","lang":"en","publishedDate":"2023-10-08","publishedPlatform":"OTHER","rating":5,"text":"The hotel is clean and in a central area! The rooms are a great size too and are modern feeling.  Jorge at the front desk was the absolute best. He was so kind, professional and accommodating and greets you with a smile! The entire staff at this hotel could not have been nicer. You also have breakfast available in the morning, which was a huge plus!  I will definitely be staying again! ","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Very attentive service - great door staff (T.T.!)","lang":"en","publishedDate":"2023-10-08","publishedPlatform":"MOBILE","rating":4,"text":"Clean rooms and great location. Close to the shows, sites, and restaurants we wanted to visit without being in the middle of noise. Note: it took a long time to get hot water in our room on 11th floor, but staff were responsive in helping fix it. \nA special note of appreciation to T.T., a doorman at aka Nomad. He greeted us warmly when we were coming and going, offering an umbrella or advice about travel. He knew what activities were happening in the city that might impact our plans to get from one location to the next. He recognized us when we approached the hotel and always had a smile. Great guy! And, he helped us save a lot of money when Uber prices to the airport were nearly $100. If you stay here, enjoy a chat with T.T.","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":80110,"title":"excellent stay at aka nomad","lang":"en","publishedDate":"2023-10-05","publishedPlatform":"OTHER","rating":5,"text":"the entire staff was amazing...J.W. T.T. & all were great & helpful...will definitely be my new york place of choice to stay in the future...thanks to all my new friends at aka nomad...look forward to my return....","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Very good value for money","lang":"en","publishedDate":"2023-10-05","publishedPlatform":"OTHER","rating":4,"text":"I loved the location. Room was nice... staff was friendly... they have the best doormen and bellmen.... IAN and TT... much appreciated.\nThe only thing is the breakfast, which is Ok, but should be improved a little...\n\nPeter Muller","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Chic spot to stay in Nomad!","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"OTHER","rating":5,"text":"The staff at the AKA Nomad went out of their way to provide a superior experience for us. The hotel, which is sleek, modern and chic, is well situated within walking distance of midtown, nomad, soho, east and west village and has many great restaurants and cafes in the area. The hotel is small enough so that you feel like a valued guest and offers great amenities and services. We will definitely return to AKA Nomad!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Stay at Hotel AKA Nomad NYC","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"MOBILE","rating":5,"text":"We had an extremely pleasant stay at the Hotel AKA Nomad. We had a premium  Nomad suite with views of Madison Av and E. 31 St. The decor was modern and both the bed and living room couch were comfortable and cozy. The staff was pleasant and friendly and helped ensure our stay was perfect. Kudos to all!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Exceptional Hotel in the middle of Manhattan","lang":"en","publishedDate":"2023-09-29","publishedPlatform":"OTHER","rating":5,"text":"Fantastic Hotel, one of the best stays in NY. Clean, Spacious and the team is incredibly helpful and friendly! Big shoutout to all the team (Lisa, Angel, Jorge, Ardita, Leana and T.T and Ian) - the location is perfect for anyone visiting as it is close to so many eating spots and amenities! I stayed for one month and it was home away from home! The rooms are some of the best available on NY, modern, clean and airy! The beds are very comfortable and the bathrooms are great! I highly recommend this hotel after I have stayed in many hotels around NY, you won’t be disappointed! ","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":80110,"title":"Great Vibe but otherwise disappointing","lang":"en","publishedDate":"2023-09-25","publishedPlatform":"OTHER","rating":2,"text":"I never write negative reviews but was so disappointed that I had to warn others. We have stayed there many times over the years under different names: the Roger Williamson, the Roger, etc and were always content. This newest brand, AKA Nomad, has a very chic vibe but the practical parts are missing. The bathroom was so dark that it was impossible to see to apply makeup and contact lenses; with no fan, it steamed up; the rain head shower with small partition flooded the entire bath floor. It would have been nice to have luggage stand instead of putting luggage on the floor, some plugs other than between beds (isn’t that electrical code?), to have our mini bar and coffee dishes replenished and with clean dishes. During our three night stay, dirty dishes from prior guest were never removed or replaced (finally I put them out in the hall on day 3) and our minibar never replenished. We alerted the management numerous times but they never responded (except for more towels so each of us would have a towel after 3rd try). They charged us more on our credit card than our bill reflects so I will need to battle for that refund next. Won’t be back.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Solid stay in midtown","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":4,"text":"My room was very quiet with a comfy bed and all the amenities I needed. Hallways and elevator are quite dark so that’s not ideal for some people. I had a nice mocktail and a snack at the bar, and the bartenders were lovely.\n\nThey should offer free coffee in the lobby and a la cart items for breakfast. Otherwise, a very pleasant stay. ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Good choice in a noisy city as New York, very quiet place","lang":"en","publishedDate":"2023-09-06","publishedPlatform":"OTHER","rating":5,"text":"I liked the ubication a quiet place in Manhattan, the bed very confortable and the people very kind.\nA modern decoration and a good location to stay in Manhattan. I felt very Welcome by the people attending the hotel","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Most disappointing hotel in NYC- poor customer service","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":1,"text":"Rarely do I write negative reviews, but our experience at this hotel compels me to share. Upon check-in, valet parked our car, and while it was in their possession, it received a $115 parking ticket. Astonishingly, the hotel tried to shift blame onto us, stating that our expired inspection caused the ticket. However, the ticket, clearly marked as a PARKING ticket, was for their valet spot, not vehicle-related. Despite this, the hotel repeatedly bothered us about the ticket, even calling us at 9 pm. The next day, they claimed we asked to attach the ticket to our reservation, which we never did. Our attempts to resolve the situation were met with poor customer service. The hotel did  nothing to rectify the situation, made no attempts to enhance our stay, despite this inconvenience. While the hotel was clean, the disappointing customer service overshadowed everything. Only at checkout, after multiple confrontations, did the hotel reluctantly offer an apology, yet they again referred to our inspection and still wasn’t clear if they were going to take care of the parking ticket. This experience left a negative impression on our entire trip. Given the numerous fine hotels in NYC, I recommend exploring alternatives that provide superior service. In a city where hotels can make or break a stay, this one fell far short of expectations. I hope upper management reviews this and think about how they can provide better customer service for future patrons.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Overwhelming","lang":"en","publishedDate":"2023-08-20","publishedPlatform":"MOBILE","rating":5,"text":"Such a beautiful hotel with great service.  Titi and George are so kind. I’ll come again for sure\nThe room is outstanding \nAll the amenities are great\nNew Coffee machine \nThe location is amazing\nWe are very happy with the choice\n…………………………………………………………","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Made my 35th birthday amazing!!!!!","lang":"en","publishedDate":"2023-08-08","publishedPlatform":"OTHER","rating":5,"text":"I would give this hotel 10 stars if I could. I booked the hotel on the MegaBus from Philly to New York. It was a reasonable price for my one-night stay for my birthday. Within 30 minutes of booking the hotel I had received an email asking about any special accommodations. I let know them know it was my birthday. They wished me a happy birthday.  The hotel was 10 minutes from the Mega Bus stop. When we walked in it was beautiful. Nice and clean, modern. The hotel concierge was amazing polite and very helpful.     When we checked -in it was fast and easy.  No surprise charges. Just basic hotel fees hold for damages. We received our keys and went to the room. The room had a king size bed with a beautiful bathroom. Nice mirror and was the perfect size for 2 people. To my surprise there was a card from the hotel with amazing chocolates and water from my birthday.  I love how accommodating everyone was and just wanted us to be comfortable. Like example, There was an  umbella in our closet just case in rain and a bunch more at the front door. \nI love this place. The location is walking distance from times square. The most important part was the staff. Their positive energy made me want to come over and over again. ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Hidden gem","lang":"en","publishedDate":"2023-08-04","publishedPlatform":"OTHER","rating":5,"text":"Hotel AKA NoMad is a hidden gem tucked away in a quieter corner of midtown. I stayed here for a week with a large group for a work trip. I really loved walking back from my office each day and getting to relax in this hotel. Everyone at Hotel AKA NoMad-- especially Ian, Ardita, and Lourdes-- was so professional, accommodating, and did everything they could to make our stay an excellent one. The level of service and attention they pay to guests was definitely a five star experience. I highly recommend!","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Great place to stay in NYC","lang":"en","publishedDate":"2023-07-28","publishedPlatform":"OTHER","rating":5,"text":"AKA NoMad is top notch!  My family and I spent 3 nights here for a quick visit following our cruise to celebrate my eldests graduation.  The room are very well equipped and the showers are superb following a long day of touring this great city!  The hotel is new and they are continuing to enhance with a new gym, entrance and modern elevators coming.  If your looking for a place to stay in NYC give AKA NoMad a stop.  \nBe sure you ask for Ian he is a true professional, very friendly and extremely helpful.  Appreciate all of your insight and assistance during our trip Ian.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":80110,"title":"Brand New but tiny rooms with low ceilings!","lang":"en","publishedDate":"2023-07-22","publishedPlatform":"OTHER","rating":3,"text":"Very cute brand new boutique hotel but the rooms are tiny and have very low ceilings. We stayed in room 1603 on the penthouse floor and booked an empire state terrace view. It seems like the building used to be an apartment building and only the interior was renovated. The view was great, other than that the room was mediocre, nothing special. Pro tip- if you’re having difficulty finding the button to turn of the strip light on the dresser, the button is behind the coffee machine and teapot. Balcony net door fell off its hinges when we tried to open it. Netflix turned off and wouldn’t turn back on halfway through a movie. And a huge cockroach crawled up on me when we were sitting on a terrace late in the evening. So there is definitely room for improvement. Staff was very nice both at the front desk, restaurant and the doorman.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"Elegant, updated, well-appointed, clean, friendly, and efficient.","lang":"en","publishedDate":"2023-07-15","publishedPlatform":"MOBILE","rating":5,"text":"Wonderful hotel in every way: clean, updated, elegant, friendly efficient service, and comfortable room, especially the mattress.  Having requested a room on a higher floor, and figuring that mentioning my 60th birthday might help, we were upgraded to a balcony room with views of the Empire State Building, and greeted by a cake, flowers, and a personalized card.  Meanwhile I needn’t have worried about the floor level as the rooms seem well insulated. The bar is lovely and perfect for a nightcap after an evening out.   Literally every member of the staff greeted us with a genuine smile every time we entered the building or had a request (which was honestly only once bc everything is so well organized). All in all, the perfect spot for a 60th birthday visit to NYC.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":80110,"title":"A Midtown Oasis","lang":"en","publishedDate":"2023-07-13","publishedPlatform":"OTHER","rating":5,"text":"The AKA NoMad is sleek, sophisticated, elegant and welcoming; all without pretense.  The staff was friendly and attentive to any needs, questions or requests. I highly recommend it for anyone looking to stay in midtown Manhattan.  I look forward to my next stay.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"AKA NOMAD ","lang":"en","publishedDate":"2023-07-05","publishedPlatform":"OTHER","rating":5,"text":"I have stayed at hundreds of hotels. AKA NOMAD is on the top of the list of best stays\/experiences ever. Staff was very hospitable and there for every need of mine. Special thanks to the housekeeping staff as well as the doorman. Thank you so much.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":80110,"title":"Loved our stay!","lang":"en","publishedDate":"2023-05-29","publishedPlatform":"OTHER","rating":5,"text":"Stayed at the Hotel AKA Nomad during the soft opening and it was a great stay! The hotel is beautifully done. The rooms are spacious and have everything we needed to have a wonderful stay. The breakfast and cheese\/wine hour were a great bonus! The hotel is located in a great location and everything is an easy walk from the hotel.  The hotel staff was the best and by far the best set of staff we have encountered in NY. Everyone was extremely nice, friendly and so helpful! Even though the hotel wasn’t fully open (the bar area was still being finished) we had an amazing stay and will be back! ","travelDate":"2023-05","tripType":"COUPLES"}
