{"helpfulVotes":0,"locationId":17762159,"title":"Nice hotel in a good location","lang":"en","publishedDate":"2024-04-13","publishedPlatform":"MOBILE","rating":5,"text":"Super cute hotel in midtown with a great location and a funky design. Rooms are small but that is normal for NYC. Rooms were wuiet enough. And the hotel staff was very kind and helped with whatever we needed: I would definitely stay here again.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great stay","lang":"en","publishedDate":"2024-03-25","publishedPlatform":"OTHER","rating":4,"text":"Everything was great about this hotel. The staff are friendly and are sure to see your stay went well. Good location, clean and the rooms were nice. \n\nDidn't stay long or get to use much of the other services but I would easily book here again. May not be one of the top Hyatt Centics and falls more in line of a Hyatt Place but otherwise it's a fine hotel.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"OTHER","rating":5,"text":"Spent the weekend in NYC with friends and for the NYC half marathon.  The hotel is in a great location and close to Times Square.  The staff was friendly and helpful throughout our entire stay.  The rooms are small but typical for NYC.  The bed was too soft for my liking.  The bathrooms could use better lighting.  Overall, had a great time and would definitely stay here again the next time I visit NYC.","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"horrible","lang":"en","publishedDate":"2024-03-14","publishedPlatform":"OTHER","rating":1,"text":"When we arrived at the hotel, they asked for a $600 deposit. We questioned this and they agreed to only take a $100 deposit. However, the next day they made a second transaction of $500 without our authorization. Due to this issue and the limited breakfast options, we have decided to avoid staying at this hotel in the future. The staff also seemed to be untruthful, which is why we would not recommend this hotel to anyone.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Ignore the negative reviews and book this hotel!","lang":"en","publishedDate":"2024-03-13","publishedPlatform":"MOBILE","rating":3,"text":"Was in two minds about booking this hotel however what I can say is book the hotel ignore the bad reviews. Upon check in we got a free room upgrade , we were also given water for our room free of charge, we were asked if we would need to get a taxi back to the airport upon check out all working less than five mins. After a long day of travelling that is just what you need quick and efficient service. All staff members are pleasant , friendly and helpful. The location of the hotel is nice you have shopping around but it is a little more quick than the busiest parts of the city making it a nice place for relaxation while not missing out on the city activities as everything is really close by. Train stations are within walking distance and just a short walk down is a lot of restaurants and stores. The rooms are well equipped with additional lighting should you requireore lighting , the bed we super comfortable and the bathroom was modern and clean.Thank you Hyatt Centric.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":5,"text":"This was our second visit to New York and we really enjoyed our visit at this outstanding hotel. \nThe hotel is in a great location with plenty of things to do within easy walking distance so no need to use taxis or subway to enjoy your trip.\nWe will definitely be staying here next time we visit.","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Go for it !","lang":"fr","publishedDate":"2024-03-05","publishedPlatform":"MOBILE","rating":5,"text":"Location-wise it's perfect, literally 100m from 5th Avenue, 10min walk from Times Square, 15min from the Empire State Building, 10min from Grand Central Station.\n\nOn the hotel side, nothing to say, cleanliness is essential, room service comes every day and changes all the towels.\nThe reception is attentive to our expectations.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"Worst stay in a Hyatt Hotel","lang":"en","publishedDate":"2024-02-28","publishedPlatform":"OTHER","rating":1,"text":"Stayed in most Hyatt properties in NY and this is by far the worst, Dark depressing room, with a very poor view, could not tell who was a staff member or the public. Noisey room, woke up in the early house people running around the corridor. Moved rooms 4 times, Lift noise, Noise out side, would not return to this hotel and suprised its in the Hyatt hotel chain","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location! Clean and comfortable","lang":"en","publishedDate":"2024-02-14","publishedPlatform":"OTHER","rating":5,"text":"Lovely hotel right beside everything was within walking distance to Times Square,Grand Central, Empire State, Vanderbilt! Not too far to Central Park either! Street location felt safe a little loud at night with sirens etc but not the hotels fault and also you’re in NYC!! Beds were super comfy, room was really clean plus the hairdryer was really good which from experience can be a gamble not bringing your own! Only con we had requested an earlier check in which maybe due to availability wasn’t granted , the room wasn’t ready when we arrived they said they would text when the room was ready so we went for a ramble for a few hours and had to go back and ask if the room was ready yet which it didn’t seem it was so we were given someone else’s room who hadn’t arrived yet but it gave us more time to explore the city! The air con was a bit noisy but after all the walking during the day we slept through it! Didn’t use the restaurant but seemed busy all the time went to the rooftop bar service was excellent drinks a little pricey but to be expected! Would stay again!  ","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great choice!","lang":"en","publishedDate":"2024-02-13","publishedPlatform":"OTHER","rating":5,"text":"The location of the hotel is wonderful, and the hotel is excellent.  Great service and very clean.  The attached restaurant was delicious. I really enjoyed the rooftop bar!  Quite the view of the Empire State Building.  I would stay here again.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Choose elsewhere","lang":"en","publishedDate":"2024-02-12","publishedPlatform":"OTHER","rating":1,"text":"A poor Hyatt experience.  Front desk told me that the restaurant on site has 'nothing to do with the hotel and is under separate owners'. No room service as advertised. No snacks\/mini-bar. If wanting to stay in the Hyatt family choose the Grayson hotel (rated a category lower by Hyatt, but much better than this Category 6)-  I had a much better experience there on a prior trip. ","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"New York New York","lang":"de","publishedDate":"2024-02-05","publishedPlatform":"OTHER","rating":4,"text":"Great location for a city trip. Almost everything is accessible on foot or by subway or bus: Broadway, museums and much more. The hotel leaves a modern and clean impression; appears to have been recently renovated. Spacious rooms and large shower for NY standards.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Extended stay in New York","lang":"pt","publishedDate":"2024-01-14","publishedPlatform":"OTHER","rating":5,"text":"Hotel with excellent facilities and great service, close to everything we like in New York. I highly recommend it. We spent 10 wonderful days at this hotel. We stayed in the room with two very comfortable beds.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"The location is great.","lang":"en","publishedDate":"2024-01-14","publishedPlatform":"OTHER","rating":4,"text":"Locations is great! Theres a lot of restaurants near by and walking distance to main attractions. Also, close to the train station. Its about a 15-20 minute walk to time square. The rooms are small but nice. ","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent hotel in great location","lang":"en","publishedDate":"2024-01-13","publishedPlatform":"OTHER","rating":5,"text":"From the moment of arrival, staff were friendly and welcoming (as well as every time we passed by reception).  Lifts were speedy, rooms well appointed and beautifully decorated and the hotel has a wonderfully central location.  I just wish I had known about the fabulous views from the rooftop bar earlier!!!  I will return!","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Recommend - Great Experience ","lang":"en","publishedDate":"2024-01-08","publishedPlatform":"OTHER","rating":4,"text":"We stayed here for 10 days over the Christmas\/New Year period.  Overall it was a great hotel, easy walking distance to lots of attractions, Empire State, Time Square, Rockefeller etc.  Bryant Park was very close, we always felt safe walking to and from the hotel. Our room had a great view of the Empire State Building, magnificent!  The room was very quiet from any outside noise however a few times we our neighbours came home late annd they were noisy, we thought they were in our room!  The rest of the time no problem.  The air con is very loud but offset by the large room and separate toilet in the bathroom.  We were told at check in our room would be serviced on request however it was serviced daily.  Elevators were fast and we rarely had anyone else in the lift with us.  The rooftop bar was incredible, only had a drink here no food. Overall we recommend this hotel, especially good for first timers like us.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Vulgarization of an exquisite \"glamour\"","lang":"es","publishedDate":"2024-01-07","publishedPlatform":"MOBILE","rating":4,"text":"After having been to several Hyatt \"brand\" hotels in Europe: \"Louvre-Hyatt\", \"Marlene Dietricht Berlin\" with exquisite attention and service, we came across a North American version of the company, and the truth is that I regret having done so. . The 2 rooms were not completely adjoining, as requested, they are separated by a space, due to the constant noise of engines, occupied by the internal air conditioning units.\nThe cleanliness of the hotel leaves something to be desired: apart from the fact that there are bottles, plastic bags and glasses that remain for hours and hours in the corridors, our rooms were left without cleaning or making the beds: on the 30th and the 31st, Even though on the 30th we spoke with the manager at 5:30 p.m., when we returned from a busy day and, eager for a refreshing shower, we found the bed unmade, without clean towels. Once the complaint has been made, the manager appears and apologizes, citing an increase in people in the hotel and promises that it will not happen again. Well, thank goodness it was compromised, because the 31st was worse, we arrived at 6:45 p.m. and the situation was worse: Nothing had been touched in the room since our departure at 7:30 a.m.: that is, almost 12 hours. And no one had touched anything. I went to complain to the reception, why they were not answering the phone and when I arrived and saw that the receptionist was almost alone, I asked him why he was not answering the phone and he replied that he had had a very stressful day and when I asked him about the \"non-cleaning \"From the rooms he told me that it was not his concern, that he had his job (he was talking to a beautiful lady). When I demanded action, he disdainfully contacted someone and half an hour later a young lady arrived with a couple of bath towels and two hand towels.\nA terrible experience.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Optimum price at great location","lang":"en","publishedDate":"2023-12-27","publishedPlatform":"OTHER","rating":4,"text":"Location was close to most great places of Manhattan. Very convenient room with king size bed. Lighting of room was amazing.\n\nJshdvjskdb sjbdhd sksbjsbdbd sjjsbdjsndvidjsbdjwojhdisnvdkwbdjdjaknsbdkwbdbdjjwns","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Christmas Weekend","lang":"en","publishedDate":"2023-12-26","publishedPlatform":"OTHER","rating":4,"text":"The hotel and staff are exceptional.  The elevators are the fastest I've experienced in a hotel.  The room was not as advertised - a room with a city view and balcony.  The room had neither available.  The coffee service was weak.  I ended up buying my own coffee at the CVS. ","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great stay!","lang":"en","publishedDate":"2023-12-26","publishedPlatform":"OTHER","rating":4,"text":"The rooms are fantastic. The service isn’t the best but I was able to overlook that’s. I booked a standard king room. I received an ADA room for some reason but I actually preferred it. Service needs some fine tuning but I will stay again! ","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Holiday business trip! ✨","lang":"en","publishedDate":"2023-12-22","publishedPlatform":"OTHER","rating":5,"text":"When I arrived I was greeted by beautiful young lady Alice. Very approachable and professional, very pleasant. She explained all about the hotel amenities as well as the rooftop bar. She was very kind! Another lady was Shanelle (very unique and she must be proud having a very special name!).\n• The lobby and lounge area was clean, neat and nice decorated for coming Holidays!\n• The Elevators were good, fast, not a long wait to get one.\n• The Hallways were nice, bright during the day, lights were lower during the night. Nice pictures!\n• Room: nice, I can say clean, even the bathroom sink had some hair, as well as towels, that part was a little dirty, but anyway nice room. The only thing what was annoying was that I had a room which was on the 4th floor. When I book the next reservation I’d request higher floor for sure, because at this point all day or night I all I heard was public transportation. During my business meeting it was so loud. As well my window was looking towards building cross the street and all I can see is a guy staring to hotel, literally every time I took a look during the night there was a man standing and looking to our hotel. Kinda creepy. \nOverall, a nice area, nice hotel and very kind and helpful staff! Will be back!!!\n\nHappy Holidays!\nMerry Christmas to all Hyatt team! ♥️","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Location","lang":"en","publishedDate":"2023-12-19","publishedPlatform":"OTHER","rating":4,"text":"Great location; we enjoyed the view from the rooftop bar.  NO affiliated parking garage; NO parking discount with their recommended parking garage.\nFront desk Charlemagne made us feel welcome on check in\nThe staff at the rooftop bar were great; food at the bar was also good.  They served dinner.  ","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location, paper thin walls!","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"OTHER","rating":3,"text":"This hotel is in a great location at 5th ave and 39th right near everything.  We walked everywhere and it was easy to navigate.  The hotel rooms are beautiful but the walls are paper thin and at numerous times, I checked to see if somehow the window was open because I could hear conversations on the street as well as in neighbouring rooms.  Don't go there without ear plugs.  But otherwise, a great hotel.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Clean, Convenient and Close Walking Distance to Our Office!","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"OTHER","rating":5,"text":"Excellent hotel! Staff was warm and friendly, room was super clean and had everything I needed. We had a company dinner at the hotel restaurant and the food was incredible, as was the service. Very happy to stay here in the future. Walking distance to our office, to Bryant Park and many surrounding options. ","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Awesome hotel ","lang":"en","publishedDate":"2023-12-17","publishedPlatform":"OTHER","rating":5,"text":"This hotel is very clean, modern and our room was roomy for a NYC hotel room. We were pleasantly surprised compared to other hotels we’ve stayed at in Manhattan by the size. The front desk was very helpful and got us a room right away (and early!). The location on this hotel is awesome. It is close walk from grand central and all of the touristy areas but tucked away enough that it’s still quiet. Overall we had a great experience at this hotel and will consider it for our next overnight stay in NYC. ","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"Distinctly average","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"MOBILE","rating":3,"text":"Check in was painful as the hotel had been booked through a company travel agency. Despite breakfast being included in the rate I was only give a breakfast voucher after the travel agency called the hotel twice. \nRoom was ok. Clean and comfortable. \nThe restaurant where breakfast was served was AWFUL. Staff generally rude and unhelpful.","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Memorable stay’","lang":"en","publishedDate":"2023-12-04","publishedPlatform":"OTHER","rating":5,"text":"We had an absolutely fantastic stay at this amazing hotel.\nThe service, location and quality were all outstanding. The staff were all so kind and helpful. Steps away from one of our favourite spots, Bryant Park and close to Time Square. Location can’t be beat. We had our best meal in NYC at Ramerino Italian Prime located in the hotel. Outstanding authentic Italian food.. Don’t miss out and book this hotel and restaurant. You will be glad you did. A huge thank you to the GM, Anthony Damiano, for making our stay a memorable one. My daughter’s Sweet 16 weekend getaway was perfect!","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Good location, good experience","lang":"en","publishedDate":"2023-12-01","publishedPlatform":"OTHER","rating":4,"text":"Spent only one night and the stay was overall positive, though the rooms feel smaller than what the web site's photographs make it appear, at least mine did. Clearly a building that was not originally a hotel, with odd-shaped rooms giving it some character and charm. \n\nThe hotel did not strike me as a place to spend more than a few nights and the elevator lobby gets cramped quickly. Coffee shop is a great place to start the day. Overall the staff was pleasant and very helpful, especially with handling deliveries to the hotel for my attention. Sour note, the front desk agent who very clearly did not enjoy checking me in at midnight and would not say one word above the barest of minimum.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Quick weekend getaway","lang":"en","publishedDate":"2023-11-20","publishedPlatform":"OTHER","rating":5,"text":"My wife and I enjoyed a quick weekend escape. We were very pleased with all aspects of the hotel and staff. Anthony and his team took great care of everything. Even the gentleman at the desk at 6AM on a Sunday morning was pleasant! We will be back.","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent choice to stay in NYC.","lang":"en","publishedDate":"2023-11-16","publishedPlatform":"MOBILE","rating":5,"text":"Perfect hotel in Midtown NYC, small hotel but excellent in service and rooms. Rooms were very clean and nicely decorated. Location is perfect, away from the busling noise of Time Square, yet close enough walking distance to it. Staffs were all very helpfull and friendly as well. Highly recommended.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Close to Grand Central, clean hotel","lang":"en","publishedDate":"2023-11-14","publishedPlatform":"OTHER","rating":4,"text":"Easy walk from Grand Central, nice clean hotel, small rooms but comfortable space. Nice small bar and restaurant attached to hotel. Check in was seamless and friendly employees. I would definitely stay there again.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hyatt Centric was amazing all around","lang":"en","publishedDate":"2023-11-12","publishedPlatform":"OTHER","rating":5,"text":"From the check in to the check out, the staff was helpful and friendly. All our needs were met to the highest standard! I would recommend this hotel to anyone looking for a getaway in the city! The cleanliness and beauty of this hotel is spectacular.","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Place","lang":"en","publishedDate":"2023-11-12","publishedPlatform":"OTHER","rating":5,"text":"This is my second time staying here for business travel and the hotel does not disappoint. It’s in a great location (off 5th) and the food options are great. The rooftop is an added bonus. I would definitely be staying here again if my business travels put me on the east side. ","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Value, Perfect Location","lang":"en","publishedDate":"2023-11-07","publishedPlatform":"MOBILE","rating":5,"text":"Great Value.  Perfect location, updated rooms, convenient food nearby.  Close to 5th Ave. \n\nI was here for a conference in mid-town and this was walking distance.  For ~$300\/night,  this location is unbeatable (Andaz nearby is >$600).\n\nLocation:  Short walking distance to 5th Avenue, Bryant Park and Mid-town.  Perfect location for work and leisure. Lots of restaurant and shopping all within short walk.  Subway is nearby as well. \n\nLobby:  Open lobby with small sitting area and breakfast buffet served there (free for Globalist). \n\nRestaurant:  The Italian restaurant next door is excellent, legit Italian food.  \n\nElevator: 2 small but efficient elevators. \n\nRoom:  As Hyatt Globalist, got a suite upgrade.  The living room was oddly layout but spacious,  had two banquet of funky velvet sofas.  \n\nBedroom. Separate bedroom is average for NY.  Comfy bed and high quality linens. Note:  limited storage space,  small open closet.  \n\nBathroom:  Updated, shower only. Clean. \n\nLoved our stay, will be back.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"A fuir","lang":"fr","publishedDate":"2023-11-07","publishedPlatform":"MOBILE","rating":1,"text":"A fuir \nL’enseigne et l’emplacement est séduisant mais l’hôtel est vraiment pas dans les normes d’un hôtel à ce tarif il mérite vraiment pas ses 4 étoiles \nChambres minuscules \nChambres sombres \nPas de chauffage \nPas\nDe couverture supplémentaire \nPersonne inexistant et incompétent\nPetit déjeuner null juste du pain avec du beurre et banane","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Amazing Post Marathon Staycation","lang":"en","publishedDate":"2023-11-06","publishedPlatform":"OTHER","rating":5,"text":"Joining the marathon over the weekend and having a hotel you can rely on is beyond amazing. \n\nThe hotel is spotless and the rooms and public spaces are beautiful, even down to the elevators and hallways. Everything is centrally located. I do wish we had stayed longer and explored the other amenities. \n\nWhat impressed us more than anything else was the staff - They were genuine, kind,  thoughtful and very accomodating to make a good impression. They took our luggage's even before checking in to get that off our plate while we stressed about the race. Hilton, one of the front desk team took our luggages, remembered our names and checked us in a couple of minutes. It was the most smooth check-in process I have had for a fully booked hotel.The staff were all smiles as soon as we walked in realizing we had a come from the marathon, offered us water and the GM, Anthony personally congratulated us after he knew we were part of it. The personal touches is what gets you and warms your heart.\n\nThe staff will ensure you are very well taken care of. They will go above and beyond for your needs and help you in any way they can. They have set the bar high when it comes to customer service. Thank you Hyatt Centric!","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Absolutely fabulous staff.","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"The staff is very friendly and helpful. I continued to be needy throughout my stay and they were always kind and totally exceeded my expectations. The room was clean, everything was just wonderful. It is a good location, great Italian restaurant, very comfortable. Nothing but praises. ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Beautiful hotel with a top-notch rooftop bar and perfect location! 😇","lang":"en","publishedDate":"2023-10-28","publishedPlatform":"OTHER","rating":5,"text":"This is already my fourth time in this beautiful hotel and it is every time impeccable! \nGreat service, incredible location, super helpful staff and amazing rooftop bar with a million (at least) dollar view! \n\nWould recommend in a blink of an eye! ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Perfecto en Manhattan","lang":"es","publishedDate":"2023-10-28","publishedPlatform":"MOBILE","rating":5,"text":"El hotel Hyatt es un lugar muy bien ubicado para una estancia en Manhattan, servicio y condiciones del edificios son muy buenos.\nLo recomiendo y volveré sin duda. \nMe hospedé en una habitación de esquina en el piso 21 vista a la ciudad.-\nPersonal en general es atento y dispuesto hacer tu estadía perfecta.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel, great location, great customer service","lang":"en","publishedDate":"2023-10-20","publishedPlatform":"OTHER","rating":5,"text":"The rooms are big for NY standards, and they are newly remodeled, modern, and very clean. The bed was very comfortable and clean. The bathrooms are upscale and comfortable with excellent water pressure. The customer service at the lobby was impeccable. The lobby is small, but modern, updated, and clean.  The Italian restaurant and the rooftop deck bar offer good quality food. I will definitively be back. ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"My 3 Day Adventure in NYC","lang":"en","publishedDate":"2023-10-19","publishedPlatform":"OTHER","rating":5,"text":"I recently stayed at the Hyatt Centric Midtown for my 3 day adventure in NYC.  This is the 3rd Hyatt property in NYC I have stayed at and by far my favorite.  Being off of 5th and 39th, the location was great and a short walking distance to many things.  Upon arrival, we were courteously greeted and taken care of right away.  The front desk staff was very friendly and hospitabele. \nThey were able to check us in early, upgrade us to a suite, and provided late check out options.  There was always fresh water available and an open coffee bar with delicious muffins and croissants for breakfast.  If you were looking for something more substantial, the restaurant is there to serve you.  A big shout out to Alice and Janette foe being to helpful and accommodating.  Anthony Damiano, you run a great staff.  Can't wait for our next visit.  Until soon, the Texas ladies Crew. ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel, nice location","lang":"en","publishedDate":"2023-10-12","publishedPlatform":"OTHER","rating":4,"text":"This was the first time staying at this hotel.  Great location to everything we had planned on our itinerary.  Nice rooms, comfortable beds,  good water pressure with the shower.  The front desk crew were wonderful. ","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17762159,"title":"NYC if the fall","lang":"en","publishedDate":"2023-10-12","publishedPlatform":"OTHER","rating":5,"text":"NYC in the fall is magical. The colours and the crisp air in the mornings. The Hyatt Centric on 39th is well located to truly enjoy the city. The desk staff is friendly and welcoming. Rooms are clean with a great shower and comfortable beds.  The hotel is close to Times Square and Bryant Park. I can’t wait to return. ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Best Manhattan Hotel for Customer Service and Thoughtfulness!","lang":"en","publishedDate":"2023-10-12","publishedPlatform":"OTHER","rating":5,"text":"I LOVED the Hotel Management & staff.  They were all so kind & thoughtful while I was staying there after my husband had been seriously injured in Manhattan.  Thanks to Anthony, Katherine, Hilton, Charmaine, Janette, Shanelle, Alice, & the hotel handyman (l wish that I remembered his name.)  The entire staff was wonderful!","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Really centric and a nice roof top bar","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"OTHER","rating":5,"text":"Entry hall is nice, friendly receptionist, no wait time. Wireless worked well and I could work from there. Ironing shirts was easy. I booked a room for one person and its size was sufficient. Storage of luggage after check out was for free. I would come again. ","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Location","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":4,"text":"Very clean and comfortable hotel in Mid-town.  Enjoyed walking to NY Public Library and Korean BBQ for dinner.  We were able to leave our luggage early.  Paid parking just down the street.  Easy to get in and out!","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"A gem in mid-town Manhattan","lang":"en","publishedDate":"2023-09-16","publishedPlatform":"OTHER","rating":5,"text":"My wife and I were stranded for 48hours due to the weather after arriving at JFK.  We found this hotel through the Hyatt app and had a fabulous 2-day extension to our vacation.  The location was ideal.  It is close to everything, but on a relatively quiet side street.  The restaurant was very good, and the lounge\/bar on the 22nd floor gave an outstanding view of the Empire State Building.","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent location, great stay","lang":"en","publishedDate":"2023-09-10","publishedPlatform":"OTHER","rating":5,"text":"We were delighted with the location as it was very central in a quiet area. Our room with two Queens was clean and quite roomy.  Zero noise from inside or outside the building meant a great night's sleep.  The roof top bar was an unexpectedly nice place with a good ambiance.  And the staff there and at the front counter were excellent.","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Good location but not good experience","lang":"en","publishedDate":"2023-09-06","publishedPlatform":"MOBILE","rating":3,"text":"The location of this property was great, but unfortunately the service didn’t impress. We were greeted warmly by the front desk person and were welcomed as Globalists. This is pretty much the highlight of our two night stay. The rooms were clean and comfortable, but relatively average. We were not upgraded at all, in fact our room looked directly into another building and we were on the 9th floor. It was incredibly noisy at night, even by NYC standards. The breakfast was horrible! The staff were inattentive and unfriendly. After perusing the buffet we decided to order off the menu. We had to flag down a waitress to order. The brioche French toast was like soggy wonder bread. The oatmeal was watery and slimy. We opted to go off site and skip the free breakfast the next morning. When coming and going nobody bothered to hold the door open even when a staff member was standing right there. We will choose a different Hyatt property next time.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hidden gem of a hotel!","lang":"en","publishedDate":"2023-09-06","publishedPlatform":"OTHER","rating":5,"text":"Hidden gem of a hotel! Perfect location for exploring New York. Great rooms and very comfortable beds! Very friendly and helpful staff. Attached to a great restaurant -Ramerino! And has a wonderful rooftop bar with great view of the Empire State Building! Would definitely stay there again! ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Consistently Amazing","lang":"en","publishedDate":"2023-09-01","publishedPlatform":"OTHER","rating":5,"text":"This place keeps getting better and better. The team here always makes me feel like its home. The area is perfect, and it has a boutique hotel type of feel. I would highly recommend staying here on your next nyc trip.","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Intimate hotel with generous room size and attentive staff","lang":"en","publishedDate":"2023-08-30","publishedPlatform":"OTHER","rating":5,"text":"Loved the convenient location, fun furnishings and knowledgable staff. Quiet, too, and breakfast (for Globalist members) served in the restaurant versus a club. Above and beyond. Highly recommended! PS Unlike other NYC Hyatts, there's no resort fee added daily!","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Outstanding from beginning to end!","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":5,"text":"I cannot say enough about all of the staff we encountered at the Hyatt Centric 5th Ave but would especially like to call attention to Jackie at the front desk.  She was so in tune with the needs of our family and in particular, our special needs son.  She was a God send!  The housekeeping staff were attentive and added a special touch of tucking in my boys' plushies in the bed when they were made! And while a separate entity, the A to Z rooftop lounge staff were so welcoming to our young boys, even making lemonade from \"scratch\" at the boys' request.  We will most assuredly be back and highly recommend this hotel to any family looking to stay in midtown Manhattan!","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hyatt Centric 39th and 5th","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"OTHER","rating":5,"text":"What makes this hotel exceptional is it staff and service. Great location in midtown. Room was clean with very comfortable bedding. A to Z rooftop bar was perfect after a long day of sightseeing. A quick thank you to hotel general manager Anthony Damiano for quickly addressing HVAC issue. HVAC stayed on 24\/7 with no air flow. I would definitely recommend Hyatt Centric 39th and 5th. ","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Acceptable EXCEPT ONE ISSUE","lang":"en","publishedDate":"2023-08-06","publishedPlatform":"MOBILE","rating":2,"text":"The hotel is generally acceptable, front desk staff pleasant.  It’s NY, so rooms are small, which is ok.  Good location if you want to be in midtown.  Smallest sink I’ve ever seen in a hotel or anywhere for that matter. .  .\n\nBUT, the HVAC system is TERRIBLE.  All night, it turns on and off about every 10 minutes, makes the room too cold, then it waits until you are sweating and turns on again.  The temperature was set at 70 - we didn’t touch the thermostat.  \n\nBut that’s not the worst.  The vents are positioned so that the air blows DIRECTLY  on you while you lay in bed.  You could catch pneumonia! It’s unpleasant, disturbs sleep, and ruins the entire evening.  The best assessment of a hotel is whether or not you can get a pleasant, restful night’s sleep. This hotel fails on that count, at least in the room we received.  Ask before you stay about the venting location - if it is across from the bed.\n\nThat said, while it wouldn’t solve all the problems, at least they could add a plastic diffuser to the vent to reduce the air from blowing on guests while in bed.   How does a hotel not know about this problem and do something about it?  I would expect that from Hilton, but not Hyatt.  \n\nA good hotel is all about the details.  Those that don’t pay attention to details or put profit above the details of the guest experience should be avoided.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Employees who listen are here…..","lang":"en","publishedDate":"2023-08-04","publishedPlatform":"OTHER","rating":5,"text":"People working here makes this place give a wonderful experience. Katherine, a Front Office Supervisor, listened to my requests earnestly and made them happen. \nIn all, she went way above and beyond and I truly appreciate her sincerity!!","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17762159,"title":"Wonderful guest rooms","lang":"en","publishedDate":"2023-08-03","publishedPlatform":"OTHER","rating":5,"text":"Much larger rooms than expected in midtown NY.  Super comfy king bed.  High quality linens and pillows. Modern spacious bathroom.  Even had a large upholstered arm chair with ottoman - rare in Manhattan. Wood (or wood tile?) floors. Black out shades. Remarkably quiet on the 17th floor.  Plenty of AC outlets and USB ports everywhere.  Well-designed desk.  Hanging space and high quality glass door mini-fridge.  Housekeeping every day.  Huge flatscreen TV (maybe 65 inches) with a generous channel selection.  Perfect midtown location on E. 39th Street.  CVS open late around the corner.  My new go to midtown hotel.","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Quiet Retreat Near Times Square","lang":"en","publishedDate":"2023-08-03","publishedPlatform":"OTHER","rating":5,"text":"This is a great hotel near Times Square.  The rooms are on the small side but are very quiet which made for restful sleeping. The staff was very professional and responded quickly to a couple of requests that we made.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Ritorno a New York ","lang":"it","publishedDate":"2023-07-30","publishedPlatform":"MOBILE","rating":3,"text":"Conosco per lavoro gli Hyatt e ho scelto per questo. La posizione è comoda, al centro di Manhattan, vicino a Grand Central e un po' meno a Penn Station o Times Square, molte linee di metropolitana a pochi minuti a piedi; ma l'hotel occupa uno spazio relativamente ristretto tra due fabbricati e si sviluppa esclusivamente in altezza, ci sono non più di una decina di stanze per piano.  La camere sono ben insonorizzate, spazi piuttosto sacrificati per quanto ben gestiti, bene l'area toilette. Il bar al roof è inevitabilmente sacrificato per spazio che viene sovrastato dagli edifici confinanti, la vista sull'Empire non basta a rendere esclusivo il tutto. Bene la pulizia, anche la dotazione di asciugamani ( ma non disponibili accappatoi). Disponibili porte USB per ricaricare cellulare. Buono il Wi-Fi.  Non sempre cordiale il personale all'accoglienza. Prezzi un po' alti nel complesso. ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent quiet hotel in the middle of midtown","lang":"en","publishedDate":"2023-07-28","publishedPlatform":"OTHER","rating":5,"text":"Excellent hotel in the middle of midtown with very good customer service and very quiet rooms\nThe Good\n- Location is perfect, 1 block from Bryant Park, walking distance to Broadway, Times Square and several subway stations\n- Room faced a courtyard, which made it extremely quiet.  Normally you hear sirens in NYC or doors closing late at night from people partying.  However, we heard only complete silence\n- Rooftop bar really nice for a drink overlooking the city\n- Parking available 1 block away with a hotel discount for $65\/night\n- Staff was extremely nice\nThe Bad\n- Rooms are very small.  This is normal in NYC but very crowded for a family of 3.  However, space is used well and room has everything you need.\n- No dual queen size bed options.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Classy, well-positioned in midtown Manhattan","lang":"en","publishedDate":"2023-07-25","publishedPlatform":"OTHER","rating":5,"text":"I was in town attending my father's funeral, and chose this hotel because of an Amex Offer for Hyatt Centric and because the location was perfectly positioned in the city for my plans.  My Hyatt elite benefits were recognized at check-in, I got the military veteran rate, and the WoH app worked flawlessly for the stay.  The hotel is a 10-minute walk from Times Square and the Empire State Building, is nestled near all of the major subway lines running throughout New York City, and yet is a classy, quiet spot in a very vibrant area.  I had a serious problem initially during my stay which was promptly and professionally dealt with personally by the general manager (Anthony D.) and director of operations (Greg) to my complete satisfaction.  \n\nThe hotel is in very good condition, is tastefully decorated in a colorful, yet subdued motif, the rooftop observation deck has a great view of the Empire State building, and this stay increased my affinity for the Hyatt Centric brand's emphasis on location.  Just like the Centric Montrêal, it's very close to what you want to see, and getting around NYC on the subway is a cinch.  It caters to millennials without being crass and party-like...more like a classy business casual hotel.  A button-up shirt and slacks, no tie.\n\nThis stay made a difficult time much easier for me, I was treated very well overall, and I highly recommend the hotel.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel and staff","lang":"en","publishedDate":"2023-07-24","publishedPlatform":"OTHER","rating":5,"text":"Hotel was convenient to Grand central and suited our travel plans. Staff was fantastic from checkin through checkout. Our room was a corner suite and very comfortable.  Rooftop was a pleasant surprise and a great intimate space to have a quiet drink and food. ","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"A gem of a smaller hotel","lang":"en","publishedDate":"2023-07-22","publishedPlatform":"OTHER","rating":5,"text":"Perfectly located in mid-town, Hyatt Centric is lovely and understated.  Fairly large room for NYC, friendly and unobtrusive. The bonus is a rooftop bar with a stunning view of the Empire State Building. Also, surprisingly quiet.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Best Hotel Experience in Midtown!!","lang":"en","publishedDate":"2023-07-20","publishedPlatform":"OTHER","rating":5,"text":"Entire hotel and restaurant staff were superb, even during a very hectic time.  Every opportunity I have to come to NYC, my go to destination is Hyatt Centric Midtown NYC.  Really appreciate the welcoming nature of the entire staff!","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent stay.   Very new and modern room and great location.","lang":"en","publishedDate":"2023-07-08","publishedPlatform":"MOBILE","rating":5,"text":"Excellent stay.   Very new and modern room and great location.  \n\nA great choice if you will have to be around midtown area of NYC\n\nAlso, the general manager Anthony is awesome!    He leads by example.\n\nThe one downside is that the Italian restaurant on first floor has unfriendly service and doesn’t deliver room service (when it’s busy).    \n\nOther than that.   This hotel is a great choice.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Fantastic view of Empire State Building & Convenient to Grand Central Station","lang":"en","publishedDate":"2023-07-01","publishedPlatform":"OTHER","rating":5,"text":"Our high floor city view reservation got us an incredible view of the city, including the Empire State Building just outside our large window.  We picked the Hyatt Centric Midtown because the rooms were a bit larger than most major hotels and because of the convenient walk of less than 10 minutes to Grand Central Station and less than 20 minutes to Penn Station.  \n\nThe staff was friendly and the hotel was clean.  Attention to detail was obvious and made our stay comfortable.  Our room was cleaned daily and it was nice to come back to fresh sheets and towels and a newly made bed.  \n\nOur reservation came with breakfast and we took advantage of this every day of our weeklong stay.  Food was excellent!  Two days during the week there was a breakfast buffet and the other days we dined off of the regular menu which had a variety of choices (we enjoyed all that we tried!).\n\nGive this hotel a try on your next visit to NYC!","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Fantastic Stay!!","lang":"en","publishedDate":"2023-06-29","publishedPlatform":"OTHER","rating":5,"text":"Best hotel experience I've had i years (and I'm a 100+ nights a year in hotels, guy).  Staff was excellent.  Everyone I came in contact with greeted me with a smile, a \"hello\" and a \"how is your stay going?\" Manager in Lobby saying hi to guests- when was last time that happened to you- right?","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Pleasant Midranger","lang":"en","publishedDate":"2023-06-26","publishedPlatform":"OTHER","rating":4,"text":"New hotels have grown faster than people in Manhattan.  This is another office building conversion and it has many of the admirable touches associated with Hyatt. Very friendly staff, mostly quiet rooms, excellent lighting in the bathroom, high standards of cleanliness, a fine sit down a la carte breakfast; decent mattress, ample charging outlets, large flat screen television.\n\nwhile the lobby is a bit cramped, and so to the hallways, the three elevators are blazingly fast and the inner courtyard while homely keeps noise down.\n\nThe A\/C, as several have noted, is efficient, but sounds much like a car ferry racing out of a berth. Instead of white noise, it could make it difficult to sleep.\n\nThe Sunday rate was New York reasonable. The weekday rate is a bit steep, but the location is very convenient for business, sightseeing.\n\nThey have much competition at this price point, but it is a decent choice.\n","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent time at Hyatt Midtown","lang":"en","publishedDate":"2023-06-25","publishedPlatform":"OTHER","rating":5,"text":"Our stay at the Hyatt Midtown was amazing.  Hotel staff provided excellent customer service, the hotel is kept in optimal conditions.  The rooms are very modern with plenty of room for a couple. The beds are super comfy and the whole vive in the hotel was just excellent. \nShout outs to Arlene at the main reception, she took care of us like no other.  Can't wait to be back.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Will be back!","lang":"en","publishedDate":"2023-06-24","publishedPlatform":"OTHER","rating":5,"text":"Anthony went out of his way to make sure our stay was good for us. The location is perfect in the city. Very safe, great walking distance to all the good things to see. Will only stay here when visiting Manhattan. ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Pretty Good","lang":"en","publishedDate":"2023-06-22","publishedPlatform":"MOBILE","rating":4,"text":"Room was quite small, a little dark, but had a nice design. It was also well stocked with coffee and tea pods and good soaps and shampoos. Staff overall was super friendly with everyone saying hello. \n\nBreakfast was good with Globalists being allowed to order anything off the menu. I like breakfast\n\nThe gym was cramped but had excellent dumbbells. That was a plus as too many hotels have limited dumbbell choice. But aside from dumbbells there was not much else. \n\nLocation is excellent. I'd stay here again if the price was right but some rates seem sky high and overpriced for what you get when I searched other dates. This is not a luxurious place. Not at all.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Perfect for the vacationing traveler","lang":"en","publishedDate":"2023-06-21","publishedPlatform":"OTHER","rating":5,"text":"I stayed at this Hyatt in June of 2023. It was really easy to get to from Grand Central. The front desk staff were very helpful. The room was small and didn’t have a great view but was easy to get to, quiet, and had everything I needed. If there were 4 people it might be a snug fit bit for the price it was great. I had seen some negative reviews and really not sure why. Location is excellent as well. ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"TRES BON EMPLACEMENT","lang":"fr","publishedDate":"2023-06-18","publishedPlatform":"OTHER","rating":3,"text":"Nous avons séjournés dans cet hôtel pendant 5 nuits, les 2 premières je n ai pas fermé l œil tellement il faisait chaud la clim ne fonctionnait pas, malgré mes 2 demandes d intervention le pb n a pas été résolu. le 3 -ème jour je suis retournée a la réception pour faire part de mon mécontentement et là un grand merci à ALICE qui a été réactive et nous a donné une autre chambre ou  nous avons enfin vu la différence. Mis a part cela les chambres sont propres et de taille correcte, avec une salle de bain fonctionnelle mais le tout manque un peu de luminosité et de rangement. L emplacement est très bien. Nous avons pris un verre sur le toit avec  une vue sur l'Empire State Building(c était le top).","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17762159,"title":"1st Time at this location","lang":"en","publishedDate":"2023-06-14","publishedPlatform":"OTHER","rating":5,"text":"Great overall location and hotel with a nice roof top to enjoy with friends. Rooms were very stylish and felt like a boutique hotel experience. Roof top has a view of the empire state building which was a bonus!","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"NYC Hyatt @ 5th and 39th","lang":"en","publishedDate":"2023-06-13","publishedPlatform":"OTHER","rating":5,"text":"Location, location, location! Hotel was clean, modern, and well maintained. Room was nice with a great view of the city. Staff was friendly and helpful. Rooftop bar was nice with a great view of the city.\n","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent choice of accommodations","lang":"en","publishedDate":"2023-06-13","publishedPlatform":"OTHER","rating":5,"text":"Overall excellent experience. Left with the notion of coming back to this hotel again. From the moment I walked into the hotel I was greeted professionally and I felt valued. The hotel was clean and the room was nice as well as clean. I would recommend this hotel to friends and family. ","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Close to Time Square but far enough away avoid the crowds and the crazy.","lang":"en","publishedDate":"2023-06-12","publishedPlatform":"OTHER","rating":5,"text":"Great location with easy access to Times Square, Broadway, Grand Central and other tourist hotspots, but far enough away for a little quiet.  It’s a newer hotel, which means there’s plenty of places to plug in your tech. ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Wonderful Service","lang":"en","publishedDate":"2023-06-12","publishedPlatform":"OTHER","rating":5,"text":"The hotel was very clean and centrally located.  The staff helped our family of 5 get rooms together.  They provided a late checkout and helped arrange a car to the airport.  It was a wonderful stay, and I would recommend the hotel to others.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"DONT BOTHER WITH THIS PROPERTY","lang":"en","publishedDate":"2023-06-12","publishedPlatform":"OTHER","rating":2,"text":"Location was great....\nBreakfast and attention given by server was great\nRooms are super compact and very very dark\n\nBUT HERES WHY I WOULD NOT RECOMMEND THIS PROPERTY\nGeneral manager was made aware of a situation that happened with a delivery from Uber that was delivered to the front desk...and then suddenly disappears. I never heard from anyone\n\nI confirmed with front desk about protocols when having a delivery brought and they assured me it would be kept for me \nI called mid day while we were out sightseeing \nand was told packaged had arrived and was being held at the FRONT DESK\n\nI returned back to the hotel after 5:00pm and it had vanished..no one knew anything, no one saw what happened. They told me I must have called the wrong Hyatt and maybe reach out to Uber...Uber sent a picture of the package on the desk with a time of delivery 11:13am\n\nI could go on and on but heres my take, when there is a level of dishonesty and a level of mistrust coupled with it trying to be covered up by senior management then I say this,  there are hundreds of hotels in New York with great location as a selling feature. I have yet to hear back from Mr. Velo OR the General Manager Mr. Damiano about this incident and for that reason and the complete lack of service from those at the top I DONT recommend this hotel. Your staff are a direct reflection of your management team and in my opinion as a seasoned traveller both need a complete overhaul.\n","travelDate":"2023-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Small, dark room with no view","lang":"en","publishedDate":"2023-06-11","publishedPlatform":"OTHER","rating":1,"text":"Ok, my bad, I booked the wrong hyatt centric. We had stayed at 45th st before-friendly staff, great location for theatre, nice view from big window. \nThe hotel at 5th and 39th is awful- beaten up, no view, not particularly convenient. A\/C very loud when it turned on. Staff not responsive. Not cheap either. Couldnt wait to leave","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"It's the location that makes the difference ","lang":"en","publishedDate":"2023-06-11","publishedPlatform":"OTHER","rating":4,"text":"The hotel is located is a perfect spot to discover NY. 25 meters from 5th Ave and in the middle of everything. The reception and staff are very friendly and service minded. Check in is quick. As with most hotels in NY, the rooms are very small, dark because of the high rises outside and loud. The beds were fine, but the room is only for sleeping. It's a good hotel if you want to discover NY in the summer time, and don't depend on your room that much. Although, the rooms are clean and offer you everything for a good night stay. ","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great service!","lang":"en","publishedDate":"2023-06-09","publishedPlatform":"OTHER","rating":4,"text":"This hotel is unassuming in looks, but big on customer service! Andrea at the front desk is dazzling and super charming! As are all the front desk staff. The team was vey quick to offer answers to questions and even go above and beyond for the extra touch. Thank you! ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Clean and charming hotel","lang":"en","publishedDate":"2023-06-07","publishedPlatform":"OTHER","rating":5,"text":"We had a great experience staying at this hotel. Very clean and quiet. Convenient location to many NY attractions such as Time Square, Madison Square Garden. The staff was very friendly and professional.  Highly recommend. ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Amazing Hotel and Location","lang":"en","publishedDate":"2023-06-06","publishedPlatform":"OTHER","rating":5,"text":"The rooms were a bit small but welcome to NYC.  The room was spotless and had everything I needed.  Even free water!  Woohoo!  The staff were extremely friendly and helpful.  The fitness center is good with cardio machines and weights.  The location of the hotel was amazing.  short walk to Bryant park which was our breakfast place each morning.  Also a short walk to Times Square.  I loved being near Times Square but not in it.  Definitely recommend this hotel.  ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent staff","lang":"en","publishedDate":"2023-06-06","publishedPlatform":"OTHER","rating":5,"text":"When the air condition in the room wasn’t working, the staff was more than accommodating to fix the situation, without making us feel like an inconvenience. They orchestrated a room switch in the middle of the night and set us up for the next day while we were out for our event.  ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very Pleasant and Serviceable Hotel","lang":"en","publishedDate":"2023-05-30","publishedPlatform":"OTHER","rating":4,"text":"This is a well-kept hotel with pleasant staff in a great central location. I stayed for a week for work and I was very comfortable. There are plentiful restaurants in the area and I enjoyed ending the day at the on-site bar. ","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Another Great Stay","lang":"en","publishedDate":"2023-05-30","publishedPlatform":"OTHER","rating":5,"text":"I have been staying at this hotel off and on for over 6 months. Staff are friendly and facilities are great. Good location as Bryant Park is right around the corner and Ramerinos makes I very good complimentary breakfast as part of your stay as a Globalist so if you travel frequently definitely worth stopping in ","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Home away from home.","lang":"en","publishedDate":"2023-05-30","publishedPlatform":"OTHER","rating":5,"text":"I am grateful to have found this gem of a place.  Everyone is committed to your stay being fantastic.  It's lovely to be addressed by your name even when you return even after a long while.  The location is excellent.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Good location, newer hotel and professional service","lang":"en","publishedDate":"2023-05-29","publishedPlatform":"OTHER","rating":5,"text":"I work in midtown Manhattan and stayed here after a late dinner. Hotel is newer. Rooms are clean and efficient. The staff were some of the nicest, most professional team I have met. Check in was easy. The manager was personally greeting guests the next morning in the lobby.\n I observed the night staff engaging 4 out of town visitors on the best things to see in NY and also sending a bottle of prosecco to them to enjoy. Kudos to this team","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great location and nice hotel","lang":"en","publishedDate":"2023-05-27","publishedPlatform":"MOBILE","rating":4,"text":"Great hotel in midtown. The beds were very comfortable and good size rooms. The bathrooms were good size (lacked a little counter space, but not a big deal). You also get enough products for two people, and there is a coffee machine in the room. There is not a restaurant at the hotel, however it’s very pricy Italian restaurant next door (we did not go for breakfast), and there are a lot of breakfast options near by and also Whole Foods grocery store. It’s s great central location and I’d stay here again.","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17762159,"title":"NY 23May23 - Mary & Djo","lang":"fr","publishedDate":"2023-05-27","publishedPlatform":"OTHER","rating":5,"text":"Excellent Hôtel, l'emplacement pour les longues ballades dans NY, l'équipe à votre écoute, la propreté, nous n'avons pas testé la restauration car NY à pris le relais mais tout était bien ! On a passé deux jours très agréables, on y reviens très bientôt ! Eric & Marie ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel in convenient location","lang":"en","publishedDate":"2023-05-26","publishedPlatform":"OTHER","rating":5,"text":"We've stayed at several Hyatt properties in NYC and really like the Centric Midtown for both quality of the hotel and the convenience of the location. Rooms are comfortable and quiet, staff is both welcoming and helpful, and location is convenient to transit, restaurants and venues. The on-site restaurant and rooftop lounge are both good options if you don't feel like exploring the wonderful options in the surrounding blocks or broader NYC. ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel in a great location","lang":"en","publishedDate":"2023-05-25","publishedPlatform":"OTHER","rating":5,"text":"The hotel is conveniently located in midtown. It’s small footprint and focus on service put it above the other hotels in the area. The team went out of their way to make sure I was taken care of and the breakfast service was exceptional. ","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent customer service!","lang":"en","publishedDate":"2023-05-25","publishedPlatform":"OTHER","rating":5,"text":"Customer service was exceptional! The receptionists and the managers helped me solve my problem (a mix-up with my reservation). Location is great. Walking distance within everything. Thank you for making my stay pleasant. ","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Impiegata del check-in maleducata","lang":"it","publishedDate":"2023-05-23","publishedPlatform":"OTHER","rating":1,"text":"Per il prezzo pagato mi sarei aspettato all’arrivo il servizio bagagli poi al check-in l’impiegata non ha accettato la mia carta aziendale perché sulla carta c’è scritto Confezioni Vebi di Santucci Ughetta & C. E ho provato a spiegarle che io ero socio è in nessuna parte del mondo mi hanno fatto problemi e lei visto che mi ero alterato mi ha detto che se avessi continuato a parlare me ne sarei potuto anche andare.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Good Location. Great Roof Top Bar.","lang":"en","publishedDate":"2023-05-22","publishedPlatform":"OTHER","rating":3,"text":"Great Location. Food Good but Overpriced.\nMarvellous Roof Top Bar view includes the Empire State building.\nStaff helpful and friendly.\nRoom missed for make up one day but made up immediately when told.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"10 out of 10 would stay Again!","lang":"en","publishedDate":"2023-05-21","publishedPlatform":"OTHER","rating":5,"text":"Hotel is in a great location.   Walking distance to many great places in Midtown.  Rooms are small, but that is expected for the area.  Although small the room was clean and accommodated all of our needs.  The staff, especially Janette and Anthony, were exceptional.  ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Above and Beyond","lang":"en","publishedDate":"2023-05-16","publishedPlatform":"OTHER","rating":5,"text":"We were so excited when we walked into the room and saw all the surprises they had for my daughter’s birthday! They put rose petals on the bed, and even gave her snacks and a balloon! I want to thank the staff at this location, they truly went above and beyond to make my daughter feel special! I appreciate it greatly","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Room for improvement","lang":"en","publishedDate":"2023-05-15","publishedPlatform":"MOBILE","rating":2,"text":"I was not impressed by Hyatt Centric Midtown.  It did not live up to the the Hyatt standards I have grown accustomed to.  First things first, the complimentary breakfast for elite travelers is awful.  It isn’t even as good as airplane food breakfast.  There is nothing interesting on the menu.  The fruit was melon and really unripe strawberries.  The coffee was also not good.  We opted to eat out at all subsequent breakfasts.  \n\nWe were upgraded to a King suite.  It was painfully dark and oddly designed.  Not a fan of the decor.  The room darkening shades were not functional so we had to crawl onto the furniture and fix them.  We couldn’t get our room cool enough for sleeping.  There were no glasses in the bathroom for water.  The recycling bin was lined with a plastic liner.  That suggests that they do not recycle.The hanging area was open to the room like a VERY low level motel.  To turn on the shower, you had to stand in spray to get it to the right temperature.  The biggest problem of all……the rooftop bar was closed.  it was beautiful and we were able to take the steps up to the roof and enjoy the view of the Empire State Building but it was closed so we walked through a closed bar to get to the roof.  Maybe we shouldn’t have been there but it was open via the stairwell and it was delightful while we were there.\n\nNow for the good things.  The bed was comfortable.  Housekeeping was very sweet and good.  And the best thing was a tiny light that faintly lit the toilet from the bed.  It was motion activated and very faint so you were not awakened while using the restroom in the middle of the night. \n\nI wish we had chosen a different Hyatt property because the price for this hotel was not reflected in the quality.  We are Hyatt loyalists so this was very disappointing.","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":17762159,"title":"Hyatt Centric 5th Avenue - Disappointing Experience","lang":"en","publishedDate":"2023-05-14","publishedPlatform":"OTHER","rating":2,"text":"As an Explorist Hyatt member, I'm beyond frustrated with my recent experience staying at this Hyatt property.  The Hyatt describes its Centric brand as:  \"Upscale, cosmopolitan and highly customizable, these properties attract selective guests who want the best of what’s essential and none of what’s not — all at the center of a prime destination.\" I have stayed at several Hyatt properties and each time had a satisfactory experience. This however, was very disappointing for the following reasons:\n\n1.  Reserving for 4 adults and being provided 2 sets of wash cloths, hand towels, and bath towels.  When I called to request additional supply for 4 adults, I was provided only 2 additional bath towels and 2 hand towels.\n\n2.  Inadequate supply of in-room coffee - not enough pods with caffeine for 3 adults for one day!  The cream curdled and ruined the first cup made.  It took 3 calls and trips from staff to provide enough pods, sugar, and powder creamer for 3 adults to have coffee our first morning.  When serviced by housekeeping, still less than 3 pods of caffeinated coffee left for the room.\n\n3.  When checking in I was not acknowledged as an Explorist.  When I asked if I would receive free water, the manager replied \"We're a Centric and we don't have to give you water.\"  Not the friendliest explanation and not sure if that's true?\n\n4.  Our beds were not made properly.  Upon arriving, one queen had no flat sheet and the other queen had two flat sheets - one above the fitted sheet and another on top of the comforter\/duvet.  When housekeeping prepared our rooms on a subsequent day, the beds were made the same way.  Very odd!\n\nThe hotel is only 2 years old (according to staff).  There is no place in the hotel to purchase snacks or other items.  I asked for a Diet Coke and was presented with a bill of over $6 with a line to provide a tip.  \n\nThe rooftop restaurant\/bar is very nice - sophisticated decor and an amazing view of the Empire State Building.\n\nThe view from our room (208) was of a concrete wall.\n\nI'm so disappointed that I burned 50,000 points plus $1100 to stay four nights here.  If you want a great experience with a Hyatt property, choose another!","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Hyatt stay","lang":"en","publishedDate":"2023-05-07","publishedPlatform":"OTHER","rating":5,"text":"Perfect room, nice gym, great location. Very near some great restaurants and subway. Highly recommend this hotel. Great coffee shops near by. Also close to the park. Cant beat the location and access to everything. ","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Nice stay","lang":"en","publishedDate":"2023-05-07","publishedPlatform":"OTHER","rating":5,"text":"I was in NYC for an event. Hyatt Centric was in an ideal location for my meeting, room was very clean and front desk team was friendly. I will stay again. I was surprised by how quiet the room was (I was on 21st floor)","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great stay","lang":"en","publishedDate":"2023-05-04","publishedPlatform":"OTHER","rating":5,"text":"Great location and it’s fairly close to the subway and major attractions, making sightseeing convenient. Surrounding area is safe as well. Rooms are not exactly soundproof and it might affect light sleepers like myself. Bed is large and comfortable ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Stay at Hyatt Centric NYC","lang":"en","publishedDate":"2023-04-24","publishedPlatform":"OTHER","rating":5,"text":"Entire experience was excellent: from checkin, cleanliness of room, and excellent food at the restaurant. This was my fourth time to stay at the Hyatt Centric and I will definitely stay there my next trip to NYC.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"D’accord à nos attentes. Situation géographique dans le centre facilitant les visites.","lang":"fr","publishedDate":"2023-04-16","publishedPlatform":"OTHER","rating":4,"text":"La vue du top est magnifique avec la possibilité de prendre un verre. Le personnel est attentif et souriant. Les chambres sont spacieuses et la literie très confortable. Possibilité de se restaurer sur place, très appréciable après une longue journée de balade ","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"TOP!!!","lang":"it","publishedDate":"2023-04-16","publishedPlatform":"OTHER","rating":5,"text":"Posizione strategica per muoversi sia a piedi che in metro. Personale molto disponibile e cordiale sia in sala ristorante che alla reception. Camere belle e letti molto comodi. Ristorante buonissimo sia per la colazione (a la carte, non a buffet) sia per la cena che abbiamo provato un paio di sere. Bar in terrazza una chicca per la sera, con vista sull'Empire! Lo consiglio!!!","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent Choice for Business Stay in NYC","lang":"en","publishedDate":"2023-04-15","publishedPlatform":"MOBILE","rating":4,"text":"Stayed here one night for its great midtown east\/Bryant park location where I had work meetings.  Check in smooth, room was spacious and well appointed for NYC standards with completely renovated marble bath and useful lighting throughout room.  Great bed.  Quiet room.  Good breakfast.  Appreciated late checkout with Hyatt status.  Very nice staff encountered throughout hotel including front desk, maintenance, restaurant.  My only suggestion would be a gym upgrade—it’s fine but only one elliptical and a bit drab down there compared to other business hotels I stay in throughout Manhattan .  But I would def stay here again.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"perfetto","lang":"it","publishedDate":"2023-04-11","publishedPlatform":"OTHER","rating":4,"text":"Hotel recente e molto confortevole. La posizione è top: a pochi passi da Times Square e dall'Empire State Building . In piena midtown. Camera spaziosa per gli standard di New York così come il bagno. Tutto perfetto","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Outstanding Customer Service Great for Business Travel or Leisure! ","lang":"en","publishedDate":"2023-04-05","publishedPlatform":"OTHER","rating":5,"text":"Absolutely love this hotel! I have booked a lot of properties in NY and this one bar far exceeds expectations! i had book this hotel for my two of my groups and customer service and overall experience is the best around. Thank you Adeline for being amazing and communication was super easy! She made my job easy which is hard to do so i greatly appreciate her dedication in providing exceptional customer service! This property will go above and beyond for you as they understand you have so many options to stay at in NY and take you choosing them seriously. Honestly we all can tell lately no matter where you go sometimes you do not know what kind of service you will be getting and makes us timid to spend money but i promise you will definitely feel at ease when you stay either individually or booking a group here. This will be go to hotel for NY, i wish all hotels were like this in every city!","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Hyatt Centric","lang":"en","publishedDate":"2023-03-27","publishedPlatform":"OTHER","rating":5,"text":"Staying at this hotel for a short vacation with my wife. The location is amazing and the staff very nice, helpful, and welcoming. Definitely is a place I would love to stay again when visiting New York.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Close to everything, nice rooms and staffs!","lang":"en","publishedDate":"2023-03-24","publishedPlatform":"OTHER","rating":4,"text":"It was a nice stay, we were close to the central station to connect fast everywhere, 5th av right in the corner with public library and Brian’s park just in 2 minutes. Rooms were comfortable (has king bed! Not easy to find in NYC), nice and clean. The restaurant inside the hotel, Ramerino, has amazing food. The staff so helpful and friendly. We had a wonderful stay!","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Amazing time at the Hyatt centric midtown.","lang":"en","publishedDate":"2023-03-23","publishedPlatform":"OTHER","rating":5,"text":"Amazing experience at this hotel. Very comfortable beds and clean rooms. The service is very fast and on time. The front desk is very welcoming and helpful with their information to the guests.\nBreakfast was phenomenal the food was really good and also the staff was amazing.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Better than expectation","lang":"en","publishedDate":"2023-03-21","publishedPlatform":"OTHER","rating":5,"text":"I was impressed with the staff and service.\nLocation is amazing. Price is reasonable. They let me do a late check out and also were really helpful to keep my luggage few hours before my check in. \nNice and clean for the money.   ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great place to see NYC at a good price!","lang":"en","publishedDate":"2023-03-19","publishedPlatform":"OTHER","rating":5,"text":"The Hyatt was clean and comfortable and was within walking distance to all the major attractions downtown!  We loved their rooftop area that showcases The Empire State Building and the lovely NYC skyline at night!  The rates are average for NYC and the service is top notch and friendly.  I highly recommend a stay here!  The rooms are clean and comfortable as well! ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Perfect gelegen hotel in rustige straat. Goed bed, goede douche met heerlijk grote handdoeken.","lang":"nl","publishedDate":"2023-03-15","publishedPlatform":"OTHER","rating":5,"text":"Kamer groot genoeg en je hebt alles wat je nodig hebt. Goed bed, goede douche, grote handdoeken. Rustige straat maar je zit overal dichtbij, we hebben bijna alles gelopen. Taxi genomen naar Lower Manhattan maar de terugweg lopend ging prima! Diner bij restaurant Ramerino is aanrader!\nJe kunt daar ook goed ontbijten, reserveren vooraf was niet nodig. We hadden een relaxed verblijf hier! ","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"Better than expected","lang":"en","publishedDate":"2023-03-11","publishedPlatform":"OTHER","rating":5,"text":"From a value proposition standpoint, this is a good choice.  The front desk staff upon check in were lovely and I must call out Janette for going the extra mile for a special request.\n\nThe room was nicely designed though the heating unit was quite loud and I wish I'd put in ear plugs before going to bed.\n\nGlobalist breakfast was one of the less generous ones but the staff at the restaurant were very nice.  \n\nAnthony the General Manager was visible and hands on during my stay which was nice to see.  He was very pleasant.\n\nI would return to and recommend this property","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Girls weekend","lang":"en","publishedDate":"2023-02-26","publishedPlatform":"MOBILE","rating":5,"text":"Hotel staff very friendly and accommodating. \nLocation convenient to many area attractions.  Chose this hotel to be in a different location than my last visit. I wanted to be close to Bryant Park and Grand Central. Still easily able to walk to Times Square and Rockefeller Center. \nWouldn’t hesitate to recommend this hotel.","travelDate":"2023-02","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Start spreading the news!","lang":"en","publishedDate":"2023-02-20","publishedPlatform":"OTHER","rating":5,"text":"Our stay with Hyatt Centric was excellent.  We were greeted by the friendly staff when we arrived, the rooms were clean and comfortable and the location was convenient to many of the New York City attractions.  The breakfast each morning was made to order and the portion size was more than adequate.  The rooftop bar had great atmosphere and was a very relaxing place to enjoy a glass of Champagne and admire the lights of New York City. The staff was very accommodating and Katherine Rosario, the Front Office Supervisor, made sure that we enjoyed our stay.   ","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"A Hotel Where You Feel at Home","lang":"en","publishedDate":"2023-02-12","publishedPlatform":"OTHER","rating":5,"text":"This was my 6th stay at this hotel.  I usually stay for 5 to 6 days.  I come to New York for multiple meetings and need a hotel that is conveniently located, a nice room to work in and to rest.  This hotel has it all.  Very easy to get to the subway and many restaurants close by.  The rooms are nice, not large but large enough to work and rest and very well designed.  The staff is great.  You are welcomed warmly at the front desk.  Arlene at the front has a radiating smile and you can tell she is an example of great customer service.  The whole front desk team is great.  They welcome the guests and get them situated as quick as possible.  After a long day of meetings coming back and being greeted so nicely is refreshing.  Shannon at the front is genuinely interested in how your day was.\nThe hotel also has a great breakfast service.  Its usually not crowded, enough solid choices and efficient and pleasant service.  Seyma and her colleagues at the restaurant take very good care of you.\nI've met the manager, Anthony a few times.  He is always helping guests and his team.  You can tell he runs the place well.\nI travel around the world and for the many reasons I mentioned, I look forward to returning to this Hyatt and highly recommend it to friends.","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Hotel was clean but breakfast less than expected","lang":"en","publishedDate":"2023-02-07","publishedPlatform":"OTHER","rating":3,"text":"Restaurant was cold, we had to wear coats and food and coffee were not hot. They had one small space heater by one table near back of restaurant and services was subpar at best. For over $140 for 4 people to eat omelets and toast, the food should have been better as well as the space we ate in. ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Another wonderful stay!","lang":"en","publishedDate":"2023-02-05","publishedPlatform":"OTHER","rating":5,"text":"Stayed at the Hyatt Centric Midtown 5th Ave New York this past weekend - and had yet another wonderful stay! Room layout was perfect - very efficient, modern, clean. Staff super friendly and helpful. And the area is accessible to so many places in NYC! In short, a great place to stay when in NYC!!","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Stylish, comfortable choice for a enjoyable stay in Midtown","lang":"en","publishedDate":"2023-02-02","publishedPlatform":"OTHER","rating":4,"text":"From an easy and efficient check-in, to a friendly welcoming staff, to a quiet and cozy room, to a nice breakfast, our experience was very pleasant.  The location was excellent for our various excursions - centrally located which makes it convenient and accessible.  Decor is funky and bathroom products very nice!  Would def stay here again.  ","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Clean and good location","lang":"en","publishedDate":"2023-02-01","publishedPlatform":"OTHER","rating":5,"text":"Safe and well-lit area. Rooms are comfortable and have more space than a standard NYC hotel room (not just a bed between 2 walls). High quality hair dryer. Turn down service and tidying up every night. ","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Location+ \/ Staff++ \/ Room--","lang":"en","publishedDate":"2023-01-27","publishedPlatform":"OTHER","rating":3,"text":"Used as base camp for another NYC dinner, show, shopping excursion. Good location a couple of blocks from Grand Central, NYC Library and Bryant Park. With the special rate I found at $175 all-in, it was a NYC bargain. Staff was top shelf and made stay warm and welcoming. The room however left much to be desired. First, space - yes, NYC small with that money-saving \"open closet\" for hanging clothes. But to have an overhead shelf, and but 2 drawers for storing clothes\/belongings is below the Hyatt brand watermark. Better to use the \"cabinet\" for the ironing board which didn't fit as cubbies. Second, the bathroom - no shelving or towel bars bath meaning towels go to the floor. Oh but there is one - count it, one peg at 7 feet above the floor for a bath towel. So, the \"keeping green\" really means the money the laundry service makes. Now, there was a shelf under the sink vanity large enough to hold CLEAN towels and a shaving\/make-up kit but little else. Third, avant garde lighting was insufficient and requires a call to front desk to understand how to operate. Fourth, seating? Fugeddaboutit. Then too, if it wasn't very clean, well kept, and again the staff, it would have rated 2-stars in spite of the savings. ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Hyatt Centric: Exceptional in every way, and does NOT gauge NYC guests a daily “resort fee”","lang":"en","publishedDate":"2023-01-25","publishedPlatform":"OTHER","rating":5,"text":"I love this hotel for its impeccable staff who always strive to go above and beyond to ensure guests' comfort\/needs are met with a smile. It is increasingly hard to find such exemplary service in this day and age, when even the most basic requests at other hotels are met with grudging mediocrity.\nThe interiors and rooms are clean and inviting. The mattresses are comfortable and do not have the uncomfortable dip from hundreds of previous visitors. The clean aesthetic carries on to the restaurant, which serves superb food that is fairly priced - no gauging. \nSpeaking of gauging, for the past four years or so, most NYC hotels (even the substandard ones) have added a “resort fee,” -- $25 to $70 daily, on top of the listed room rate. Guests are often surprised when checking in because they only become aware of it upon check-in. It's absolutely obscene! Hyatt has never charged guests this additional fee -- ever.\nThe Hyatt Centric is relatively new and I've returned three times in the last year. I anticipate many more stays in the future.","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Amazing weekend in NYC","lang":"en","publishedDate":"2023-01-19","publishedPlatform":"OTHER","rating":5,"text":"New York is a limitless array of entertainment and world class restaurants. Hyatt Centric midtown is perfectly located from broadway, time square and Madison Square gardens. The exterior of the building is modern glass while the interior is colourful and trendy. The beauty of this hotel is location. The beds are comfortable and shower is great. The staff is professional and friendly. Shannon at the front desk has great advice and a warm, greeting smile every time you enter the lobby. I highly recommend the Hyatt Centric Midtown. ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hyatt Centric Midtown","lang":"en","publishedDate":"2023-01-19","publishedPlatform":"OTHER","rating":5,"text":"Absolutely loved our stay. \nThe check-in was quick and simple. Absolutely beautiful room, clean and classy. The Italian restaurant was excellent and service was impeccable.  \n\nSecond time we have come here, and once again we were more than satisfied with our stay. \n\nAs far as location of the hotel. It is ABSOLUTELY perfect! Minutes away from Times square, central station and subways. \n\nA special thanks to the general manager Mr Damiano who made our special weekend extra special, my wife and I appreciated your kind gesture.\n\nSee you guys again soon","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Amazing location, new hotel, ideal place to stay","lang":"en","publishedDate":"2023-01-17","publishedPlatform":"OTHER","rating":5,"text":"We loved this place for its convenient location to shows, sightseeing and shopping. We come to NYC every year and this will be where we stay from now on. Its new, great service, comfy beds. Recommend the rooms facing the interior. So quiet - great night sleep.  Great service, clean and comfy. Cant wait to come back","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Another great trip to NYC","lang":"en","publishedDate":"2023-01-16","publishedPlatform":"OTHER","rating":5,"text":"We returned to stay at the hotel with friends visiting the city for the first time and had a great trip. Great location as we could walk to everything we wanted to see and the staff was super friendly and helpful. Thank you, Catherine! We hope to come back again in the Spring.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Janky as Hell Hyatt","lang":"en","publishedDate":"2023-01-16","publishedPlatform":"OTHER","rating":1,"text":"Hyatt Elite-Discoverist here..\nSucky hotel and a disappointment from the Hyatt brand. Let's get start from the beginning.\nChecked in on 1\/12\/23 around 3pm. The Caucasian woman working at the counter (with French\/European accent) said my charge didn't go through on the room. I called to confirm with Hyatt\/Chase that there was a travel lock on my card. I fixed the problem, went back to check in with her and she goes \"do you have enough money to pay for the room now?\"...are you kidding me?!? I have a 25k limit lol. Totally inappropriate to make any assumption and comment like that. Then they take our bags because our room isn't ready so we leave for some dinner. We call back around 5 after dinner to see if the room is ready...it's not!!! The front desk receptionist says not until 6pm! 2 hours later than check in time!\nThen the night of the 15 around 8pm we call downstairs to request room service from the Italian restaurant next door....they don't even answer, followed by the receptionist saying \"I don't see anyone around to take an order\"...huh? \nThe room itself is totally small for even NYC. Nowhere to put bags. The bathroom doors don't fully shut or lock...you can hear it all!\nThe rooms are noisy as hell! Constant noise from surrounding rooms and upstairs...and we were on the 18th floor! Wet condensation every morning on the window seal as well!\nYou might get a better deal than many Manhattan hotels, but you get what you pay for, for sure. Only redeeming quality is a good location.","travelDate":"2023-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17762159,"title":"WORST HOTEL EXPERIENCE IN NY","lang":"en","publishedDate":"2023-01-09","publishedPlatform":"OTHER","rating":1,"text":"This has been the worst hotel experience I have ever had. To be honest I cannot understand how Hyatt can have a hotel in NY with that lack of client services. The employees are very disrespectful and without any education (lot of times their answers were \"Yeah\" - with a \"I don't care about that....\" tone, without even looking at us and repeating the same several times. They even hanged the phone up when my wife call to ask for them to clean the room.\nThe first night (December 23rd) there were lot of noise coming from other room (through the ventilation system assume). We went to sleep at 10pm and after trying to sleep without success, at 3am I went to talk with the person at the reception. I told him that I could not sleep and I wanted him to do something. The security guard (that was there too) told me that the noise was coming from 17th floor (I was on the 18th floor) and that somebody already made a complaint about them. The person in charge of the reception told me that they already asked the customers to stop making noise and they will ask again. I return to my room and at 5am I had to go again to the hotel reception to complaint about the same noises (several persons laughing and shouting loudly). The hotel employee told me that they already asked them to stop making noise. I asked him to call the police or to do something about that. He said he couldn't do anything. \nI asked him to give another room to sleep. He asked me \"Now?\". I replied \"Yes, now. I want to sleep\". He told me to return to my room that he will bring me another key for another room. Around 15\/30 minutes later he brought me another key of another room. I cannot believe it was me (the client) who has ask for a clear solution (too late because I hadn't sleep in almost all night).\nThe other problem was that few days they did not clean the room (basic change of towels and made the bed) even if we requested that.\nOn Monday (Dec 26th) we left the hotel at around 11am and when we return around 5pm we found that the room wasn't cleaned at all. We called to request that to clean the room. One person (a man that was at the reception) talked with my wife and he hanged up (after saying \"Yeah\"...a couple of times) without giving her a clear answer. My wife called again and a woman asked her was the name of the housekeeper that was assigned to clean our room. My wife told her that we didn't know that and that was something they are supposed to know that. The same issue happened other days.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Conor Ryan","lang":"en","publishedDate":"2023-01-03","publishedPlatform":"OTHER","rating":3,"text":"Christmas visit just your ordinary run of the mill hotel nothing stood out about it,a bit more glamorous on the website wouldn’t put anybody off staying there best thing about it was location but wouldn’t recommend it either as I a bit pricey for what it is .!!","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Don’t go there ","lang":"en","publishedDate":"2022-12-31","publishedPlatform":"OTHER","rating":1,"text":"This hotel shouldn’t be in Hyatt brand, it must be local hotel, not at level of Hyatt\nLobby is a joke\nRestaurant as well\nBut worse are service and employees\nThey don’t do housekeeping for 3 days when you complain and ask them to do it they don’t care what unacceptable don’t go there ","travelDate":"2022-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location and good service","lang":"en","publishedDate":"2022-12-30","publishedPlatform":"OTHER","rating":5,"text":"It’s only 6-7mins walk to grand central station which is make it easy to go anywhere. Super close to Bryant park. Time square, central park, empire, and many other tourist spots are walkable from this hotel. The room is kinda dark but it’s pretty spacious for NY hotel size. The service is amazing. They allowed us to check in earlier and willing to hold out luggage when we check out. Water is not complimentary unless you are Hyatt elite.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location & value","lang":"en","publishedDate":"2022-12-29","publishedPlatform":"OTHER","rating":5,"text":"Absolutely loved this location and the front desk staff! Will return in a couple of months! Very helpful and accommodating. Love the decor. Housekeeping made sure the room was disinfected and cleaned! ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Sehr schönes Hotel, gute Lage","lang":"de","publishedDate":"2022-12-29","publishedPlatform":"OTHER","rating":4,"text":"Das Hotel liegt zwar etwas abseits von der nächsten U-Bahn Station „Central Station“, aber trotzdem gut zu Fuß erreichbar. Bushaltestelen sind gleich nächster Block. Zu Fuß ist zu erreichen „Time Squar; Central Station; und viele Einkaufgeschäfte“. Haben U-Bahn kaum genutzt.\nEmpfang sehr freundlich, man sprach auch ein paar Wörter Deutsch, zwar nicht genug für CheckIn (wir sind ja auch in der USA), es freut aber einen wenn man auf Deutsch sogar begrüßt wird. Dies hat man echt nicht erwartet. Zimmer sehr gut und bequem ausgestattet. Klimaanlage, sehr großes Bett und großes TV-Gerät. Bad sehr groß und modern, leider wie in USA oft üblich eine Badewanne. Ich mag Duschen einfach viel mehr. Blick ist nicht so besonders gewesen, aber wenn man halt von Hochhäusern umgeben ist. Es ist schon imposant, wenn man unten steht und nach oben blickt. Sehr gute Zimmerreinigung jeden Tag. WLAN ist kostenlos und sehr schnell. Kissen und Decken sehr angenehm, auf Wunsch bekommt man noch mehr.\nKann dieses Hotel echt empfehlen. Auch der CheckOut ging sehr schnell und freundlich. Wir sind mit der U-Bahn vom Flughafen angereist.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"This is the PLACE to stay 💗","lang":"en","publishedDate":"2022-12-26","publishedPlatform":"OTHER","rating":5,"text":"My families stay here was tremendous. The staff was so accommodating and welcoming! I felt right at home especially after a long day of traveling! The room was well thought out and the space was well utilized especially for NY! The location is premier as it’s only a hop and skip from the NYC Public Library, Bryant Park, shopping on 5th Ave, and Times Square\/Herald’s Square. However, it’s nicely tucked away that noise isn’t a problem. This will be my new go to spot. Hyatt Centric got this one right!! ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Christmas trip","lang":"en","publishedDate":"2022-12-25","publishedPlatform":"OTHER","rating":3,"text":"Took our daughter to NY for Christmas.  Picked this hotel based off of reviews stating how close the hotel was located to things we wanted to see and how friendly and helpful the staff was.  While the first part was true, sadly the latter was not.  We arrived a little early (3:30) and they stated our room was not ready.  We asked if it would be ready at 4pm, our scheduled check-in. They stated no and said they had no idea when it would be ready, but they would call.  We had to pull out items we needed in the hotel lobby and leave our bags.  We went and ate and walked around.  They never called.  When we went back and we had to go up to the front desk three different times before we finally gained access to our room.  We also tried to get drinks from the rooftop bar located in hotel.  Was unable to drink inside because of some type of private event.  Said we could sit outside (in December mind you). We ordered drinks, bartender stated he couldn’t make change.  The bartender was very rude to us throughout this whole transaction so we decided to leave.  We would not stay at this location again or recommend.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Manhattan long weekend.","lang":"en","publishedDate":"2022-12-23","publishedPlatform":"OTHER","rating":4,"text":"My Wife and I travelled to NYC for her Birthday to see some shows and to renew our relationship with the City. We have typically stayed at a Hyatt hotel when travelling both in Canada and various US Cities. The location of the Hyatt Centric on 38th was perfect, as we walked every day from mid town north to the Guggenheim, and south to Soho. Ideal location. The service was terrific as always, Ramarino restaurant was top of the charts,( and Sammy V is a gem!). All in all we were happy to stay. Rooms are a bit simple, but serve their purpose very well. Happy to stay again. ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location for family with kids","lang":"en","publishedDate":"2022-12-21","publishedPlatform":"OTHER","rating":5,"text":"We had an awesome time during our stay. An awesome hotel that was in an excellent location making everything within walking distance for the most part. Our kids loved the location. Food and everything really close by as well","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great location - had everything we needed!","lang":"en","publishedDate":"2022-12-12","publishedPlatform":"OTHER","rating":5,"text":"My friend and I were visiting NYC for our first time for four nights, three days in early December 2022. I booked this hotel with a pretty good deal back in April for around $375\/night after taxes and fees. The hotel only opened in 2021, so everything was still in great shape. But we mainly booked it for the location. We were smack dab in between the Empire State Building and Rockefeller Center. Almost everything we wanted to do during our trip centered around our hotel, so the location was perfect. Although, after we walked about 20,000 steps our first full day - we definitely wished a subway stop was right outside the hotel doors!\n\nWe arrived at the hotel just after 6pm on Sunday evening from JFK. Our room was not ready yet and were told that it would be about 20-40 minute wait. After waiting about 10 minutes, the front desk gentleman, I believe his name was Shannon, let us know that they were actually upgrading our room which is why it was taking a long time. However, if we wanted a non-upgraded room, we could get checked in right away. We opted to wait. It took about an hour to get our room. But we got upgraded to the 19th floor when we did not choose a high floor room when booking. We had an incredible view of the Empire State Building! It was definitely worth the wait. They also gave us a voucher for a free breakfast at the hotel restaurant. We took them up on that our last day there. The breakfast was fine, but I'm glad it was free as it is definitely not worth the price! An okay bagel, egg, bacon, and cheese sandwich with a side of fruit was supposed to be around $30 I believe. Rico Bagel is like a block away and you can get an excellent bagel sandwich for $8. \n\nOne thing I do want to say is that Shannon mentioned that we could leave our luggage with them while we waited if we wanted to go out. However, when we took them up on that offer, the area they told us to put the luggage was not secure. So we ended up just waiting in the lobby. I would definitely recommend having a secure area for luggage to be held for guests. \n\nThe room was gorgeous. Small, but efficient. We were able to book synthetic bedding instead of feather when reserving our room, which was great. The beds were probably the most comfortable beds I've ever used in a hotel room! I also called a month before to confirm our booking and asked for a fan to be in our room. They had a nice tower fan in our room once it was ready, which made us more comfortable. \n\nThe room was small but efficient. It had a nice mini-fridge which we definitely put to use. They don't have ice machines, but if you ask the front desk, someone will bring you some ice. That was nice our first day when nothing was cold from the fridge yet. The shower is large and beautifully decorated. However, the shower door does not secure water very well. Not the best design. But we had plenty of towels to keep the water from being a nuisance. \n\nWe left a $5 tip for our housekeeper every day and had excellent service (tip your housekeepers!!). \n\nThree elevators and they are extremely fast!\n\nWe are from the upper Midwest and the last two days we were there it was 90% humidity and almost 60 degrees out. We looked a bit out of place with all of the New Yorkers in puffer coats - but it was hot for us! We also figured out our last night there that our thermostat had not been working the entire time. We had it set to 65 - thinking that's what it was at. But when we messed with it, we realized that it was set at 65 but it was actually 71 in there. I called the front desk and they had an engineer up to our room very quickly - even though it was really late. He had it fixed within ten minutes and for the first time since we got there, we actually had air out of our vents. We had to turn the air up to 68 as it had gotten too cold in there.  \n\nWe really had such a great experience and I would be very happy to stay there when we go back to visit!","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Frustrating Service, Great Room!","lang":"en","publishedDate":"2022-12-07","publishedPlatform":"OTHER","rating":2,"text":"This was our first stay at a Hyatt Centric. Not entirely sure if the smaller room size was simply the NYC effect or the standard for Centrics. Even though we were upgraded to one of their bigger rooms with a balcony, the room was so small that it was hard to walk around the bed. The desk and closet were almost hidden behind the bed. We did appreciate the balcony, but it rained for most of our short stay, so we didn't get to use it as much as we would have liked. \n\nUpon checking in, we were told breakfast would end around 11:30. Of course, we are on vacation, so we wandered downstairs just before it ended, and were told that it closed half an hour ago. We were genuinely confused and tried to explain that the lady who checked us in told us 11:30. After going back and forth with the receptionist, we were told to go out, grab our own meal, and bring the receipt back for them to reimburse. Now, to be fair, I'm not sure there was a better way to remedy the situation, but due to having to go out and find a spot, we were quite rushed for our activities that day (nearly missed the ferry to Ellis Island). Apparently, the weekend receptionist told us weekend breakfast hours, but since this was a Sunday-Monday stay, the next day's breakfast used weekday breakfast hours. The bigger issue was more that the weekday receptionist was rather difficult to talk to and you could almost taste her anger in the air. \n\nSince we were in such a hurry, we were not able to take our suitcases to our next hotel (which I had planned to be on the way to the ferry), so we asked them to hold our bags for us. At the end of the day, when we returned to retrieve our bags, we were told that the receptionist had dropped his keys down the elevator shaft and our bags were locked in the storage room. He proceeded to promise to bring our bags over to our next hotel (I did not exactly trust him to do that safely, as one of our bags lost a wheel during our trip), but we had no other choice, so we left after half an hour of going back and forth. Ten minutes later, he called us back, saying he had found another way into the room. What should have been a simple minute-long process ended up becoming extremely stressful and took nearly an hour to resolve. \n\nThese two situations are obviously probably not what you would experience during your normal stay, but I can't help but feel disappointed by the attitude of the receptionists in each situation. One was extremely belligerent and stubborn while the other was almost just nonchalant and carefree.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location!","lang":"en","publishedDate":"2022-12-05","publishedPlatform":"OTHER","rating":4,"text":"This hotel is better than expected. Clean, up to date, friendly staff. The rooms are a little small and was tight for 3 people. The location and service from the staff outweigh the size of the rooms in my opinion! The rooftop bar is amazing as well as the the restaurant in the hotel. Shout out to Etma (Emma) in the rooftop bar. We made a point to go up there every night just to talk with her, grab a drink and take in the amazing views. A quick walk to Bryant Park, Times Square, 5th Ave shopping, tons of restaurants near by, you really can’t go wrong with this hotel! ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Perfect hotel for a family visiting NYC","lang":"en","publishedDate":"2022-11-29","publishedPlatform":"OTHER","rating":5,"text":"We traveled to NYC with two children, ages 8 and 5, the week of Thanksgiving. This hotel was perfect for us. We felt close to everything, yet far enough way that we didn't feel crowded and overwhelmed by Midtown. Anything we needed was steps away, yet we felt like we were on a quiet street. Within the hotel walls we were happy as well. The staff were friendly and accommodating. The room was spotless and laid out perfectly, so that it was functional for the size. We had a two queen city view room, and we felt it was really comfortable and quiet. Finally, the price was right!","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Pictures are Misleading","lang":"en","publishedDate":"2022-11-11","publishedPlatform":"OTHER","rating":3,"text":"The hotel was much smaller than the picture, the lobby was tiny and smelled of disinfectant. rooms were really dark and small.  Kind of depressing.  They were clean however.  The biggest disappointment was that despite advertising of \"room service\" there was none.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Quelques jours à NY","lang":"fr","publishedDate":"2022-11-07","publishedPlatform":"MOBILE","rating":4,"text":"Chambre très propre avec un mobilier et une décoration récente.  Une literie très confortable.  Le personnel est très sympathique et souriant\nSeul bémol, le petit déjeuner n est pas servi sous forme de buffet, le choix est restreint et le prix élevé. \n","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Bien placé, calme et non brouillant, et propre","lang":"fr","publishedDate":"2022-11-04","publishedPlatform":"OTHER","rating":4,"text":"Nous avons passé un agréable séjour. Le seul hic. C’est le restaurant qui ne fait pas partie de l’hôtel qui servent le petit déjeuner. \nNe veux vraiment pas qu’on se conforme aux exigences de personnes qui était dans la salle est à l’hôtel récemment là. Pour plusieurs jours sur place nous étions un group de 20 personnes \nA revoir pour le petit dej’ \nPour le reste, tout était impeccable 👌 \n","travelDate":"2022-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17762159,"title":"This hotel is a gem!","lang":"en","publishedDate":"2022-10-26","publishedPlatform":"OTHER","rating":5,"text":"I can't say enough great things about this hotel.  We were within walking distance to many attractions including The New York Public Library, Rockefeller Center and  Times Square.  The staff was very accommodating and friendly.  The bed was extremely comfortable and welcoming after spending the day and night taking advantage of all NYC has to offer. This is a new hotel so everything is sparkling and modern.  The rooftop bar is an added bonus with a beautiful view of the Empire State Building, spectacular at night! I look forward to returning next year.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"NYC Weekend Away","lang":"en","publishedDate":"2022-10-25","publishedPlatform":"OTHER","rating":5,"text":"Spent a wonderful weekend in the city to see a broadway show with my Mom and two aunts. The location of the Hyatt was perfect to walk to from Grand Central Station. Close to many sights including the New York Public Library which we visited. The beds were extremely comfortable & the shower was a luxurious treat! The view from the rooftop bar & outside terrace was lovely. What a beautiful hotel! The staff was extremely helpful & attentive. Eveline was a standout! We look forward to staying here again for our next NYC visit! ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Fantastic staff and hotel","lang":"en","publishedDate":"2022-10-24","publishedPlatform":"OTHER","rating":5,"text":"The staff at the hotel are amazing and can help you with anything you need. Anthony the manger is phenomenal. Shannon at reception is such a nice person, every-time I would come back to the hotel or leave we would have a lengthy conversation about my day in the city. 10\/10 would stay here again and will be staying with them again in the near future. ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Can't go wrong here","lang":"en","publishedDate":"2022-10-22","publishedPlatform":"OTHER","rating":5,"text":"Perfect location, good size bathroom for NYC, room is clean & quiet. Bed was very good. Only complaint and its minor is the bed is lower than knee height off the floor.\nI read too many reviews trying to figure out the best option, this is a solid choice. Pricey but its NY.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Midtown experience!","lang":"en","publishedDate":"2022-10-19","publishedPlatform":"OTHER","rating":5,"text":"Hyatt Centric Midtown was centrally located in Manhattan, with great coffee shops and breakfast nearby.  I recommend Gregory's for a good cup of coffee.  We did not get breakfast at the hotel, as it was too expensive.  Our room was clean, modern and quiet.  Very kind and helpful staff as well! ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great staff","lang":"en","publishedDate":"2022-10-17","publishedPlatform":"OTHER","rating":5,"text":"Stayed for one night, room was bigger than expected and staff was friendly. My light was broken in my room, but staff fixed it immediately and were very helpful about it. Overall great experience and would stay again.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"PARFAIT","lang":"fr","publishedDate":"2022-10-13","publishedPlatform":"OTHER","rating":5,"text":"Choisi suite à une promotion sur voyage privé de 40% et ce pour la première fois nous avons passé un séjour exceptionnel dans cet hôtel. \nSituation parfaite.\nPersonnel accueillant et serviable \nPropreté irréprochable  ménage journalier, chambre spacieuse lit kingsize. \nProduits d'accueil de qualité et réapprovisionné tous les jours  idem pour la machine à café. \nFrigo et coffre fort.\nDes couloirs silencieux et bonne insonorisation des chambres.  salle de douche et WC séparés, penderie et tiroirs de rangement. \n3 ascenseurs aucune attente.\nUn bar rooftop de folie avec vue sur l'Empire State\nRestaurant italien dans l'hotel. Prix un peu cher mais de qualité \nSeul bémol le petit déjeuner est trop cher dans sa formule .\nNb nous avions une chambre sur cour...pas de vue mais pas de bruit et à  New York c'est mieux.","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17762159,"title":"Love this hotel!","lang":"en","publishedDate":"2022-10-12","publishedPlatform":"OTHER","rating":5,"text":"We had a great stay. The hotel location is perfect. Round the corner from beautiful Bryant park and the NY Public Library. We took a short stroll to the 34street ferry and sailed over to dumbo in no time which I thoroughly recommend. Most things are walkable from here. We had really good sized, well equipped room with a very comfortable bed. The addition of somewhere to hang a towel of robe would be handy. All staff were wonderful and attentive. Arlene in particular gave us great service. It was my first trip to NY from the UK and I hope to stay at the Hyatt midtown 5th Av on my next trip. ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Nice hotel, 3 stars for recent stay but would try it again.","lang":"en","publishedDate":"2022-09-30","publishedPlatform":"MOBILE","rating":3,"text":"Stayed at the Hyatt last weekend for 3 nights. Had issues with the air con, reception were absolutely useless and engineering were a no show but have since had the manager reach out and assured me that this was a unique issue. Hotel room was otherwise very comfortable and great location. Will give this hotel one last try on next trip as location was ideal and bed was comfortable but I won’t be as forgiving if the air con issue was not unique to this past trip.","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"2 nights in a great location","lang":"en","publishedDate":"2022-09-26","publishedPlatform":"OTHER","rating":4,"text":"Overall a solid, centrally located hotel. Clean room, good water pressure in the shower, comfortable bed. The room got cool from the AC, but never really got to feeling like it was actually at the temperature listed. It takes a minute to get used to the light fixtures and automatic lights on the bed. No closet, but there are places to hang clothes. Keurig in room. Would stay again.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent hotel mid town Manhattan","lang":"en","publishedDate":"2022-09-25","publishedPlatform":"OTHER","rating":5,"text":"Good location.  Rooms and bathroom were clean and fresh and room staff kept up well.  Very good Italian restaurant on site as well as breakfast.  Staff for both were excellent.  Roof top bar was closed which was a bit disappointing.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Boutique new alternative ","lang":"en","publishedDate":"2022-09-23","publishedPlatform":"MOBILE","rating":4,"text":"This is a good alternative near Grand Central. A bit of a smaller hotel feel with decent sized rooms that are nice and new. It is quite new still so the rooftop wasn't open yet.\n\nPros\n- location convenient. Close to GC without being right on the doorsteps and dealing with the traffic there\n- nice new rooms\n- not a huge amount of thoroughfare\n\nCons\n- air conditioning was super noisy, so beware light sleepers\n- restaurant was expensive for breakfast. Seek other options nearby\n- boutique in size but didn't have a personalized feel to it. But can't complain for a business trip.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Meh","lang":"en","publishedDate":"2022-09-19","publishedPlatform":"MOBILE","rating":3,"text":"AC didn’t work, maintenance came but never got above 75 degrees in the room for two days. \nHotel was sold out (wedding nearby), breakfast kitchen only had one cook. Our food took a hour to come out. \nRooms were small but it’s NYC. Nicely renovated rooms and spacious, beautiful shower.","travelDate":"2022-09","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great location, friendly staff","lang":"en","publishedDate":"2022-09-11","publishedPlatform":"MOBILE","rating":4,"text":"Loved the location, central and close to good subway stops and grand central station. \nStaff were lovely. \nBreakfast was so nice - cooked to order and well worth it. Breakfast staff were so friendly. \nInitially given an inward facing which I really didn’t like, they kindly changed it.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17762159,"title":"Not upt to Hyatt Standard","lang":"en","publishedDate":"2022-08-30","publishedPlatform":"OTHER","rating":3,"text":"Location is fine, property is average, i would a different Hyatt property next time. The room was small, dark, sparse, no closet, seems like the Hyatt was trying to cut corners every strep of the way when it comes to the room.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"NYC Weekend getaway","lang":"en","publishedDate":"2022-08-29","publishedPlatform":"MOBILE","rating":4,"text":"Perfect location for our weekend trip to NYC. We wanted a central location that was easy to get to and we were able to explore. Our Main reason for this trip was to go to a concert at Yankee Stadium. Loved that we were close to the train we needed to take to the stadium. \n\nThe hotel was clean. The room are NY rooms not too much space but still were comfy and perfect for the weekend. \n\nThe only reason I didn’t give 5 star is because it doesn’t provide parking. There’s a few garage near so finding parking wasn’t a problem but would be nice if they had parking. \n\nStaff were friendly and attentive. Definitely will be in our NYC hotels rotation.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"decent room, decent price, great staff","lang":"en","publishedDate":"2022-08-28","publishedPlatform":"OTHER","rating":3,"text":"great location, decent stay for the price point, did not like the color of the rooms, too dark and not airy enough, would not stay in this hotel again without a paint lift, staff was friendly, restaurant was below par","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"We had Some Problems, but....","lang":"en","publishedDate":"2022-08-22","publishedPlatform":"OTHER","rating":4,"text":"...we'd definitely give this hotel another try simply based on the great customer service offered by Greg, the assistant GM, Chantell, Arlene and all the wonderful employees we encountered during our stay. That is the reason we gave it 4 stars. As a Globalist, we had been upgraded to a suite and the room itself was extremely clean and comfortable enough from a size standpoint, except we had a problem with the air conditioning, which made for 2 very uncomfortable evenings.  The other concern was the lighting, which is inadequate, especially considering the dark green color scheme and the eclectic design.  But, the hotel was very quiet for NYC, the bed was comfortable, the shower pressure was excellent and breakfast in the restaurant was delicious.  Plus, you can't beat the location and the price for midtown Manhattan. All reason's why we'd give this hotel another try and recommend to our friends and family (assuming the air conditioning problem we encountered was an anomaly and not the norm since I don't see this issue in other reviews).   ","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Buen hotel y muy céntrico","lang":"es","publishedDate":"2022-08-20","publishedPlatform":"MOBILE","rating":5,"text":"Me hospede ahí con mis hijos y mi esposo en diciembre de 2021, es un hotel muy limpio y cómodo y está muy bien ubicado, está a pocas cuadras de una estación de metro y caminando puedes llegar a Bryant Park, es un hotel familiar y de negocios, por lo que si te molesta el ruido es muy buena opción .\nEl personal es amable, sobre todo la persona que estaba en front desk de nombre Michael, siempre sonriente y tratando de consentir a los niños y hacerles platica! Es un hotel al que sin duda regresaría, ya sea en familia o en plan de negocios.","travelDate":"2021-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Outstanding Customer Service at the Hyatt Centric on 5th Ave.","lang":"en","publishedDate":"2022-08-20","publishedPlatform":"MOBILE","rating":5,"text":"On a recent business trip to nyc I had to make a last minute hotel change which landed in at the Hyatt Centric Midtown. I usually stay at a Hilton, but they lost my reservation and were not at all accommodating.  I was not a happy camper and was tired from the flight. I stopped by the Hyatt and talked to the front desk individual- I explained I had no reservation and was told ‘no problem sir we have a room with your name on it .. one just for you’…. with a big smile!! (I thought for a moment I was Twilight Zone). I travel frequently and I have to say, that Edil (the front desk individual) was a breath of fresh air. I was treated like their most important customer (you know the highest rewards tier). I was not really familiar with the immediate area and was tire and hungry. Edil quickly got me checked in and suggested a few places to eat in the area and where the closest Starbucks was… he also let me know when they closed !! I had questions about transportation and a few other items and Edil was more than helpful. His demeanor, attitude, and friendliness was a tremendous departure of what I’m use to at other hotels. To top it off, once I got settled in my room , he called to make sure I was happy with the room.  This has not been my experience at other hotels at all. I will certainly return and will let my office staff and travel department know of the exemplary service I received. Thank you Edil and the Hyatt Centric for a wonderful stay.  I shall return.","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Charming little hotel","lang":"en","publishedDate":"2022-08-17","publishedPlatform":"OTHER","rating":5,"text":"It’s a great location and a nicely appointed hotel with some unusual (but good) lighting features in the rooms. Of course it’s small — it’s a NYC hotel — but the rooms make the best use of the space and they don’t feel small. Didn’t try the restaurant or café but they smelled good. Fitness room was perfectly acceptable— nothing special but it did the job. Very friendly staff. ","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Glamorous, Comfortable, Spacious, Affordable Hotel With High Quality & Service","lang":"en","publishedDate":"2022-08-16","publishedPlatform":"MOBILE","rating":5,"text":"Clean, spacious, stylish, fresh, accommodating and affordable—what a hotel!  Quiet, great value for price, this place is beyond nearby competitors. Housekeeping, front desk and in house restaurant are all beyond expectations and highly competitive quality.","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great value in NYC","lang":"en","publishedDate":"2022-08-14","publishedPlatform":"MOBILE","rating":5,"text":"Fabulous location. Great staff service. Clean rooms. Elegant design. Friend and professional staff. Great for personal requests and highly adaptable. Ok breakfast, yet ready to adjust to personal asks. For views above 18th floor, amazing view. Thank you to the staff.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Location, Amazing Staff","lang":"en","publishedDate":"2022-08-12","publishedPlatform":"OTHER","rating":5,"text":"From the minute I arrived, the staff at the Hyatt Centric Midtown 5th Avenue New York were wonderful -- friendly, helpful, professional.  The location is both completely central to midtown Manhattan and easy to get to all parts of the city.  And although right in the most convenient location it was not noisy.  The restaurant I don't think served breakfast but there are plenty of coffee, breakfast, lunch and dinner places in every direction (although NYC prices).","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great service, clean efficient rooms and a restaurant\/bar that feels like walking into a dream!!!!","lang":"en","publishedDate":"2022-08-12","publishedPlatform":"OTHER","rating":5,"text":"Great hotel.  Love the HYATT Centrics, but this one is well done.  Great service, clean rooms, perfect location, and, the restaurant and bar are just over the top - food, service, value, and atmosphere!!!  All sooo good!!! ","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Super clean room and friendly staff","lang":"en","publishedDate":"2022-08-08","publishedPlatform":"OTHER","rating":5,"text":"Room was super clean. We were on 17th floor. There is no view from room though it was higher-floor. Staff were friendly and helpful. Small room for the price, but I guess that is expected in New York. Overall it was a stress free stay for us.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"OK MAIS SANS PLUS","lang":"fr","publishedDate":"2022-08-06","publishedPlatform":"OTHER","rating":2,"text":"je suis arrivés malade a l hotel .D habitude si on me donne une chambre comme ca,je ne l aurais jamais acceptée, mais la n etant pas en forme ....je me suis laissé pigeonner .Chambre reçue avec vue sur un mur ....aller jusqu a New York pour ca est quand meme fort dommage .Odeur dans la salle de bain .le problème de la salle de bain a été réglé après 24h.Apres m être plein au responsable de l hotel , il m a promis que lors de mon prochain séjour a New York je ne serais pas déçu si je lui envoyais un email.Moi je lui avais plutôt demandé une reduction sur le séjour qui n a d'ailleurs pas abouti .retournant a New York ,je lu ai écrit un email qui est resté sans réponse .......bref meme s il devait me répondre son hotel ne casse rien , il y a mieux pour le prix .A oublier","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Beautiful hotel in heart of New York!","lang":"en","publishedDate":"2022-08-05","publishedPlatform":"OTHER","rating":5,"text":"Loved our stay at this hotel, friendly staff, very welcoming. Well thought out rooms - great design. With a great restaurant with phenomenal food. Well located - definitely will be coming back! Thank-you for making it amazing","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very nice hotel & amazing location!","lang":"en","publishedDate":"2022-08-05","publishedPlatform":"OTHER","rating":5,"text":"Staff is out going and very friendly! From the time we arrived till the time we checked out, we all felt very welcomed! Rooms are very clean, very comfortable and well thought of, love the design. \nYou can tell every detail matters! Loved our stay and would definitely go back! Thank-you for making it so wonderful!","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hôtel calme, Situation géographique ++","lang":"fr","publishedDate":"2022-07-29","publishedPlatform":"MOBILE","rating":5,"text":"Hôtel super bien situé à 3mn de marche de la grande bibliothèque et de Bryant Park, moins de 10mn de Times Square et de l’ESB, idem Grand Central. Personnel très sympa, ménage fait TLJ, à la fois proche de tout et très calme pour bien se reposer après des grosses journées de visites.","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great Hotel","lang":"en","publishedDate":"2022-07-27","publishedPlatform":"OTHER","rating":5,"text":"This is a great hotel. \nIt is clean and close to everything.  \nNice new room with lots of USB chargers, an open style closet, bench, mini fridge, desk and chair. The mini fridge came in handy as we bought water to keep fresh which were needed for the HOT weather we experienced during our stay. The bathroom is nice, especially the shower  Overall the room was clean and chic.\nThe staff was extremely friendly and always went out of their way to say Good Morning or Good Evening and answer any questions we had.\nWe would definitely stay here again.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Decent but not great","lang":"en","publishedDate":"2022-07-26","publishedPlatform":"OTHER","rating":3,"text":"Very good location. Friendly staff. Property was clean and comfortable but very basic. I would suppose about in line with the price. Rooms were small and had a few technical issues while staying there.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very Nice Stay!","lang":"en","publishedDate":"2022-07-25","publishedPlatform":"OTHER","rating":5,"text":"Very much enjoyed our stay at the Hyatt Centric! \n\nThe staff was all super friendly, including responding to a few custom requests. \nOur room was nice and clean. Fast elevators that weren't busy.  AC worked well. Modern shower. Blackout curtains kept the room dark. \n\nGreat location too near Bryant Park, as we had easy access to many Subway lines. \nOne thing to note is the hotel barely has any lobby (only a small sitting area). This fact had no impact on our stay but I suppose some others may value having more of a lobby for lounging. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Pretty good location, chic room","lang":"en","publishedDate":"2022-07-23","publishedPlatform":"MOBILE","rating":5,"text":"Chose this hotel to be a little bit away from the busiest areas but still populated. This hotel is around the corner from the NY Library, close to Bryant Park, a few minutes walk from Grand Central station. Easy to catch trains from here uptown to museums. Plan on 15-20 minute walk to theater area. The hotel area was very quiet late on Sunday night so i took a cab back to it instead of walking—but mostly it seems to be pretty safe to walk in the area surrounding this hotel. Easy to catch cab on the busier streets on either side of hotel. \n\nNice updated room with a lower king sized bed, lots of lighting options, USB chargers, an open style closet with iron and ironing board for biz travelers, bench to put your suitcase or sit and put your shoes, a desk, mini fridge, and chair. I didn’t have a chance to turn on the tv. Bath is nicely updated though the shower floor is a bit slippery and there’s not a lot of counter space. Overall the room was clean, very chic and stylishly updated, but the view from my room faced the other buildings, haha! \n\nLobby was nice, staff are friendly and helpful. Restaurant below was noisy when in the lobby but I couldn’t hear it on the 8th floor. \n\nThis room would be good for a solo traveler or a couple. \n\nI normally like to stay in boutique hotels, especially in NYC, but this was a good value and Hyatt offered flexible cancellation if needed. Would consider staying here again!","travelDate":"2022-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17762159,"title":"Super hotel, amazing location, appropriate pricing","lang":"en","publishedDate":"2022-07-18","publishedPlatform":"OTHER","rating":5,"text":"I Really enjoyed this boutique hotel. It was very comfortable and modern. Couldn't ask for a better location for visiting both downtown and uptown. I had an amazing view. \n\nHeads up that there's no signage on the door, so it can be tricky to find if you don't see the name on front of the hotel","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Weekend getaway","lang":"en","publishedDate":"2022-07-17","publishedPlatform":"OTHER","rating":5,"text":"Convenient location to all of the popular touristy sites including Times Square; friendly and professional staff; spacious and clean guest rooms compared to other NYC hotels (with a fridge); definitely worth a return stay during our next trip. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel, great location, great night front desk staff","lang":"en","publishedDate":"2022-07-11","publishedPlatform":"OTHER","rating":4,"text":"The hotel is in an excellent location, within walking distance of all the major attractions. \n\nSome of the front desk staff were ok (but some were less than helpful). However, we received OUTSTANDING service from Shannon Owens and his manager Gregory Velo - both of these gentlemen made our stay so much more comfortable and enjoyable, and we cannot thank them enough! \n\nWe would recommend staying at this hotel for the excellent service provided by Shannon and Greg, and for the great location. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"AWFUL customer service. Beware before you book!","lang":"en","publishedDate":"2022-07-11","publishedPlatform":"OTHER","rating":1,"text":"Very rude front desk staff (Arlene), I have never experienced a nastier check-in person for no reason at all. I realize it's hard to find employees, but Hyatt should be ashamed to have people like this working. Reported incident to Jasmine (manager) and my complaint fell on deaf ears. Wound up leaving the hotel. This hotel has ZERO customer service.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Location and Staff","lang":"en","publishedDate":"2022-07-08","publishedPlatform":"OTHER","rating":5,"text":"The location is perfect! Right in the middle of Midtown next to Bryant Park. The staff is extremely nice and will help you with whatever it is you need. They were very welcoming to our kids too. Rooms were always clean with great showers and comfortable beds. ","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Gutes Hotel für einen Städtetrip","lang":"de","publishedDate":"2022-07-06","publishedPlatform":"MOBILE","rating":3,"text":"Wir waren zu Besuch in diesem Hotel für einen Städtetrip in NY.\nDie Lage des Hotels ist sehr gut. Man ist schnell bei der UBahn und den Sehenswürdigkeiten.\nDie Fenster sind sehr schlecht isoliert, weshalb man den Strassenverkehr sehr gut hört im der Nacht. Falls man einen leichten Schlaf hat, ist das Hotel nicht gut.\nAlles in allem ein gutes Hotel für ein paar Nächte. Preis\/Leistung stimmt.","travelDate":"2022-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Another GREAT experience","lang":"en","publishedDate":"2022-07-04","publishedPlatform":"OTHER","rating":5,"text":"Just completed our 4th stay at the Hyatt Centric Midtown 5th Ave New York. Each time, we have had a great experience! Staff is very friendly, efficient, accommodating. Rooms are well appointed, comfortable and designed to maximize available space. Midtown location allows for so many dining options - from casual to upscale. All in all, a great choice for a NYC stay.... just cannot wait for the Rooftop Bar to open up!","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"The best hotel in NYC!!","lang":"en","publishedDate":"2022-07-04","publishedPlatform":"MOBILE","rating":5,"text":"The whole staff, from the front desk to housecleaning and everyone in between, were incredibly professional, kind, courteous and always willing to help with a huge smile! My boyfriend and I will definitely go back and would recommend this hotel to anyone and everyone!! We really cannot thank you enough for making our stay such a memorable one! 🌟🌟🌟🌟🌟","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"New, clean, quiet rooms - close to everything midtown - great price for this area","lang":"en","publishedDate":"2022-07-02","publishedPlatform":"OTHER","rating":5,"text":"This is my 5th trip to NYC. We wanted to stay just outside of Midtown because we haven't enjoyed the hotels in that area in the past. This location is great (Murray Hill). So close to Bryant Park and NYC Library and Grand Central Station. Short walk to Empire State building, Rockefeller Center, Theater District. I booked directly with the hotel and the staff member who helped us was so amazing. He even called back to make sure our reservation came through okay. The best part was how quiet the rooms were. New, clean, modern furnishings and comfortable, firm bed that was excellent for my husband's bad back. Clean, quiet, safe, no frills. Great place to sleep at end of long day in the city. A good deal - other hotels in this area are more expensive.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very Clean, Super Friendly staff","lang":"en","publishedDate":"2022-06-30","publishedPlatform":"OTHER","rating":5,"text":"The staff was so friendly and personable. Rooms were very clean, well kept and modern.  Located close to Penn Station and Times Square and everything you want to see , but off the main strip to be nice and quiet too. Housekeeping was so helpful and kept the room clean and stocked. Bed was super comfy.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Few days in New York","lang":"en","publishedDate":"2022-06-25","publishedPlatform":"OTHER","rating":5,"text":"We stayed here with a group of friends and family in for a wedding. Location was brilliant. So central for restaurants and shows and we walked to high line also ( if you like walking). \nRooms were small but comfortable and clean. ","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"New York City Visit","lang":"en","publishedDate":"2022-06-25","publishedPlatform":"OTHER","rating":5,"text":"The location was ideal for touring NYC, dining out and attending plays on Broadway.\nThe rooms are modern fresh and updated with the latest energy efficient lights. Infact, my wife particularly liked the automatic floor lights located on the base of the beds.\nMost importantly, the staff was friendly and helpful. ","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Pleasant Stay","lang":"en","publishedDate":"2022-06-23","publishedPlatform":"OTHER","rating":5,"text":"The hotel staff was very friendly. The room and bathroom was very clean. The hotel location is great. Very close to Bryant Park and nearby restaurants. So far my favorite hotel in midtown. Highly recommended!!","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"A Redemption visit","lang":"en","publishedDate":"2022-06-22","publishedPlatform":"OTHER","rating":5,"text":"My last trip to the hotel left quite a bit to be desired in terms of the customer service. I reached out to the GM prior to this trip, shared my concerns, many of which he was aware of and had already corrected. He assured me that this visit would be very different and he was absolutely right, as you can see by my rating. The only thing I would ask them to consider (which they are) is to allow Globalists access to the entire breakfast menu, and to work out a system where meals and drinks can be charged to the room. However, the team from front desk, to housekeeping, to the restaurant, were all amazing! And the location is perfect.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great midtown location!","lang":"en","publishedDate":"2022-06-18","publishedPlatform":"MOBILE","rating":5,"text":"This hotel is in such a great location! \n\nYou'll read this consistently in many reviews and I'll say it again!  It's removed from the hustle and bustle of Times Square and other popular midtown hotspots, but close enough to walk to them. Also, it's a short walk to many subway stations. \n\nWhile we initially thought we'd be visiting central park a lot during our trip, we ended up spending many of our evenings at Bryant park, which is a just a few blocks from the hotel. While much smaller compared to central park, this park feels a lot more activated, especially in the evening. There are movie and yoga nights on the lawn. There are games such as ping pong too!\n\nAs far as the hotel goes, it feels like a like new or recently renovated property. The rooms are good size and efficient. They service the rooms each day, which is refreshing nowadays.  The room does run a bit warm, however, you can ask for a floor fan.  They are super responsive to service requests. For example, my shower wasn't draining very well. They were knocking on my door to fix within 30 seconds after hanging up the phone. I know it's a small hotel but still very impressive. \n\nThe gym is a good size and never seemed full. \n\nWe only had breakfast one day there. It's a good breakfast with your typical offerings, but it is rather pricey. To give you an idea: our order of pancakes, oatmeal, American breakfast with coffee and OJ came out to $80 after tip.  Don't get me wrong, it was tasty. But maybe not an affordable daily option. \n\nLastly, the rooftop bar is not yet available for this property. \n\nOverall, great Hyatt property! Highly recommend if visiting NYC.","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Clean, comfortable and convenient stay","lang":"en","publishedDate":"2022-06-16","publishedPlatform":"OTHER","rating":4,"text":"The room was great, spacious, modern and clean. We really appreciated the modern and udated room, it makes for a comfortable sleep after a long day exploring the city. The price was reasonable, considering the room, and location in midtown NYC. Staff was corteous and helpful. ","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very good for the price","lang":"en","publishedDate":"2022-06-15","publishedPlatform":"OTHER","rating":4,"text":"Overall a good hotel option in a great location. Rooms are nicely appointed and spacious, but the one I was assigned on the second floor had very little natural light reaching it and the wifi performance was poor. However, this is a better than average hotel by NYC “affordable” standards and I would not hesitate to select this hotel again if the rate is under $250. ","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":17762159,"title":"Well located in Midtown","lang":"en","publishedDate":"2022-06-11","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is amazing. It is located near the 5th avenue - 10min walk from Times Square. The room was big enough for a Manhattan hotel and the staff was very friendly and helpful. We will definitely stay in this hotel again next time we come to New York.","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very nice stay !","lang":"en","publishedDate":"2022-06-07","publishedPlatform":"MOBILE","rating":5,"text":"We had a very good experience staying at the Hyatt Centric Midtown 5th avenue. The hotel is lovely, so is the staff. The room looked like the pictures on the website and was beautiful ! Bed was huge and very comfy. There is a safe and a mini fridge in the room. Cleaning was done everyday, no need to ask the front desk. They keep the luggage for free on the last day and no extra fees like you can find in a lot of hotels in NYC. Close to Bryant Park and Times Square. I definitely recommend ! \n\n(Ps : we didn’t need to use the AC a lot but it may be a bit loud during summer when it’s on)","travelDate":"2022-05","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great hotel and amazing location!","lang":"en","publishedDate":"2022-06-01","publishedPlatform":"OTHER","rating":5,"text":"Had a amazing stay at the Hyatt centric. The location was splendid (just two minutes from the public library), and the room was great in size and clean. The bedroom also had large windows which gave plenty of light.\nWould definitely be coming back for my next New York trip!","travelDate":"2022-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel","lang":"en","publishedDate":"2022-06-01","publishedPlatform":"OTHER","rating":5,"text":"Hotel was nice, clean and convenient.  Staff were very friendly and helpful.  Everything is a short walk or cab ride away, allows a break from the noise of times square hotels without being too far away.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Disappointed,","lang":"en","publishedDate":"2022-05-31","publishedPlatform":"OTHER","rating":2,"text":"If you want to stay in an upscale hostel ok but if not don’t stay here. From the narrow hall ways to get to your room , to the tight accommodations it was an utter  disappointment . No we’re to put your luggage, you have to request ice, room service comes at 9am and the list goes on","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel","lang":"en","publishedDate":"2022-05-31","publishedPlatform":"OTHER","rating":5,"text":"I enjoyed my stay here.  The room was a good size, the shower was the best I've had at any hotel.  Comfortable beds and pillows.  We were on 5th floor and it was pretty quiet.  Managed to sleep good.  Its just across the road from Bryant Park and close to Times Square, Grand Central Station and subways.  The staff were really nice and helpful.  Would book this hotel again if we come to NY.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Hyatt Centric Midtown nails the luxury-on-a-budget\/design-centric vibe","lang":"en","publishedDate":"2022-05-30","publishedPlatform":"OTHER","rating":5,"text":"Since moving out of NYC four years ago (but still coming into the city often for work), I've sampled many of the new hotel brands catering to a younger\/more budget conscious traveller, but still trying to provide a cool, design-centric vibe. This one is the best I've found. Unlike many competitors, the smart and compact room design still feels large and luxurious; the bathroom\/shower is fantastic (and not in the middle of the room!); the bed is comfy-amazing; the exposed closet actually has hanging space for your work clothes. Smart touches, like motion-sensor nightlights around the bed and tinted windows, add luxe without adding $$$. The in-room desk and chair provide a comfortable place you can actually work for many hours a day, if you need to. The staff is outstanding, and the breakfast restaurant is open until 11:30 AM, something I really appreciate on a long work stay! Bravo Hyatt Centric!","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"New Hotel Smell","lang":"en","publishedDate":"2022-05-30","publishedPlatform":"OTHER","rating":5,"text":"Conveniently located in Midtown Manhattan and close to multiple subway lines, so a great starting point for those looking to explore the city. The area gets a little quiet and deserted at night but felt safe the whole time.\n\nThe lobby was small but efficient. The front desk staff were prompt and professional. I believe there's a restaurant in the back, but it wasn't open when I stayed, so they explained that I could order food through a third party. That was a nice alternative.\n\nStayed in a room with a city view and you know it was a new hotel when the room still had that \"new\" smell. Looking out the window there were some building water towers and the Empire State Building in the distance. A pretty NYC view if you ask me! The room was on the small side (though in NYC, this is standard), but it was still big enough to fit a little table and extra seat in there on the side. The bed was a bit on the hard side but still comfy.\n\nOverall had a good short stay here.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Exceptional customer service and the perfect location. Very safe!","lang":"en","publishedDate":"2022-05-29","publishedPlatform":"OTHER","rating":5,"text":"The hotel is located in a prime location close to time square,\nCentral Park and some excellent restaurants. The customer service here was outstanding. The staff was always willing to help and constantly asked about our experience throughout the stay. The breakfast was terrific. The hotel was clean. The staff is presentable and professional. Thank you all for a wonderful visit.\n ","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Mrs","lang":"en","publishedDate":"2022-05-28","publishedPlatform":"MOBILE","rating":5,"text":"Excellent staff,their GM Antony lends a personal touch to ensure every guest is taken care & happy.He helped us beyond words & expectation with our luggage.Their front desk staff Rochelle, Yesenia, Evelin, Jasmine, Arlene and Vernon,is very pleasant ,bell boy Jose is super helpful .Lucy & Andy are very efficient in serving hot  breakfast.We extended our stay at the hotel due to the warmth & personal touch & we expect to come back.God bless each one of you.Thank you Hyatt staff","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Place!","lang":"en","publishedDate":"2022-05-28","publishedPlatform":"OTHER","rating":5,"text":"This is a nice, clean and convenient hotel. Really new and exceeded expectations. Room was nice size with great amenities. Nothing Beats the Hyatt Bed and Pillows. Staff was nice and I enjoyed the quiet atmosphere. ","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Beautiful, Clean Room with only one con","lang":"en","publishedDate":"2022-05-21","publishedPlatform":"OTHER","rating":3,"text":"Pros: The location is fantastic. I loved waking up in the morning and being a few minutes stroll from Bryant Park with of the food\/coffee options nearby, as well a super short walking distance to the New York Public Library and shopping on 5th avenue. The room and bathroom were immaculate. Everything was modern, new, and pristine, and the beds were comfortable. I booked a double room and had 2 queen beds and quite a large room by NYC standards.\n\nThe con: The street noise was unbearable. No one in my room slept. We were on the 8th floor, overlooking 39th street, and we heard the sirens, the traffic, the garbage\/recycling, dumpsters being dropped that sounded like bombs going off, two men fighting in the street, etc. There was zero soundproofing. The beds were very comfortable and I really wish we could have gotten some sleep but I felt like we were trying to sleep in the middle of the street it was so loud. \n\nWould I stay here again? Absolutely, IF and only if I could get a room on a higher floor and on the other side of the building where hopefully it is a little quieter. ","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Up to the Brand Standard","lang":"en","publishedDate":"2022-05-20","publishedPlatform":"OTHER","rating":5,"text":"Hyatt Centric Midtown 5th Ave is our hotel of choice when we are in NYC for business. It's centrally located and the rooms are spacious (for Manhattan standards), they are clean and comfortable. The entire staff is courteous and acclimating when possible.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"A good hotel near Time Square","lang":"en","publishedDate":"2022-05-20","publishedPlatform":"OTHER","rating":4,"text":"Pros: Clean,with new linen and towels, ample of soap and shampoo, quiet at night, free wifi.\nCons: procey ($500\/night) , small room, no free breakfast and parking. No free water bottles in the room. No other aminities such as swimming pool, Spa, parking garage.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great, Functional Hotel in a Convenient Area","lang":"en","publishedDate":"2022-05-20","publishedPlatform":"OTHER","rating":5,"text":"Very clean, well organized, very functional hotel. Excellent staff. Great gym. Lots of quick food nearby. The staff brought a glass to my room in 2 minutes, delivered takeout to my room - it's the little things that count when you're on the road. Definitely recommend for a business traveler. Rooms are small but it's NYC. Wasn't disappointed about that. ","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Volvería sin dudarlo","lang":"es","publishedDate":"2022-05-18","publishedPlatform":"OTHER","rating":5,"text":"Estuvimos 9 dias.Cumplió ampliamente con nuestras expectativas. Excelente ubicación, atención muy cordial, habitaciones cómodas y modernas. Las mismas cuentan con mini refrigerador y máquina de café con cápsulas de cortesía. Al ser un hotel pequeño, el movimiento de gente es mínimo y uno se siente como en casa.","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great location 👍🏻","lang":"en","publishedDate":"2022-05-17","publishedPlatform":"OTHER","rating":5,"text":"Nice, clean hotel that has great location: walking distance to 5th avenue and Madison avenue. The tourist areas are close by- Bryant Park, Ny Public Library, Empire State Building, Grand Central Terminal, Rockefeller Center also. We love Korean food, and Ktown isn’t so far away either. The rooms are not huge but cozy. We had 2 queen beds, a large tv, small closet space, refrigerator and a safe. The bathroom needs more hooks to hang towels. The area is busy but not too loud- although you can hear trucks and such in the mornings. Breakfast was reasonable, omelet, hash, croissant and 2 coffees = $34.  The hotel also welcomed us with some prosecco, so that was nice. It rained one time and we were able to use the onsite Rentbrella where we rented umbrellas free for 24 hours. Great spot!","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"excellent location, super clean small efficient rooms with all amenities","lang":"en","publishedDate":"2022-05-17","publishedPlatform":"OTHER","rating":5,"text":"Locate on 39th St. between 5th Avenue and Madison Ave, this brand new hotel features small rooms (with king size beds), a desk, open closet (no doors to save space, a chair and footstool, large screen TV, safe and mini-fridge, and a spacious bathroom.  While the room is the size of a cruise ship cabin, it's efficient and certainly reasonably priced.  The bathroom needs a towel bar and a small shelf but maybe they will put it in after reading this review .  A rooftop bar is scheduled to open in June so we didn't see that unfortunately.   Breakfast is delicious and features everything you could want, with prices reasonable for the area (figure $25 - $30 p,p. for a full breakfast with coffee).  Dinner is available and on our last night we took advantage since we didn't want to deal with the rain outside.  Food was good, nothing special but hearty and tasty and again, pricing is reasonable.  The front desk people were top notch, there to help in every way.  Daily cleaning to your specifications are offered, so if you only want towels, and refreshed toiletries, that is what you get; if you want full service, you can get that.  Very comfortable hotel for a short stay in the Big Apple. I'm adding this as it's asking me if there is Covid testing on site.  I didn't ask, but there are Covid testing sites on every street right now in NYC.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"A great, affordable place to stay in Manhattan","lang":"en","publishedDate":"2022-05-05","publishedPlatform":"OTHER","rating":5,"text":"We were really happy with our stay here. The staff were friendly and efficient. The room was a decent size (especially by NYC standards). It's a very new hotel, but not sterile. The location is very convenient--good for tourist visits and likely to be convenient for business travelers. The rates, for a Manhattan hotel, were reasonable. NOTE: The bed was incredibly comfortable. Maybe that's just me--I realize \"comfortable\" is subjective--but I wished I could have taken the bed home with me. (I couldn't).","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Plan to Return!","lang":"en","publishedDate":"2022-05-04","publishedPlatform":"OTHER","rating":5,"text":"We're glad we stayed here. Great location just off Fifth Avenue, within a short distance from Grand Central and even the theater district. The staff couldn't have been more friendly and helpful. Our room was relatively small, but well designed, and we heard no street noise, so it was nice and quiet. The next time we go to New York, we will check for rooms in this hotel first.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Superb property. Superb experience.","lang":"en","publishedDate":"2022-05-04","publishedPlatform":"OTHER","rating":5,"text":"An amazing property located in the heart of midtown. The staff was amazing. Make sure Michael checks you in. His hospitality and attention to detail was incredible. I was genuinely welcomed each time I walked into the hotel. From Housekeeping to the Director of Operations, the staff was the absolute finest.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great booking experience!","lang":"en","publishedDate":"2022-05-03","publishedPlatform":"OTHER","rating":5,"text":"Loved coordinating and working with the team at the Hyatt! They were so responsive and helpful. It was a clear process booking for a very large group and we had little to no complaints about everyone's stay","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location GREAT STAFF :)","lang":"en","publishedDate":"2022-04-30","publishedPlatform":"OTHER","rating":5,"text":"Easy check in. Staff at front desk was super nice and answered all my questions. Cleaning crew was funny and so great to see in the mornings. They had all great recommendations for exploring NYC. Thank you :)","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Overnight stay","lang":"en","publishedDate":"2022-04-28","publishedPlatform":"OTHER","rating":5,"text":"The hotel was great for our one-night stay.  Also, the staff was very helpful.  One staff member even showed us how to use an app for an umbrella.  Also, breakfast was very good, and the service at breakfast was  pleasant. We would go back to this hotel for another visit to NYC. ","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Decent place to stay in Midtown Manhattan","lang":"en","publishedDate":"2022-04-25","publishedPlatform":"OTHER","rating":4,"text":"Stayed at this hotel for 4 nights in late April 2022 with adult relatives, sharing two rooms.  Never sure how to rate \"value\" for a NYC hotel. Newly remodeled - rooms are very sleek, pleasant; not huge (had a regular double queen and a king room). A few frustrations - lighting wasn't the best; no place to hang towels (even though you're encouraged bypass housekeeping service until the 3rd day). Housekeeping took items (partially eaten bags of chips and nuts; empty water bottle) as \"trash\" that we were not done with and that were NOT in the trash - even after we complained about it. It was noisy due to some kind of construction taking place all night across the street - but I doubt there are very few places in NYC where you can avoid this - not the fault of the hotel.  On the plus side: great location - just a few blocks from NYC Public Library and Grand Central station. Smaller hotel, so no long wait for the elevators, nor for front desk staff when checking in or out. Front desk and housekeeping staff were very friendly and responsive when we asked for additional towels and coffee. Depending on the price, I would definitely consider staying there again. We didn't eat at the hotel restaurant due to prices. ","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location in the Big Apple.","lang":"en","publishedDate":"2022-04-24","publishedPlatform":"MOBILE","rating":4,"text":"Had a great weekend stay at The Hyatt Centric 5th Ave in New York City.  Rooms are large and spotlessly clean.  The staff is very helpful and accommodating.  Their little restaurant serves a tasty and satisfying breakfast.  My only complaint is that the coffee in the room was pretty anemic.  That's a small inconvenience for such a wonderful stay.  Will definitely return!","travelDate":"2022-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Lovely stay","lang":"en","publishedDate":"2022-04-20","publishedPlatform":"OTHER","rating":5,"text":"My daughter and I really enjoyed our stay at this Hyatt Centric location. It was my daughter’s first time in NY and our room was just what we needed. The staff, including housekeeping, was absolutely amazing. Very welcoming and helpful. The beds were comfortable, roomy shower and good breakfast on site. Walking distance to Grand Central and Times Square.  We look forward to returning again.","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location and great service!","lang":"en","publishedDate":"2022-04-20","publishedPlatform":"OTHER","rating":5,"text":"This location is tucked away, but close to 5th Ave. and has the best rooms to keep your nights lively and your late mornings cozy for extra sleep!  The rooms are beautifully decorated, comfy, and far enough way from the major traffic to let you sleep with the blackout shades.  The staff is very welcoming.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great location and value","lang":"en","publishedDate":"2022-04-15","publishedPlatform":"OTHER","rating":5,"text":"This is starting to become my go to hotel for business trips to NYC.  Location is great.  Close enough to walk to the busy touristy areas and far enough away to not get stuck in that traffic.  Easy to catch an uber or walk to a train station.  Hotel feels new.  Rooms are small, but most hotel rooms in NYC are going to be small.  While small the rooms are functional, clean, and sufficient.  Staff is amazing at all levels from front desk, to housekeeping, to breakfast staff.  Hyatt Globalists are treated very well.  Strongly recommend.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Couldn’t fault anything","lang":"en","publishedDate":"2022-04-15","publishedPlatform":"MOBILE","rating":5,"text":"Hotel was really reasonably priced. Great location, good amenities, hotel room was clean and with nice decor. The staff were super helpful form the day we arrived - especially the front desk and concierge. The team really looked after us and helped us at every opportunity. The rooms were always made up to a high standard too so also a credit to the maid service. We were room only so never ate in the hotel but we couldn’t fault anything about our experience here. Thank you Hyatt Centric for a lovely experience for our first time in NY!","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Hotel with amazing staff","lang":"en","publishedDate":"2022-04-11","publishedPlatform":"OTHER","rating":5,"text":"This is the first time I stayed at this Hyatt.  The room and amenities were very clean.  The hotel staff (everyone of that I encountered) was friendly and went out of their way to see if I had any questions.  I really appreciated the service.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Cozy, great location, amazing service.","lang":"en","publishedDate":"2022-04-10","publishedPlatform":"OTHER","rating":5,"text":"If you like midtown there is no better than Hyatt Centric 39&5th. The area is great! Close to everything without being in the middle of the craziness. You get the benefits of a Hyatt brand with a signature hotel.  ","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"A lovely boutique-style hotel in the heart of midtown","lang":"en","publishedDate":"2022-04-10","publishedPlatform":"OTHER","rating":5,"text":"We had a truly lovely time at the Hyatt Centric Midtown.  From the moment we entered the hotel, Rochelle, Jose, and all the other staff could not have been more responsive or accommodating.  The location was excellent for the theater district and exploring midtown, and our room, although on the smaller side, fit our needs well.  Our only suggestion would be to add more closet\/drawer spaces for travelers on longer stays.  Would definitely recommend.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Small but stylish. Clean and comfortable.","lang":"en","publishedDate":"2022-04-09","publishedPlatform":"OTHER","rating":5,"text":"The hotel is conveniently located in midtown, with a welcoming lobby and staff.  The rooms are recently remodeled and very functional with many places to plug in.  Bathroom is very nicely done and functional - particularly liked that you can start the shower without getting in. The room is small however. As a single person it was fine.  Two would work but certainly no more than that. I will go back if the rates are competitive. ","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Family vacation","lang":"en","publishedDate":"2022-04-08","publishedPlatform":"OTHER","rating":5,"text":"We stayed at this hotel for a couple of days and we had an excellent experience here. Rooms were very clean, staff was very friendly and ready to help with everything we needed. The restaurant was excellent and breakfast was delicious. Would strongly recommend it. We will definitely go back again.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"For Joni and Alba, thanks","lang":"en","publishedDate":"2022-04-07","publishedPlatform":"MOBILE","rating":5,"text":"I have visited many hotels around the world, but none with such kind and special attention.  In this hotel the attention is 10\/10.  All the staff is very attentive and they will always want to help you in everything you want.  The rooms have very comfortable beds and very complete bathrooms, including a hair dryer and shampoo and conditioner.\n\n But I am especially writing this review because of the wonderful and wonderful dinner that my mother and I had tonight.  We sat down and ordered a masala for dinner and were served by an attentive and very caring guy called Joni, he made us have a lovely evening.  We also met the great cook named Alba, she prepared us the delicious dish, it was very good.\n\n The entire experience at this hotel has been truly excellent, from the first minute we arrived.  I hope this review helps you.","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"Wonderful Stay for NYC","lang":"en","publishedDate":"2022-04-06","publishedPlatform":"OTHER","rating":5,"text":"My wife and I stayed here in March 2022 for an entire week. The staff was beyond friendly. As any NYC space is the rooms are small but very well laid out to make the most of the space. The rooms, hallways, elevators and building were always kept clean. Great location between Bryant Park Subway and Grand Central, you can be on a train anywhere without a transfer in just two blocks. But even better is walking everywhere and this hotel is perfectly situated for that. A few great coffee and bagel shops within two or three blocks as well. Look forward to our next trip to NYC and will stay here again. ","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Best location and super friendly staff","lang":"en","publishedDate":"2022-04-02","publishedPlatform":"MOBILE","rating":5,"text":"This hotel is outstanding. The location is unbeatable and the rooms are nice and clean, with a coffee machine , hairdryer, safe and fridge. The staff of the hotel is very very friendly . I rarely experienced such nice people, especially Michael and Rochelle are people with a high value and they have totally understood what it means to make their customers happy. They are very customer oriented and are trying always to find a right and good solution. These two guys are the best!!!\nI will definitely stay at this hotel again when I am in New York next time.","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"Comfortable, basic business hotel","lang":"en","publishedDate":"2022-03-26","publishedPlatform":"OTHER","rating":3,"text":"Hyatt Centric at Fifth Ave and 39th is a comfortable, basic business hotel. \n\nThe bedding is very comfortable, and large windows open for fresh air. The light fixtures are fussy and tricky (hotels should never put clever fixtures in hotel rooms: round switches that you'd think you twist but actually have to tap quickly but not let your finger rest on them....ugh) and the desk-level electrical outlet is blocked by a pole coming out of the desk so you can't use it (huh?).\n\nService is generally friendly but sometimes a bit rough around the edges.\n\nThe restaurant is now open for breakfast and super, super basic (think Denny's or comparable).","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hotel stay","lang":"en","publishedDate":"2022-03-19","publishedPlatform":"OTHER","rating":5,"text":"They let us check in a few hours early and for free. That was a plus. Room was clean and everything worked well! Really appreciated the shower water pressure! Would stay here again! Thank you again Hyatt! ","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Midtown centric hotel","lang":"en","publishedDate":"2022-03-18","publishedPlatform":"OTHER","rating":5,"text":"Great hotel close to the public library and Grand Central Station. The staff is wonderful and accommodating. A special mention goes out to effervescent Micheal, Evelyn and housekeeping manager Ivan, who was exceptionally efficient and kind enough to pay attention to every single detail. They made my stay a truly memorable one. I will certainly visit this little gem again.","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"A boutique hotel experience for those who want to stay in a chain hotel","lang":"en","publishedDate":"2022-03-16","publishedPlatform":"OTHER","rating":4,"text":"I was very pleased with my stay at the Hyatt Centric Midtown 5th. The room was decent sized and extremely well designed. Plenty of outlets for all the tech people travel with today. Numerous different lighting opions in the room (I loved the motion sensor triggered night lights for when I woke up in the middle of the night to go to the bathroom!). While there is not a \"classical closet\" the room's hanging system provided excellent hanging space. The desk space was very large probably 8' long. (One nit there was not a lot of drawer space; a little unit under the huge desk would have been much appreciated). I was on the back of the building. The room was relatively dark as it faced a courtyard of the backs of buildings. That was also a plus, however, as it was one of the quietest rooms I've had in NYC. The bathroom was surspisingly large with great counter space. Front desk was excellent; acknowledged by Hyatt status and offered me the appropriate benefits. One last thing, most NY hotels of this size only have two elevators, this one had three and this was much appreciated as I never had to wait. I would definitley stay here again!","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"No heat or hot water.","lang":"en","publishedDate":"2022-03-15","publishedPlatform":"OTHER","rating":2,"text":"First room had no heat or hot water. The front desk staff were extremely nice and helpful. They moved us to a different room which had heat and hot water. Overall the hotel was adequate as a NYC hotel, but the rooms are very dark and depressing and everything just seems slapped together by someone who decided to try to make a “hip NY hotel”. Standard bathroom with tiny sink, old bathtub. Beds were comfortable, lots of charging ports. Some of the reading lamps didn’t work. A cheap pod coffee maker with off brand pods. No breakfast but you are in the center of NYC so you can get food anywhere. ","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Amazing Staff, Amazing Stay","lang":"en","publishedDate":"2022-03-13","publishedPlatform":"OTHER","rating":5,"text":"I booked this hotel for a business\/pleasure trip. We arrived from Phoenix, AZ several hours before check-in and thankfully were able to check-in early.  The staff was amazing during the entire trip, and the hotel is in a great location. The room was comfortable and quiet.","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Good Value in Manhattan","lang":"en","publishedDate":"2022-03-13","publishedPlatform":"OTHER","rating":4,"text":"Hotel was clean, staff very friendly.  We enjoyed our stay.  Restaurant looked good, although we did not eat there.  Very close to NY Public Library and Bryant Park.  Great location when visiting mid town Manhattan.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"A decent Centric","lang":"en","publishedDate":"2022-03-09","publishedPlatform":"OTHER","rating":4,"text":"While there's some minor issues to overcome, I had a solid, pleasant stay at this Hyatt Centric. \n\nAs a Globalist, I did not get early room access nor an upgrade, but as a frequent traveler to NYC, I honestly don't expect to receive either in a market like New York City. That said, other Hyatt hotels within its vicinity have offered these benefits to me, and even just a verbal recognition that those benefits aren't available would have been nice.\n\nThat said, once I did get my room, it seemed to be newly renovated - it was vibrant, clean, and up to what I expect for a Hyatt Centric - which is pretty high standards.\n\nI appreciated its abundance of light (natural & built-in), and the city view of the Empire State Building was awesome. I know there were reviews about the unrenovated rooms, but the new rooms are fantastic. On the 17th floor, it was very quiet - something appreciated with NY hotels.\n\nAC & water pressure\/heating was up to par for the very cold days during my stay.\n\nBreakfast was a bit of a mess. At the restaurant, it seemed it was understaffed and the staff seemed stressed, and as a consequence, service was inattentive with basics missed. I can't blame them, though, considering how much they had to handle. The food was tasty, though.\n\nIn general, staff were generally friendly - a good measurement for NYC hotels.\n\nWhile it wouldn't be my first choice in Midtown, I was generally happy with may stay & wouldn't hesitate at all to stay here again at this Hyatt Centric.","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"remodeled excellent hidden gem","lang":"en","publishedDate":"2022-03-07","publishedPlatform":"OTHER","rating":5,"text":"My favorite destination in NYC. Very friendly and helpful staff. \nRooms are recently remodeled comfortable bedding and nice clean bathrooms.\nVery reliable Wi-Fi. Also strong cellular service.\nExcellent value","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location!","lang":"en","publishedDate":"2022-03-07","publishedPlatform":"OTHER","rating":5,"text":"It was our first time staying at the Hyatt Centric and it was a great experience. The staff at the front desk were very friendly, helpful and knowledgeable.  \n\nGreat location! We could walk to almost all the major tourist attractions like Times Square, Empire State building, Central Park, Grand Central train station....\n\nLots of  restaurants and shopping close by.\n\nThe room looked brand new, very clean and I loved the design! Beautiful shower and soft and plush towels.  We didn't hear any noise from the city traffic.\n\nI would recommend not travelling with large suitcases because there isn't room to store them.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel","lang":"en","publishedDate":"2022-02-20","publishedPlatform":"OTHER","rating":4,"text":"My wife and I stopped here for our wedding  anniversary for 5 nights last week and we cant recommend it enough. Excellent and very helpful staff and Anthony, the general manager upgraded our room and we had an amazing view of the Empire state building. The hotel is also in an excellent location for getting round Manhattan and has lots of nearby bars and restaurants, as well as Bryant park being a minute away. We will be back\n\nNoel","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Bare-bones 2-Star Property","lang":"en","publishedDate":"2022-02-18","publishedPlatform":"OTHER","rating":2,"text":"NOT a 3 or 4 star property as it is listed.  Although front desk staff is friendly, this hotel has super small rooms that were very shopworn (tape holding molding on walls), no closet or iron\/ironing board or other normal amenities terrible food from their limited room service options (inedible breakfast eggs, no possiblity of getting coffee).   Be warned that there is NO parking on site, and there isn't even a pull-in area for car drop-off, nor is there anyone at front to help unload and bring in luggage.    This property also doesn't honor World of Hyatt member benefits. ","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Perfect stay, great location","lang":"en","publishedDate":"2022-02-18","publishedPlatform":"OTHER","rating":5,"text":"Great little hotel in the perfect location for a quick stay. I was on my own, but it's really absolutely a gem for a single or couple who wants to be in the city using a familiar brand hotel with friendly staff, nice amenities, an easy restaurant and an awesome location. Most of the hotels right around this one are triple the price and do not offer triple the experience. highly recommend.","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":17762159,"title":"Very poor experience","lang":"en","publishedDate":"2022-02-11","publishedPlatform":"OTHER","rating":1,"text":"I stayed at this hotel a few days ago and it was overall a terrible experience.\nTo start when I arrived the street was blocked completely because some utility personnel was performing some work. Water was flowing out in the street making it a mess just to get to the hotel. \nUpon arrival I was told that there was not water in the rooms. Reception did not have any idea as to when the water service was going to be restored. Also I must point out that nothing in the hotel website alerted customers about this major inconvenience. No alternative lodging ideas were offered. Overall this indicated to me that the hotel did not take any ownership of the issue. \nDeciding to checking (and praying that water would be restored soon, I checked in and no acknowledgment of my Globalist Hyatt status was offered. My assigned room was lugubrious with a view of walls of nearby buildings. A small workspace with an uncomfortable chair was not very inviting to do much there. \nBecause there was no operating restaurant in the property, coupons were offered to order breakfast on line through a provider app. Unfortunately it was not working in my phone so I ordered through my laptop using the coupon code . In the end I had to pay for the breakfast.\nInexperienced staff?, no ownership of the customer experience?. Whatever it was I added up to a very poor stay.\n","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Stay","lang":"en","publishedDate":"2022-02-08","publishedPlatform":"OTHER","rating":4,"text":"Enjoyed the stay. Very clean hotel! Looks like it was recently renovated wish is nice. The only thing was the room size a little tight for a couple to stay.  Definitely Look to book the larger room if you are not traveling solo.  ","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Decent Minus Breakfast","lang":"en","publishedDate":"2022-02-07","publishedPlatform":"OTHER","rating":4,"text":"Stay Report - 2\/5 to 2\/6\n\nLocation: The hotel is located on 39th Street between 5th and Madison.  Location wise that's great.  Easy walk to the Times Square, 42nd\/Bryant Park or Grand Central Subway Stations.  There are also lots of restaurants around the hotel (I recommend Chili for Sichuan cuisine on 37th).  Do note though there is currently construction on 39th which has closed a lane and has led to a hell of a racket outside the hotel.\n\nHotel: The hotel is a standard mid level midtown property by which I mean it's a skinny high rise sandwiched between other skinny high rises.  The lobby is very pleasant and has a sitting area, two computer business center and a small coffee shop.  There are three elevators and they are really tiny and there can be long waits for them.\n\nCheck In: Standard New York check in experience by which I mean it was efficient but lacking any warmth.  I was thanked for being Globalist and asked if I wanted my late check out but not given any upgrade.  \n\nRoom: Small, it being New York and all.  What space there was was dominated by the large bed.  There was a tiny desk next to a faux closet in one corner, and there was a fridge and coffee maker but no microwave.  The bathroom was pretty nice albeit small.  Soundproofing however is awful.  I was on the 12th floor and I heard every noise from down below.  Also the apartments next door look directly into your room so be aware to guard your privacy. \n\nDining: They do have a restaurant that serves dinner.  Glancing at the menu showed it's Italian food moderately priced.  Breakfast is via a delivery service called Butler.  Their menu was very limited and they forgot my drink.  Globalists are entitled to one main, one side and one drink.  That was a huge disappointment. \n\nOverall a good stay location wise and if you're just using it as a base of operations it's fine.  But if you have more than one person or will spend a lot of time in the room I'd stay elsewhere","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Location, good stay","lang":"en","publishedDate":"2022-02-06","publishedPlatform":"OTHER","rating":5,"text":"I had a great stay at the Centric. I had a work meeting near 52nd Street and was taking the train to Penn Station so I wanted to be located between the two, the hotel was about a 20 minute walk to each. It's close to Times Sq., MSG, the library and the Empire State Building. 5th Avenue and Madison Ave were a block away. \n\nMy room was modern and clean and the hotel staff were very nice. There is no restaurant onsite yet but one is in the works, being in NYC there are plenty of options near by. I felt pretty safe walking in the area alone at night. ","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"A Gem in Midtown","lang":"en","publishedDate":"2022-01-28","publishedPlatform":"OTHER","rating":5,"text":"Super location with a most professional, helpful and happy staff.\nRooms functional and super clean, beds most comfortable.\nThe location in Midtown is most convenient to everything NYC has to offer.  The hotel is big enough to offer full services but small enough to offer a boutique experience.\nWe will definitely stay here again ","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great stay with a group!","lang":"en","publishedDate":"2022-01-26","publishedPlatform":"OTHER","rating":5,"text":"Visited the property with a group of 35 (kids and adults).  We were welcomed and made to feel right at home.  The rooms were very modern but still comfy and the room service was outstanding.  Will definitely stay here again as it was right in the middle of all the action!","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very nice hotel for its category","lang":"en","publishedDate":"2022-01-23","publishedPlatform":"MOBILE","rating":5,"text":"Great location (just outside of busy area but close to transportation). Rooms are more than adequate by NYC standards and has some nice touches like a Keurig machine, safe and mini fridge, Grohe fixtures and Toto toilets. The toilet and sink\/shower are separated by a door which is makes sharing easier. Would recommend.","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great Location","lang":"en","publishedDate":"2022-01-22","publishedPlatform":"OTHER","rating":4,"text":"This is a relatively new hotel in a great location if you want to be centrally located down town.\nNo restaurant yet, but we understand there will be soon.\nRooms are reasonable size with a modern design, comfortable bed, lot's of natural light, storage and good comfortable bathroom with a great shower.\nfront desk is helpful and friendly.\nonly stayed overnight but would work for longer stay.\nVery impressed for the price.","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Incredible!!","lang":"en","publishedDate":"2022-01-20","publishedPlatform":"OTHER","rating":5,"text":"This hotel is such an awesome place. The rooms were great! Extremely clean and laid out very well. I loved the motion censored lights on the floor for if you were walking in the dark. Unfortunately the restaurant wasn’t open yet, but I would definitely go back to try it. But my main highlight of this stay was the incredible staff!! Evelin, Michael, Rochelle, and Arlene were the absolute BEST! I can’t thank them enough for being so warm and welcoming and always leaving us with a smile. I would 100% come back here just for the incredible staff, but also the hotel is pretty freaking cool too. There’s no reason to doubt if you’d like to stay here, I would definitely book it again!","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Overnight stay!!","lang":"en","publishedDate":"2022-01-20","publishedPlatform":"OTHER","rating":4,"text":"Great experience!!! A clean hotel with friendly and helpful staff!!! Great find!! Also, very close to all the action and places that visited throughout our stay. We always try to stay at Hyatt Hotels because they never seem to disappoint!!","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location","lang":"en","publishedDate":"2022-01-12","publishedPlatform":"OTHER","rating":5,"text":"I truly think that this hotel is going to do very well. The location is just perfect, 2 minutes walking from Grand Central and the One Vanderbilt building, 5 from the Empire State Building, 10 from Times Square. It's completely renovated, fantastic style. It really worths.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"NYC HYATT CENTRIC experience:","lang":"en","publishedDate":"2022-01-04","publishedPlatform":"OTHER","rating":4,"text":"Highly recommend…good rates, clean, close to shops, restaurants, tourist spots; Staff are efficient, attentive, helpful & friendly.\nWill come back specially when you open your rooftop bar\/restaurant .\nSpecial thanks to Michael & Evelyn!😊","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Perfect hotel at a fantastic midtown location","lang":"en","publishedDate":"2021-12-31","publishedPlatform":"OTHER","rating":5,"text":"Our group just got back from a week long vacation to New York, where we stayed at the new addition to the Hyatt family of Centric hotels. Everything about the hotel was impeccable: the facility itself Nd the room, but most importantly, the Staff, which attended to all of our needs. Congratulations on a perfect hotel at a great location ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hot Water Problem.","lang":"en","publishedDate":"2021-12-27","publishedPlatform":"OTHER","rating":3,"text":"Staying in this Hotel from Dec 20-24, the room is newly renovated & small as expected, good location, and helpful staffs. However, on Dec 21, there was no hot water for nearly 12 hours, which was the major issue during winter time. This water heater problem has happened a few times in this Hotel based on the previous reviews. Perhaps Hyatt Group should consider putting this Hotel in category 6.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"A+ staff but various maintenance issues","lang":"en","publishedDate":"2021-12-25","publishedPlatform":"OTHER","rating":2,"text":"I was traveling for a mix of personal and business reasons. This hotel is in a good location. The staff were wonderful but unfortunately we have several maintenance problems, including: heat and hot water did not work.  I could not shower for two days so intimately checked out early and moved hotels. No credit or compensation was provided. ","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Home away from home in NYC","lang":"en","publishedDate":"2021-12-18","publishedPlatform":"OTHER","rating":5,"text":"Amazing staff, exceptional breakfast, fantastic value. The hotel is ideally located, and Rochelle, Evelyn, Michael and Yasmina treated me like a member of their family. What terrific ambassadors for the Hyatt brand.","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Amazing trip to NY this past weekend!","lang":"en","publishedDate":"2021-12-15","publishedPlatform":"MOBILE","rating":5,"text":"This was my family's first trip to NYC and it was a great one, made all the better by the comfortable and positive experience at the hotel. While the fire alarm did go off in the early morning, the staff were of utmost consideration in making sure that our needs were accommodated and that this had minimal impact on our trip. Additionally, it was clear the staff at the hotel had all guests' safety as a priority. The room was clean with an amazing view of the city that myself and my family enjoyed: Would definitely stay here again and will be recommending it to anyone I know visiting the area.","travelDate":"2021-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17762159,"title":"SUPER-FRIENDLY STAFF","lang":"en","publishedDate":"2021-12-15","publishedPlatform":"OTHER","rating":5,"text":"The hotel itself is \"okay.\" It is very central, and it is easy to walk up or downtown. What makes this boutique hotel deserve five stars is that they have some of the nicest staff I have encountered. Everyone was very friendly to me. They were helpful and kind. And for that, I am very grateful. I often have to move a lot of clothes and I travel with a small dog, and the hotel staff could not have been nicer to the dog, and they always offered to help me schlepp my clothes around. I always felt that the staff would keep us all safe.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"New but Old","lang":"en","publishedDate":"2021-12-15","publishedPlatform":"OTHER","rating":1,"text":"Hotel is a category 3 at best. Despite being new, everything about it felt old. The decor is awful, hallways are tight, closets are open to the room, lighting is harsh, and amenities are nothing special. The hotel is not a relaxing place to be at. The price per night was ridiculously expensive given the quality of hotel. Nothing about this Hyatt is like other Centrics. Staff is okay. Room was clean. ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Terrible Customer Service","lang":"en","publishedDate":"2021-12-14","publishedPlatform":"OTHER","rating":1,"text":"Pros: The rooms were nicely decorated and clean. The amenities had a very pleasant smell. The location was great (which was why I chose this hotel in the first place).\nCons: \n1. The rooms were tiny with no room to even leave a suitcase open. However, that is fairly typical for rooms in NYC, I had simply hoped for more from a Hyatt.\n2. My room with a \"view\", that mind you I paid extra for, required you to crane your neck in the very corner of the room to see the Empire State building. The actual view as a series of water towers. Granted this might be the NYC version of view but it certainly is a more than a little misleading.\nThe bigger issues:\n3. At multiple points I saw staff members at the front desk with their masks off.\n4. I arrived at the hotel at 5:30 pm and still had to wait 45 minutes for my room to be cleaned. There is absolutely no reason why my room is not ready for me at 5:30 pm. \nThe biggest problem:\n5. One of our nights a fire alarm went off at 1 am. I have two young children who were obviously fast asleep. When the alarm was not shut off within a few minutes we obviously had to wake them up, dress them for the cold and then run down 18 flights of stairs. Only to be told that it was a false call. I am happy that it was a false call and that no one was hurt and nothing was damaged. However, I am very upset about the utter lack of acknowledgement from hotel management about the major inconvenience that this was for my and every other family staying there. It was an utter nightmare trying to get the kids back to sleep and absolutely affected the remainder of our trip because the kids were sleep deprived. It is unacceptable that there was not at the very least a letter of apology slipped under our door. Or perhaps some chocolates placed on the bed when it was made. Or a question by the front desk as we walked out the door that next morning asking how we were and sorry for the experience. Something. Anything. But instead all we got was utter silence as if it didn't happen. I truly expected more from a Hyatt hotel. I will absolutely not stay at this particular Hyatt ever again.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Clean and Trendy","lang":"en","publishedDate":"2021-12-13","publishedPlatform":"OTHER","rating":5,"text":"The staff is friendly and kind, and the lobby\/elevator has a wonderful smell of citrus.  Having stayed at several other NYC hotels in midtown, this is a welcoming feature!  Nice touch.  Very clean everywhere, and the beds are so comfortable. ","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"Nice stay","lang":"en","publishedDate":"2021-12-13","publishedPlatform":"OTHER","rating":4,"text":"The hotel was near the locations we needed to be close to ( I.e., Grand Central Station, NYU Hospitals, etc.). The room was very nice.  The self parking was not ideal because there were no parking garages near-by and it took sbout an hour to find parking.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Birthday Celebration in NYC!!!","lang":"en","publishedDate":"2021-12-12","publishedPlatform":"OTHER","rating":5,"text":"Yesenia & her staff provided white glove service! All of our requests & needs were were accommodated with a smile. The hotel is centrally located & can walk to any location very easily. Would definitely stay at the same location again.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location and great quality!","lang":"en","publishedDate":"2021-12-12","publishedPlatform":"OTHER","rating":5,"text":"I would definitely recommend this hotel for a vacation stay! It’s perfect location for almost all attractions and sites here in NYC. We walked everywhere and it was perfect. Great rooms and views. Staff was very friendly and so helpful. Manager was on site and welcomed my son with some candy! :) so nice!! ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Outstanding Customer Service at Hyatt Centric","lang":"en","publishedDate":"2021-12-10","publishedPlatform":"OTHER","rating":5,"text":"Hyatt Centric is a new hotel and there is still some lobby construction underway but it did not detract from my experience. The rooms are new, clean, minimalist, and functional. But the reason for my review is to complement the amazing front desk staff. I was traveling for business, and these folks were friendly, quick, and very attentive, calling me by name and knowing my room number, asking me if everything was going well on a daily basis. Evelin was absolutely amazing. She stored my luggage, requested another room for me facing away from the street, gave me a late check out, and offered the option of a car service which was excellent. I was very rushed getting my car to the airport and they quickly took my room keys to get me checked out and directed me right to my driver so I could be on my way. I cannot say enough about how professional and efficient the staff was. The manager also wished me goodbye as I was leaving. Thanks so much to Evelin and the team! I will definitely stay again.","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Another great Hyatt experience!","lang":"en","publishedDate":"2021-12-07","publishedPlatform":"OTHER","rating":5,"text":"Friendly and speedy check in\/out, beautiful and clean rooms and great location. We love staying at the Hyatt hotels and this location did not disappoint, looking forward to staying in the near future. ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great for a Weekend in NYC","lang":"en","publishedDate":"2021-12-06","publishedPlatform":"OTHER","rating":4,"text":"The Hyatt Centric was in a convenient location, central to everything in Manhattan.  We were able to walk to most destination.  The room was clean, bed was excellent and shower was warm with lots of water pressure.  The room was quite small and a little dark but it's NYC after-all.  If you don't plan on spending a ton of time in your while you are in NYC this is an excellent option for a clean, comfortable, centrally located hotel that represents good value for the money.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location, service and breakfast","lang":"en","publishedDate":"2021-12-06","publishedPlatform":"OTHER","rating":5,"text":"It's a new hotel -- only a few months old.  They seem to have worked out all the bugs that are expected from a new hotel.  Our room was nicely appointed and always cleaned (despite COVID).  Everything from the soaps to towels, bedding were 5-star.  One big surprise was the Butler complimentary breakfast room service.  I'm a foodie, and I can tell you that the quality of the food was also 5-star.  (Try the avo toast with the Impossible sausage.)  We have a great story -- when we were in line at a show, my girlfriend discovered that she forgot her driver's license.  (Theaters required proof of vaccination and i.d.)  Michael at the front desk searched the room, found her wallet, took a photo of her i.d. and sent it to my phone.  We got into the show on time!  Thanks Anthony.  You have a great property and crew!","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Over priced, tiny room.","lang":"en","publishedDate":"2021-12-04","publishedPlatform":"OTHER","rating":2,"text":"My wife and I just returned from a trip to NYC and we stay 4 nights at this Hyatt (39th and 5 Ave).   This hotel is way over priced the upgraded room that we reserved had barely enough room to walk around the bed.   No closet.   The hotel's restaurant was not working.  So they told us about a place were we could order breakfast and have it delivered to the room.   Breakfast was good, but THERE IS NO TABLE IN THE ROOM FOR 2 PEOPLE TO EAT!!!!!!!!!!!!  we had to take turns standing and eating!.  The maid only came twice to clean.   The phone did not work.   The internet was unreliable.   the bathroom had a sliding door because a normal door would not have enough room to open - it would hit the bed.   And the view from the high floor (which was extra) was a view of an uninteresting building across the street.   DO NOT BOOK IN THIS HOTEL -  it is a rip off","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Nice hotel - great staff.","lang":"en","publishedDate":"2021-12-03","publishedPlatform":"OTHER","rating":3,"text":"This is a nice hotel, well located in mid-town Manhattan. The staff were great and very helpful. The hotel is rather small, but the rooms were nice. Unfortunately, the wifi was down for one evening and most of the following next day. This was more than a mild inconvenience as I was travelling on business and needed wifi to work. Without the wifi issues I would have given a 4 out of 5. ","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Thanksgiving Week.","lang":"en","publishedDate":"2021-11-29","publishedPlatform":"OTHER","rating":5,"text":"Awesome experience. Easy walking distance to all main sites in the city. Thanks a lot and shoutout to all the staff for going the extra mile to make our stay comfortable. We will definitely come back..","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Location!","lang":"en","publishedDate":"2021-11-28","publishedPlatform":"OTHER","rating":4,"text":"We went to NY for Thanksgiving. This hotel is a great location for the parade, Central Park, shopping, food, etc. The staff was friendly and courteous! The rooms were small yet comfortable. Great gym too! ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel for a family vacation!","lang":"en","publishedDate":"2021-11-25","publishedPlatform":"OTHER","rating":5,"text":"This hotel was a great value, had a great location to experience a lot of NYC (near a lot of food options, classic NYC locations, et cetera), a friendly staff, and comfortable, clean rooms. Would certainly recommend for a family vacation in the city. 👍 ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"New Hyatt Centric at 39th and 5th is clean, comfortable and in a great location.","lang":"en","publishedDate":"2021-11-23","publishedPlatform":"OTHER","rating":4,"text":"from initial greeting an check-in by the front desk staff to our late departure with airport travel arranged by the staff, everything was very pleasant. Looking forward to the rooftop bar opening in the spring.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"NYC","lang":"en","publishedDate":"2021-11-22","publishedPlatform":"OTHER","rating":5,"text":"This was a brand new hotel, staff was so nice and the rooms were very spacious. This hotel is close to everything, including Grand Central Station and the Empire State Building. I would stay here again. ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Clean, Cordial and Convenient","lang":"en","publishedDate":"2021-11-20","publishedPlatform":"OTHER","rating":5,"text":"A new property in a great location! Plus, it has one of the friendliest staffs I’ve ever come across in NYC.  Shout-out to manger Anthony, and also to Michael. The Hyatt beds are comfortable, towels are fluffy, and the toiletries are quality. There’s a big flatscreen, good WIFI, mini-fridge and a nice selection of Keurig. But I need to mention that the rooms are unusually dark-- due to other buildings’ proximity, as well as a dark color palette and the “boutique-y” lighting style.  Just be aware of that.  As for me, I will certainly be returning—with nightlights in tow.  I’m looking forward to the opening of the restaurant and rooftop bar!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Location, Clean Rooms","lang":"en","publishedDate":"2021-11-20","publishedPlatform":"MOBILE","rating":5,"text":"Great location, new hotel, friendly staff. \n\nWalking distance to Bryant Park, shopping and food. For a New York hotel, the room size was decent. Very clean and modern decor (green walls, lounge chair). Other room highlights include a Keurig machine w\/cream, nice rain shower head, and small desk.  15th floor room was quiet from street noise. Easy luggage storage when early check in was not available. Hard to tell how much of the lobby is closed down for construction or as a COVID precaution, but staff was friendly and we don’t stay at hotels to hang out in the lobby. Would definitely stay again.","travelDate":"2021-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hot water cut out in the morning","lang":"en","publishedDate":"2021-11-16","publishedPlatform":"OTHER","rating":2,"text":"The hotel was nice enough, but the hot water cut out in the morning.  The front desk staff said it was building-wide, and maintenance doesn't work on Sundays.  We had to take cold showers.\n\nThe room was fine and clean, though not much more that just the bed, bathroom, and tv.  The location is an easy walk from grand central station. The check in time isn't until 4, which was a bit of an issue because we were going to a 5 PM show, but cabs and ubers are easy to get, and you can leave your luggage at the front desk early before you check in, and then after you check out, which is convenient ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Location is great but the service needs time to improve","lang":"en","publishedDate":"2021-11-15","publishedPlatform":"OTHER","rating":2,"text":"Very very slow butler service breakfast. They told me it will take 1-1.5 hr and I said yes. They text me after 1hr 11min saying it's prepared and on its way.  I called them 20min after getting the 2nd text and they said they need another 15 min so I canceled it otherwise I will miss my train. I was so hangry that time when I canceled it. :( \n\nI know room service takes time so I even asked the day before should I pre-order the breakfast. The person who answered the phone said the system may not let me pre-order. Anyway, unless you get plenty of time otherwise don't order the breakfast even if you have the globalist membership (which I have). \n\nThe hotel is new and the location is great. The night I checked in I was told that they are trying to fix the hot water but we didn't run into a problem. I will wait for some time before thinking about going back.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Never again","lang":"en","publishedDate":"2021-11-15","publishedPlatform":"OTHER","rating":1,"text":"Tiny rooms, no business center, no food or snacks and staff is hard to get their attention.   I come to NYC for business a lot but I will be looking for a different place to stay next time.   I won't recommend this for casual travellers as well","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location and hotel","lang":"en","publishedDate":"2021-11-09","publishedPlatform":"OTHER","rating":5,"text":"Hotel is fairly new with boutique vibe. Well located midtown East walking distance to grand central and attractions. Lobby is a bit small but comfortable. On-site restaurant and rooftop deck will be open in a few months. Room (13th floor) was very clean and comfortable with good storage and blackout blinds for sleeping. Sound insulation was good.  Bed was very comfy and climate control was excellent. Bathroom was well laid out with excellent water pressure and temperature, and good toiletries.  Small desk for work area. All staff I interacted with were friendly and helpful when needed. I recommend this hotel.","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great location, very clean room!","lang":"en","publishedDate":"2021-11-08","publishedPlatform":"OTHER","rating":5,"text":"I’d stay here again in a heartbeat. Friendly staff, great location. Love the lighting in the room and the marble shower was fantastic. I’d definitely choose this hotel over several others that pop up in the area.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"NY stay at Hyatt 39th & 5th","lang":"en","publishedDate":"2021-11-08","publishedPlatform":"OTHER","rating":3,"text":"Hotel under construction.  No amenities available.  There is noise.  Some of the room doors are next to each other, causing a loud noise as it opens and closes.  The dark green paint in the room makes it very dark.  Location is excellent! ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Friendly new boutique hotel steps from B’way!","lang":"en","publishedDate":"2021-11-07","publishedPlatform":"OTHER","rating":5,"text":"Our excitement about returning to Broadway theater after a 2 year pandemic hiatus was underscored by finding a fantastic new boutique hotel just a few short blocks from the theater district - Hyatt Centric at 39th & 5th. Clean - friendly - great find!! We will be back!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"New Property Near Grand Central\/Times Square","lang":"en","publishedDate":"2021-11-02","publishedPlatform":"OTHER","rating":5,"text":"The new Hyatt Centric has many positives - new rooms, fast elevators and very quiet rooms (including facing the street).  The rooms are decent sized for Manhattan and decorated well.  Currently (OCT 2021) there is no restaurant and roof deck is not open either.  For some reason the heater\/air handler couldn’t be adjusted (odd for a new place) so the room was a bit too warm.  Lastly, good sized bathroom but few things to fix - two hooks for towels (2 people in the room) and water seeped on floor from shower…. Can be fixed and typical of new hotel. Overall there is a lot of potential for the Hyatt Centric and hope the management can pull through on the opening quirks. ","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Mostly Good!","lang":"en","publishedDate":"2021-11-02","publishedPlatform":"OTHER","rating":4,"text":"Front desk and management staff were exceptional and professional in every way. Location of hotel is superb. Bed linens and pillows are best in the hospitality industry. The recently opened property is an asset to “the greatest city in the world.”","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great Location","lang":"en","publishedDate":"2021-11-01","publishedPlatform":"OTHER","rating":5,"text":"I had a wonderful experience at Hyatt Centric 39th & 5th. First of all, the location is perfect. I was able to comfortably walk to a concert at Madison Square Garden and loved how close it is to other big spots like Bryant Park and Grand Central. The staff was very friendly, the room was clean, and the view from my balcony was great! I would definitely stay here again!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great hotel! Great Location!","lang":"en","publishedDate":"2021-11-01","publishedPlatform":"OTHER","rating":5,"text":"Recently opened, this was my first stay at the Hyatt Centric.  The mid-town location is ideal.  Within view of 5th Avenue, its a short walk to Lexington and the East Side  as well as Times Square and the West Side. The hotel is small but has all the conveniences.  Check-in and out went very smoothly.  Staff was efficient, pleasant and knowledgeable. The room was small but well laid out with adequate work space and lighting. All Globalist benefits were provided and although the on-site restaurant was closed, snacks were available for purchase and breakfast by “Butler” was available. Definitely take advantage of this amazing service.  For anyone planning a trip to New York City, I highly recommend this hotel!","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great place, friendly staff!","lang":"en","publishedDate":"2021-10-30","publishedPlatform":"OTHER","rating":5,"text":"This was a perfect getaway for me and my wife. We had a room with a view of the Empire State Building,  going to sleep looking at those lights is amazing. The staff was great, went above and beyond. Thanks!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Weekend Stay in NYC","lang":"en","publishedDate":"2021-10-25","publishedPlatform":"OTHER","rating":5,"text":"Everything was exceptional…clean, new and friendly service. Wish the restaurant and roof was open but I guess that’s a reason to return. We were only on the third floor but elevators were quick which is always a plus.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"VERY small rooms and nothing open at the hotel","lang":"en","publishedDate":"2021-10-25","publishedPlatform":"OTHER","rating":2,"text":"I would highly recomment staying at the Hyatt House in NYC and not this hotel.  There is nothing at this hotel to do and nothing is open.  That combined with the SMALL room and only one little desk chair to sit on made this experience miserable.  ","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17762159,"title":"A great stay in NYC!","lang":"en","publishedDate":"2021-10-25","publishedPlatform":"OTHER","rating":5,"text":"The one thing that makes this hotel great are the people working there, my only complaint is my room was a bit dusty and dark, perhaps put a light over the work desk area, also I could have used a luggage stand as the closet area was too small to hold my bag, other then that my stay was perfect, I slept great and walked everywhere including to Broadway to see a show, the staff was fun and always willing to help out with questions, Thanks for a great stay!!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"The Best Little Hotel in Midtown!","lang":"en","publishedDate":"2021-10-23","publishedPlatform":"OTHER","rating":5,"text":"My colleague and I needed rooms in a hotel near Grand Central Terminal because we had to be at work at 5am the next morning. I found the brand new Hyatt Centric 39th & 5th and booked it, thinking \"It must be decent if it carries the Hyatt name.\" When we arrived, we found a brand new, charming little hotel with a beautiful lobby and friendly, attentive and very efficient front desk staff. In about two minutes, we had our room keys and hopped on the elevator to find our respective rooms. My \"Manhattan-size\" room was sparkling clean, well appointed, thoughtfully laid out and had the most comfortable king size bed. I couldn't have been happier and spent two nights there declaring to myself that \"this will now be go to Manhattan hotel.\" I've already booked it for another trip. Besides its fantastic location in the heart of midtown, the Hyatt Centric 39th & 5th is a wonderfully affordable hotel with clean, safe and very comfortable rooms.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":17762159,"title":"Very friendly staff;","lang":"en","publishedDate":"2021-10-22","publishedPlatform":"OTHER","rating":5,"text":"Everybody at this hotel to a person was welcoming, friendly, and accommodating.  Even the maintenance folks downstairs by where the fitness center is.  It's like the Hyatt in Kauai.  Except this is NYC, where you don't expect that.\n\nThe rooms are NYC-sized (i.e. not huge) but tidy, clean, and functional. Foodservice, which is currently provided\/delivered by a 3rd party company, is probably the weakest point of this property-- limited selection and dilatory delivery.  I'm looking forward to when the property has its own restaurant\/breakfast service up and running.\n\nAbove all, I think the mgmt of this new property is committed to customer satisfaction and continual improvement: when I checked in, the mgr was personally greeting people and making sure everybody was accommodated and happy.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Credit were credit is due: Great service recovery.","lang":"en","publishedDate":"2021-10-21","publishedPlatform":"OTHER","rating":5,"text":"----- NEW REVIEW -----\nSome background: I've stayed this property twice. The first stay was terrible, and I rated this 1*. I've had to remove this review as TA wont allow me to post more than one review every 3 months. For this reason I've included the old review below.\n\nCredit where credit is due: after a first stay that was really bad (my other review is still up, below) this stay has been exemplary. The hotel, and in particular GM Anthony really did try to make things right. Often (and I personally think this is why people complain) guests are just after some points, but this is the easy way out; and, after spending those points, I'm sure guests are back to resentment.\n\nAnthony, on the other hand, took time out of his day and we had almost an half an hour discussion. After this discussion I made the decision to give the hotel another chance and I'm glad I did.\n\nBefore my stay Anthony and his team were of great help arranging the many packages I had arrive to the hotel, Amazon decided to deliver almost every item in a separate box resulting in 13 packages. These were all waiting for me when I got to my room. I've only had this happen at the Park Hyatt Seoul before and this was a really nice gesture.\n\nCheck in this time was extremely smooth and very swift. The woman at check in, I didn't catch her name, was very hospitable and a big difference when compared to my previous stay. This time I stayed in room XX07, and I can definitely recommend paying extra for this room category. The room is situated much farther away from the elevator and this meant a much better sleep at night. I will add, however, that this room is opposite a linen cabinet that I presume is used by housekeeping so there is some noise during the day. While this room faces the street, the windows are definitely well sound proofed, as the only traffic that was audible were police sirens. Normal traffic wasn't audible. Great.\n\nI tried the gym this stay and it was great for a hotel gym. The gym has three treadmills, an elliptical and stationary bike. Most importantly, however, the dumbells go up to 70 pounds. Most hotel gym only have weights up to 50 so this is something I particularly liked. The gym is of decent size, particularly for Manhattan. \n\nLocation is perfect. Comparing it to the Hyatt Centric Times Square, you are just a few blocks away from the craziness that is Times Square, and for this reason I actually prefer this hotel's location. Fifth avenue is around the corner and central park is 15 min away by foot. \n\nFor those thinking of using BLADE: I did a speed test on a week day at 4PM, and uber to the helipad + BLADE + transfer to T4 at JFK was two minutes slower than an uber straight to JFK. It can take up to 20min to get from the hotel to the helipad because of Manhattan traffic.\n\nI would like to thank Anthony for his hospitality and his efforts into making things right. This was a wonderful stay and I have already booked my next stay for my trip next month.\n\n----- OLD REVIEW, RATED 1* --------\nI'll start by saying I was really looking forward to my stay, having stayed at the Hyatt Centric Times Square property a few times, which is amazing. Long story short: book that one instead.\n\nPrior to arrival, requested a room on a high floor away from the elevator. Arrived at the property at 4PM - was assigned a room on the 8th floor with a view of a brick wall. I'm a Hyatt explorist member - and while this isn't the highest tier in Hyatt, you'd think they would at least assign a better room. Asked for a different room, but was told the hotel was fully booked (yet still selling rooms to the night across different categories at 4PM... interesting)\n\nWe put a DND sign to the room as soon as we entered. We had valuables worth 10k+ USD in the room that didn't fit the safe so we didn't want anyone to enter our room.\n\nOur bathroom had issues: the water wouldn't drain. I raised this and specifically asked if maintenance can fix this AFTER we checked out. Instead, maintenance shows up 15 min later, knocking the door with the DND sign hanging right there, so I sent them away. Spent 2 hours in the city, came back to see someone had entered our room. Foot marks in the bathroom, and 2 towels on the bed. Called the operator and asked why anyone would enter the room - was told 1802 requested towels. We stayed in 802. I understand mistakes happen but I asked the operator why anyone would enter a room with a DND sign on, and operator admitted that shouldn't happen. I ask for an investigation, the next day I get a different story: the leak in the bathroom had to be fixed. Clearly one of these stories is true. Got an apology email from the GM, who managed to spell my last name wrong. You'd think if you're in damage control mode to get your guest's name right.\n\nRooms are OK but walls paper thin - we overheard everything the couple next to us was discussing, even at the lovely time at 2AM. There is also CONSTANT beeping from the elevator, clearly audible in the room throughout the day. This drove us completely insane.\n\nOur flight is not until 10PM, but we are ready to check out at 8AM. We are completely done here.\n\nLocation is fine. Extremely small lobby, no bell man to assist with luggage.\n\nThe Hyatt Centric Times Square is usually around $20 more. Stay there.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hyatt Centric- Review! GREAT STAY!!!  Recommend this brand new hotel!!! Fabulous staff! Rooms! Amenities! Read on!","lang":"en","publishedDate":"2021-10-20","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is beautiful, clean, excellent service, welcoming staff beginning with Mark at the fromt desk who helps  accommodate each guest request upon arrival and greets with a warm genuine smile. The front desk staff during the day includes Rochelle, Jasmine and Freedom! Who are each welcoming, kind, accommodating at both check in and throughout my entire stay!! Vernon is at the desk throughout the evening and as energetic, kind, helpful, welcoming, and ensures all is in order, safe and attended to throughout the evening! \n\nThe hotel is brand new!! Walk into the beautiful well laid out lobby.  colorful, clean, plenty of room to spread out, comfy navy couches, amd big window to look out while doing business, reading or relaxing, amd a breakfast area opened till 11:30am offering fresh pastries, teas and coffees! \n\nThe hotel also has a brand new GYN downstairs with plenty of workout equipment and machines to use! Feel great after workout!! An entire separate sink, washroom, bathrooms downstairs to wash up after a great workout!! \n\nThe rooms are SPACIOUS! Well laid out!! The bed is super comfortable! King size bed with excellent bedding! You will have a great night sleep! \nThe room is decorated with art work, painting above bed, and a separate seating area- couch\/chair and foot rest! There are draws and hanging space for plenty of clothes!! The window has black out shades so you can use for good nights sleep  and open for sunlight during day! There is a large TV- you can use chrome cast or bring your own Amazon Firestick and the engineer will be happy to help you with any questions or needs, set ups, and is super kind, patient and happy to help successfully! \n\nThe bathroom is stacked with fluffy white towels, soaps, shampoos, conditioners, tissues, clean !! Amd nicely decorated! The shower is a rain full shower and spacious as well!! You will enjoy a nice hot shower whether it’s after your workout , first in morning, or after a day walking NYC!! \n\nThere are so many outlets available around bed as well! And plenty of lights , night lights, lamp and all done very meticulously and cleanly!!! \n\nIvan is head of housekeeping staff and is also full of smiles, welcoming! And helps to make sure you are stocked with all the items you would like !!! Very generous and attentive!! \n\nThe refrigerator  in room is added bonus to keep drinks and snacks if you choose!! Also a safe in the room if you should need one!! \n\nA wonderful stay!! I would absolutely  recommend and would certainly  return when I’m\nBack in the area!!! \n\nThank you to the entire staff!!! For a wonderful stay!!!!","travelDate":"2021-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17762159,"title":"Wanted a view😫","lang":"en","publishedDate":"2021-10-16","publishedPlatform":"MOBILE","rating":3,"text":"We arrived at 4pm only to be told no view and no restaurant or rooftop and there was nothing they can do fully booked ...the room was small but very clean the hallway very narrow hard to get your bags in ..\nIf I had to stay more than a night I'm sorry this would not be it due to the lack of amenities. ","travelDate":"2021-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17762159,"title":"Great Midtown Location","lang":"en","publishedDate":"2021-10-13","publishedPlatform":"OTHER","rating":5,"text":"Enjoyed our recent stay at this Hyatt.  Great location, within walking to restaurants, bars (try Mulligans around the corner), and Times Square. Our room was spacious, quiet, and clean. Michael, at the front desk was wonderful.  Our bags were delayed at the airport and he was very reassuring that the hotel would inform us when they arrived.  He ended up delivering them personally at 12:30 in the morning. Terrific service!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Nicely located, clean Hotel","lang":"en","publishedDate":"2021-10-12","publishedPlatform":"OTHER","rating":5,"text":"This is a fairly new hotel within the Hyatt chain.   The rooms as they are on the small end as all hotels in the NYC area are, they use every square inch wisely.  Everything was clean, and the front desk responded to all questions, professionally and promptly.\nThank you to everyone there!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Average hotel","lang":"en","publishedDate":"2021-10-12","publishedPlatform":"OTHER","rating":3,"text":"Room was clean but they do not clean until every third day of your stay. Wish there was an option for daily cleaning, especially if you provide proof of vaccination. Rooms were small as expected, but it was fine. I wish they had cleaned surfaces better--there were finger prints from previous occupants all over the place. Also no blackout curtains and people in the buildings across can see clearly into your room (as you can clearly see into theirs). ","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Hyatt centric 39th & 5th recently opened and it was beautiful comfortable and very high end in room Decor. Would highly","lang":"en","publishedDate":"2021-10-11","publishedPlatform":"OTHER","rating":5,"text":"Beautiful new hotel with nice size rooms. Beautiful rooms and bathrooms. Big comfortable king size bed with large TV and ample space for your clothes. Air conditioning worked really well and automatic lights when you get out of gef","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Perfect Experience","lang":"en","publishedDate":"2021-10-11","publishedPlatform":"OTHER","rating":5,"text":"Came with friends for a quick trip to NYC for friends' first trip to NYC. The hotel location is perfect, close to everything we wanted to explore. The staff was very friendly, professional, accommodating and helpful; always greeting us with a smile and asking how everything was with our stay, The room was comfortable with nice, funky furnishings and all the modern touches you'd need. Though rooms are on smaller size compared  to other cities, they were larger than I expected for NYC. Amazed how quiet the rooms were (no street noise or from hallways\/other rooms).\n\nThe hotel is new, so everything isn't open\/completed. The Butlr delivery service for breakfast was efficient and tasty. I look forward to returning to try the restaurant and bar, once they open. \n\nWhile our stay was amazing, I do offer the following feedback to the property...the lobby has a coffee bar, I wish the property offered a market\/pantry to get drinks (soda, juice, water) and snacks along with ice and ice buckets for rooms since we had to get drinks from a store. Bathrooms need more places to hang towels\/clothes than the one towel hook. Left no place to hang clothes while showering and makes it difficult to be environmentally conscious by reusing towels when you don't have any place to hang damp towels. \n\nDefinitely will stay here again.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Amazing Hotel","lang":"en","publishedDate":"2021-10-10","publishedPlatform":"OTHER","rating":5,"text":"I came to the city to visit with friends and family as a last minute idea. When I booked the Hyatt Centric I was not expecting such a beautiful hotel with what I would say was the best all around staff I have experienced in a hotel in many years. If you get a chance to visit New York this is the hotel to stay at it’s kept amazing clean by a great housekeeping team and the front desk team are extremely friendly and helpful.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"A small but efficient hotel in the heart of Manhattan.","lang":"en","publishedDate":"2021-10-10","publishedPlatform":"OTHER","rating":4,"text":"We attended a freinds wedding and this hotel was conveniently located. We like that the hotel didn’t have a huge lounge that made it easier to go in and out without facing lots of people. Room was small but well designed with all of the amenities including a mini freeze. Staffs were friendly and the front desk staff were profession and courteous.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Nice property in a convenient location!","lang":"en","publishedDate":"2021-10-10","publishedPlatform":"OTHER","rating":5,"text":"What a wonderful place to stay while on business or for pleasure in NYC. Conveniently located at 39th and Madison, a very short walk from 5th Ave., this property is very clean and friendly.  I will be staying again! One note, the hotel states 5th and 39th, but if you are getting a taxi or ride share, go to Madison and 39th.  It is just on the left side of the street walking toward 5th.  ","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Excellent new property in a great location","lang":"en","publishedDate":"2021-10-09","publishedPlatform":"OTHER","rating":5,"text":"First time staying here as it opened very recently. The location is excellent. The staff is superb. It was quiet, well appointed and perfect for a NYC stay. Rooms aren’t huge but big enough. Very well decorated. My room was in a back corner and was very quiet. AC worked beautifully. TV was perfect with lots of channels. WiFi was fine. Only issue is kitchen isn’t open yet but should be soon along with their rooftop bar which should open by Spring. Terrific staff; incredibly friendly. Will stay again for sure. ","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"Excellent","lang":"en","publishedDate":"2021-10-01","publishedPlatform":"OTHER","rating":5,"text":"New hotel in a great location, near Brian Park, Rooms are relatively large for New York (we stayed a couple + 2 children), Quiet rooms, everything new, lobby a bit small but not disturbing, Feel safe on the hotel street, near Fifth Avenue excellent service","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Modern clean and quiet","lang":"en","publishedDate":"2021-10-01","publishedPlatform":"OTHER","rating":5,"text":"Quiet and comfortable. Food service was outstanding and easy to follow. Close to a grand Central station for easy metro access. They offered $50 for early check in and I felt very welcomed. Room was big and didn’t hear another person the whole stay","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very nice, new hotel in the heart of Manhattan","lang":"en","publishedDate":"2021-09-29","publishedPlatform":"OTHER","rating":5,"text":"Checked out on Sunday, and could not have been happier with our stay. Our room was a nicely appointed 12th floor standard King room. Everything about our stay was exactly what we wanted. Do not hesitate to book this new hotel.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Updated and great location","lang":"en","publishedDate":"2021-09-28","publishedPlatform":"OTHER","rating":4,"text":"Good sized rooms for NYC right in Manhattan. Friendly staff and nice, clean. Modern design made it seem to be newly renovated. Convenient to both Grand Central and Penn without being directly in a noisy area such as times square. Would return","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Not really Hyatt standard","lang":"en","publishedDate":"2021-09-27","publishedPlatform":"OTHER","rating":3,"text":"The hotel is new, but boy, they did cut corners when renovating. Wall paper is scratched all over, some outlets did not work, poorly furnished edges, etc. No sound proofing whatsoever. We could hear neighbors above walking and people next door talking. We got a room facing inner yard and it was dark, noisy (there is an industrial fan outside). Even through we were on 11 floor, the noise was quite loud even with window closed. When I opened the window once the room was filled with a smell of burnt oil, I think the fan serves a restaurant. No body cream, no bathrobes. I stayed at Hyatt Centric Tokyo and it was amazing. NYC is nothing even close to the same standard. I guess its the city of low standards when it comes to hotels, so consider that when choosing where to stay. ","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Perfect stay at the new Hyatt Centric 16 E 39 St Manhattan","lang":"en","publishedDate":"2021-09-26","publishedPlatform":"OTHER","rating":5,"text":"Hyatt Centric Hotel 16 East 39 St Manhattan is an oasis of quiet elegant simplicity in a city where this is very rare. From the moment I entered the hotel the reception by staff and the physical ambience were  inviting, calm and warm.\n\nMichael ,who checked me in, listened carefully and responded swiftly to my questions about breakfast, TV channels and request for extra towels and bath gel. \n\nIn the room, I liked the gentle fresh color scheme of tourquoise and cream with hints of navy blue.\nFirst I took a warm shower in the spacious bathroom and tried the extra smooth sumptuous cotton sheets of the highest thread count.\n\nThis stay at the Hyatt Centric provided the quiet calm I needed to restore my energy to face the challenges of a normal day in the Big Apple.\n\nAt checkout, Arlene was very helpful giving me easy precise directions to my meeting a short distance away. Also I noticed the presence of General Manager Mark during check-in and General Manager Anthony during check out near by. This confirms for me that outstanding customer experience is number one priority of this Hyatt  team.\n\nIn fact, I felt so good that I plan to return again which is why I have booked my next two stays at this Hyatt.\nCharles","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Very nice stay!","lang":"en","publishedDate":"2021-09-26","publishedPlatform":"OTHER","rating":5,"text":"We checked out this morning and everything about our stay was very nice. Well appointed room. Nice bathroom. Location cannot be beat, in my opinion. We would not hesitate to stay at the Hyatt Centric 39th and 5th again in the future.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Do yourself a favor abs stay here","lang":"en","publishedDate":"2021-09-19","publishedPlatform":"MOBILE","rating":5,"text":"The staff was incredibly friendly and helpful, they hand wrote out some amazing suggestions for places to visit in the city.  The rooms were immaculate. We met the GM he showed us where the rooftop bar will be, we will probably come back just to see it when completed.  \n\nI highly recommend staying here, they created a family owned B&B type environment","travelDate":"2021-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17762159,"title":"Look No Further!","lang":"en","publishedDate":"2021-09-17","publishedPlatform":"OTHER","rating":5,"text":"My client and I recently traveled to NYC for a few days and boy ol boy, this was the perfect place to stay! From the moment we checked in we felt welcomed and valued as a guest. The hotel staff did an excellent job going over everything in detail as it pertained to our stay. The rooms were spacious considering a hotel in NYC. If you're looking for a nice view- reserve the Empire Suite, it's amazing! \nMark and Anthony did an amazing job communicating with us during our stay as well as making sure we had everything we need. Again, if you're searching for the best place to stay LOOK NO FURTHER! ","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":17762159,"title":"Billed as a boutique hotel but is a Hyatt Place","lang":"en","publishedDate":"2021-08-31","publishedPlatform":"MOBILE","rating":2,"text":"This “place” somehow bills itself as a boutique but has none of those touches — You need to get yourself and your bags through two narrow doors and into a very small lobby without help, rooms have no robes, mini bars are not stocked, room service has no wine or liquor, etc.   And be warned that contrary to all advertising on the website the rooftop bar \/ restaurant has not opened even the hotel has been operational a few months.","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17762159,"title":"Great stay!","lang":"en","publishedDate":"2021-08-26","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here for one night with our 5 yr old on his first trip to NYC on his first adventure in NYC.  Room was ready upon arrival.  Great location walkable to Grand Central, Ny public library and Times Square. Hotel has a small boutique feel which I haven’t seen in Hyatt brand prior.\n\nWe were in 1401.  Larger than expected but small as you would expect for an NYC hotel room.  Great use of small, clean and beautifully decorated. Small bathroom but toilet was separate from shower (huge plus when traveling with a 5 yr old)\n\nRestaurant and bar aren’t open yet, but hotel does have room service.\n\nA huge thank you to Michael and Jasmine for making our stay so wonderful! We can’t wait to return!","travelDate":"2021-08","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":17762159,"title":"Great location in Midtown","lang":"en","publishedDate":"2021-08-23","publishedPlatform":"OTHER","rating":4,"text":"This hotel is newly renovated and did not have everything up and running when I visited unfortunately. The rooftop bar and breakfast area were not available yet. The hotel itself is in good shape (since I'm a building inspector, I will say I think the general contractor could have done a better job with some of the final finishes). \nThe staff more than made up for these things tho! Very friendly, helpful and accomodating.\n\nI would definitely ask when booking about the room view. I stayed in Room 1602 which is tucked into a corner and very dark (so this is great if you want to sleep in and the black out shades work great too!) However, if you want light and a city view, this is definitely not the best room.","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17762159,"title":"Nice location","lang":"en","publishedDate":"2021-08-19","publishedPlatform":"OTHER","rating":5,"text":"The location is really good and the service is great too. Close to subway, 12 minutes walk to time square. Ton of places to shops around the hotel. The room is nice and doesn’t feel too small. Will stay there again ","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17762159,"title":"New Hyatt Centric hotel in NYC","lang":"en","publishedDate":"2021-08-09","publishedPlatform":"OTHER","rating":5,"text":"It was exciting to be one of the first people to stay at this hotel. It’s a brand new hotel, everything was new and clean! I loved the large screen TV with Chromecast, the light fixtures, and the shower. The bed and sheets were really comfortable. This is a great location and there are so much shops and restaurants nearby. The staff was really friendly and helpful. I felt really welcomed as everyone greeted me and they all seemed really excited to be there. Special shout out to Arlene & Michael at the front desk. I would stay at this hotel just for the friendly staff.","travelDate":"2021-08","tripType":"FRIENDS"}
