{"helpfulVotes":0,"locationId":17765111,"title":"pleasant vacation","lang":"es","publishedDate":"2024-04-09","publishedPlatform":"OTHER","rating":5,"text":"Although the hotel is small in terms of the size of the rooms, the beds are very comfortable and above all clean, the breakfast area can be a little chaotic due to its size but it fulfills its purpose, the attention of Giovanni, the breakfast manager, is unbeatable. The same as Esteban, the guy at the reception who welcomed us at all times with a smile and was willing to help us with whatever we needed.","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Perfect - Amazing personnel","lang":"en","publishedDate":"2024-03-22","publishedPlatform":"OTHER","rating":5,"text":"That was an amazing experience. The hotel is very clean and modern, yet affordable for this part of Manhattan. Perfect location. A few minutes' walk from Penn Station and Times Square. The bed is very comfortable. The heating\/aircon is efficient. The room sizes are as advertised. No very one-sided contracts to sign upon checking in. No hidden charges on check out. Breakfast is good and varied enough. The lobby is welcoming.\n\nHowever, what makes this hotel truly unique is the staff. They are all very friendly, professional and helpful. I was travelling with my toddler and heavy luggage and everyone volunteered to help all the time, anticipating our needs. Everyone was super lovely, the type of lovely one would expect in a small underpopulated village in the countryside where people are just happy to meet other souls. So it's the best of both worlds. You get the proper NY and small community vibe. \n\nSpecial thanks to Cynthia and Michael. I didn't memorise the others' names, but I thank everyone. \n\nI would go back without hesitation and I highly recommend it.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"It was ok","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"MOBILE","rating":4,"text":"It’s actually a 3.5, but the room was clean and not so tiny (for Manhattan, Paris and London standards) so don’t want to rate it too low.\nBreakfast was terrible. The worst I’ve ever seen. Inedible food plus disposable plates and cutlery created waste which could have easily been avoided.\nStaff was ok, you could leave your luggage for free after the check out which we really appreciated.\nFree “coffee” in the lobby (basically brown water), but great tea selection and hot chocolate!\nGreat location in the middle of it all, if you’re looking for that, I would opt for a different location next time (not a fan of hectic TS area).\nGood value for money.\nI can recommend.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Just perfect","lang":"en","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":5,"text":"Room really great size, breakfast good, location great, ideally located close to Penn St and 42nd st stations. Rooms cleaned daily and staff friendly and helpful. Free luggage store on departure day,  would stay again in a heartbeat.","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great experience!","lang":"pt","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":5,"text":"Hotel was pleasantly surprised by the accommodation, kind staff, comfortable room and very clean every day of our stay, the small kindness of coffee and cookies at reception made the trip even better!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"NYC","lang":"en","publishedDate":"2024-03-04","publishedPlatform":"OTHER","rating":4,"text":"breakfast area is so small.\nHad to wait until tables get emptied.\nFood quality not better than expected.... good location and clean.\nOvernight parking stamp was helpful to save some bucks. Clean bath and bedroom.","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"room looks bigger in pictures","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":4,"text":"You can slightly hear the footsteps and people walking up stairs.\n Everything else was perfect, reasonable pricing. so close to subway and variety food vendors +restaurants.\nThe room looks smaller in person, it'll be great for business trip.","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Get Away","lang":"en","publishedDate":"2024-02-20","publishedPlatform":"OTHER","rating":4,"text":"We had a great stay.  The staff was exceptionally helpful and friendly.  The room was neat and clean.  The free continental breakfast was good with lots of variety. Free warm cookies available in the lobby after 5pm.  Everyday a different one and enjoyable.  Free tea and coffee available in the lobby as well. Everything you needed outside was easily accessible and walkable.  My only complaint was no full length mirror in the room. We will be back and tell our friends.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Just sufficient","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"OTHER","rating":3,"text":"The Room was very small and the breakfast was insufficient really without choice and quality.\n(Not cheese or ham or other salt cold plate. And the bacon offer as hot plate was boiled and not crispy).\nQuality of bed and position was good.","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Amazing place to stay","lang":"en","publishedDate":"2024-02-10","publishedPlatform":"OTHER","rating":5,"text":"Great location, clean and modern accommodation, facilities and staff brilliant.  \nThoroughly enjoyed our stay and freshly baked cookies daily 5pm onwards were a lovely touch. We wouldn't hesitate to stay again.\n","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"A highly recommended hotel","lang":"en","publishedDate":"2024-02-08","publishedPlatform":"OTHER","rating":5,"text":"Travelling and staying inside Manhattan is sometimes a concern as to the service and cleanliness of the hotels.  LaQuinta removed all of our concern during our recent weekend stay in the Big Apple.  The location of the hotel as well as the cleanliness of the facility was only surpassed by the friendliness of the staff during check-in, check-out, and questions during our stay. An excellent choice for anyone looking to stay downtown to see the sites or take in a play!  Two Thumbs Up!","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Hidden gem hotel","lang":"en","publishedDate":"2024-02-03","publishedPlatform":"OTHER","rating":5,"text":"Beautiful modern we hotel we booked 4 rooms and every room was the same spotless like new very clean spacious rooms especially for new york perfect location for times square plenty of food places near by we cannot fault this place breakfast was plenty choice travelling with fussy 5 children we all loved here ","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Good location, not sure if good enough for the price","lang":"en","publishedDate":"2024-01-05","publishedPlatform":"OTHER","rating":3,"text":"I stayed at La Quinta by Wyndham Times Square South in New York, attracted by its fantastic location. The hotel's central spot offers easy access to key attractions, but the steep price tag made me question the overall value. Additionally, the breakfast left much to be desired with a limited and subpar selection. While the clean and comfortable rooms and (most of them) friendly staff added some positives, the premium cost may require a second thought for potential guests.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Good mid-range hotel","lang":"de","publishedDate":"2023-12-27","publishedPlatform":"OTHER","rating":3,"text":"The hotel is in a very good location for exploring New York, lots of things are within walking distance. Our room was clean, big enough, big comfortable beds, big shower. Unfortunately, the staff were unfriendly and simply ignored us. They never said hello or smiled back. We didn't feel like guests. It's a shame. We travel a lot and rarely experience anything like this.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Fantastic Stay, Great Hotel, Meh! City","lang":"en","publishedDate":"2023-12-20","publishedPlatform":"OTHER","rating":5,"text":"Stayed three nights while fulfilling a bucket list trip to see the Christmas spirit that embodies NYC. Hotel was in a great location and easy walk to Bryant Park, Macy's, Central Park and WTC among other spots. Special note for neurodivergent or otherwise sensitive people - this part of the city smells real bad, the noise levels are inescapable, the crush of people is worse than a mosh pit, and the traffic ... just plan on walking everywhere. \n\nDid find the staff at the hotel to be exceptional - Diana at Front Desk and Maria in Housekeeping - are true gems that went out of their way to make our stay memorable. Thank you to you both!. \n\nThe hotel itself - rooms are about the size of a college dorm room - tight quarters for two adults with two carry ons - but the king bed was comfortable. Sound proofing is not great so if you are doing the nasty, everyone will hear you for a couple of floors at least. \n\nBathroom is tight, though rain shower was a nice surprise - just be careful turning it on as there is no room in the shower to avoid the cold initial spray. Breakfast was decent - not a fan of hotel eggs and this hotel continued that trend - though really nice selection of breakfast pastries, waffles, yoghurt and fruit. Coffee was consistently better than any of the overpriced cafe's we tried. \n\nWould stay here again and highly recommend. ","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Small well-kept hotel","lang":"de","publishedDate":"2023-12-10","publishedPlatform":"OTHER","rating":4,"text":"Apart from the size of the breakfast room in the basement and the associated inconveniences such as having to queue for a free table, everything was to our satisfaction. Great location and very clean. Rooms may be a little small, but that's pretty standard in Manhattan. We would book the hotel again. But we would prefer to have a leisurely breakfast out.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great","lang":"en","publishedDate":"2023-11-29","publishedPlatform":"OTHER","rating":4,"text":"Room was nice and clean. Decent location, 10 min walk to Bryant park. Staff was very nice. Cookies....yummy. Great price and parking across the street. Good choices of food close and not to far from everything.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Don't stay at La Quinta","lang":"en","publishedDate":"2023-11-25","publishedPlatform":"OTHER","rating":1,"text":"They effectively charge you twice for the room by blocking your card for the room cost + $100 security deposit when you check in, then charging you again when you check out. A week later, the initial blocked card amount has still not been released","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"trip to New York for sight seeing","lang":"en","publishedDate":"2023-11-19","publishedPlatform":"OTHER","rating":3,"text":"we booked La Quinta due to the central location in Manhattan\nThe room is reasonably equipped with a comfortable bed and a very convenient bath (shower)\n\nthe breakfast area is poorly furnitured, limited choises with poor taste - from 8:00 A.M. it is overbooked => waiting cue to enter","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Decent for the price","lang":"en","publishedDate":"2023-11-14","publishedPlatform":"OTHER","rating":4,"text":"Pros:\n1)\tGood location\n2)\tComfortable bed\n3)\tFridge and Coffee\/tea making facilities in the room\nCons:\n1)\tThe Bathroom door kept sliding open\n2)\tNot the biggest room\n3)\tBreakfast could have been better\n\nOverall would recommend and stay again","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Awesome","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"Great location, near bus station and subway stations. Near time Square. Great bed, clean bathroom, super friendly staff. Cookies from 5pm to 10pm. Nice breakfast, Ingrid in the kitchen staff is wonderful. Would come back for sure.","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Gran Eleccion!!","lang":"es","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"Ubicación, limpieza, comodidad.. todo fenomenal. Agradecer a todo el personal del hotel su profesionalidad y disponibilidad (recepción, limpieza, desayuno). Destacar a Andrea y la recepcionista del turno de tarde por su gran ayuda en un problema que tuve con mi maleta. Muchisimas gracias!! ","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Very well located","lang":"fr","publishedDate":"2023-11-03","publishedPlatform":"OTHER","rating":5,"text":"Hotel très bien situé. Belle chambre pour New York avec lit king size. A noter, le personnel très sympa. Salle petit déjeuner petite, il peut y avoir un peu d'attente. Prés du metro Pen sur la ligne E direct Jamaica station ( aéroport).","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"A modern, clean shoebox!","lang":"en","publishedDate":"2023-10-16","publishedPlatform":"OTHER","rating":4,"text":"I chose this hotel for a quick overnight stay for an early morning appointment in the city.  The plus: modern design, slanted floor to ceiling windows, modern flooring (I avoid carpeted rooms as it holds germs, stains)!, small fridge ,convenient to restaurants in Hell's Kitchen.'\nThe negatives: It is a shoebox!  You walk into room and the king bed takes up the entire space. There's no way someone can get up to use the bathroom without you waking up as well. \nI booked this for convenience and because all other lovely (8.5+) hotels I've previously stayed at in Manhattan were nearly $600 for one night.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Hôtel idéal pour court séjour à proximité de Times Square","lang":"fr","publishedDate":"2023-10-12","publishedPlatform":"MOBILE","rating":4,"text":"Salle petit déjeuner très petite. Chambre bien entretenue et idéale pour court séjour. Distributeur de boissons chaude à volonté et mis à disposition gratuitement. Cookies offert à partir de 17h00. Personnel ne parlant pas français.   Notion d'anglais indispensable pour le séjour dans cet hôtel. Hôtel idéalement situé à proximité de Times Square. ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Small & compact but solid hotel. Good location is a plus. ","lang":"en","publishedDate":"2023-10-09","publishedPlatform":"MOBILE","rating":4,"text":"Pros:\n1) Fairly good location. Not too far from Times square and near Port authority bus terminal. \n2) Rain shower which is unexpected in this type of size room and price range. \n3) Comfortable bed. \n4) Complimentary water, coffee,  and cookie (5pm afterward) service station in the lobby. \n5) Complimentary breakfast. \n\nCons:\n1) Limited space for breakfast area. May have to wait for available seating. \n2) No gym facility available. \n3) No dining option available. \n\nVerdict:\nI chose this hotel after reviewing many reviews. I am glad I had chosen this hotel. I have stayed 2 nights at the hotel using 30,000 Wyndham points per night. Given another chance to stay in NYC again using Wyndham points, i will probably choose to stay at this hotel again. ","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Very good hotel in a good location.","lang":"en","publishedDate":"2023-10-09","publishedPlatform":"OTHER","rating":5,"text":"Very good hotel in a good location. The staff is friendly. The rooms are well equipped and modern. The cleanliness of the rooms are good and are cleaned daily. The breakfast is great for the price-performance ratio. Recommended!","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great hotel near Time Square","lang":"en","publishedDate":"2023-09-26","publishedPlatform":"OTHER","rating":5,"text":"I stayed here on a weekend.  It was very clean and fresh. It was located near Time Square and a reasonable walking distance from the High Line, the Shed, and the Vessel. Breakfast was as expected. I'll stay here again. \n","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Lovely hotel near Times Square","lang":"en","publishedDate":"2023-09-24","publishedPlatform":"OTHER","rating":5,"text":"This hotel was very clean and the rooms were very comfortable.  The shower was great.  I was on the 9th floor and it was pretty quiet.  Breakfast was as expected.  The staff was welcoming.  The hotel is near Times Square and a reasonable walk to the High Line\/Shed\/Vessel, etc. ","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excelente, melhor lugar para ficar custo X benefício","lang":"pt","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":5,"text":"Cama excelente, café de cortesia 24hs muito bom, e.cookies no final da tarde e noite todos os dias tb. O espaço do café da manhã é pequeno mas rápido as pessoas comem e cedem os lugares. Hotel super limpo, recepção com atendentes excelentes ( Alessandro e demais) gerente mto atenciosa e prestativa. Localização ótima e bem seguro. Produtos de banho dove e toalhas e roupas de cama super cheirosas.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Good hotel close to Times Square","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":5,"text":"Overall good hotel. Close to the important places. Kind service. Breakfast room is very small. But breakfast is good. Stayed with family for NY visit. Clean rooms. Enough space in the room. We were happy staying here. ","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great experience","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"OTHER","rating":5,"text":"Everything was really great. All the employees were nice and happy to help. I would definitely come back again.  The front desk employees were incredibly friendly, nice ,and the best they all speak Spanish. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Pleasure","lang":"en","publishedDate":"2023-08-15","publishedPlatform":"OTHER","rating":4,"text":"Went here because we drive clients to destinations and nyc was were they wanted to be. So we drove and stayed and left the next day. The property was good and shower was the best part. I also like the shopping and pizza as well","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Super Accommodations","lang":"en","publishedDate":"2023-08-07","publishedPlatform":"OTHER","rating":5,"text":"We stayed here for 4 days to celebrate our 49th Wedding anniversary. The rooms were very clean and well kept. The hotel was within an easy walking distance to Time Square and Central Park as wekk as the bus routes.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Quite a wonderful surprise.","lang":"en","publishedDate":"2023-08-01","publishedPlatform":"OTHER","rating":5,"text":"We booked the LaQuinta Inn adn Suites by Wyndham Times Square South for a pleasure trip to Manhattan. I was a bit trepidiatious prior to our stay because of a horrible experience we had at a LaQuinta Inn and Suites in Myrtle Beach, S.C.\nWe were pleasantly surprised by the comfort of our room, the quality of the bed and linens, the quality of the bathroom, the cleanliness of not only our room but the entire hotel.\nThe staff was quite delightful and extremely helpful.\nAnd the free breakfast was a nice little surprise to make the stay even more pleasant.\nWe can not recommend this hotel enough. Good price for mid-town Manhattan...and a great room with even greater service.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Every Surprised,Nice!!","lang":"en","publishedDate":"2023-08-01","publishedPlatform":"OTHER","rating":5,"text":"Was very surprised!! Great looking lobby and rooms. We had a 2 beds room and was very clean just what we needed for only staying a couple days.\nStaff was super friendly and very helpful. It was nice to come back to fresh made cookies every night.\nWould definitely stay here again 👍","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Thank you guys !","lang":"en","publishedDate":"2023-07-27","publishedPlatform":"OTHER","rating":5,"text":"I really wanna say a good word about all the help and great welcoming (twice) that we got from NAIRIM, ESTEBAN and CYNTHIA!\nWe visited first for 3 nights and then came back for another night few days later. The amazing staff made us feel like we are home and that is very rare especially when it's our first visit in the US.\nThe rooms are clean, breakfast is fair enough and the location is o.k, great homemade cookies tho lol. close to 7 eleven , great food in the area 😀 \nMust say again that the staff made the experience and the vibe the best!\nThank you, Gracias, and Toda!💞\nThe Zadok family ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17765111,"title":"I love NYC ","lang":"it","publishedDate":"2023-07-27","publishedPlatform":"MOBILE","rating":5,"text":"A New York per la terza volta, ed il La Quinta ci coccola e vezzeggia x tutta la settimana. Stanza più grande delle medie newyorchesi pulitissima e bagno spazioso e luminoso. Colazione varia e abbondante, unico neo la sala un po' piccola per accogliere tutti gli ospiti se decidono di fare colazione insieme. Comunque hotel ottimo nuovo e di tendenza. Estremamente soddisfatti. ","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Wonderful Hotel Near Times Square","lang":"en","publishedDate":"2023-07-24","publishedPlatform":"OTHER","rating":5,"text":"We absolutely loved this hotel. The hotel appears to have been renovated at some point and it was done wonderfully.  The staff is excellent and very helpful, going above and beyond to help me with a work issue that required a printer and scanner.  The rooms are beautifully decorated, the bed and pillows as comfortable as any we have used. I will note, because some people don't understand, that this is a downtown hotel, so the rooms are smaller than some are used to, but they are plenty roomy enough, including a work area. The room was cleaned each day.  Cookies are provided every evening in the lobby and coffee is always available. The hotel is very efficient at storing and retrieving bags if that service is needed.  \nOther reviews mention it so I will as well, the free breakfast is a bit so-so, and the breakfast room is small and a little hard to move around in if you go at a busy time. But the food and drinks provided are good and refilled often.\nThe hotel is on a quiet part of the street, we were never bothered by outside noise, and about a 5-minute walk to Times Square. We highly recommend this hotel. ","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17765111,"title":"Good. Nice-Looking. Affordable.","lang":"en","publishedDate":"2023-07-18","publishedPlatform":"OTHER","rating":5,"text":"My fiancé and I really enjoyed a good time at your hotel last week. We checked in at the time we were supposed to do. It really helped having complementary coffee and tea ready to serve yourself as you walk into the location. Sometimes you want to drink either after eating dessert in the city. The room and bathroom were completely clean and cozy. The room had everything they advertised it had. You got what you were promised to get. From a king sized bed with two nightstands with wall power outlets to a closet where you can hang your clothes and iron them with the appliance they offer you to go it with. You could manage your A\/C temperature as you wanted to. What I loved about the bathroom is the two types of shower knobs and heads the shower had. That was amazing. Moving on to breakfast, it was the typical American breakfast you find at many hotels with complementary breakfast. Breakfast is in the basement level. I was highly satisfied. But what I loved the most was the ability they gave us to make our own waffles. I love waffles. So I indulged in one in one of the days I ate there. The day we checked out at 11:00A.M., the Front Desk workers put our luggage away in a storage until we came back to retrieve them. This is a complementary service. The Front Desk agents were also very professional and amicable at the same time.  I cannot be any more satisfied with the service we received. Thank You Very Much for everything Guys and Gals! ","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent ","lang":"en","publishedDate":"2023-07-12","publishedPlatform":"OTHER","rating":5,"text":"An excellent hotel very clean and close to everything. Thanks to Alexander front receptionist for his help during my stay. He was very professional. All NY attractions are walking distance. Very safe area to walk at night. ","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Good room, good location, nice staff","lang":"en","publishedDate":"2023-07-08","publishedPlatform":"OTHER","rating":5,"text":"For the price in New York this was perfect.\nThe location close to Time Square, MOMA, Cental Park and still a bit away from the noise was really nice.\nThe only thing to improve would be the breakfast: The buffet often ran out of food, and only one woman to fill it, was close to impossible.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Worse experience ever in NYC","lang":"en","publishedDate":"2023-07-03","publishedPlatform":"OTHER","rating":1,"text":"The hotel systematically refused to provide the invoice.  I had to send emails and call.  the complete receipt was provided after 15 days.\nThe cleaning service was also bad.  My dental splits were lost after the cleaning of my room the second day of my stay.  I reported it in frontdesk.  They simply did not provided any response.\nWith the exception of one receptionist (Diana), the rest were very impolite.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent hotel","lang":"en","publishedDate":"2023-06-25","publishedPlatform":"OTHER","rating":5,"text":"This hotel was amazing from the warm hospitality to the warm cookies everyday! Cynthia was amazing, from her expert travel advice and conversation! All of the employees were helpful and did their very best to accommodate our family! Esteban was very accommodating and ensured we were able to have the late checkout! The rooms were cleaned daily and I can honestly say they were spotless! I enjoyed every bit of this hotel! The La Quinta Inn and Suites by Wyndham was an excellent stay and we will be back!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"La Quinta Displaying High Level of Care","lang":"en","publishedDate":"2023-06-23","publishedPlatform":"OTHER","rating":5,"text":"I have had the pleasure of staying at various hotels, including different LaQuinta locations. However, my recent experience at the LaQuinta in New York stands out as exceptional. The hotel staff was extremely attentive to our needs, providing us with helpful recommendations for delicious Mexican and Italian restaurants (we ultimately went with the Mexican option). \n\nAlthough I cannot recall the name of the lobby attendant, I do remember how they kindly pressed the elevator button for us as we approached, making our return to the hotel effortless. These thoughtful gestures and attentiveness to our comfort and convenience made me feel truly valued as a guest. I look forward to returning to this hotel in the future.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Muy bueno en general. Recomendable 100%","lang":"es","publishedDate":"2023-06-23","publishedPlatform":"OTHER","rating":5,"text":"Recomendable la ubicación, la amabilidad del personal, la limpieza, el desayuno (aunque pequeño el desayunador y acotado el horario). En general todo muy bien.\nEl punto negativo es que aun dejando un deposito de U$D 200 cargan una noche en la tarjeta de credito.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"tgny100","lang":"en","publishedDate":"2023-06-23","publishedPlatform":"OTHER","rating":4,"text":"With pleasure I'd stay at La Quinta Inn a lot of time after my last visit to New York and I find a warmth ospitality and I can talk with my friends very good about the hotel, I hope to come to New York another time and stay again in this hotel","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Perfect!!! Q","lang":"es","publishedDate":"2023-06-21","publishedPlatform":"OTHER","rating":5,"text":"Fui por primera vez a New York y este hotel hizo que mi experiencia sea mejor. El desayuno excelente, la cama super cómoda, los empleados super respetuosos, la zona tambien es muy buena. 100% recomendado","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Exceptional Customer Experience","lang":"en","publishedDate":"2023-06-12","publishedPlatform":"MOBILE","rating":5,"text":"The people at the front desk that we encountered at check in, checkout and every interaction throughout our 3 night stay provided exceptional customer service. Will recommend to all our friends and will stay here next time we travel to NYC!!!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Nadie se hizo cargo de la emergencia","lang":"es","publishedDate":"2023-06-06","publishedPlatform":"OTHER","rating":1,"text":"Durante la estadía, se cayó el lavabo del baño que estaba instalado de forma muy deficiente y se inundó el baño. Nadie en el hotel se hizo cargo. No lo repararon. No nos dieron otra habitación. No nos dieron ningún tipo de refund.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Small size but not bad at time square","lang":"en","publishedDate":"2023-06-04","publishedPlatform":"OTHER","rating":3,"text":"Room size were small and hard to work in room. Breakfast room was tight and fruit were not fresh. Though location is great esp if we are visiting time square area. Lobby and room were clean. Staff was friendly.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Good choice!","lang":"en","publishedDate":"2023-05-22","publishedPlatform":"OTHER","rating":5,"text":"La Quinta is staffed by lovely, helpful people who go ‘above and beyond’. The hotel is in an ideal location for both downtown and uptown Manhattan and particularly for food and theatres. It was a very good choice of hotel and lived up to its reviews ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Perfect hotel for NYC ","lang":"en","publishedDate":"2023-05-20","publishedPlatform":"MOBILE","rating":4,"text":"We stayed for 6 nights here during our trip to NYC. Staff at reception was very friendly and helpful when arriving. Room was big enough for NY standards. Every day cleaned and fresh towels and sheets. Bathroom with rain shower and products daily filled on. Bed was very good and also fridge in the room.\nHotel is well located only 4 blocks from subway 5 min walking. Breakfast was best ok with fresh waffles to make , eggs , pastry , oatmeal , bagels , juice , yoghurt , fruit...\nOnly negative point the breakfast place was quite small , we had place every morning but if you want to sleep late it could be a problem. You can always take it to your room also.\nCoffee and tea , water at the reception all the time and cookies between 5 and 10pm.\n","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"New York Stay","lang":"en","publishedDate":"2023-05-14","publishedPlatform":"OTHER","rating":4,"text":" Close to Times Square, \nA lot of restaurants and shops around the area& things to do. \nClean and tidy hotel room , quite small but understandable.\nThere was a mix up with the money taken from my account for the bill as they tried to charge me twice but this was amended. ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Till belåtenhet","lang":"sv","publishedDate":"2023-04-24","publishedPlatform":"OTHER","rating":5,"text":"bra bemötande av i synnerhet en i receptionen, låg bra till för promenad till central park ocj Time square och Rockyfeller center. Lite plats i badrum lite svårt få plats med atteraljer,  men övrigt bra och bra frukost med lite variation.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Clean, central and comfortable","lang":"en","publishedDate":"2023-04-19","publishedPlatform":"OTHER","rating":5,"text":"Very friendly and supportive staff members.  Clean and comfortable rooms. Location itself convenient to local attractions like Times Square or Empire State building. Only five minutes walking distance to subway. Only beeakfast could be better and the breakfast room itself is very tiny.","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"First time visitors","lang":"en","publishedDate":"2023-04-17","publishedPlatform":"MOBILE","rating":5,"text":"On our first visit to New York, we found this hotel to be absolutely perfect! Conveniently located, so close to landmarks and subway stations, we were able to navigate the city. We were always greeted so warmly and after busy days of exploring always returned to a clean room. Breakfast was convenient, with a wide range of choice, setting us up well for the day. We could not fault anything about our stay and would happily return! ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Amazing Hotel!","lang":"en","publishedDate":"2023-04-15","publishedPlatform":"OTHER","rating":5,"text":"If you are reading this and coming to New York! This is the hotel for you, it is amazing. The staff are the most friendly and helpful in New york, it is one of the cleanest hotels I've ever been in and it is so central with its location just at maddison square gardens (38th of 8th Ave).\nPlease please book this hotel.\n\nThe irish said goodbye 😉(10th of April-15th)","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Nice hotel with a very good location","lang":"en","publishedDate":"2023-04-15","publishedPlatform":"OTHER","rating":4,"text":"We had a very nice stay at this hotel, staff was very nice and friendly. The only thing is maybe the breakfast room is too small but food is okay. \nThe location is just perfect you can walk easily toward many places. ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Nice location and very friendly staff!!","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":5,"text":"Staff are very accommodating. The hotel is accessible and just a stone throw from the tourist spots in midtown area. While waiting for your check in you can leave you bags and walk around the city or ask what’s the earliest time you can check in.","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Very clean! Amazing Customer Service!","lang":"en","publishedDate":"2023-04-06","publishedPlatform":"OTHER","rating":5,"text":"The hotel is conveniently located and extremely clean. The hotel team was so friendly! Breakfast was amazing they had so many options. We traveled with two adults and three children. I definitely recommend this hotel when you’re visiting New York. Great price great location super clean and amazing hotel team! ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excelente opção","lang":"pt","publishedDate":"2023-04-03","publishedPlatform":"OTHER","rating":4,"text":"O hotel tem excelente localização, próximo a Times Square e a estação da Rua 42. Apesar disso a qualidade do sono é muito boa, pois ele fica a uns 2 quarteirões da parte mais movimentada da região.\nO preço acaba não sendo dos melhores, mas por ser em Manhattan não daria para ser diferente. \nO café da manhã oferecido é razoável, no entanto, o período de serviço é curto e o espaço pequeno, então acaba ficando bastante tumultuado por volta das 8h00 da manhã, então é melhor ir o mais cedo possível ou então se servir e ir comer no próprio quarto. Também é possível se servir de café ou chá ao longo do dia, não sendo necessário comprar na rua nos horários ao longo do dia, além também de cookies frescos que são assados ao longo do dia.\nO atendimento foi bom, não tive nenhum problema em relação a nada, e para quem interessar o hotel permite que você receba encomendas que porventura comprar online e pedir para entrar lá no período que se hospedar.\nParticularmente, se um dia voltar a Nova York com certeza me hospedaria novamente nesse hotel.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great stay for a couple days","lang":"en","publishedDate":"2023-03-30","publishedPlatform":"OTHER","rating":5,"text":"We stayed there for 6 nights and this hotel exceeded our expectations, the staff was friendly and kind (shout out Diane and Kevin for being so helpful), the room was spacious and the it was cleaned every day, the location was close enough to Times Square that it was safe to go out at night, the breakfast could be better, but it was great for a quick bite. \n\nThis is def our go-to hotel from now on.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17765111,"title":"Great location. Great service.","lang":"en","publishedDate":"2023-03-23","publishedPlatform":"OTHER","rating":5,"text":"Great location for us. Great staff--polite, friendly, helpful. Good breakfast--waffle maker, pastries, fresh fruit, scrambled eggs, sausage, etc. Comfortable bed--wanted a blanket and it was brought in a timely manner. Quick elevator. ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"muito bom","lang":"pt","publishedDate":"2023-03-21","publishedPlatform":"OTHER","rating":4,"text":"os quartos são pequenos, mas satisfatório para 7 dias, chuveiro bom, limpeza diária nos quartos, retornaria com certeza. O café da manha éra bom (padrão americano), localização excelente, funcionários prestativos","travelDate":"2023-03","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":17765111,"title":"A perfect hotel in an excellent location","lang":"en","publishedDate":"2023-03-13","publishedPlatform":"MOBILE","rating":5,"text":"We stayed at the hotel during the last week.  After I made the reservation, I read reviews about the hotel and the comments about that the dining room is too small and the rooms is small, etc. \n\nToday I can say for sure that nothing is true.  \n\nMe and my son stayed in a standard room of the hotel.  We arrived at 6:00 in the morning and Cynthia welcome us with a smile, took our luggage for storage without requiring payment. this givesed us the option to walked in the city.  \n\nAt 15:00 we returned to the hotel and the room was ready for us.  \nThe room is excellent.  There is space to the luggage, a work area.  Coffee machine, cupboard, etc... \nThe mattress is large and comfortable, 5 excellent pillows.  Shower (shower head + shower handle whatever you like), face soap, body soap, shampoo and conditioner.  \nBig towels and small towels.\n  \nEvery day they cleaned our room anew and took care of everything we asked for.\n\nThe dining room in the basement can accommodate about 20 people. \nyou can find every day: eggs, bacon, selection of fresh cakes, selection of bagels, selection of breads, cheese, butter, spreads, selection of fruits, delicacies, cold and hot drinks. machine for making fresh pancakes.  \n\nI highly recommend this hotel.  The service is excellent and Cynthia, Diana and Alexis were always happy to help and make sure we felt good in their hotel.  On the next visit we will definitely come back here.","travelDate":"2023-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17765111,"title":"Super séjour hôtel top","lang":"fr","publishedDate":"2023-03-03","publishedPlatform":"MOBILE","rating":5,"text":"Hôtel hyper sympa calme propre est moderne le petit-déjeuner est offert durant votre séjour ainsi le café et thé toute la journée, vous avez aussi en soirée des cookies à votre disposition\n\nLe personnel a l’accueil est top, très souriant, à l’écoute, le personnel de ménage est top.\n\nJe vous recommande l’hôtel la quinta Time square","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Recomendado","lang":"es","publishedDate":"2023-02-26","publishedPlatform":"OTHER","rating":5,"text":"Recomiendo muchisimo el hotel, super central y muy comodo y los recepcionistas muy amables, tener una estacion de cafe las 24 horas es lo mejor, porque se llega de madrugada con frio y es reconfortante tomarse un cafe calientico 😊 ","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Convenient and Clean - Great for families!","lang":"en","publishedDate":"2023-02-23","publishedPlatform":"OTHER","rating":5,"text":"This property was perfectly situated for where we wanted to be in NYC.  We had plans to see Aladdin and this was just a couple blocks away.  The emerald parking garage was right across the street and gave us a discounted rate ($45\/night vs. $75).  The hotel room was clean and beds were comfy and included a microfridge and microwave.  The breakfast buffet was perfect for us to fill up before we headed out for the day to explore NYC, complete with a waffle maker, scrambled eggs, sausage and other continental options.  I would absolutely stay here again.  Oh did I mention they give our fresh baked chocolate chip cookies?  ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Beautiful 12 nights","lang":"en","publishedDate":"2023-02-17","publishedPlatform":"OTHER","rating":5,"text":"It was beautiful experience, I booked for 6 nights then I rebooked for another 6 nights, because I felt i am in my own house , specifically all the reception staff was so friendly and the ladies hepls on the breakfast times were very nice ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"very good place in Manhattan","lang":"en","publishedDate":"2023-02-14","publishedPlatform":"OTHER","rating":5,"text":"Good Location, friendly staff, clean and beautiful place. I had no problem and could enjoy NY so much. I am very happy. Thank you for make me feel so good. I hope to return as soon as possible and I will recommend La Quinta to all my friends","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Experiência Excelente","lang":"pt","publishedDate":"2023-02-12","publishedPlatform":"MOBILE","rating":5,"text":"Estivemos no La Quinta no início de Fevereiro, durante uma semana e foi excelente! O quarto é pequeno mas aconchegante, chuveiro bacana, tudo muito limpo e o staff sempre educados e receptivos, o recepcionista da noite então nem se fala de tão bacana e educado. Café da manhã não varia muito, mas realmente não importa tendo em vista que não é comum hotéis servirem café nos EUA, mas o que tinha disponível era realmente de boa qualidade e bem gostoso. Sempre tem café, chá e até sachê para fazer chocolate quente na recepção. A localização do hotel é sensacional em uma rua não muito movimentada e perto de tudo! Tudo mesmo! Inclusive estações de metrô. Ao voltar para NY escolheria o La Quinta novamente e sem medo.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great location and value","lang":"en","publishedDate":"2023-02-05","publishedPlatform":"OTHER","rating":5,"text":"The location was fantastic and the staff was super friendly. We needed directions and the staff was always ready to help guide us. The room was \"cozy\", on the small side.  Even though it was small, they managed to fit every thing in and we slept well.","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Comfortable stay","lang":"en","publishedDate":"2023-01-18","publishedPlatform":"OTHER","rating":5,"text":"Me and my husband visited the city for the first time! This hotel is only a few blocks away from time square and access to many subway stations! Which made it very easy to find places to go. The check in desk were friendly. They helped us find the best pizza nearby and it did not disappoint. ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Vacation","lang":"en","publishedDate":"2023-01-12","publishedPlatform":"OTHER","rating":4,"text":"In general I enjoyed the stay, the people who work at the hotel are polite and the breakfast is reasonable.  But I think the rooms lack a large mirror, it's difficult to get dressed and not be able to see if the clothes you put on look good","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Hôtel bien situé","lang":"fr","publishedDate":"2023-01-07","publishedPlatform":"OTHER","rating":5,"text":"Avons vraiment aimé notre séjours dans cette hôtel. Bien situé (38e st) avec accès au Metro à la 42e st et 34 st. Quartier avec beaucoup de restaurant de tous type. Nous avions une chambre premium 20 étage. Très propres et spacieuse pour New York (22m\/sq). Lit super confortable, vraiment une belle chambre avec belle vue sur le quartier et tours a proximités. Seul point faible la façons dont est organisé la salle pur déjeuner, trop petite pour tout le monde , mais cela ne nous a pas empêcher de bien déjeuner (type continental , œuf, saucisse. beacon , gaufre etc.) Nous y retournerons.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17765111,"title":"La Quinta Inn","lang":"en","publishedDate":"2022-12-22","publishedPlatform":"MOBILE","rating":5,"text":"We had a wonderful time! The staff was amazing! Especially Cynthia! She was so helpful and gave us a fantastic tip on a bakery! The rooms were very spacious, and everything was so clean! I highly recommend La Quinta Inn!","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17765111,"title":"Great","lang":"en","publishedDate":"2022-12-22","publishedPlatform":"OTHER","rating":5,"text":"Location was perfect middle. \nFew blocks down from Rockefeller and time square. \n5th Avenue was also few blocks away . \nGreat stay , great staff. \nRooms are a little small but it’s Manhattan. Didn’t spend anytime in the room but sleep and shower ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Privacy ... the LOO ? ","lang":"en","publishedDate":"2022-12-06","publishedPlatform":"OTHER","rating":3,"text":"We arrived after a 8 hour flight (on schedule) and greeted by I assume the night-porter \/ reception only to be told that we have been allocated the wrong room and would need to move the following day ... hardly ideal ? ... The following morning I spoke to reception again who insisted we moved and allocated us another room . We returned back to the hotel later that day and indeed our cases etc had been moved from one room to another ...However , it was very evident that the bathroom would have benefitted from a door that would close and afford just an element of privacy ...? After speaking to reception again , a chap arrived , made a call and advised us sorry the parts to remedy the problem still had not arrived ?!? which begs the question , why allocate the room in the first instance ? ... No hint of a sorry or can we facilitate a further change if you require ! My girl-friend and I are close but not that close as the door was ajar the entire time we stayed at this hotel . The reception were sympathetic buts that's all . Would I go back ?... No , I don't think I would as customer care particularly let the experience down . Was this faux-pas rejected on the bill ...? No it wasn't , hence my rating but we British tend to ask politely , however we did witness an agitated US visitor get quite cross with reception and boy did they jump !.... ","travelDate":"2022-12","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":17765111,"title":"Unpolite manager","lang":"en","publishedDate":"2022-11-29","publishedPlatform":"OTHER","rating":1,"text":"\nBy accident, we booked the hotel on the wrong date- we called immediately to report it. Couple times. Nobody picked up. When I got to speak with the manager ( I guess)- Cynthia- she was so rude and unpolite. Did not care to listen but kept saying “there is nothing I can do” ","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Great stay","lang":"en","publishedDate":"2022-11-07","publishedPlatform":"OTHER","rating":5,"text":"Great staff, quiet small hotel! We enjoyed our stay and the location of the hotel. Close to Time square but on a quite quiet street. Staff is super welcoming and accomodating. The room was clean and there was free beverages in the lobby!","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"It is regular","lang":"en","publishedDate":"2022-10-29","publishedPlatform":"OTHER","rating":3,"text":"In this hotel you have to make your bed and clean the room, what it’s not frequent. i spent 10 nights at la Quinta and they just madecthe room twice. At the end, the shampoo was finished, the litter eas full and everything was a mess. If they don’t do the rooms like this case, think it’s better to get an appartment. ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Decepcionante","lang":"es","publishedDate":"2022-10-24","publishedPlatform":"OTHER","rating":3,"text":"Las habitaciones no son como se muestran las hoteles, literal tienes el baño pegado a la cama, duermes con los olores del baño, me cancelaron mi reservación a 20 minutos de llegar al lugar, provocando que el precio haya sudo MUCHO mayor, pero ya estaba en NY y llegando no tenia otra opción y se aprovecharon","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17765111,"title":"Great value for money in nyc","lang":"en","publishedDate":"2022-10-07","publishedPlatform":"OTHER","rating":5,"text":"Great location and friendly staff, hotel is clean and rooms are of a reasonable size for nyc hotels, basic breakfast is offered and also coffee and cookies everyday - room cleaning is every 3 days but I found this reasonable.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"A few thoughts.","lang":"en","publishedDate":"2022-09-16","publishedPlatform":"MOBILE","rating":3,"text":"The hotel is located greatly if you come with touristing. It is rather quite.\nCleanness is average. Included breakfast is ok.\nThere is a hidden fee over $65 for using “free” coffee in the lobby, so called “facility fee”, nobody even mentioned about it neither on the reception nor on TripAdvisor. It is not refundable and it makes a sad post-impression.","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Buen hotel","lang":"es","publishedDate":"2022-09-08","publishedPlatform":"OTHER","rating":4,"text":"El hotel y las instalaciones fueron excelente. Además la habitación, desayuno y atención del personal también. Muy atentos y colaboradores, entendiendo y teniendo herramientas para los turistas. La ubicación es un poco regular, ya que en las noches es muy solitario y da sensación de inseguridad (aunque no nos pasó nada)\n","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"A wonderful comfortable, hospital experience in a fantastic location","lang":"en","publishedDate":"2022-09-07","publishedPlatform":"OTHER","rating":5,"text":"The staff, Anthony (manager), Alexis, Christian, the rest of the front staff, including the man who made the cookies each day were very friendly. The breakfast team was really attentive. They were very helpful and generous with helping me with answering questions I had and some requests I had. Each time I walked into the hotel, I felt the hospitality of the team. I appreciate that very much. I stayed a total of 7 days, despite the review only saying 2. The team was very amiable. The rooms were really clean as well. The AC was great, especially after you've spent a very warm day in the city.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Excelente hotel para una estadía en Nueva York","lang":"es","publishedDate":"2022-08-16","publishedPlatform":"OTHER","rating":5,"text":"El hotel es ideal para una estadía de vacaciones en Nueva York, ubicado en la 38th entre la 8 y 9 está cercano a todo para salir caminando o utilizar el metro. Manhattan es para caminarla, aunque sean muchos kilómetros. El hotel brinda el desayuno y es completo, si bien el espacio parece pequeño, yendo antes de las 8 nunca tuvimos que esperar. El servicio de café del lobby es buenísimo, siempre un café listo y a toda hora, y hasta las 20 hay galletas recién hechas !. Si se desea un snack o bebida se puede adquirir allí también. La habitación suficiente, muy cómoda y limpia, con todo lo necesario. El baño muy bueno y bien dispuesto. El personal tiene hispano parlantes para quienes no dominan el inglés así que suma, son siempre muy atentos y agradables.","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Perfect for a short trip to the heart of NY","lang":"en","publishedDate":"2022-08-12","publishedPlatform":"OTHER","rating":5,"text":"The hotel is really nice and the staff super friendly. But the rooms are kind of small so it is not recommended to go with too many luggage as it won't fit. Perfect place for a quick trip to NY as you are in the middle of everything!! Times Square is just a short walk away","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent!","lang":"en","publishedDate":"2022-07-25","publishedPlatform":"OTHER","rating":5,"text":"All around excellent!  Staff was welcoming and efficient in all regards.  Everything was clean. \nFront\/Lobby door is secure (room key entry).  Location to Times Square and theatres was very good (close enough to easily walk but not so close you pay the an exorbitant rate!).\nThe room was small but we didn't have any problems sharing the space (didn't spend that much time in the room!)   Did not have any issues sleeping--street noise wasn't an issue for us-can't say that other places we've stayed in NYC!  \nWarm CC Cookies in the Lobby in the afternoon!!  BONUS","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Good location","lang":"en","publishedDate":"2022-07-21","publishedPlatform":"OTHER","rating":5,"text":"We’re able to do many things walking, because the location is super nice.\nGood breakfast and friendly service by the lady who was there serving.\nSmall room.\nHousekeeping only each 3 days, which is not good.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Chill and Relax","lang":"en","publishedDate":"2022-07-20","publishedPlatform":"MOBILE","rating":5,"text":"We were planning to spend our eid al adha holiday in new york. We wanted to visit the city for so long as it is one of our must see cities. As we were searching for hotels specifically near to times square that fits our budget, we came a across at La Quinta Inn & Suites by Wyndham Times Square South and their location was just right near times square 38th street 333 w. The price was reasonable and it had a free breakfast. So we booked for 6nights. When we arrive from jfk airport, we booked an uber going to our hotel. As soon as we arrive we were greeted with a friendly face, and we forgot his name but we nicked named him “Mithun” because he looked liked our ex-boss.. kidding aside. He explained all the needed info and very helpful. He was fast but very efficient, pleasant and easy check in. As soon as we went up and freshen up, the first thing we noticed is that the room was very clean and well kept. The bed was super comfy and the most comfortable bed we have ever slept in. The bath and toilet amenities were super clean and no foul smell at all. The staff were truly amazing. The inn had a 24-Hour Reception Desk which is super convenient. They serve their breakfast early 6am and 7am on weekends. Vanessa prepared the breakfast buffet and never allowed the choices to be empty for the next people to eat it had lots of choices and seating. Vanessa was very friendly and helps us a lot in anything we needed and we very much enjoyed her efficiency. The Laquinta staff whoever on the shift of any time of the day and night, if you asked for some fresh towels or replenish your shampoo\/conditioner\/bathgel\/soap\/lotion\/trash bag - they wont hesitate to give it to you. In short they provided us whatever we requested. On our last day we asked the Alexis the front desk if we are able to do a late check as we got a message that our flight got delayed and she gladly gave us an hour of extension which was sufficient by the time we needed to travel to the airport which was an hour drive if it had a medium flow of traffic. We had a wonderful experience at the La quinta. Every staff member we encountered, from the the check- in to the cleaning staff were delightful and eager to help! Thank you! Will recommend to our colleagues!","travelDate":"2022-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Run away","lang":"en","publishedDate":"2022-07-09","publishedPlatform":"OTHER","rating":2,"text":"Not used to paying $125 a night for a refrigerator box room is clean the bed kept sliding because they're not hooked it's not a box spring it's on a board and if there's two of you you going to be on top of each other with no microwave","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Muy recomendable!","lang":"es","publishedDate":"2022-07-07","publishedPlatform":"OTHER","rating":5,"text":"El hotel me pareció muy bueno, es pequeño pero tiene todo lo que uno necesita para una estadía de pocos días en NY (fuimos 5 días): moderno, limpio, buena atención, cama cómoda, buenas almohadas, buena ducha, habitación luminosa y silenciosa (estuvimos en piso 22). El desayuno me pareció muy bueno, ofrece infusiones, jugos, fruta, yogur, cereales, tostadas, wafles, huevo revuelto y panceta. Más que suficiente, y encontrar un alojamiento en NY que tenga desayuno incluido no es habitual, por eso para nosotros fue muy valioso. El lugar para desayunar es pequeño pero siempre conseguimos donde sentarnos y nunca hubo un problema. El hotel además ofrece servicio de té y café gratis las 24 hs, y hornean cookies todas las tardes para regalar a los huéspedes (este detalle me encantó). Está bien ubicado, cerca de todo. Buen precio. Recomiendo!","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"they don't clean the rooms","lang":"en","publishedDate":"2022-07-03","publishedPlatform":"OTHER","rating":1,"text":"Bad experience as they didn't clean our room.  We talked to the staff and they still didn't clean the room.  We had a child and the service was horrible.  We will never stay at this hotel again as it is expensive and the quality is low.","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"There might be a better and cheaper hotel near by","lang":"en","publishedDate":"2022-07-03","publishedPlatform":"OTHER","rating":3,"text":"First thing our room smelled like pee. Which is the main reason our stay was rough. It was supposed to be romantic time with my girl and that kinda ruined it. We got there early and dropped our bags off. When we got back to our room we had someone else’s personal belongings. There’s cheaper hotel nearby ","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Okay… Hit or Miss… then bad ending","lang":"en","publishedDate":"2022-07-02","publishedPlatform":"OTHER","rating":3,"text":"We stayed at this hotel for a week, six nights in a row then returned for one more night after a side trip to Washington DC. The first six nights were okay. Room size considered roomy given NY standard and compared to the Fairfield Inn and Suites Times Square nearby. The breakfast area is super small and cramped serving the same items everyday. Housekeeping provided every three days with one day advanced notice. The free water and coffee stand is good. The lobby area is super small. Service is a hit and miss. Don’t know why so many people commented of the good service. Not ours. The several front desk staff were either inexperienced, cold, nervous, or rude. We were a party of four and when we checked in, we asked if there were four towels in the room. We were told of course, and guess why, only three sets were found. On our last night here, there was no hot water. We called the front desk and were told someone would check and would give us a call back for an update. We got one call but the promised second call did not come. When we checked out on our last day, we asked if the hotel could get us a taxi, I was told that would cost $95 if the taxi is needed after 1 pm as it is considered rush hour. NYC has a fixed taxi rate of $58 plus toll if the ride is between JFK and Manhattan, with a rush hour surcharge after 4 pm. I was shocked at how the hotel marked up a taxi call. So, the one night that I was charged $350 my family had cold shower and I hailed my own taxi on the street.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Friendly Staff","lang":"en","publishedDate":"2022-07-01","publishedPlatform":"OTHER","rating":5,"text":"Hotel staff were amazing. Cynthia and Anthony went out of their way to accommodate a special request from us. Alexis was always cheery. Everyday, she would ask us how our day went. Hotel was very clean. Would stay here again.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Clean hotel, friendly service","lang":"en","publishedDate":"2022-06-28","publishedPlatform":"OTHER","rating":5,"text":"All staff we interacted with were pleasant, friendly and helpful.  The rooms are small, but nice and clean and the hotel is quite (no elevator noises like in other hotels close by).\n\nWe really appreciated the hard-surface floors in the rooms which are more sanitary than carpets.  The room and the public areas of the hotel were clean.\n\nDiscounted parking is available directly across the street and is a reasonable cost (for NYC).","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Hôtel bien placé, propre et excellent rapport qualité prix","lang":"fr","publishedDate":"2022-06-11","publishedPlatform":"MOBILE","rating":5,"text":"La Quinta Inn & Suites by Wyndham Times Square South est très bien situé.\nLe petit déjeuner est au sous-sol dans une salle exiguë, il vaut mieux y aller tôt pour éviter la cohue. C'est plutôt varié, sauf pour les fruits (que des pommes durant une semaine) et il n'y a pas de chocolat.\nLa literie est excellente après une journée de marche, un vrai régal !\nAux alentours, il y a de tout pour se restaurer.\nNous recommandons vivement !","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Mal servicio","lang":"es","publishedDate":"2022-06-07","publishedPlatform":"OTHER","rating":1,"text":"Viajamos con mi familia, tres niños menores de 3 años, mis papas mayores de 65 años y mi esposo, viajabamos desde orlando el domingo 29 por avion, desafortunadamente nos dejo el vuelo desde orlando, por lo que decidimos irnos por tierra, a esa hora que paso este imprevisto 3:30 pm escribi por la plataforma Booking, comentando el caso que debia correr la reserva un dia porque claramente no llegabamos esa noche, el hotel me responde q es con booking y booking que el hotel decide segun su disponibilidad, lo hacia para no perder mas dinero y pagar por una noche que no ibamos a usar. Llegamos el lunes 30 a las 10:30 pm al hotel, el personal que nos recibio no hablaba español, he intentamos que nos ayudara y fue lo mas despota y nada amable, el cansancio nos podia sobre todo con los niños y aceptamos pagar completa la reserva y acostar a mis hijos de una vez, la verdad debimos irnos a otro hotel, el hotel es pequeño, los pasillos super incomodos, la habitacion no le hacen aseo, el baño de la habitacion de mis papas estaba tapada la ducha se inundo, mi papa bajo hablo con el de recpcion que era el mismo de la noche anterior, y paso lo mismo sero empatico, haciendose que no entendia español, y NUNCA solucionaron el problema del baño, el restaurante es en el sotano, super mal ubicado parece una carcel, en fin nunca recomendaria este lugar, hay muchos hoteles alrededor mejores y mas economicos. Ni booking ni el hotel me ayudaron con el dia que tuve que pagar por el impase del avion, la respuesta fue es que debias avisar antes de la hora del check in para hacer algun cambio, y les dije como iba a saber que el avion me iba a dejar y que debia manejar 28 horas por carretera desde orlando a new york antes de la hora de reserva. ","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"2ème séjour et toujours autant satisfait","lang":"fr","publishedDate":"2022-06-05","publishedPlatform":"OTHER","rating":4,"text":"Pour notre nouveau séjour à NYC, je me suis en premier orienté sur le La Quinta Times Square South, le connaissance pour y avoir séjourné juste avant le covid en mars 2020. Nous avions tout de même regardé d'autres hôtel mais nous avons finalement choisi de retourner au La Quinta et nous n'avons pas été déçu. L'accueil, la propreté, le service sont les mêmes, et ce fut un plaisir de retrouver cet hôtel. Sa position est très intéressante, proche des spectacles, ce qui permet de rentrer à pied le soir et proche du métro pour s'évader lus loin en journée. \nA ce jour, pour moi, le La Quinta reste l'un des meilleurs choix à Manhattan, le rapport qualité\/prix est très juste. Il offre de très bonnes prestations pour un prix correct à NYC. \nLes chambres sont effectivement pas très grande, c'est vrai mais ça reste vivable et la literie est très confortable.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"deftig verblijf voor deftige prijs","lang":"nl","publishedDate":"2022-06-01","publishedPlatform":"OTHER","rating":4,"text":"proper budget hotel, zalige bedden. Ontbijt was pover. omgeving vond ik nogal shady. Bij mijn aankomst lag de computer plat waardoor ik niet onmiddellijk kon inchecken. Staff vond ik over het algemeen vriendelijk. De liften waren zeer snel, je moest nooit lang wachten","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Nice Location","lang":"en","publishedDate":"2022-06-01","publishedPlatform":"OTHER","rating":5,"text":"Located right in the center of things. Easy access to public transportation. Lots to do in walking distance. Nice remodeled property. Staff was very friendly, you could tell they liked their jobs. Would stay again.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great Hospitality","lang":"en","publishedDate":"2022-05-26","publishedPlatform":"OTHER","rating":5,"text":"What a welcome place to stay. Anthony, Christopher ,Cynthia and Raphael were so helpful and friendly. They printed out maps for us and told us of places to go see. Recommended pizza places and rooftop places which we enjoyed. Rooms were just right for us. My niece and I were there for my sons wedding and felt very comfortable staying there. \nThanks","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"great hotel","lang":"en","publishedDate":"2022-05-26","publishedPlatform":"OTHER","rating":5,"text":"great location and excelent value for money.\nnear every thing in time square and close to all transportaion in new york.\nsmall rooms but enough fo traveling.\nmost cerently come back next time visiting new york","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Good but has room for improvement","lang":"en","publishedDate":"2022-05-16","publishedPlatform":"OTHER","rating":3,"text":"Night concierge staff was super friendly and helpful, exactly what I needed during checking into the hotel after a 19 hour flight. Can’t say the same for the morning check out staff in the morning. Room is spacious only for one person & furnishing definitely needs a good refresh. Am happy there are USB ports right by the bedside for easy phone charging - super useful. ","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent Stay here Close to The City and Reasonable - Clean - Friendly Staff","lang":"en","publishedDate":"2022-04-28","publishedPlatform":"OTHER","rating":5,"text":"The property is vey nice. Well kept and convenient to the subway into the city. The staff were Very Good. Friendly. Helpful. The view of the city from our 10th floor room was wonderful. Free Street Parking was available. We could actually see our car from the lobby of the hotel. This is located near an industrial area. So if you're looking for glamorous surroundings, this place ain't for you. Brian and Chelsea at the front desk were great. Rosa, the head housekeeper and breakfast manager was very helpful and kept the crowded breakfast room well supplied with a good assortment of cereal, fruit, cold juices, & sausage Biscuits. The subway is about 6-8 blocks away. If driving, I would definitely stay here again.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great place!","lang":"en","publishedDate":"2022-04-28","publishedPlatform":"OTHER","rating":5,"text":"The Hotel is modern but simple at the same time. The breakfast is great and nutritive, also very diverse. The room is great too. NY is a noisy city but the room have a good sound isolation. The bed and pillows are so comfortable. The location is the best, very near everything, if you want to enjoy NY walking and using subway this place is perfect.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Tutto benissimo","lang":"it","publishedDate":"2022-04-23","publishedPlatform":"OTHER","rating":5,"text":"Posizione dell'hotel magnifica. Comoda per visitare la città.  Camera un po piccola ma pulita e funzionale così come il bagno.  Staff della reception disponibile e cortese. Colazione da integrare un po'.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great hotel","lang":"en","publishedDate":"2022-04-23","publishedPlatform":"MOBILE","rating":5,"text":"We stayed in this lovely hotel for 6 nights and enjoyed our stay. It is spotless and the staff are very nice. Tea, coffee and water are free all day long with fresh chocolate chip cookies in evening.\nThe breakfast is grab and go- toast, bagels, bacon, egg, porridge, juice, yogurt, muffins etc.\nThe room was spacious but storage space was limited.\nThis hotel is exceptional value and dont hesitate to book it.","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Such an amazing staff who gave top quality service","lang":"en","publishedDate":"2022-03-31","publishedPlatform":"OTHER","rating":5,"text":"Right from the moment of check in, I was given a warm welcome from a very happy staff. The hotel is perfectly located in Times Square within walking distance to many great restaurants and places to shop. Macy's is only a couple blocks away. The room was very clean, quiet, and the bed was super comfortable. I would like to mention the names of the wonderful staff that always went above and beyond to make stay a pleasant one. The entire staff deserves recognition, but I would like to mention those whose names I remember. Anthony, Diana. Oswald, and Christian to name a few, always went above and beyond what one would expect. The best quality service I've ever seen in a very long time.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great staff, good location","lang":"en","publishedDate":"2022-03-23","publishedPlatform":"OTHER","rating":5,"text":"A nice, affordable stay in Times Square area. Rooms are NYC-sized-- Small but not cramped; very clean. Just a few minutes walk from Broadway. We enjoyed the smaller boutique hotel feeling this location offers.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Overall good but very loud","lang":"en","publishedDate":"2022-03-22","publishedPlatform":"OTHER","rating":4,"text":"Stayed here one night prior to running the NYC half marathon. The location is very central to many popular places in NYC, including times square, which was a goal as I needed an easy spot for my husband and our dog who accompanied us to get to to watch the race. This hotel is very dog friendly and our dog was made very welcome! At only $20 per night per dog the pet fee is also more than reasonable. \n\nWe had a queen room on the third floor and it was more spacious than many other NYC hotels we have been in. My only wish was that we were maybe on the other side of the building not facing the street or on a higher floor because it was VERY loud almost all night. I understand we were in a busy area in NYC so that is to be expected but there was no noise proofing to mute any of the outdoor sounds out. I wonder if it would've been better on a higher floor in the back of the building though. We did not sleep well due to outside noise, but the bed itself was comfortable enough.\n\nAll in all, still probably would stay again.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great experience!","lang":"en","publishedDate":"2022-03-07","publishedPlatform":"OTHER","rating":5,"text":"Cynthia, Alexis, Anthony and Oswald were all amazing!! The staff was always eager to help and had great attitudes. I stayed with my husband and our small dog. Pet friendly hotel! If we ever need a place to stay again in the city, we will not hesitate to return here (:","travelDate":"2022-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excelente lugar para parejas! o viajeros que van a conocer nueva york!","lang":"es","publishedDate":"2022-03-04","publishedPlatform":"OTHER","rating":5,"text":"Es un buen lugar calidad\/precio, que te incluya el desayuno es un gran plus en una ciudad como nueva york, hay cafe deli 24 horas y galletitas a partir de las 5 super ricas; no hacen la limpieza por el covid pero la puedes solicitar cada tercer día. Las habitaciones son pequeñas pero limpias y funcionales. El metro esta muy cerca, aproximadamente a 5-7 minutos de la estación penn station, que se encuentra a lado del Madison Square Garden y a 7 min de Times Square, excelente ubicación!","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Hotel perfecto para visitar Nuva York","lang":"es","publishedDate":"2022-02-17","publishedPlatform":"MOBILE","rating":5,"text":"Hotel muy recomendable para visitar Nueva York, junto a Times Square y estaciones de metro.  El hotel con todo lo necesario para una estancia muy agradable, muy limpio, desayuno continental incluido y el personal es muy amable, hablan español y te facilitan y ayudan en todo, sobre todo CYNTHIA es muy profesional y atenta. Hay café, té y agua en recepción las 24 horas.\nLa diferencia a otros hoteles es que la habitación se limpia cada 3 días, pero hay que solicitarlo en recepción, pero si necesitas toallas o gel, lo solicitas en recepción y te lo facilitan en el acto. Yo he estado una semana y lo recomiendo, conozco muchos hoteles por la zona de Times Square y seguro voy a regresar a este hotel.  Mi experiencia ha sido muy positiva. Relación calidad \/ precio muy buena.","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great time !","lang":"en","publishedDate":"2022-02-15","publishedPlatform":"OTHER","rating":5,"text":"Had a great stay for Valentines day. Special shout out to Anthony and the front desk and housekeeping team. Property was well kept and conveniently located. Would recommend and would stay again !!!!!!","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Come On!  It's NYC!","lang":"en","publishedDate":"2022-02-14","publishedPlatform":"OTHER","rating":5,"text":"Great staff, close walk to shows, and a bit longer walk to Central Park, The MET, etc.  Very clean, but a little small if you really like to stretch out.  The coffee is good and around the clock, but eat out for breakfast","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Wonderful Hotel and staff","lang":"en","publishedDate":"2022-02-14","publishedPlatform":"OTHER","rating":5,"text":"Had an excellent stay at La Quinta recently. Anthony and the team made me feel welcome as soon as I arrived. My room was extremely clean, the hotel is a few blocks away from Penn station so was very easy to get to and from JFK via the e train. The 'Grab and Go' breakfast worked great. Free cookies were even provided in the lobby!","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Jitu","lang":"en","publishedDate":"2022-02-13","publishedPlatform":"OTHER","rating":5,"text":"Efficient hotel, making the best use of space. Very clean and overall a wonderful place. Location is 5 mins walk from Timesquare with plenty of restaurants nearby. This is one those few hotels that provides breakfast as well. Loved our stay at La Quinta","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Good location, fair price","lang":"en","publishedDate":"2022-02-03","publishedPlatform":"OTHER","rating":5,"text":"The hotel is placed in a very convenient location with fast access to all parts of NYC. The room is clean and bright. The manager was very attentive when I passed out in the lobby. The only thing is the mini-fridge or the AC would give rhythmic beep that sometimes spook you.","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Disappointing Experience","lang":"en","publishedDate":"2022-01-28","publishedPlatform":"OTHER","rating":2,"text":"Checked in at 9:30pm on Jan 24th for a one night stay after a very long day of traveling for work purposes. When I was ready to get in bed around 11pm I noticed black stains and lint on sheets, called front desk, offered to bring me clean sheets which I would've had to change myself, I refused and ask to bring me clean pillow cases. Front desk brought me me the clean pillow cases and a key to another room. I accepted the new room to realize that there was long hair in the blanket cover, dust bunny's all over the room. I reported this to GM and FRONT desk manager Anthony next morning, nothing was done to make me feel satisfied as a customer. I will be frequenting NYC over the next year for work purposes and will not stay at LA Quinta again, nor will I recommend this hotel to anyone.","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17765111,"title":"Best Value in Manhattan, easily.","lang":"en","publishedDate":"2022-01-20","publishedPlatform":"MOBILE","rating":5,"text":"Due to numerous flight cancelations, we had a long-term stay at the La Quinta on W 38th. The staff, including Cynthia, from check in to check out were professional and personable. They were always empathetic with our situation and made our stay seemless and affordable. \nThe breakfast was spot on and prepared for us by one of two staff members. They were always cheerful and helpful. There was always hot coffee and fresh water in the lobby. The room was very comfortable and the TV was large and good for football but didn't take over the room.\nAll the desk staff were helpful, friendly and knowledgeable of the area.\nThe location is ideal if you have never been to the city with a multitude of deli's, restaurants, resources and even a great self laundromat (MK Laundry) on 9th, 3 minute walk.\nGet a smoothie at Cafe Aroma at the corner. Subway is easy to get to. Go for a walk on the Hudson. \n\nThis place is EASILY THE BEST VALUE in Manhattan. I know because we researched crazily for days! :)","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great location, good service.","lang":"en","publishedDate":"2022-01-13","publishedPlatform":"OTHER","rating":4,"text":"We stayed for 7 nights, everything was good, they have a microwave in the lobby and our room had a mini fridge. Staff was very helpful including Anthony, Cynthia and Diana. They can include more vegan options on their breakfast like more fruits and any kind of vegetable milk.","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Week in NYC","lang":"en","publishedDate":"2022-01-11","publishedPlatform":"OTHER","rating":5,"text":"The staff at this hotel were very friendly and helpful with both the check in and check out process. The rooms were very clean and modern. The location and price are hard to beat! Right off the major metro lines running up and down Manhatten and perfectly located between Hells kitchen and the very touristy Times square. Also located 10 mins up the C line from the Soho Shopping area! I would recommend this to others looking to explore NYC with an affordable rate. ","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Gloria Colon","lang":"en","publishedDate":"2022-01-10","publishedPlatform":"OTHER","rating":5,"text":"The protocol and management against the covid was very good.  We feel secure in the cleanliness and security of the hotel.  In the care of the lady Cynthia, she was excellent and very attentive to the visitors of the hotel.  She helped us with information and a good treatment towards us.","travelDate":"2021-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great Hotel for the right price","lang":"en","publishedDate":"2022-01-05","publishedPlatform":"OTHER","rating":5,"text":"Our room was really spacious, clean and well-maintained with plenty of towels. Beds were super comfy. Overall, the hotel is very clean and well-maintained as well. Location is superb. Waljking distance from major sites like high line, The shops at the Hudson, Chelsea, Times Square, Rockefeller building, 5th Ave, etc....A rare find in NYC for that price!","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Ottimo rapporto qualità prezzo","lang":"it","publishedDate":"2022-01-04","publishedPlatform":"OTHER","rating":4,"text":"Buon hotel in una posizione strategica per muoversi sia a piedi che con la metropolitana. Stanze moderne e senza moquette. \nPulizia della stanza solo su richiesta e non troppo approfondita.\nLobby e sala colazione piccole. Colazione con poca scelta e ripetitiva. In generale un ottimo compromesso.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Great location and friendly staff","lang":"en","publishedDate":"2022-01-03","publishedPlatform":"OTHER","rating":5,"text":"I was so pleased with our stay at La Quinta. The location cannot be beat. The parking garage across the street was convenient. We were within a 10-minute walk to Times Square and all the theaters. Clean rooms. Chocolate chip cookies in the afternoon. Anthony at the Front Desk was the best - so helpful and a fantastic demeanor. Looking forward to a return trip!","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great staff and location","lang":"en","publishedDate":"2021-12-29","publishedPlatform":"OTHER","rating":5,"text":"Modern hotel in walking distance of most of what midtown has to offer. Room was small but adequate similar standard to a uk premier inn. Could have done with a mirror in the room rather than just bathroom and a little more storage area. It suited our needs perfectly however as we basically slept there and used it as a base. Quite a small hotel so no real facilities however 2 pcs in lobby with printer and free access to internet which was handy for printing tickets etc. staff all really pleasant and helpful. ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"La Quinta Inn  & Suites by Wyndham Times Square South NY","lang":"en","publishedDate":"2021-12-28","publishedPlatform":"MOBILE","rating":5,"text":"Great service. The room was awesome, very good and modern. It also included a small fridge. Breakfast is good and you can take it to your room. Thanks to Cynthia for the service in front desk and the rest of the crew. Location is perfect, close to every important place to visit in NY. Front doors of the hotel are automated. So you don't need to touch anything at all. For these covid times is A+.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Don’t have hotel call for a cab!","lang":"en","publishedDate":"2021-12-19","publishedPlatform":"OTHER","rating":3,"text":"Very satisfied with Clean rooms- but stood in line 45 minutes  for breakfast- was staying 2 nights, they only checked me in for 1 night, came back 2 night, was locked out of hotel and out of my room\/front desk said they would call for a cab, called limousine instead-cost double . ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Meh …","lang":"en","publishedDate":"2021-12-19","publishedPlatform":"MOBILE","rating":3,"text":"the room is small, but the hotel is very well located, the receptionist in the morning is very friendly and attentive, the one at night \/ afternoon not so much, I asked for a extra blanket and they told me they don't have extra blankets in a hotel over 15 floors, lies 😡","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Estadia a ser sopesada pelos prós e contras","lang":"pt","publishedDate":"2021-12-10","publishedPlatform":"MOBILE","rating":3,"text":"Ponto forte - localização ( sobretudo se for fazer viagens ate Washington\/Filadélfia\/Boston e os outlets fora de NY, pois os ônibus saem do Port Authority que é muito perto).\nO atendimento dos funcionários, em geral, muito bom (recepção até o café).\n\nPontos negativos - café da manhã (ficamos 14 dias hospedados - o café era composto neste período de maçã, iogurte, suco em copo plástico, 2 tipos de pães, muffins em 3 dias, waffles todos os dias, sucrilhos, ovos mexidos e cozidos, queijo, em um dia é bacon e no outro dia uma espécie de hambúrguer, café e leite).\nAinda somente uma pessoa atende e a fila, na maioria das vezes, fica no corredor, pois o espaço do café é composto de 5 mesas mais uma mesa alta com 4 banquetas para um hotel com aproximadamente 80 quartos.\nRessalto, ainda, que a pessoa que atende no café tem que se desdobrar para cuidar do que falta e sair para providenciar. \nA limpeza tem que ser marcada na recepção todos os dias. O hóspede solicita, indica o horário e eles marcam para o dia seguinte. Se marcar no mesmo dia só tem a troca das toalhas.\nAcho que pelo valor cobrado, o hotel peca nestes pontos.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Ok","lang":"en","publishedDate":"2021-12-08","publishedPlatform":"OTHER","rating":2,"text":"Check in was a great and easy process. Our room was insanely small. Just enough space to walk around the bed. The bed was comfy, but the blanket had some dirty marks on it. The chair at the desk kept hitting the bed. The bathroom was small, and the room was not properly cleaned. The toilet also wasn't working properly. After checking out, there was some confusion regarding charges, and the front desk lady was rude when we called about it.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Great location and service","lang":"en","publishedDate":"2021-12-08","publishedPlatform":"MOBILE","rating":5,"text":"I would stay again to this hotel as it is convenient to see Broadway shows and practically walking distance to Time Square and nearby attractions. The front desk staff Christian and Cynthia are accomodating to my questions which I really appreciated. I have stayed in other hotels but they are not as friendly. The breakfast staff too provided great service!","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great place to stay near Times Square","lang":"en","publishedDate":"2021-12-08","publishedPlatform":"OTHER","rating":5,"text":"A great price for being near Times Square. Can't rave enough about this hotel find!  I will return when I come to the city.  The only thing I can't comment on is breakfast because I didn't have breakfast in the hotel.  ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Best Trip of my life","lang":"en","publishedDate":"2021-12-06","publishedPlatform":"MOBILE","rating":5,"text":"The hotel was amazing would definitely recommend if it’s your first time in New York. The energy was heartwarming and the staff were really helpful especially Alexis, he went above and beyond. He was one of the main reason I’d return to the hotel. :))","travelDate":"2021-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Clean and modern with some minor issues","lang":"en","publishedDate":"2021-12-04","publishedPlatform":"OTHER","rating":4,"text":"We stayed for 3 nights over Thanksgiving weekend. The room was clean when we arrived, and the room and especially the bathroom was modern and well-appointed. The room had a safe, iron and ironing board, and a small refrigerator, but no microwave – there are a couple microwaves in the lobby next to the front desk. Internet speed was very good.\n\nLike many hotels, you have to request that housekeeping clean your room if you want new towels etc. We scheduled the room to be cleaned on the last day but housekeeping didn’t show.  \n\nThe breakfast system is a joke, with one employee putting together a plate one customer at a time. So we're standing in line, waiting for the toast of the front of the line's person to finish, with no multi-tasking by the employee, for example asking the next person what they wanted her to toast for them. And the employee served everything -- even cold items like fruit or yogurt were inaccessible to us, so if we didn't want to wait for the 'prep' items, we were SOL. Also someone with a new batch of scrambled eggs went past and I could tell they were from powdered. The first morning we stood in a long line for 15 minutes without moving, so we gave up and never went back.\n\nOverall we would return, for the room furnishings and location, and eat breakfast elsewhere.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"The best accommodation in NYC so far.","lang":"en","publishedDate":"2021-11-23","publishedPlatform":"MOBILE","rating":5,"text":"La Quinta Inn & Suited by Wyndham Times Square South is the perfect hotel. Seriously. The staff was super friendly and helpful. Room and bathroom very clean and modern. And it was also soundproofing. The breakfast was simple but everything you needed: Eggs, sausage or bacon, good old NY bagels, bread and waffles. Loved and enjoyed my stay so much that I will definitely stay there again. You can‘t go wrong with this hotel at all. If I can make a suggestion, a wall body mirror would have been nice but this doesn‘t change my experience at all. Highly recommend this place. 10\/10!","travelDate":"2021-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Perfect","lang":"en","publishedDate":"2021-11-21","publishedPlatform":"OTHER","rating":5,"text":"We had a wonderful stay! Friendly staff, clean room, breakfast was good. Warm fresh cookies and coffee in the lobby! We got the Explore NYC package with our room. It was very beneficial! Definitely would stay again! ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"nice place to stay","lang":"en","publishedDate":"2021-11-20","publishedPlatform":"OTHER","rating":5,"text":"friendly staff, great room, not too pricey, great breakfast, fast elevators, easy check in & out & they held my bag.  OK lobby to sit & wait for friends & share pizza from right down the block.  Two Bros Pizza has $1 slices!  Didn't get too check out any other food options on the block, but I had done street view.","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Mr","lang":"en","publishedDate":"2021-11-19","publishedPlatform":"MOBILE","rating":5,"text":"It’s a perfect place to stay, strong recommend to stay if you visiting New York, very clean and nice service. The front desk  is friendly and super nice  I believe will choose Laquita as next trip again.","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Convenient, Clean and Classy","lang":"en","publishedDate":"2021-11-16","publishedPlatform":"OTHER","rating":4,"text":"Stayed here one night during a girls NYC weekend.  Super convenient location, and the building and rooms are very clean and inviting.  The staff was helpful with tips and storing bags during checkout.  No problems at all! ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Anthony: Great welcome!","lang":"en","publishedDate":"2021-11-13","publishedPlatform":"OTHER","rating":5,"text":"Anthony was the best host ever. Kind and warm after a long trip! Great customer service! Rooms were good and location just perfect. Arrived walking from metro station that goes to the airport. Breakfast included is a perfect plus in NYC.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Limpieza terrible","lang":"es","publishedDate":"2021-11-05","publishedPlatform":"OTHER","rating":2,"text":"Pésimos en la limpieza te dejan la basura dias y se escudan con el tema de COVID cuando debería ser lo contrario tener limpio El desayuno fatal es en un cuarto en donde hay cero cuidado covid y te dan unas porciones de risa si pides más te dicen que no ","travelDate":"2021-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"The worst hotel of my life","lang":"en","publishedDate":"2021-11-04","publishedPlatform":"OTHER","rating":1,"text":"The rooms are not cleaned, the sheets stained, the breakfast is disgusting, the attention is terrible, it is uncomfortable, the breakfast is disgusting, overheated in a basement, dirty the bathrooms, I am leaving because of bad attention and they do not refund the money, there is a lot of noise at night and you can't sleep, they are thiefs","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Ottima posizione","lang":"it","publishedDate":"2021-10-19","publishedPlatform":"MOBILE","rating":5,"text":"Siamo stati in questo hotel a gennaio 2020. Hotel davvero comodo per poter raggiungere le principali attrazioni della città, si trova in pieno centro a pochi minuti da Times Square, New York è una città che non dorme mai ma nonostante la posizione centrale, l’hotel è situato in una via tranquilla e silenziosa. La camera è pulita e calda (con il freddo di New York è sempre piacevole tornare in una camera bella calda) e il letto era comodissimo. Te’, caffè e biscotti sono sempre a disposizione nella hall per gli ospiti. \nUnica nota negativa è stata la colazione, molto scarsa e ripetitiva con prodotti di scarsa qualità.\nNew York è una città meravigliosa, e quest’hotel è stato assolutamente un’ottima scelta per la nostra permanenza di 4 notti.","travelDate":"2020-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excelente ubicación, limpieza y servicio!!!","lang":"es","publishedDate":"2021-10-19","publishedPlatform":"MOBILE","rating":5,"text":"Excelente atención, todas las personas quieren resolver tus inquietudes y atenderte bien. Excelente ubicación, cerca de todo, puedes ir caminando a teatros, estaciones, metros y otras atracciones. Definitivamente volveré!! Me gustó mucho el hotel, muy cómodo y conveniente.","travelDate":"2021-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"I would stay again","lang":"en","publishedDate":"2021-10-16","publishedPlatform":"OTHER","rating":4,"text":"The hotel room was clean and the bed was comfortable staff was friendly and knowledgeable, everything worked as it should. There was a safe in the room. I would stay here again if it was just 2 of us the room was extremely small and the bathroom door does not lock also no full body mirror. ","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Great Hotel with Great Staff","lang":"en","publishedDate":"2021-10-05","publishedPlatform":"OTHER","rating":5,"text":"Stayed at this hotel in September for 3 nights.  It was fantastic, central to all attractions.  Cynthia at the front desk was awesome!  So friendly and knowledgeable.  Great tips.  Rooms were a bit small but big enough, since we didn't spend much time in our rooms.  They were clean (which is the most important thing to me).  Hotel is very clean.  Cookies and coffee were an extra plus! Breakfast was good too.  So convenient!   All around a great stay.  Would stay here again 100%.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great stay in NYC","lang":"en","publishedDate":"2021-09-23","publishedPlatform":"MOBILE","rating":5,"text":"I had an excellent experience at this hotel. The rooms are smaller than normal but are still comfortable. I arrived way later than expected at 2am and I forgot to call ahead but Keyon stayed late and was able to help me check in without any issues.","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excelente relación precio calidad y buena ubicación","lang":"es","publishedDate":"2021-09-22","publishedPlatform":"MOBILE","rating":4,"text":"Muy buena opción de hotel basado en relación precio\/calidad + desayuno incluido.\nLas piezas son espaciosas y luminosas, cama de tamaño king muy cómoda, buen espacio para guardar cosas, baño amplio con iluminación LED, ducha amplia.\nCuenta con TV cable básico que cumple, sin funciones smart. También hay cafetera en la pieza.\nEl desayuno tiene poca variedad pero todo lo que sirven es muy rico y el señor que atiende es un amor (Bokul es su nombre).\nLa ubicación es muy buena geográficamente hablando, pero el barrio es un poco peligroso.\nHablando un poco de lo que no nos gusto o que podría mejorar: no tiene espejo de cuerpo completo y hay espacio sobrante sobre el WC que podría haber una repisa porque hay muy poco espacio para dejar las cosas de baño, los vidrios estaban sucios, había un ruido como de agua en una cañería constante durante la noche que molestaba un poco para dormir, el espacio para tomar desayuno era muy pequeño, el servicio de limpieza de la habitación había que solicitarlo con un día de anticipación y en dos oportunidades volvimos a la pieza y no estaba hecha.","travelDate":"2021-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Love NYC","lang":"en","publishedDate":"2021-09-13","publishedPlatform":"OTHER","rating":5,"text":"Enjoyed a weekend stay here, to attend 9-11 20 year commemoration.\nHotel was convenient, clean, and quiet.\nFull breakfast served daily, and hot and fresh chocolate chip cookies available in the lobby after 5pm. Coffee, tea and water always available. Staff is friendly (especially Cindy, at the front desk...a winning smile.) We will be back...😃","travelDate":"2021-09","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17765111,"title":"Comfortable stay","lang":"en","publishedDate":"2021-09-11","publishedPlatform":"OTHER","rating":5,"text":"The location is in the middle of everything but on a quiet street. Short (5-10 minutes max) walk to Penn Station, Port Authority, the subway, Times Square, Hudson Yards. Always felt safe in the area. Enjoyed this small and comfortable hotel. Only 4 rooms on a floor, quiet. Tea and coffee are always available for free at the lobby. Room is modern, The staff is attentive. Highly recommend","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great hotel in a great location!","lang":"en","publishedDate":"2021-09-09","publishedPlatform":"OTHER","rating":5,"text":"Affordable and very comfortable with a great staff. Will stay here again. Close to everything. Easy to transit. Very clean space. Great room. Everyone was very friendly. Would recommend to anyone coming to New York. ","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent Customer Service 😊","lang":"en","publishedDate":"2021-08-26","publishedPlatform":"MOBILE","rating":5,"text":"I’m usually not the one who writes reviews, however I never make a decision without extensive research on others reviews! That being said, I cannot express how happy we were with this hotel and their willingness to go above and beyond!! \nFrom the moment we checked in, Alexis was amazing, friendly and helpful....along with Cynthia(who goes out of her way to make sure everything is clean and sanitized) Diana and the overnight staff, Keyon! \nI’m sure all the staff is good, but these 4 really stuck out and made our stay one we never forget.\nWe can’t thank you all enough😊\n\n⭐️⭐️⭐️⭐️⭐️","travelDate":"2021-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Buen servicio y buena atencíon","lang":"es","publishedDate":"2021-08-25","publishedPlatform":"OTHER","rating":4,"text":"El servicio es bueno, la atención es buena, la ubicación del hotel ideal, cerca al metro y muchos sitios de interés, el desayuno es normal pero siempre está fresco, quizás variarlo un poco. \nLas habitaciones un poco pequeñas\nDeben mejorar la frecuencia de limpieza de las habitaciones","travelDate":"2021-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"It’s good","lang":"en","publishedDate":"2021-08-25","publishedPlatform":"OTHER","rating":5,"text":"Overall trip was great, wish they had better bed frame because our mattress kept sliding off. I would wake up falling into a gap. The lady in the front did mention maid service would only be provided if we ask. But we don’t want to have interaction with staff if we come to the hotel tired and sleepy.                                                   ","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"La Quinta Inn & Suites by Wyndham Times Square South Stay","lang":"en","publishedDate":"2021-08-17","publishedPlatform":"MOBILE","rating":5,"text":"The staff was extremely friendly and amazing. Everything was very clean and the included breakfast was great. The hotel's location is great and very central. Close to many subway lines can easily get to all places by foot. I recommend 10\/10.","travelDate":"2021-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Bonito y buena ubicación","lang":"es","publishedDate":"2021-08-17","publishedPlatform":"OTHER","rating":4,"text":"En general el hotel estuvo bien, pero me dí cuenta que ahora (después de la pandemia) los hoteles son \"self service\". Si deseas limpieza, hay que pedirlo; si deseas más papel, hay que pedirlo; etc. El staff fue muy atento y amable, me volvería a quedar siempre y cuando vaya sin familia; ya que las habitaciones son pequeñas.","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"EXCELLENT SERVICE & LOCATION","lang":"en","publishedDate":"2021-08-16","publishedPlatform":"OTHER","rating":5,"text":"I recently spent 6 nights at this location and the service was exceptional.  Every staff member was friendly, helpful, and always eager to help.  The rooms were small but perfect for one person.  They were modern, clean, and had everything I needed.  I felt extremely safe and the location was great for Javits Center, where we were doing business. I would highly recommend this particular hotel and will book there again next time I head to NYC.  Thanks to the great staff for a positive stay in NY.","travelDate":"2021-07","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17765111,"title":"Happy Hutch!","lang":"en","publishedDate":"2021-08-04","publishedPlatform":"MOBILE","rating":5,"text":"I spent 4 nights at La Quinta with a friend, small (but you don't need more) room and bathroom, perfect for our 4 nights in NYC.\nBreakfast was great, varied each day and small changes throughout the week too. I enjoyed the water\/coffee that was available all day everyday, AND THE COOKIES 😍\nStaff were super helpful and friendly throughout. \nAlthough only 2 lifts and lots of rooms, I never shared with a stranger nor had to wait for longer than a minute! \nWill definitely consider visiting again.","travelDate":"2021-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent  location and service","lang":"en","publishedDate":"2021-08-02","publishedPlatform":"MOBILE","rating":5,"text":"During our stay from 27 thru 31 of July we experienced a great service and staff was really nice.\n\nLocation in Midtown is excellent and close to city action, hotel rooms are in very good condition as well as common areas.\n\nVictor and Gabriela","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Perfect!","lang":"en","publishedDate":"2021-07-14","publishedPlatform":"OTHER","rating":5,"text":"This is problaby one of the best places to stay in NY! We stayed just one night to get our flight from JFK the next morning. Its location allowed us to do some tourism, always a must when visiting the City. We stayed with our lil puppy and it was just perfect. Everything spotless and the staff just WONDERFUL! Thanks a lot for your high standards!","travelDate":"2021-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"First trip since Covid-19 started","lang":"en","publishedDate":"2021-07-11","publishedPlatform":"MOBILE","rating":4,"text":"The room and price for the room were reasonable. Rooms are pretty updated and everyone for the most part was super nice and willing to help! We stayed 3 nights and 4 days and never got my room cleaned. First day they blamed it on me because I didn’t call it in since my phone wasn’t working?? Second day they said they would and came back to my room and nothing. Shout out to Alexys who was always so helpful.","travelDate":"2021-07","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":17765111,"title":"Bien ubicado","lang":"es","publishedDate":"2021-07-04","publishedPlatform":"MOBILE","rating":4,"text":"Ea un lugar solo para dormir, te ofrecen el desayuno de 6 a 9 pero aparte de que es malisimo no tienen suficientes a las 8:30 no queda nada, cual es el sentido de madrugar a buscar un huevo sintetico si estas de vacaciones, no realizan limpieza en el cuarto me imagino que por un tema de ahorro vinimos 4 noches y nunca limpiario, el aire tiene un tema de ahorro de energia que prende y apaga toda la noche lo que no permite a uno descansar.  Es un hotel economico bien centrico para moverte caminando a todos lados . Tienen estacion de agua y cafe todo el dia, el personal es amable exceptuando la odiosa del desayuno.","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17765111,"title":"Definitely recommended","lang":"en","publishedDate":"2021-06-26","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here for 10 nights in the month of June. The hotel was very centrally located, walking distance to most attractions and the neighborhood felt quite safe. The room and common spaces were clean. TV in the room did not have a streaming option but there's a lot of channels to zap. This hotel also had a fast and reliable wifi. \n\nCheck-in and check-out was so easy and they also helped us store our bags for a few hours after we checked-out. The staff were very sweet and helpful day and night during our stay. Special thanks to hotel staff Keyon, Cynthia, Diana, Ahmed and Oswald! You guys made our stay so comfortable!","travelDate":"2021-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Impressed with the experience!","lang":"en","publishedDate":"2021-06-25","publishedPlatform":"OTHER","rating":4,"text":"With such a reasonable rate, I was not expecting the quality of service I received and accomodations at this hotel. I was impressed with the staff's great service, the room was cute and clean, the breakfast, the close off-campus gym access, and the level of COVID-19 precautions. It was a pleasant stay and I recommend the hotel to those looking for a reasonably priced and cute boutique hotel with great service and nice accomodations. ","travelDate":"2021-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Rude reception lady and tiny rooms","lang":"en","publishedDate":"2021-06-14","publishedPlatform":"OTHER","rating":2,"text":"Stayed at the hotel over the past weekend and was disappointed with the hospitality. Lady at reception Cynthia was unprofessional, rude, and very short-tempered. I would not recommend any of my friends and family traveling to NYC to stay at La Quinta.","travelDate":"2021-06","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Not friendly and helpful at the reception","lang":"en","publishedDate":"2021-06-13","publishedPlatform":"MOBILE","rating":1,"text":"We stayed at this hotel in June. The hotel is clean. The Stuff is unfriendly. The reception lady Cynthia is so rude. \n\nShe is extremely unfriendly from the minute we walked to the door. She is short tempted, rude. She didn’t help us to check it. Cynthia acts like we stay for free at this hotel. \nI was watching her while she served other clients, she chooses whom she wants to be nice and helpful. \n\nNot recommend to stay because of the hotel stuff","travelDate":"2021-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent Stay","lang":"en","publishedDate":"2021-06-12","publishedPlatform":"OTHER","rating":5,"text":"This was my first time traveling anywhere since March 2020 when Covid started the shut downs in the US. Needless to say my husband and I were a bit apprehensive but I do a lot of research before booking a hotel and this time was no different, The hotel is an a great location close to the Port Authority subway station and from there you can go just about anywhere you want in NY. \nOur room was clean, but be aware you MUST request for your room to be serviced if you want your bed made etc. We were only there for two nights so this wasn't much of an issue. There is coffee, tea and cold water available in the lobby and trust me, when you come back to the hotel after enduring that hot NY summer weather you will be VERY grateful for that water. \nThe best part of our hotel stay was Cynthia. She was amazing!!! Extremely helpful and professional. There is no question we asked that she didn't answer. I was mostly impressed on our first morning and seeing Cynthia serving breakfast AND checking in guests at the same time. I know she must have been overwhelmed, but she remained super clam and professional and did everything with a smile on her face. At the end of the trip we requested to speak to the manager to express our sincere gratitude for the service we received and Mr. Ahmed Latif was amazing as well. Not pretentious at all and even gave us a little gift to take back home. We will definitely be back to this hotel on our next visit to NY, especially if Cynthia is there and Mr. Latif is in charge.","travelDate":"2021-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Review","lang":"en","publishedDate":"2021-05-31","publishedPlatform":"MOBILE","rating":5,"text":"Cynthia and Alexys did an amazing job with the customer service. They made us feel like we was at home in we really enjoyed ourselves. I will definitely come back there in the future. I will be back in September of this year.","travelDate":"2021-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"I would recommend the hotel to friends and family BUT I’d be aware of the cleaning and internet LOTS to be improved in t","lang":"en","publishedDate":"2021-05-29","publishedPlatform":"OTHER","rating":4,"text":"I’d recommend the hotel to family and friends but be aware that the cleaning and the internet deserves more attention.\nThe personnel were GREAT\nWe were very happy with the location and the reception we’ve received from the employees at the reception, they were always whilling to help.","travelDate":"2021-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"First visit to New York City","lang":"en","publishedDate":"2021-05-15","publishedPlatform":"MOBILE","rating":5,"text":"Cynthia help us a lot amazing experience we are definitely going back again all the staff is amazing and loved thank you so much we are si happy to choose La Quinta Inn & Suite by Wyndham to stay in are first visit","travelDate":"2021-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"First trip to NY","lang":"en","publishedDate":"2021-05-14","publishedPlatform":"MOBILE","rating":5,"text":"I’m super happy I decided to stay here it’s in the middle of everything Times Square is just minutes away food is walking distance no need for a car at all! The subway is foot steps away.This hotel is barely two years old it’s modern and well kept smells new. The neighborhood is clean. The staff at this location provides exceptional customer service Alexis  is awesome! Celine is the best!!! They made sure our stay was comfortable I’d definitely be returning soon.","travelDate":"2021-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Above and Beyond","lang":"en","publishedDate":"2021-04-25","publishedPlatform":"OTHER","rating":5,"text":"La Quinta is an exceptional hotel that is clean, within a central and convenient location with a phenomenal staff.  I had an unexpected situation arise where I required a room promptly. Ms. Celine Chen the General Manager went above and beyond to accommodate my needs. She and her staff were courteous, professional and very helpful! I greatly appreciated Ms. Chen's kindness and assistance in helping make a stressful situation more manageable. An extended thank you to Mr. Mohammed who assisted me as well. It was welcoming to encounter such a great staff!","travelDate":"2021-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Mr. Mora","lang":"en","publishedDate":"2021-04-05","publishedPlatform":"MOBILE","rating":5,"text":"Front desk staff (Diana) is extremely efficient, pleasant and helpful! Overall, La Quinta Inn & Suites by Wyndham Time Square South amenities were great and staff were incredibly helpful. Had a great stay!","travelDate":"2021-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Gran opción excelente atención ","lang":"es","publishedDate":"2021-04-04","publishedPlatform":"MOBILE","rating":5,"text":"El lugar está muy buen ubicado, las instalaciones son bonitas y permanecen aseadas.\n\nEl desayuno es muy rico aún que por pandemia algo monótono \n\nDiana en la recepción es muy amable y habla muy bien español. ","travelDate":"2021-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great Stay","lang":"en","publishedDate":"2021-03-14","publishedPlatform":"OTHER","rating":5,"text":"Great hotel location near stores and Times Square. Friendly staff warm and welcoming. Private quiet environment. Clean room nice view. Great shower. Free Breakfast.  Looking forward to staying again. Stay here. ","travelDate":"2021-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great Experience - Location and service was the best!","lang":"en","publishedDate":"2021-01-31","publishedPlatform":"OTHER","rating":5,"text":"We recently visited New York City and stayed at La Quinta Times square. The location of the hotel is great. It is equidistant from the Penn Station and Times square and we could walk everywhere!! \n\nThe staff was very warm, kind and efficient. Everyone made sure that our stay was comfortable. I would definitely go back!","travelDate":"2021-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"WE LOVED IT !!!!","lang":"en","publishedDate":"2021-01-18","publishedPlatform":"MOBILE","rating":5,"text":"The staff was extremely kind and helpful. The room and the hotel as a whole was very clean which was very much appreciated due to the pandemic. Free breakfast provided every morning. Will definitely come again 5 stars!!!","travelDate":"2021-01","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":17765111,"title":"Really a Great Stay","lang":"en","publishedDate":"2021-01-17","publishedPlatform":"MOBILE","rating":5,"text":"We had to come to NYC for family emergency during pandemic - found this hotel online and whether because of pandemic or not, they had great pricing! \n\nAwesome location that is fifteen minute walk from Times Square and 20 minute walk from Chelsea! \n\nSpace inside the hotel was decent (have stayed at some hotels in Manhattan where you trip over the bed after opening the door to the room!) although we did get the larger king bed. Rooms were clean and decently appointed. Overhead shower with steam doors was really nice! \n\nThere were some limitations on service because of pandemic restrictions but this shouldn’t reflect on the hotel so I won’t mention them in detail. \n\nOne thing I do want to say is that the staff were very attentive. Celine, in particular, went out of her way to connect with us and make us feel very welcome. \n\nDefinitely will be our first choice on our next trip back to the city. ","travelDate":"2021-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Warmest New York Hospitality","lang":"en","publishedDate":"2020-12-30","publishedPlatform":"OTHER","rating":5,"text":"If there's one thing that is very much commendable about this hotel is the STAFF. They definitely will be there to help you out (well except the guy on night shift; but he was ok) and they go beyond what customer service means. ","travelDate":"2020-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"La Quinta Inn & Suites by Wyndham Time Square South","lang":"en","publishedDate":"2020-12-29","publishedPlatform":"OTHER","rating":5,"text":"Very warm welcome to the Hotel, very young, friendly, supportive crew, all really nice especially Celine. Very nice stay. The Hotel is near Time Square and you can use Metro, buses. The hotel is very clean and safe, all wearing mask, include Breakfast from 6 to 9. We are very pleased with the attentions, including a map with indications to travel using the Metro.","travelDate":"2020-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Thank you all","lang":"en","publishedDate":"2020-12-25","publishedPlatform":"MOBILE","rating":5,"text":"Hello again I don't know what happened to the 1st review but I am going to send this one in awesome. A special thanks to miss Rivera and miss Celine M Mr. Ozwald and the rest of staff thank you for being kind to our family","travelDate":"2020-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great mid town gem !","lang":"en","publishedDate":"2020-12-02","publishedPlatform":"MOBILE","rating":5,"text":"Fantastic new facility, clean and comfortable. Staff was super friendly and helpful.... I travel for a living and basically live in hotels. This is my new go to place for Manhattan! I would expect to pay double for this level of hotel! HIGHLY RECOMMENDED!!","travelDate":"2020-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":17765111,"title":"Everything was perfect","lang":"en","publishedDate":"2020-10-23","publishedPlatform":"MOBILE","rating":5,"text":"Everything was perfect. Breakfast was delicios, the room was clean, hotel was good, people was good, location was good, employees were good. We were so happy in new York. Thank you so much for everything.","travelDate":"2020-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":17765111,"title":"lazy customer service","lang":"en","publishedDate":"2020-10-11","publishedPlatform":"MOBILE","rating":1,"text":"Terrible, check in process! Mahmoud M. Mahmoud, the acting front desk manager was rude and had no experience in customer service or “Platinum” Rewards Membership. My wife and I are frequent stayers and Mahmoud M, neglected to acknowledge the benefits of the membership, there was a “Problem” for every possible solution as Mahmoud’s lazy customer service caused unnecessary emotional anger and frustration surrounding, my Anniversary gift to my wife. After, several months of COVID. I wanted to give her to have a stress free and effortless experience that he ruined because the credit card was left home and when asked not to “Authorize” the debit until i was able to update the card on file (few hours) that disappeared somehow, as a platinum member. \n\nMy wife was not able to pack small toiletries such as toothpaste, additional soap, and a comb. They made her walk to 8th avenue CVS where it’s a HUB for disgruntled drug addicts and homeless. This was absolutely a horrendous stay. I wasted thousands of points when I could’ve given her a spa day at HOME!! Although my wife made the best of the experience the ”check-in” process and the individual behind the desk made me reluctant to sharing this experience.","travelDate":"2020-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Great little gem in a convenient location near major transportation hubs. Fabulous staff and clean functional room.","lang":"en","publishedDate":"2020-08-04","publishedPlatform":"OTHER","rating":4,"text":"I am a local who is dealing with an apartment mishap and needed a refuge from home. This fit the bill. It would be a great stay for anyone but perfect for travelers needing to be close to Penn Station or Port Authority as both are withing walking distance. Small but efficient did the trick for me! Great bed and pillows, strong WiFi, mini fridge, continental breakfast, and VERY clean with great shower. The staff was especially accommodating and helpful and very sweet. Only 3 rooms per floor and very quiet when I was there for people who have a tough time sleeping in NYC. Between the pandemic and the hurricane and my own stressful situation, this was a delightful Refuge.","travelDate":"2020-08","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Molto confortevole","lang":"it","publishedDate":"2020-03-26","publishedPlatform":"MOBILE","rating":5,"text":"Hotel rinnovato molto carino e pulito, la posizione è ottima vicinissimo a Times Square e alle principali stazioni metro. Il personale molto cortese, nella hall possibile prendere caffè the e biscotti in qualunque momento. Ottimo rapporto qualità prezzo, molto consigliato considerando i prezzi di New York. ","travelDate":"2020-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great location, near Penn Station.","lang":"en","publishedDate":"2020-03-18","publishedPlatform":"OTHER","rating":5,"text":"very clean new facility!\npleasant helpful desk staff. Lucked out with a Free stay with points still had a great high floor room.\nSmallish room but not cramped, but its NYC, so was  actually better than average fro the price level.","travelDate":"2020-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Un très bon hôtel bien situé","lang":"fr","publishedDate":"2020-03-08","publishedPlatform":"OTHER","rating":5,"text":"Nous avons séjour pour notre deuxième séjour à NYC dans cet hôtel. Le choix de cet hôtel c'est fait de manière totalement impromptu ayant du changer d'hôtel quelques jours avant notre départ. Et que dire à part que se fut une très bonne surprise. L'hôtel est agréable, le personnel est vraiment serviable, aimable et gentil. L'hôtel est proche de toutes les commodités à pied. \nLe petit déjeuner est très satisfaisant, il faut juste penser à mettre un pull pour aller le prendre car la clim peut être un peu forte dans la pièce mais c'est franchement le seul point négatif à noter. Le café est bon, le jus d'orange est de type Minute Maid donc rien à dire. Sachant que dans certains hôtels le café ou le jus d'orange peuvent faire peur, que la rien à dire. \nL'hôtel offre toute la journée la possibilité de prendre à emporter café, déca, ou thé comme on le veut dans le hall d'entrée et ceux gratuitement. Et l'après midi dès cookies sont cuits par le réceptionniste et proposé à la clientèle toujours gratuitement. \nLa chambre en elle-même était de taille juste, elle ne s'est pas révélé trop petite pour deux pendant une semaine, nous avions une chambre donnant sur la rue directement et la rue de l'hôtel est vraiment calme, il ne faut pas avoir peur du bruit, nous n'avons jamais été dérangé durant notre sommeil. Et il faut signaler que la wifi en haut débit est gratuite vraiment dans tout l'hôtel, même dans la chambre, ce qui est vraiment top. \nBref, un très bon hôtel à choisir sans soucis, je vous le recommande vraiment. Le prix est vraiment bien placé, pour indication, les sept nuits pour deux avec petit déjeuner nous est revue à 953 euros en mi février.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great clean and quiet","lang":"en","publishedDate":"2020-03-03","publishedPlatform":"OTHER","rating":4,"text":"Not bad at all actually really neat. I did enjoy my stay. I just didn't like how they didn't accept military discount . i found that weird cause wyndham hotels i been to accepts it always and there food is over priced too a can of soda for 4 to 5 dollars is insane. Besides that the stay was great i enjoyed it , it was very clean and there showers where awesome .","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great location for walking tourists, clean and new hotel, great service","lang":"en","publishedDate":"2020-03-02","publishedPlatform":"OTHER","rating":5,"text":"The hotel looks modern and clean like on the pictures. Rooms are not big but for 2 people for 3-4 night sufficient. No smell, no noise (both from street and corridor\/other rooms) Breakfast not bad american standard, for European travelers - the breakfasts in US are totally different than in Europe but fine. Coffee (24\/7) and tasty cookies (after 5pm) in the lobby! Great location for walking up and down Manhattan, very close to Time Square. Walking distance to Penn Station to get to Newark Airport by train. Great stay!!!","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Anniversary","lang":"en","publishedDate":"2020-02-21","publishedPlatform":"MOBILE","rating":5,"text":"Excellent Hotel!! The room was small but clean. Hotel staff were very nice and accommodating. The hotel’s location was perfect. There is only 3 or 4 rooms per floor.very quiet. I would definitely stay here again!!!!","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent Value","lang":"en","publishedDate":"2020-02-15","publishedPlatform":"OTHER","rating":5,"text":"A gem.    Rooms are small but have everything you need and are very clean and very modern.   Good location.  13 walk to Madison Square Garden.    Excellent restaurant Casa Nonna across the street.  24 hr parking garage also across the street.   Free breakfast with eggs and pancakes or french toast.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"The Best in Times Square Area","lang":"en","publishedDate":"2020-02-09","publishedPlatform":"OTHER","rating":5,"text":"The hotel is brand new everything is fresh and new.\nThe staff always welcoming me in with a warm welcoming smile. \nThe rooms are good size for NYC hotels & The bed was so Comfy.\nHotel near Times Square, Hudson Yards, Madison Square Garden, Subway stations & A lot of Restaurants.","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Clean, Affordable Hotel in NYC","lang":"en","publishedDate":"2020-02-08","publishedPlatform":"OTHER","rating":5,"text":"This is a new property and convenient to Times Square, Empire State Building, etc.  Despite being in NYC it was very quiet.  The staff was super friendly and the hotel, as far as cleanliness, was immaculate.  The price was great and much less than I expected to pay in Manhattan.  We look forward to coming back.  The rooms were small but I totally expected that in NYC so didn't find it to be a problem. ","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":2,"locationId":17765111,"title":"Spotlessly New","lang":"en","publishedDate":"2020-02-06","publishedPlatform":"OTHER","rating":5,"text":"This property was a shining example of what a hotel should be. Rooms were not large as most NYC are usually on the small size. Our room was absolutely spotless and quiet. Only three rooms per floor. Breakfast was good.","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Overcharging","lang":"en","publishedDate":"2020-02-05","publishedPlatform":"OTHER","rating":3,"text":"The hotel is nice good location but they forgot to make a new booking, we maked one sr booking.com and more 3 nights directely and payed at check in . They forgot to make in the sistem and was calling to leave the room and I had the recit and showed. After they made a overcharging of US$3000,00 , we wee in the subway and return and they sad it was a problem in the sistem . Very mass.","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent choice of hotel in NY","lang":"en","publishedDate":"2020-02-05","publishedPlatform":"OTHER","rating":5,"text":"I stayed at the hotel for 17 nights and I really liked the accommodations, the cleanliness of the room and the kindness of the entire team, especially Diana, who always welcomed me with a huge smile on her face that made my day better. Breakfast is good for those who stay at the hotel for a short period, as it is always the same food every day and there were few protein options.","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"New modern unpretentious hotel!","lang":"en","publishedDate":"2020-02-04","publishedPlatform":"OTHER","rating":4,"text":"Located just off 8th Ave in The Garment District 4 blocks South from Times Square this new 22 story hotel is comfortable great value for mid-town Manhattan.   Rooms are small but well appointed.  The breakfast was better than expected! The staff was very pleasant!","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"The best place to stay south of 42nd street","lang":"en","publishedDate":"2020-02-03","publishedPlatform":"OTHER","rating":5,"text":"From Checking in to checking out the best customer service period! Staff is genuinely happy to meet and assist you (no fake smile here), staff is very friendly, courteous, professional and accommodating.\n","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Clean hotel, fantastic\/friendly staff, great value.","lang":"en","publishedDate":"2020-01-29","publishedPlatform":"OTHER","rating":5,"text":"We were initially fooled when google street view showed it under construction; that's how new it is! The nice clean lobby is indicative of the cleanliness throughout, just as the friendly front desk staff are indicative of the rest of the staff, (breakfast & housekeeping staff included). The hotel breakfast (included) gets you off to a quick start to the day (coffee\/tea, OJ, cereal, fruit, pastries, eggs, pancakes\/fr. toast). Subway: it's only 4 blocks up to Times Sq - 42 St. Station blue line which has underground walkway to the red and yellow lines as well. Cheap eats on the corner of 38th St. & 8th Ave. for late night include 2 Bros. Pizza by the slice\/pie and a great little Wok to Walk. The room is small, but hey folks, it's Manhattan! 4 guest rooms per floor and around 22 floors. We stayed 6 nights. The only thing that would make it better would be the addition of a full length mirror in each room when you're getting fancied up for a night out!","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Lost belongings","lang":"en","publishedDate":"2020-01-17","publishedPlatform":"OTHER","rating":3,"text":"Housekeeping has not taken care of our belonging. Following our check out we forgot to pack a pair of boots. We kept the room tidy when we left and used all the bins for trash. The item was not disposed. Housekeeping did not have records of our belongings. We placed two call to verify and were told there was nothing in the room.  ","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"The best Hotel I've ever visited!","lang":"en","publishedDate":"2020-01-04","publishedPlatform":"MOBILE","rating":5,"text":"I was coming to New York with the intention of proposing to my girlfriend. When I called and informed Mahmoud, the general manager, he was immediately and passionately intent on making this the best possible experience for myself and my now fiance. They made sure the room was perfect placement, style, and nothing was handled without care. Diana was discreet and very enthusiastic in greeting us upon arrival and leading me to Mahmoud who was there on his day off and Ana, the head of housekeeping, who showed me to the room and made sure it was to my liking, set up the room for my proposal even buying extra roses and decorations on her own, and did a more magical job decorating the room than I could ever have imagined! They incorporated items and ideas I hadn't even thought of that made it even more of a \"WOW\" moment. To put it simply... they made magic. It felt like a fairytale and the hospitality the extended made me feel like they had known me our whole relationship and genuinely cared this was important to me! Not to mention the fact that everytime we walked in or out of the hotel they greeted us with a smile and friendly conversation. I felt like everytime we saw David or Diana at the door it was like being greeted by my own family and that they genuinely enjoyed seeing us. 5\/5, 10\/10, 100\/100!!! If you are in New York stay HERE! Walking distance from anywhere you want to go and they really created the best experience I've ever been a part of! I will not be staying anywhere else. Anytime I come to New York, I will be staying here at the La Quinta of 333 W 38th street!","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Birthday trip","lang":"en","publishedDate":"2020-01-03","publishedPlatform":"MOBILE","rating":4,"text":"Location was good within walking distance of most things room was small but excellent very clean bed was comfortable breakfast was ok but you can get grate food within walking distance staff was very helpful especially David very nice i had a good time","travelDate":"2019-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Very Poor Customer Service- Credit Card Scammers- You will be overcharged.","lang":"en","publishedDate":"2020-01-01","publishedPlatform":"OTHER","rating":1,"text":"I had a reservation at this hotel for 12\/21, unfortunately my mother was seriously ill and at a last minute, per the hotels confirmation to call with any urgencies, I called the hotel explained to the hurried front desk person that my mother was in a serious health crisis and asked to cancel my reservation. She said, no problem, I am sorry to hear this news and I will take care of it. Well she didnt and my mothers limited income credit card was charged a whopping $$377 for a no-show. We had another reservation at the Hilton for additional family and they were kind and gracious to cancel per phone call without a problem. Laquinta is refusing to refund me, charged a credit card without approval and their management does not have the customer service decency to call me or respond to my emails. \nThis is not customer service- this is theft and terrible disrespect for the visitors that help this hotel in business.\nBuyer beware if they will charge me a room despite me following their directions to call in urgent matters, imagine what they will charge to your card when there is a missing towel or you check out 5 minutes late. Worst customer service I have ever experienced.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":17765111,"title":"Wonderful place to stay.","lang":"en","publishedDate":"2019-12-29","publishedPlatform":"OTHER","rating":5,"text":"Hotel was clean and very convenient to places we wanted to go. Staff was very nice and accommodating. Guest rooms were a little small but we had all the room we needed and we weren't in our room very much. Can't say enough wonderful things about this place. Just GREAT.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"A comfortable hotel with easy access to many attractions with a friendly staff","lang":"en","publishedDate":"2019-12-28","publishedPlatform":"MOBILE","rating":5,"text":"My husband and I spent Christmas 2019 at this small non pretentious yet extremely accommodating reasonably priced hotel. We could walk to the hotel from the Port Authority, take the subway to many locations and enjoy the hospitality of the staff- Mahmoud, Bushara, Diana, David and Omar- were all very helpful in providing us everything we needed to make our stay comfortable.\nHighly recommend this hotel to anyone not looking for a deluxe accommodation with a heave price tag.\nA little homey place in midtown.\nThanks to the staff who helped us during our stay.","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"100 % recomendable","lang":"es","publishedDate":"2019-12-23","publishedPlatform":"OTHER","rating":5,"text":"Visitamos Nueva York 1 semana en la previa a las fiestas navideñas y debo reconocer que el hotel es además de cálido y nuevo un espacio de relax después de un día de paseos y muchas actividades. El desayuno es correcto y algo no habitual en los hoteles de NY ... y la atención del personal es maravillosa,siempre dispuestos a resolver cualquier inquietud o inconveniente que surgía.  Recomiendo que visiten La Quinta inn... todo esta súper accesible si les gusta caminar y buscan una buena opción que conjugue precio y calidad hotelera...volvería sin dudas.  Muchas gracias por la atención  recibida.","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":17765111,"title":"Great stay","lang":"en","publishedDate":"2019-12-23","publishedPlatform":"MOBILE","rating":5,"text":"My husband and I are on the third of a four night stay. Very nice accommodations. Clean rooms and hotel overall ( new) decorated modern. We are in a King Premier room on the 20th floor- room 2002. Nice view of city lights makes for a great night light. King bed and linens and pillows very comfortable. Housekeeping freshens immaculately each day while we are out. Very nice hot shower, plenty of towels and complimentary toiletries and blow dryer. Coffee maker and refrigerator also in room - 2 complimentary bottled waters daily in your room. Breakfast on the concourse level. Adequate but we opted to eat out mostly instead but I do think it’s nice that they have this ( basic bagels, cereals etc) Hot cookies each afternoon at 5 is also a very nice touch- coffee in the lobby 24 hours. All of these little touches make this place a great value for your money. A few blocks from Penn Station subway line at 34th. We also enjoyed massages on 36th street @ Aquis. Very affordable and worth it after walking all weekend. Love that it was close and clean and a great massage for $50.00 plus tip. My body feels better after working the kinks out.\nOverall I will plan on staying here again. Nothing disappointed us in any way. Great spot to explore the city!","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"New but could be better.","lang":"en","publishedDate":"2019-12-10","publishedPlatform":"MOBILE","rating":4,"text":"Brand new small hotel well located in Midtown. Close to \nPort Authority Bus Terminal and Penn Station. \n\nVery small lobby with few seating but complimentary tea and coffee (and even cookies).\n\nWe travelled with a friend, so we can compare 2 types of rooms.\nThe standard King room is very small.\nNo place to open a suitcase, and small bathroom with no space  to put a vanity case or even your toiletries.\nThe Premier King room is much better in terms of space , especially the bathroom, but still no luggage stand.\nWe had some issues with the A\/C that was pretty noisy, but the \nhotel by itself is very quiet.\n\nThe breakfast room located in the basement with no windows is also very small ( roughly 20 seats), so it can be difficult to access during peak hours.\nComplimentary Breakfast itself is simple but good with choice of pastries, eggs, juice and yoghurt.\n\nWhen we checked in at 4pm, our room was not ready and we had to wait for more than an hour in the small lobby with cold draft each time the doors opened. So not the best experience!\n\nNevertheless, the staff was very nice and helpful.\n\n","travelDate":"2019-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17765111,"title":"excellent stay and location","lang":"en","publishedDate":"2019-12-08","publishedPlatform":"OTHER","rating":5,"text":"We were very pleased with our stay.  The staff at the reception desk was friendly and welcoming, and they kindly assigned us a room not facing the street (I'm very sensitive to street noise etc).  Everything looked new and well designed.  The room was small, but it had everything we needed.  Breakfast is included, served in the basement, a decent but not extravagant selection.  The hotel is just a few blocks from Times Square but  far enough away that you escape the hubbub.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Lovely small hotel in a great location","lang":"en","publishedDate":"2019-12-07","publishedPlatform":"OTHER","rating":5,"text":"We arrived late on a Tuesday.  Staff was so friendly and informative (Unlike many NYC hotels).  They recommended a great dinner place.  Rooms were larger than many NYC hotels and pricing was reasonable.  The room was kept immaculately.  Beds were comfortable as were the pillows.  We had 5 pillows on a king sized bed.  Elevators ran quickly and quietly.  I would definitely return and recommend this location to my friends.\nIf I have one small recommendation, the bathroom has terrible lighting for putting on make-up.  This could easily be fixed if they added a small light up retractable mirror on the wall.\n\nCoffee and tea and cookies are available most of  and the time in the lobby,\n\nWhite the breakfast was free, the breakfast was not good. Part of the reason we visit NYC is for the food, but you can get frozen bagels like those served anywhere in the country.  We wound up going out to breakfast every day.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"We love it !","lang":"en","publishedDate":"2019-12-03","publishedPlatform":"MOBILE","rating":5,"text":"Clean room and the fact that all the staff is friendly and helpful.  \nIt comes with complementary breakfast which is a great help to start your day.\nThey serve freshly baked cookies in the evening 🥰🥰🥰\nThe location is excellent , it takes you 10 mins talk to Bryant park , and 5 mins to Broadway if you plan to watch the show.  ","travelDate":"2019-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Великолепный отель! ","lang":"ru","publishedDate":"2019-11-16","publishedPlatform":"MOBILE","rating":5,"text":"Доброжелательный персонал, особенно Diana. Отель новый, не замораживали деньги на карте, хороший завтрак, отличное расположение, в стоимость включены две бутылки воды 0.33 каждый день, очень удобная кровать, уборка была каждый день. Супруга поздравили с Днём Рождения. ","travelDate":"2019-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":17765111,"title":"Great stay!","lang":"en","publishedDate":"2019-11-16","publishedPlatform":"OTHER","rating":5,"text":"Excellent customer service.  Bushra is super helpful! All the staff were great.  The room is very clean, a bit small, but expected for the price. There was a cold draft in the ventilation in the breakfast area but they fixed it right away. The selections for the breakfast were limited but decent. The bagels and croissants were delicious. Location is close to a lot of places to eat and also close to the subway. I will definitely consider staying here again when I visit NYC.","travelDate":"2019-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent!!!","lang":"en","publishedDate":"2019-11-07","publishedPlatform":"OTHER","rating":5,"text":"Amazing Staff,   rooms are beautiful and comfortable.    Only small issue i had was I requested a wake up call but it was on the morning after clocks changed and I was awaken one hour earlier.....   Everything was great!!!  \n\nThank you so much","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Just Opened and a Hidden GEM","lang":"en","publishedDate":"2019-10-22","publishedPlatform":"OTHER","rating":5,"text":"All I can say is WOW.  I arrived on their second day open and was absolutely amazes at the view I had from one of the top floors.  I have never been to a LaQuinta like this.  the rooms were small but for the price and location this hotel cannot be beat!  I will be back","travelDate":"2019-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":17765111,"title":"Excellent stay.","lang":"en","publishedDate":"2019-10-11","publishedPlatform":"MOBILE","rating":5,"text":"Just came back from 3 days stay in la quinta  midtown Manhattan.  Had an amazing stay. Right in the middle of Manhattan- walkable distance from times square and subway stations. What impressed us most was the front desk- managed by Diana, John and Mohamud. They were extremely helpful and courteous. Big thanks to them for giving us proper directions and even printouts. Our stay was very pleasant.  Whole heartedly I recommend this place. ","travelDate":"2019-10","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":17765111,"title":"New hotel needs some adjustments","lang":"en","publishedDate":"2019-10-04","publishedPlatform":"OTHER","rating":4,"text":"4 stars because the staff were so nice. 3 stars because I didn't sleep well due to the a\/c blowing on the head of the bed and the bathroom fan being permanently on and loud. My brother in a different room had the same issues, although I think he slept better. Otherwise, the bed was very comfortable, room clean, spacious, wi-fi ok, and location good. The hotel appeared to be very recently opened. Spacious room had some wasted space. There was no suitcase stand leaving the floor as the only option. Some people would want a mirror other than the one over the bathroom sink. I had some issues with the light switch and outlet configurations meaning what turned on and off with each switch seemed odd. Could be a great choice if they correct a few things.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":17765111,"title":"Calming after the madness of Manhattan.","lang":"en","publishedDate":"2019-10-03","publishedPlatform":"MOBILE","rating":5,"text":"We've had an amazing stay soon after the opening of this newly built hotel. It's amazing how calming the very friendly and smiling staff and well appointed and cleanly designed interior can be after spending your days around the busy streets of Manhattan.","travelDate":"2019-10","tripType":"FRIENDS"}
