{"helpfulVotes":0,"locationId":23528665,"title":"Exceptional Service From Everyone","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"MOBILE","rating":5,"text":"From Check-In to Check-Out, everyone was incredibly helpful and friendly to us. Also got a nice gift from the hotel for our anniversary.\n\nVery nice upgrade and a very clean and comfortable room as well. \n\nSpecial shoutout to Nicole for always going above and beyond to make our stay memorable!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23528665,"title":"Luxury Birthday Weekend Get-Away Made Pefect","lang":"en","publishedDate":"2024-01-29","publishedPlatform":"OTHER","rating":5,"text":"Second time I've stayed here and I may have loved it EVEN more.  From start to finish, everyone at the hotel makes you feel so welcome.  My stay was a couple's weekend getaway (mixed with a birthday celebration) and the hotel totally looked out for us.  Not only did they upgrade our room, but they also had a WONDERFUL cookies-and-wine treat waiting for us.\n\nThose delights aside, the food in all the restaurants was amazing.  And as we left, the bellhop was super helpful in making sure we got to the airport for the best price (Uber vs taxi) and in the best amount of time.\n\nI can't wait to go back.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23528665,"title":"Wow. The definition of a luxury stay","lang":"en","publishedDate":"2024-04-01","publishedPlatform":"OTHER","rating":5,"text":"My wife and I booked through capital one travel portal and our stay honestly exceeded our expectations. Beautiful, clean, and the food was amazing. With the venture x card we were able to get the room upgrade, early check in, and the daily complimentary breakfast. Will definitely be returning!","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"State of the Art Hotel - Fine, Quiter and Comfortable.","lang":"en","publishedDate":"2024-03-26","publishedPlatform":"OTHER","rating":5,"text":"One of the most vibrant and fine areas of Manhattan, everything was close by, and the car was parked safe inside a garage. 24\/7 front desk, the entire staff is welcoming, and they went beyond to make us feel pampered and fulfill our requests. \nThe Hotel has a great dining, bar and a coffee place inside the facility in case you don't want to go outside. However, you will find about everything to eat nearby as well. \nSome of our favorite's amenities were the Hudson Yards, Moynihan Train Hall Concourse and the hiking\/trail that is located right outside the hotel which takes you to the Vessel area in less than 5 minutes or you could keep left and keep walking for a longer walking too. Thanks again for made our visit to Manhattan a much joyable and memorable trip.        ","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Absolutely amazing","lang":"en","publishedDate":"2024-03-25","publishedPlatform":"OTHER","rating":5,"text":"Everything was fantastic at this hotel! The room was very nice and had wonderful views. The king bed was probably one of the most comfortable I have ever slept in. Breakfast was really good and quantities were huge. We only had dinner in one of the restaurants but the food and wine were of excellent quality. Service during our stay was 10\/10. Everyone was really nice and accommodating. ","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great location , Great hotel","lang":"en","publishedDate":"2024-03-25","publishedPlatform":"OTHER","rating":5,"text":"This hotel was awesome, location worked great, went to a game at MSG, had great dining options in hotel.  Just out the door was Whole Foods and Starbucks along with independent coffee shop.   Easy based to work from for a lot of things in Manhattan. ","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great stay","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":5,"text":"The Pendry hotel is an an excellent location and is def worth the $$ - would def book again next time I stay in the city. Linaya was exceptional in helping us book activities and everything else we needed. ","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Favorite Place to Stay in NYC","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"OTHER","rating":5,"text":"Can't beat the location! The location works for me because I usually travel by train to NYC for work. Hotel is across the street from Moyihan Hall. The hotel has great (business and personal) late and early food options, good nearby resturants, 3 coffee options steps from the front door, and there is a whole foods behind the hotel, if you want a cheap, quick and healthy option. The rooms are also very spacious for NYC rooms. I've booked direct on pendry and through 3rd party sites (i've stayed there 3 or 4 times in the last couple of years)...check in has been easy each time. Also hotel team staff is friendly and professional. I am writing this positive review, because I've consistently had a positive experience the last 2 years. ","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Lovely and accommodating hotel in an incredibly convenient location","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"OTHER","rating":5,"text":"Manhattan hotel rooms are typically miniscule. The hotel rooms here are commodious.  They are incredibly comfortable, clean and beautifully appointed.  The beds are very comfortable and there is room to work or eat comfortably.  The bathrooms are well designed as are the rooms, lighting and TV placement.  It's also very close to everywhere you'd want to be, including a block away from Moynihan Station and Madison Square Garden, and, amazingly, it's very quiet! I would definitely stay here again!","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"The most incredible stay in NYC.","lang":"en","publishedDate":"2024-03-02","publishedPlatform":"OTHER","rating":5,"text":"This was without a doubt the best hotel I have stayed in. We stayed for a week here and every day was fabulous. \n\nWe had the most amazing welcome, drinks upon arrival (rum and ginger punch) and a lovely welcome cocktail and cookies in our room waiting for us. The guys on the door and reception were so friendly every day. The reception team also helped us pick a rooftop bar one night and gave us recommendations, which was really helpful. \n\nThe room service guy was so nice, he made such an effort and went through everything upon delivery to make sure we had everything. \nThe daily cleaning service was always immaculate and turned down service included macaroons. \nThe location is spot on, close to everything we needed and had a chilled vibe. Nice and quiet at night. We could also open the window in our room, which was a massive plus for us, as we like our fresh air. :) \n\nThe gym was fabulous, had a separate recovery room and peloton area, as well as the machines, stair climber, large DB area and lots of treadmills and bike. \n\nThe Bar Pendry had a nice atmosphere, and we also had food that night too. \nWhen we left, the concierge gave us water for our journey to the airport - a lovely touch. Everything was just fabulous and I can't explain how amazing the attention to detail was. \n\nWe would absolutely love to go back soon. ","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great location. Friendly staff. Will stay again.","lang":"en","publishedDate":"2024-02-26","publishedPlatform":"OTHER","rating":5,"text":"Stayed here for a night out and was pleasantly impressed with the hotel accommodations as well as the friendliness of the staff. Will definitely look to book again this time with the family! A secret little gem, pop up ice skating rink around the corner and NOT crowded at all like Bryant park. ","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing hotel in Manhattan West, NYC","lang":"en","publishedDate":"2024-02-20","publishedPlatform":"OTHER","rating":5,"text":"We’ve just found our new favorite hotel in Manhattan!  Stayed here for 4 nights and everything was perfect - excellent location, beautiful property, over the top service, and wonderful restaurants and bars. Can’t wait to return!!","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Top notch NYC hotel in Hudson Yards","lang":"en","publishedDate":"2024-01-29","publishedPlatform":"MOBILE","rating":5,"text":"Front desk and door attendants great - I will be back.  Just for hotel management to know so they could improve: 1) had do not disturb sign on door and housekeeping knocked to see if they could service room.  Probably better to call if need to check as I had a late check  2) Room service breakfast; although pancakes looked well cooked, they were gooey on the inside (inedible), side of tomato’s as a $7 side option I thought would be nice thick slices but were 3 poor chosen thin as could be, and fresh squeezed OJ was not really fresh squeezed.   \n\nGreat gym, great location, great new rooms.  \n\nThank you to the super staff.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great NYC hotel option","lang":"en","publishedDate":"2024-01-24","publishedPlatform":"OTHER","rating":5,"text":"We had an excellent experience at Pendry Manhattan West.  The accommodations and amenities were first rate for a reasonable price at this location.  Staff couldn't have been more helpful.  If you're looking for a mid-town hotel with updated and attractive rooms and a great fitness center, Pendry is a great choice.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great Midtown spot","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"OTHER","rating":5,"text":"Location is perfect. Located on a quiet street with a lovely public area behind the hotel. It was festive with Christmas lights and ice skating. There are several good spots to grab breakfast or a drink, and a Whole Foods for other necessities. We walked all the way uptown one day and all the way downtown the next day. There is access to the Highline just steps away. \nShout out to Front Office Manager Oksana Yaqubic, who took care of a room issue immediately, professionally  and perfectly!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"We’ll be back!","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"OTHER","rating":5,"text":"We come to NYC once a year. This was our first stay at the Pendry.  We LOVED it. The rooms are lovely…and quiet. The service remarkable. A special THANK YOU to John at the front desk for making our stay (and anniversary) so special. Best hotel gym I’ve ever used. Zou Zous was terrific. We didn’t want to leave…but alas had to. We will be back!","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Top service","lang":"en","publishedDate":"2024-01-18","publishedPlatform":"MOBILE","rating":5,"text":"I visited the Pendry Hotel for 3 nights with my 13 year old son. We travelled from Spain to watch an NBA game and decided to stay here as it was near to Maddison square gardens. The hotel is super modern and clean. The service was absolutely first class, everyone working here was very friendly and did everything to make our stay enjoyable. A special mention to John on the front desk team who went far and beyond to help us with all of our needs during our stay. I would highly recommend this hotel to anyone visiting New York, and I will definitely stay here in my next visit.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Outstanding","lang":"en","publishedDate":"2024-01-13","publishedPlatform":"OTHER","rating":5,"text":"We were in NYC to see Here We Are at the Shed Theatre in Hudson Yards.  Our first time on that side of the city.  We stayed at the Pendry and it was exceptional in absolutely every respect.  Now tied with the Greenwich as our favorite place to stay in NYC.","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A West Coast Vibe In Manhattan.","lang":"en","publishedDate":"2024-01-07","publishedPlatform":"OTHER","rating":5,"text":"Located in Manhattan West at the northern tip of the High Line, the Pendry is steps from Hudson Yards & sights like the Edge. The eye-catching facade is made up of undulating waves of floor-to-ceiling windows providing front facing rooms semi-circle window nooks. I admired my corner studio whose features included an open concept living plan with 1 500 sq. ft. footprint.  A cocooned window seating area was neat but the pinnacle amenity was the wall of floor-to-ceiling windows affording lots of natural light and superior vistas of the cityscape. The heavenly marbleized bath was outfitted with a soaker tub (by a window), walk-in shower and double vanity. A wide complement of eating\/drinking venues graces the Pendry. The sultry Bar Pendry is a classic waterhole where I enjoyed small bites and handcrafted drinks ......like the Moscow Mule.....kicked like a mule. The Garden Room is a casual relaxing space serving small bites, daytime coffee and evening cocktails. Zou Zou's, a well respected eatery, serves Eastern Mediterranean food-fare the likes of Duck Borek and fire roasted Leg of Lamb. I selected the Octopus Carpaccio, Smoked Cherry Baby Lamb Chops, Lemon Frozen Yogurt and Prosecco to wash it down.........a terrific food collage. Chez Zou is a premier cocktail lounge with unusual pairings like Bananas & Bourbon and Vermouth & Picked Cucumbers and others. The Vista Lounge is a modern dining space focusing on glorious breakfast food-fare for guests and locals alike. The Pendry wellness amenities feature a 24\/7 1700 sq. ft. Fitness Center and a Movement Studio with high-tech equipment and Peleton Bikes, the bikes can be requested in-room.\nSo, if you are searching for a Manhattan escape in high-end, California-inspired digs\n......................then try the .............Pendry..............a West Coast vibe in Manhattan.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23528665,"title":"Excellent Service Green & Clean ","lang":"en","publishedDate":"2024-01-06","publishedPlatform":"OTHER","rating":5,"text":"Non toxic in nearly every way. This very natural hotel setting which is clean and comfortable. The staff is easy going, kind, and helpful. \n\nThe environment is restful with a biophillic approach. Hardwood used on doors and drawers with a linseed type finish. Wool is used for the carpets and the beds have dust mite zipped covers on the mattress. There are no strong chemical odors of any kind. The doors are heavy and alleviated hallway noise. The housekeeping was excellent and turn down service thoughtful with children’s slippers and macaroons complimentary every night. \n\nThe only thing I would say is the lotion and soaps are heavy with perfume so bring your own if sensitive. The bar soap was the only product we used. The lobby is a little cold in winter but on 4th floor you have comfortable cozy restaurant. They could fix this possibly this with entry heaters or supplemental in their garden lounge. The shared public restrooms are all male\/female which left a lot of pee on the seats. I think better attention could be spent in this area or designation for sexes would be helpful or plan on using your room if you have small children as I do. \n\nThe food is excellent farm to table options without organic listed. The restaurant staff including wait staff are very welcoming and polite. Reservations required for main dining Zou Zou. It’s excellent! My only complaint here was watching the expediter touch things like a marker and items handed to her by staff then place her bare hands into the herbs and food bowls. I know I’m a germ a phobe by many standards but this is how people get sick. \n\nLocation is near Hudson Yard with an emphasis on sustainability. The Edge is one of NYC’s latest attractions which was worth the ticket price is not too crowed as when we visited the lines were not long. There is a Whole Foods with in steps of the hotel which was great for glass bottled water and necessary items. The Pendry uses plastic bottled water but provides plenty  in the rooms. \n\nThe nearby shopping is all the usual big chain suspects with high end luxury on 1st floor. Our favorite store is Falconeri cashmere on the 2nd level which had great clearance sale for winter goods at the time of our visit 1st week in January. \n\nApprox 20 minute ride to the West Village and Central Park but near the High Line. City Bikes offered right out the door. It’s very easy to get a cab at the Hudson Yard Shopping district and of course easy to get an Uber from this location late night. \n\nWe will definitely stay here again. We loved this hotel and understand a chain is coming to Tampa where we live full time! \n\n","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing stay and fantastic staff","lang":"en","publishedDate":"2024-01-03","publishedPlatform":"OTHER","rating":5,"text":"I highly recommend staying the Pendry Manhattan. The rooms are beautiful and clean and the staff is very professional and accommodating. The hotel is modern with a fully equipped gym, great restaurants, and a great location.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Manhattan’s finest Hotel with the world’s most friendly staff!","lang":"en","publishedDate":"2023-12-20","publishedPlatform":"OTHER","rating":5,"text":"I would highly recommend The Pendry West Manhattan and believe it to be one of the nicest hotels I’ve ever stayed in in NYC. From the moment you arrive, the amazing door staff make you feel so welcome and effortlessly get you swiftly booked in. We were travelling with young kids and were surprised and delighted with little treats for them in our adjoining rooms. They had so much fun at the affordable and safe Ice Rink located right next door. The Room Service Team are the best I’ve experienced- the world over. They managed to turn my messy luggage into a neat masterpiece every single day. No ask was too big or too small for Team Pendry MW. Location is brilliant with the stellar Hudson Yard Mall and surrounding shops a few feet away.\nHenry in Bar Pendry deserves a huge shout out as the friendliest bartender in Manhattan. Every day he greeted our party by our first names and served us with a smile. (Can also recommend their Whiskey Sours!) Thank you Ash and Team for the best stay. We’ll be back! ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing hotel and great location","lang":"en","publishedDate":"2023-12-16","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is an amazing hotel!  Spacious room, great restaurant and bar, wonderful location. Hotel staff can make or break an experience. From check in to check out and everything in between, Pendry staff surpassed any expectation I had for a 5 star hotel. The front desk was friendly and expedient, in room dining was quick and tasty. The bar was full, vibrant and Henry provided fast and great service.\nMy NYC visit was to see Bocelli at Madison Square Garden and the Pendry was in close proximity - but it is also in a great neighborhood with a beautiful new mall and many restaurants. I am definitely staying here again but will bring clothes to work out as their gym!","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best in NYC","lang":"en","publishedDate":"2023-12-15","publishedPlatform":"OTHER","rating":5,"text":"Good points: 1 Outstanding service and accommodations.  2 Beautiful hotel and no street \/ outside \/ inside noise (very rare in NYC).  3 Very convenient location.  4 celebrity sightings.\n\nBad points: absolutely none","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best hotel in USA!","lang":"en","publishedDate":"2023-12-13","publishedPlatform":"OTHER","rating":5,"text":"Amazing stay, fantastic staff - Oksana and Luis especially - and fantastic hotel. Honestly cannot recommend Pendry Manhattan West enough, one of our best hotel stays ever! Great hotel to celebrate a special birthday! :)","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful and well located","lang":"en","publishedDate":"2023-12-11","publishedPlatform":"OTHER","rating":5,"text":"Stunningly understated boutique property in excellent location.  Definitely check out the bars on the first and fourth floors. After frequent NY travel to Soho and upper midtown, was originally worried about Hudson Yards location. Turned out to be incredible launching spot to other parts of city. ","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Elegante, no presuntuoso, centrico y muy amigable 100% New York Spirit Baby!","lang":"es","publishedDate":"2023-12-08","publishedPlatform":"OTHER","rating":5,"text":"Todo el personal es profesional y su atención es digna de resorts 5 diamantes. \n\nLas habitaciones muy comodas; Pide un cuarto en el piso mas alto posible, la vista que tendrás me dará la razón. \n\nEstá ubicado a solo unas calles del rio Hudson, a 2 calles del Madison Square Garden, 10 minutos a la 5a avenida, Time Square, etc. \n\nVolveré sin duda!","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23528665,"title":"a must stay hotel when you are in NYC","lang":"en","publishedDate":"2023-12-08","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is a great value and really great service hotel. Food and drinks are terrific, and the vibe is all about service. You cant find a management team more focused on the customer. Highly recommend the hotel","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great Experience at the Pendry Manhattan West","lang":"en","publishedDate":"2023-12-04","publishedPlatform":"OTHER","rating":5,"text":"The Pendry Hotel exceeded all our expectations. We arrived at 6:00 am after a long flight and we thought they wouldn't give us the room until the beginning of the afternoon but surprisingly they gave it to us right away.\n\nThe hotel is modern with a very pleasant clean atmosphere and its fitness center is equipped with the latest gym equipment. They are very generous with the amenities as well as with water and other supplies.\n\nThe people are very friendly, always willing to help. They have the hospitality concept very clear. \n\nI will recommend it a million times.","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful","lang":"en","publishedDate":"2023-12-01","publishedPlatform":"OTHER","rating":5,"text":"The staff was very attentive and helpful. The room was nicely designed, the ambiance was top tier. There is a reason they call it among the best locally and nationally. If we had more time, we would have taken the chance to explore more of the area immediately surrounding the hotel too","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The Pendry Bar: where liquid artistry meets unrivaled hospitality in the heart of NYC","lang":"en","publishedDate":"2023-11-29","publishedPlatform":"OTHER","rating":5,"text":"The Pendry Bar in NYC seamlessly fuses liquid artistry with top-tier hospitality, elevated by Bartender Henrry's exceptional attention to detail and remarkable memory of customers, that truly sets it apart.  Henrry, with his extraordinary memory emanating welcoming positive energy, and a flair for crafting exceptional cocktails, imparts a personalized touch that truly redefines the customer experience. Paired with Joey's managerial brilliance, this venue isn't just a bar; it's an exceptional indulgence, setting the gold standard for an extraordinary night out in the heart of NYC. Cheers to The Pendry Bar, where excellence in mixology meets unmatched service, and each visit unfolds as a spellbinding journey into the extraordinary! Thank you all very much!","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Overall satisfaction","lang":"en","publishedDate":"2023-11-23","publishedPlatform":"OTHER","rating":5,"text":"My experience during my trip exceeded expectations for service, cleanliness and friendliness. Great value, great location and great vibe. The Hudson Yards location and experience made the experience even better. ","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent hotel!","lang":"en","publishedDate":"2023-11-22","publishedPlatform":"OTHER","rating":5,"text":"We stayed at Pendry Manhattan West for my sister’s birthday weekend. Everyone at Pendry was welcoming and the beverage director made my sister’s special day extra memorable. We will be returning next year. ","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":2,"locationId":23528665,"title":"Was worth taking the step up in price","lang":"en","publishedDate":"2023-11-19","publishedPlatform":"OTHER","rating":5,"text":"I wanted to take my wife for a really nice trip to New York as it was her first time in the city.  I am not a New York expert in any way shape or form and there are obviously a LOT of hotels there, so I spent quite a long time looking for the right place.  I think the first choice most of us have is what budget we have to spend.  Do you want to spend USD200 - USD400 to stay in a Hilton, Omni,  Sheraton etc type of hotel, USD400 to USD600 to stay somewhere a step up from that or USD600+ to stay in one of the best hotels.  If you are taking that first step up and pay more than the standard then the hotel has to be worth it and I think the Pendry was!  My reasons why are below:-\n\nLocation - This was one of the most important factors for me.  Once again I am not a NY expert but I kind of figured out that most of the things I would want to see, places to go shopping or restaurants to go eat were somewhere between Washington park and the bottom of Central Park.  Given that there would be some days I might not want to walk or get the metro but get an Uber I wanted somewhere that was sort of in the middle of that area and therefore accessible via Uber (which is very expensive!).  The second thing was that reading reviews on here people would complain about coming out of their hotel around Times Square\/Midtown and being met by sights they did not want to see….The Pendry is in a quiet, clean street with high class offices and a business square behind it so was basically in a perfect and safe location.\n\nRoom - As we weren’t planning on spending lots of time in the room it didn’t matter to us to book a luxury room.  We stayed in the standard room which was spacious, tastefully decorated, with a nice view over the office square behind the hotel.  The shower was powerful and constantly hot.  The room was clean on our arrival and well cleaned during our stay there.  The room was also quiet, the bed was large and comfortable and the black out curtains cut out the light and the air conditioning was perfect so you could have the quality sleep there that you would expect from a hotel this level.\n\nThe rest of the hotel - We didn’t chose to eat in the hotel and didn’t use any of the facilities really but the gym was big and it had a couple of nice looking bars that would have been good to have a late night drink in.  Given the huge choice of places to eat in NY, perhaps the hotel could think a little bit outside of the box to incentivize guests to go and eat at the restaurant…\n\nThe service\/staff - We aren’t demanding\/fussy guests so had limited interactions with the staff other than at check in where Violet was very nice and efficient and managed to find us a room when we arrived early which was hugely appreciated and at check out where Luis was super professional and just left us with a great final impression.  The hotel also took a few different deliveries for us and held and delivered all of them for us efficiently and professionally.\n\nMy experience was that for the price band you pay for the Pendry there is nothing I could really fault the hotel for and did not regret spending the extra.  I would definitely stay there again and wish the hotel and all the staff there huge continued success!","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A beautiful retreat in the city!","lang":"en","publishedDate":"2023-11-15","publishedPlatform":"OTHER","rating":5,"text":"Staying at the Pendry Manhattan West is a must for your trip to NYC! Not only is it close to so many amazing locations (the High Line, Chelsea Market, Hudson Yards, etc.) but the rooms are absolutely gorgeous and provide you with a perfect relaxing evening after exploring all day. The beds are soft and luxurious and the bathrooms are so clean. The staff is incredibly friendly and helpful and the on-site restaurants and bars are divine. I can’t wait to stay here again the next time I’m in the city!! ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Delightful stay at Pendry Manhattan West","lang":"en","publishedDate":"2023-11-15","publishedPlatform":"OTHER","rating":5,"text":"Our first time, but definitely not our last, at a Pendry Hotel.  This property is beautiful and the experience exceeded our expectations.  The staff were well trained and very courteous.  We'll be back!!","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Nice but did not meet expectations","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"MOBILE","rating":4,"text":"Reasonably nice hotel conveniently located close to MSG. \n\nThe bed was comfortable and the room was quiet, especially by nyc standards. \n\nValet is provided which is an added convenience (for an additional charge, of course).\n\nThe reasons for 4 stars versus 5:\n* Room service was supposed to arrive within 40 minutes. After waiting over an hour, we called to check on the order and were told there was a large group slowing the kitchen down. We were going to a show at MSG so if we’d been provided a more realistic time frame, we would have skipped the order.\n\n* I called before we left the hotel to request the tray\/food be removed from the room. When we came back hours later, it was still there (gross)\n\n* the mini bar had a $13 restocking fee (!)  and sales tax applied on top of the (already very high) prices so the items were actually about 30% more expensive than listed. I hate being nickel and dimed.\n\nI booked a standard king room for $1,447\/nt.  I expected that these kind of kinks would be worked out.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful guestrooms, but service fell short of expectations.","lang":"en","publishedDate":"2023-11-10","publishedPlatform":"OTHER","rating":4,"text":"The rooms and public spaces are just as good as advertised, and the Pendry was a comfortable place to call home for our week-long stay. The design is immaculate and the property is new enough that signs of wear are few and far between. However, the service fell short of expectations, with unanswered emails, pre-arrival requests that weren't handled in advance, and some disappointing moments at check-in and check-out that felt more like what you'd encounter at a run-of-the-mill hotel rather than the class of property the Pendry clearly aspires to be. Given the price and the less-than-central location, I'm unlikely to return. It's a pity, as the guestrooms really are quite comfortable.","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Nice stay in Manhattan","lang":"en","publishedDate":"2023-11-07","publishedPlatform":"OTHER","rating":4,"text":"In a time when some of our preffered hotels are either closed or renovating, staying at the Pendry was a great experience. The hotel is pretty new, the rooms are fine and modern; some have a decent view from the park besides it etc. Checkin\/out uneventfull, good wi-fi, attentive staff. ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful rooms, lousy service.","lang":"en","publishedDate":"2023-11-06","publishedPlatform":"OTHER","rating":3,"text":"We have stayed at the Pendry West Manhattan twice - June and Nov 2023. The hotel is beautiful but the service needs some serious improvements. Reservations were not correct when we arrived (they had us double booked), promised to look into issues by the front desk, but there was no follow through; no car service to go to or 3 blocks, no amenity upon arrival despite having one the first time, little things like a trash can in each bathroom in the room (they are broken into 2 - one with a shower and sink and one with toilet and sink, guest services lacked knowledge about amenities and restaurants within the same complex. Expected a 5 star hotel experience and felt like it was a 3 for service for a very expensive room rate. ","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Exceptional Hotel ,","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"What a luxury venue to enjoy NYC from. The staff are so accommodating and friendly. The bedding and toiletries were exceptional making sleep no problem with the jet lag. The atmosphere was calm & peaceful a slice of zen in the Kissel and bustle of a huge city. So Central to everywhere. Gorgeous restaurant and bar conveniently stationed next to the Lobby as well as a coffee shop for early risers. Would definitely recommend this stunning hotel to anyone wanting to stay in  NYC. ","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The best","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"Everything first class.coolest location and surroundings. The hotel is new and well kept with service the same. Youthful exuberance.. close to shopping and great hotel restaurants. New York needs more hotels that are fresh like this one ","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The best place to stay in NYC!","lang":"en","publishedDate":"2023-11-04","publishedPlatform":"OTHER","rating":5,"text":"Everyone should try to take the opportunity to stay at the Pendry if they're travelling to New York, whether for business or pleasure, solo or with family. The hotel is beautifully designed, the rooms are clean and modern, and the service is exceptional from check in to check out. You won't regret it!!","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing location","lang":"en","publishedDate":"2023-11-03","publishedPlatform":"OTHER","rating":5,"text":"Everything was literally within walking distance, don’t recommend getting a rental, parking is expensive and not worth it since everything is in walking distance, the hotel staff is amazing and tend to all your needs. ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Au Top !!","lang":"fr","publishedDate":"2023-11-02","publishedPlatform":"MOBILE","rating":5,"text":"Très bel hôtel à 5min à pied de la station de métro Hudson Yards, le calme sans les désagréments.\n(sur le chemin du métro, on trouve un petit café ”old country coffee” assez sympa et confortable)\nLes chambres sont spacieuses car bien agencées, literie impeccable, propreté irréprochable, personnel charmant.\nPas le temps de tester le restaurant de l'hôtel, mais les choix sont nombreux a NY, peut-être une prochaine fois !\n","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great location","lang":"en","publishedDate":"2023-10-31","publishedPlatform":"OTHER","rating":5,"text":"This location is perfect for anyone looking to explore the city to its fullest, I was amazed by how I kept on finding new things to do. The service was great, I appreciate Murat he made sure everything was taken care of, and also Salvador for his readiness to always assist with anything it many more but I couldn’t remember all the names.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Absolutely perfect!","lang":"en","publishedDate":"2023-10-31","publishedPlatform":"OTHER","rating":5,"text":"From the lobby staff to the housekeeping service, this hotel clearly strives to satisfy its guests.  Beautiful rooms with beautiful views and a location that can't be beat.  This is my new favorite hotel in NYC.","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"So great that I changed my plans to stay here again!","lang":"en","publishedDate":"2023-10-28","publishedPlatform":"OTHER","rating":5,"text":"I have fallen in love with this hotel! I stayed here on a Thursday evening before a work event and then changed my plans so that I could stay here again two days later. The rooms are calming and so comfortable, the food is excellent, and the service is incredibly friendly. It’s really an oasis and I don’t want to leave!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Hudsons Yards convenience","lang":"en","publishedDate":"2023-10-27","publishedPlatform":"OTHER","rating":5,"text":"Rooms are so very quiet and very bright and spacious.   Nicely laid out with an awesome shower. The location is Very close to Madison square Gardens for a concert.  Located with access to the Hi Line as well. ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Weekend getaway","lang":"en","publishedDate":"2023-10-16","publishedPlatform":"OTHER","rating":5,"text":"Is a great location easy to get many places.  Peloton, the garden, great restaurants.   Time square is 15 minute taxi ride.  The hotel is beautiful and Manhattan west plaza is amazing and Starbucks is close by \n\n","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Anniversary getaway","lang":"en","publishedDate":"2023-10-15","publishedPlatform":"MOBILE","rating":5,"text":"We flew into town to spend a whirlwind weekend in NY for our anniversary.  Everything about our stay at the Pendry was 5 star worthy. The service was impeccable from the moment we walked in (and was consistent throughout our stay), the room was beautiful, and the view was breathtaking. The smallest details were executed to perfection which made the stay one to remember. My only regret is that we could not stay longer. This will be our go to hotel anytime we are back in NYC.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best hotel in NYC","lang":"en","publishedDate":"2023-10-15","publishedPlatform":"OTHER","rating":5,"text":"Beautiful spacious clean rooms.  The staff are all really nice and helpful, we loved every minute it’s worth the money. Hotel is in a nice area and easy to walk around the city from here. Breakfast was good. \nThank you for the upgrade our room was the best we’ve ever had and we’ve stayed in a lot of 5* hotels.  ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Top class - great gym","lang":"en","publishedDate":"2023-10-12","publishedPlatform":"MOBILE","rating":5,"text":"The Pendry in Manhattan West Is top class. Relatively new and really good service on all counts. Nice bar and restaurant. Probably the best and newest equipment in the gym than any other hotel I have stayed at in New York. Great location and close to everything.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic Hotel","lang":"en","publishedDate":"2023-10-11","publishedPlatform":"OTHER","rating":5,"text":"Incredible location, beautiful property, great rooms and excellent staff. This is my second stay at this property. I wrote a positive review last time, and the desk staff were aware of the review. This is the kind of service and attention to detail that I think the Pendry personifies. ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"business trip","lang":"en","publishedDate":"2023-10-06","publishedPlatform":"OTHER","rating":5,"text":"Excellent staff and hotel. Staff remembers your name and are there for whatever you need.\nHotel was clean and all was good.\nWould highly recommend this property when in the area. Great restaurants in the area.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23528665,"title":"Amazing place to stay","lang":"en","publishedDate":"2023-09-25","publishedPlatform":"OTHER","rating":5,"text":"Rooms are lovely, food and service are impeccable. 24 hour room service is a huge perk, the food is always fresh and prepared well even if you order late night dining. The hotel location is very convenient, very close to the high way and a short walk from Penn Station. The wi-fi could be slightly better which could be my only criticism.","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"I almost want to keep this hotel secret","lang":"en","publishedDate":"2023-09-25","publishedPlatform":"OTHER","rating":5,"text":"This is our go to hotel in Manhattan.  First, it has a great feel to it, modern, soft lighting, a calm place in the midst of a hectic city.  Its location can’t be beat if you’re arriving at Penn Station or attending an event at the Garden.  It’s worth the price.  The rooms are exceptional, quiet, and luxurious.  And lastly, the entire staff are such seasoned hospitality pros.  They call you by name as you enter, even if you haven’t been there for months.  They’ve won our loyalty and I can’t say that about any other hotel.","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Nicest hotel in midtown Manhattan","lang":"en","publishedDate":"2023-09-22","publishedPlatform":"OTHER","rating":5,"text":"Hands down the nicest high end hotel in midtown Manhattan.  Beautifully designed, courteous staff, clean, luxurious, great location.\nIf you can splurge and stay at a high end hotel, this is the one to stay at.  Also had great experience hosting a board meeting in the conference rooms.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"5 stars, from beginning to end","lang":"en","publishedDate":"2023-09-13","publishedPlatform":"OTHER","rating":5,"text":"With the US Open in town, my go to 5 star hotel was booked solid so I decided to try out Pendry and let's just say, I might have a new go to. REALLY amazing, from the doormen, hosts, to even housekeeping being incredibly polite.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"ALWAYS FRIENDLY","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":5,"text":"Tre Elegante'.  Professional and friendly staff. Supremely California classy decor. The small bar is very cozy, well appointed, and  with excellent service and mixology. Public areas are all pleasant and rooms are modern and welcoming.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Perfect Getaway","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":5,"text":"We've stayed at a number of hotels but Pendry Manhattan West is definitely worth its 5 stars! The staff was very friendly from check in to check out. In room dining for breakfast was perfect; the food was delicious. The location was perfect: walking distance to\/from the train station, to\/from the trail along the Hudson. The room was perfect!  Thank you for making our stay so memorable!","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent Property and Location","lang":"en","publishedDate":"2023-08-31","publishedPlatform":"OTHER","rating":5,"text":"Hotel maintains an intimate, comfortable feeling. Rooms are very well appointed with excellent finishes and details. Very comfortable. Location is central but out of the hustle and bustle. A great place to stay in Manhattan.","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"You get what you pay for","lang":"en","publishedDate":"2023-08-31","publishedPlatform":"MOBILE","rating":5,"text":"This is one of the finest hotels anywhere.  The location is amazing.  The bed and pillows absolutely top shelf.  Every detail of the room is well thought.  Talk about quiet, OMG.  The fitness center was fantastic and so clean and well equipped.  It felt like our private residence rather than a hotel.  We will return, soon.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent property in the heart of Manhattan","lang":"en","publishedDate":"2023-08-29","publishedPlatform":"OTHER","rating":5,"text":"Very nice property with friendly staff and excellent location. Minutes from broadway and shopping areas but on a much quieter road.. right next to great restaurants and whole foods which makes the experience even better","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic boutique hotel with great views and location","lang":"en","publishedDate":"2023-08-28","publishedPlatform":"OTHER","rating":5,"text":"the Pendry is steps away from the High Line and a beautiful plaza with restaurants and shops. The room small but very elegant and well appointed. Staff were incredibly helpful. This is our new NYC home.","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent","lang":"en","publishedDate":"2023-08-28","publishedPlatform":"OTHER","rating":5,"text":"Beautiful hotel, in a great part of town close to everything.  The restaurants and bars were great, and beautifully appointed.  Excellent service, great amenities in an overall beautiful setting.\n\nHighly recommend ","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Date Night","lang":"en","publishedDate":"2023-08-28","publishedPlatform":"OTHER","rating":5,"text":"Awesome stay, excellent service from the staff!  My wife and I were greeted upon arrival and made to feel like we were about to have a relaxing stay.  The layout of the rooms was carefully designed to feel much bigger than they were.  ","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Stay","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":5,"text":"First time visiting the property. Beautiful and cozy hotel, yet elegant! Great design and areas were very cleaned!\n\nRoom service was spotless and the food quality was great! Location was on point as well!","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The best hotel in New York City!","lang":"en","publishedDate":"2023-08-26","publishedPlatform":"OTHER","rating":5,"text":"The hospitality is unrivaled.  The welcome warm and southernly, so unexpected in NYC of all places! Best staff I've ever interacted with at a hotel and I've traveled extensively throughout the world.  Hats off to the entire staff, manager, front desk, bellmen, operator, maid, room service, just all of it.  ","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great trip","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":5,"text":"Trip for anniversary was a wonderful trip. Beautiful fit and finish and materials throughout. Good food and service throughout the trip. Nice touch of a bottle of wine complimentary for our anniversary ","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great Stay","lang":"en","publishedDate":"2023-08-20","publishedPlatform":"OTHER","rating":5,"text":"We had an excellent stay at the Pendry Manhattan West. Room was excellent. All the staff were top notch. Service was timely and everything exceeded our expectations. Location is great. We did 2 live in studio Peloton rides during our trip and the location could not be better for that. Also proximity to Hudson Yards is nice. ","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Not 5 star","lang":"en","publishedDate":"2023-08-20","publishedPlatform":"OTHER","rating":2,"text":"We are currently staying in a queen room with our family. The room size is okay, and superficially nice enough, but the finishings are not at all high end and the layout is not at all practical. The service at the front desk is one of their biggest challenges - accordingly we’ve asked for the general manager’s contact details - which has not been provided. I could go on - and I’m hoping Mr Bhasain will provide his business card in my room today, so we can speak directly. It is one thing write a critical review and then post-event have a hollow promise of welcoming you next time - but we are here now and would like to discuss directly the issues we’ve faced - rather than publicly share all details, with a hotel that we hope can improve, I’m hoping this message will be actioned earlier enough for us to discuss while we are still here. More generally, I’d tread with a caution - it’s nice enough here, but certainly not 5*. Room 1410.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23528665,"title":"Very Nice Hotel","lang":"en","publishedDate":"2023-08-19","publishedPlatform":"OTHER","rating":4,"text":"Very nice hotel although the rooms are quite small.  The staff is very friendly (particularly Sasha the bellman).  Nice water pressure in the shower although the water leaks out into the vanity area. Need a pocket door separating bathroom from the rest of the room.  Nice fitness center and good location to nice restaurants.  Zou Zous is nice but extremely loud.  Beds are very comfortable.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Feels like Home","lang":"en","publishedDate":"2023-08-17","publishedPlatform":"OTHER","rating":5,"text":"Every surface, fabric, pillow, light switch, and carpet is a luxurious experience. The staff is ever-present in the most quiet and professional way. The bar and food options within the hotel make it effortless to turn a business trip into a social one and vice versa. And even being a cool, design forward hotel, my four year old son comes and has a ball. I come away from this hotel feeling more vibrant and rested every single time. It's become my home away from home.","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"First Time in the Manhattan West Oasis","lang":"en","publishedDate":"2023-08-17","publishedPlatform":"OTHER","rating":5,"text":"Recommended for a business trip. Got the lowest cost room with least favorable view -however, even though the room was small-ish, its layout felt roomy and very comfortable and the desk near the floor to ceiling windows was perfect for working. Bed was one of most comfortable and the shower was good pressure and temp. Lots of drawers for clothes so you can move in for however long you are staying.  Food was also quite good in the single occasion I used the restaurant (bc the plaza next door has an excellent Italian place (Ci Siamo).  Little on the expensive side but you can find deals - Highly Recommend","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"An absolutely relaxing and comfortable stay","lang":"en","publishedDate":"2023-08-08","publishedPlatform":"OTHER","rating":5,"text":"It was really a great experience all around.  I arrived at about 11:00 and was hoping to get checked in early. It took the staff about 30 minutes to get my room ready, check me in, and get me to my room.  Once there, i was totally spoiled by the great accommodations.   When it came time to leave we left at about 11:00 am and did not feel pressured to depart.   My only regret was that we had to leave at tall.  A truly enjoyable experience.","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"3 day Business trip to NYC","lang":"en","publishedDate":"2023-08-03","publishedPlatform":"OTHER","rating":4,"text":"Very good all round experience for a NYC Hotel. So nice to stay in a new modern facility with very attentive and welcoming staff. Bar & restaurant convenient and v good quality for client entertainment. All very compact. Will definitely stay there agian the next time i visit.  ","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Superb hotel","lang":"en","publishedDate":"2023-08-01","publishedPlatform":"MOBILE","rating":5,"text":"What a wonderful hotel. We were travelling with two children, and stayed in a Skyline Double Double interconnecting with the Skyline Alcove Studio on the 19th floor. Unlike so many hotels, they delivered on the promise of interconnecting rooms! The housekeeping was fantastic and the rooms were immaculate - and always made up by the time we returned to the hotel in the early afternoon. The rooms were quiet, and provided a lovely space to escape from the bustle of the City below. Even the coffee shop on the ground floor, Black Fox Coffee, did excellent tea and coffee.\nDownsides? The breakfast, served on the 4th floor, was fine rather than stellar. I’d go to Russ & Daughters around the corner for a bagel instead. But that’s a tiny point. This is a brilliant hotel, brilliantly located. I would highly recommend it.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Calm in the midst of the City","lang":"en","publishedDate":"2023-07-29","publishedPlatform":"MOBILE","rating":5,"text":"The interior of the hotel has a very calming vibe in the midst of the city. The room was absolutely beautiful with an amazing view. The beds were extremely comfortable. We ate in the restaurant and the food was very good. I look forward to trying other Pendry locations.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Yet, another great stay at the Pendry","lang":"en","publishedDate":"2023-07-28","publishedPlatform":"OTHER","rating":5,"text":"Our stay was wonderful… each time we’ve stayed, our experience has been exceptional. From the personal attention, to the beautiful accommodations… everything is 5 star! The gym is spacious, clean and well equipped.  There are various dining options both within the hotel and in the immediate area.  Location is conveniently located in midtown but away from all of the hubbub. This is the only place we’ll stay when in NYC. ","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Always a delightful stay","lang":"en","publishedDate":"2023-07-27","publishedPlatform":"OTHER","rating":5,"text":"This is our Go-to hotel on the West side in Hudson Yards. So easy to get to from NJ and you’re in the best area of everything  new & exciting. The staff is the absolute best. Pleasant and accommodating 100% of the time. I particularly love the hotel aesthetic.  the hushed tones, masculine clean feel and spacious shape of the rooms. The bars are fun and the food delish. I honestly wouldn’t consider staying anywhere else.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Well designed luxury stay in Hudson Yards.","lang":"en","publishedDate":"2023-07-27","publishedPlatform":"OTHER","rating":5,"text":"Fabulous rooms with floor to ceiling windows & a fresh air window to let a breeze in. The beds are comfy and the walls are soundproofed.  Separate shower room & toilet w\/ sink flank the entryway and makes getting ready to go out more manageable. The staff is friendly and acknowledge you coming in and out which is nice. Oh and a clothes steamer, genius!","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"A Gem in Manhattan","lang":"en","publishedDate":"2023-07-26","publishedPlatform":"OTHER","rating":5,"text":"Our experience at the Pendry West Manhattan was second to none.  I would highly recommend!  The location was perfect as we attended a concert at Madison Square Garden...walking distance.  The establishment was exceptionally clean,  and the beds provided a wonderful night's sleep.  Cudos to all the employees.... very kind and professional.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing place!","lang":"en","publishedDate":"2023-07-25","publishedPlatform":"OTHER","rating":5,"text":"The location was fantastic. Room was very spacious, very clean and most of all the shower, pillows and bed were the best! Didn’t want to leave!!\nMust try the French toast in the vista lounge! The best!","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing stay","lang":"en","publishedDate":"2023-07-25","publishedPlatform":"OTHER","rating":5,"text":"Traveled to New York for vacation. Had a wonderful stay from start to finish. Even called before our arrival and the front desk was very helpful and had suggestions on where to make dinner reservations. Location and quality of the rooms were amazing. The restaurants and bars located in the hotel were very good. Was also very close to other food options and just down the street from an huge mall for shopping. 10\/10","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Exceptional stay in NY","lang":"en","publishedDate":"2023-07-21","publishedPlatform":"OTHER","rating":5,"text":"my stay at Pendry NY was nothing short of exceptional. The hotel's decor, unmatched hospitality, and stunning views created an unforgettable experience. If you're seeking a luxurious urban oasis in the heart of New York City, look no further than Pendry NY Hotel. I am already eagerly anticipating my next visit.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"World class service","lang":"en","publishedDate":"2023-07-11","publishedPlatform":"OTHER","rating":5,"text":"Our family was completely wowed, not just by the spectacular views, room and amenities at the Pendry. But by the top tier service and attention to detail the staff provided. Okasana ensured our room was well appointed prior to our arrival and once checked in Pema, John, Nicole, Jun, David, Sasha, Miasel, Murat, Sonu all assisted in making our stay truly special. Truly grateful for their dedication to providing great service. \n\nWe look forward to returning to the Pendry Manhattan West and exploring other Pendry locations. ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Luxury Next Door to Moynihan Train Hall","lang":"en","publishedDate":"2023-07-06","publishedPlatform":"OTHER","rating":5,"text":"Traveling into and out of Manhattan via the Acela, I wanted a 5-star hotel that was close by Moynihan Train Hall.  The Pendry was just the ticket.  The room was clean, contemporary and well appointed.  The fitness center was the best I have experienced.  The staff was welcoming and very helpful.  I highly recommend The Pendry for a luxury 5-star hotel experience.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The Perfect NYC Experience","lang":"en","publishedDate":"2023-07-04","publishedPlatform":"OTHER","rating":5,"text":"Spend a little more to get the very best. Everything in this hotel is worth it. Top-tier rooms, amenities and Guest Staff. The location is ideal for everything including The Highline, Hudson Yards and restaurants. Not far from Broadway, and a short trip to the financial district. Anything you want is right there or close by.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Absolutely amazing","lang":"en","publishedDate":"2023-07-02","publishedPlatform":"OTHER","rating":5,"text":"From the service to the rooms to room service and every accommodation in between, the Pendry is it. I was even able to extend two extra nights when my flight was canceled last minute. I can't wait to come back and also visit other properties.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pendry Manhattan West","lang":"en","publishedDate":"2023-06-28","publishedPlatform":"OTHER","rating":5,"text":"Such a great hotel, too bad that I was there only for a short time. Upon arrival I was assisted by Jun who was able to answer all my questions (I had a bunch in my arsenal), kind Sasha helped me with my begs, housekeeping team did phenomenal job in providing the top quality service, bar had delicious cocktails, upon departure I was greeted by manager Oksana who made sure to share her business card with me and invited me back (wait for my email, I will shoot one soon). \nProfessional service. Comfortable design. This hotel has everything you need. ","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23528665,"title":"Clean, elegant, friendly in NY!","lang":"en","publishedDate":"2023-06-28","publishedPlatform":"OTHER","rating":5,"text":"Went on a girls trip with my 11 year old daughter.  Location was excellent as it was just the right amount of vibrancy in the area, but even more importantly the hotel decor and finishings were gorgeous!  The staff was also super friendly - from the front desk to the doormen.  Lots of nice little touches and surprises which I won't give away because that is part of the fun!  Thank you for an excellent stay.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"The Facility is Spectacular but the People Made the Difference","lang":"en","publishedDate":"2023-06-27","publishedPlatform":"OTHER","rating":5,"text":"In town with family for a niece's wedding. Can't say enough about how wonderful our stay was. The rooms are spectacular but what set it apart was the people. The doormen, room service, housekeeping, the bartender--everyone we met was gracious and genuine in their wish to be of service. Thank you!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pendry Manhattan West","lang":"en","publishedDate":"2023-06-27","publishedPlatform":"OTHER","rating":5,"text":"Best hotel in Manhattan.  Close to theatre, restaurants, Javitts, mid-town.  Do not miss this hotel it is outstanding.  5 stars!  From check in to the great restaurants and lounges, workout room, room service, an exceptional hotel","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pendry Manhattan West is a gem","lang":"en","publishedDate":"2023-06-21","publishedPlatform":"OTHER","rating":5,"text":"The Pendry Manhattans West is a hidden gem.  The location by Hudson Yards is great and a nice vibrant area.  The outdoor seating is wonderful for the nice summer nights.  When your at this hotel you fee like your in a hidden part of the city. ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great location, easy to access from Moynihan","lang":"en","publishedDate":"2023-06-20","publishedPlatform":"OTHER","rating":3,"text":"This was our 2nd stay at the Pendry Manhattan West; girls weekend in NYC with my 12 year old daughter.  The location was great, we travel to NYC by Amtrak and the hotel is just across 9th avenue from the new station, making it really easy to travel with luggage.  Hotel is very close to the Highline which we really enjoyed, and walking distance to The Edge, the Vessel, Little Island Park.   The rooms were spacious (for NYC) and the hotel is clean and new.  The staff is not at all engaging with guests and they certainly don't go out of there way to offer you any help, insights, or to check in to see if there is anything they can offer to help with your stay.  That aspect of the hotel is rather disappointing and which is why I rated it average.  The service doesn't even compare to that of the Ritz Carlton or the Four Seasons, or other high end hotels that would be in the relative similar price range.  We are staying at the Baltimore Pendry for the first time next weekend, I will be curious to see if the experience is different or similar.  \n\nOverall, great location if you are looking to stay near the Highline, Hudson Yards, or walking distance to Meatpacking district.  And super easy access to the Amtrak train station.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Wow ! Pendry rocks the details! Could not be more impressed ","lang":"en","publishedDate":"2023-06-16","publishedPlatform":"OTHER","rating":5,"text":"This is our second time visit the Pendry West Manhattan , we love this great location incredible service, as always, impeccable housekeeping Thanks to the wonderful attentive staff, Jasun, John ,Luis,Linaya,Deki front desk agent , and to the amazing front door team,  and special shout out to the  GM Ash Bhusin for a kind welcome gift in our room , that was very thoughtful !! Super service !!! I highly recommend this place \n","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Must Visit","lang":"en","publishedDate":"2023-06-16","publishedPlatform":"OTHER","rating":5,"text":"Absolutely beautiful location.Fabulous accommodation.Staff are above and beyond Especially Jasun Front desk agent he accommodated with a smile and warm greeting.Super service \nWe also want to give a shout out to the general manager Ash Bhusin\nfor a welcome us with a bottle of champagne in the room, this was super thoughtful and set the tone for our stay. The whole atmosphere was really enjoyable, thank you so much again !!","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pandry is a great place to stay ","lang":"en","publishedDate":"2023-06-16","publishedPlatform":"OTHER","rating":5,"text":"Pandry at Manhattan, NY has a great location that is close to Penn Station and many nice restaurants. The hotel staffs are very friendly and approachable. The room is clean and well maintained. The room service was great. Pandry is one of great hotels that I experienced. Whenever I visit NY, I always stay at Pandry. ","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"You must stay here","lang":"en","publishedDate":"2023-06-10","publishedPlatform":"OTHER","rating":5,"text":"Fabulous, new hotel (built in 2021) with pristine rooms and amazing views (we could see the Hudson from our room!).  We had a relaxing drink at the bar on the 4th floor and great room service for breakfast.  Zou Zou seemed like a nice restaurant but we were between shifts (4 PM) and the kitchen was closed so could not try food.  Would definitely go back.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing stay","lang":"en","publishedDate":"2023-06-06","publishedPlatform":"OTHER","rating":5,"text":"The hotel was faultless in every way.  The rooms impeccably clean and well furnished.  The bar fantastic and the staff really couldn't do enough to make our stay equally fabulous, even down to surprising my husband with a birthday card, bubbles and cake.  The location is central and easy to reach both sides of the City.\nThank you for an amazing stay,  we will definitely be exploring the other Pendry locations in the future. ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great stay","lang":"en","publishedDate":"2023-05-30","publishedPlatform":"OTHER","rating":5,"text":"Incredible service, as always, and stunning accommodations. Couldn’t recommend highly enough. Room service was perfect. We would love to return! Special shout out to the amazing front door team as well","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Awesome Hotel with Great Staff and Location","lang":"en","publishedDate":"2023-05-29","publishedPlatform":"OTHER","rating":5,"text":"This is a great hotel for the combination of luxury and amazing location with terrific staff.  Shopping at Hudson Yards and access to high line at same time was a highlight of the trip and can be recommended.  Easy to get around and west Manhattan is really coming along ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful property, amazing staff.","lang":"en","publishedDate":"2023-05-27","publishedPlatform":"OTHER","rating":5,"text":"Super friendly, attentive, impeccable from arrival to departure. One of the nice touches - four bottles of water in the room, plus a welcome amenity.  I really appreciated the thought towards each detail.  Highly recommend.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Chic, stylish, and comfortable","lang":"en","publishedDate":"2023-05-24","publishedPlatform":"OTHER","rating":5,"text":"The primary reason we chose this was because of its proximity to the Peloton studios, and that did not disappoint. We were a 3 minute walk away from peloton which made getting into the live classes super convenient. The hotel itself is great- very clean, friendly staff, and decently sized rooms for NYC. Overall, we were very happy with our stay. ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great time in New York","lang":"en","publishedDate":"2023-05-22","publishedPlatform":"OTHER","rating":5,"text":"The hotel is very up to date. The decor is grand. The rooms are spacious. Linens and towels were fantastic.  Highly recommend. Located close to Square Garden if you are coming in for a concert or sporting event.","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pendry Manhattan","lang":"en","publishedDate":"2023-05-21","publishedPlatform":"OTHER","rating":5,"text":"Excellent new property, great service, comfortable bed, large room, 2 blocks to Penn Station, Metro and MSG.  This is the place to stay if you want to explore this area (Hudson Yards and The High Line) and easy to venture out to other parts of NY.  Restaurants nearby and on the premises if you want to stay near or at the hotel and Whole Foods around the corner.","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Our Stay at Pendry Manhattan West","lang":"en","publishedDate":"2023-05-21","publishedPlatform":"OTHER","rating":5,"text":"This is an excellent hotel that is conveniently located to the restaurants and shops at Hudson Yards. The rooms are very functional and well appointed. The staff is extremely friendly and helpful. We will definitely return to the Pendry.","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great Stay; discreet, luxurious, relaxing","lang":"en","publishedDate":"2023-05-18","publishedPlatform":"OTHER","rating":5,"text":"I am not normally one to leave reviews but I had to after my stay. Celebrated a birthday and stayed with my wife. From start to finish we received impeccable service and hospitality. It was a staycation for us and by far the best hotel we have stayed in in NYC. The room felt like a private oasis of calm in the craziness of NYC. It was very zen, very comfortable, amazing bath products and everything was extremely considered. Definitely for guests looking for a high end, discreet but luxurious stay. Area is also great for walking and dining. Couldn't recommend the hotel enough and will be back as often as we can. BONUS: a Black Fox Coffee location just off the lobby. Win win. ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Luxury and modern in great location","lang":"en","publishedDate":"2023-05-16","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is located in the Hudson Yards area of Manhattan. Location was perfect to walk most places or take a short cab ride. The only exception was to Central Park and museums near park. A taxi was sufficient but traffic jammed in that area.","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Stay Here, You Won't Regret It","lang":"en","publishedDate":"2023-05-13","publishedPlatform":"OTHER","rating":5,"text":"Can't say enough wonderful things about this place. The hotel is immaculate with incredible attention to detail. The staff is so welcoming and attentive. The room service food is incredible. The rooms are luxurious, quiet, and cozy. Really appreciated the nightly turn-down. Please consider this hotel if you are visiting NYC.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pampered Luxury!!","lang":"en","publishedDate":"2023-05-09","publishedPlatform":"OTHER","rating":5,"text":"One of our best hotel experiences ever. Staff is effortlessly accommodating. Room was gorgeous!  Highly recommend. Would gladly stay there again. \nLocation is great and close to nice parts of the city—very safe. ","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"A gem in Hudson Yards","lang":"en","publishedDate":"2023-05-03","publishedPlatform":"OTHER","rating":5,"text":"A new hidden gem in Hudson Yards - the Pendry is a great choice.  The staff are amazingly welcoming, the fitness center is a great size with new equipment - the rooms are comfy -  with nice bath products and the bar is hopping.  If you can get into the restaurant, it's great - but hard to get a rez. for dinner\n  ","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Awesome new deluxe hotel!  Definately will come back!","lang":"en","publishedDate":"2023-04-25","publishedPlatform":"OTHER","rating":5,"text":"This is my favorite hotel, perfect location, love the new modern spacious rooms and delicious food!  Perfection!  We really enjoyed our stay and will definitely return.  Our room was super well thought out, room service was quick and food was yummy.   ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great NY hotel  on Highline!","lang":"en","publishedDate":"2023-04-25","publishedPlatform":"OTHER","rating":5,"text":"Beautiful five star hotel but less costly than Ritz and quite frankly better. A more hip vibe. Room was a nice size with a killer view. Lobby beautiful and loved that we were 10 blocks from midtown and 10 blocks from West Village.","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best hotel in NYC","lang":"en","publishedDate":"2023-04-24","publishedPlatform":"OTHER","rating":5,"text":"This hotel goes above and beyond to make sure you have everything you need for your stay. The service is extremely personalized and first class. I want to give a huge shout out to Luis at the front desk. He exemplifies amazing customer service. My stay wouldn’t have been the same without him.","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Top!","lang":"en","publishedDate":"2023-04-18","publishedPlatform":"OTHER","rating":5,"text":"Stayed 8 nights. Top place! \nPerfectly located hotel with lots of restaurants and attractions nearby. Top class service from start to finish. especially good service at the door.\nI can warmly recommend Pendry.","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best Hotel in Manhattan","lang":"en","publishedDate":"2023-04-18","publishedPlatform":"MOBILE","rating":5,"text":"This experience will remind you of what luxury travel once was. The entire experience from the time you arrive to when you depart will be a memorable and rewarding hotel stay. We loved this hotel because everything about it is Five Star. The level of personalized experience is unparalleled. Daniel Ng, the Manager should be commended for ensuring that every detail of your stay is top notch. The rooms are large and beautiful and this is a full service hotel with room service and other perks that are rare in today’s world of travel. Every staff person is welcoming and you are treated like royalty. We booked through American Express Fine Hotels which I also recommend. The amenities are wonderful!","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"A Memorable Manhattan Birthday","lang":"en","publishedDate":"2023-04-17","publishedPlatform":"OTHER","rating":5,"text":"A stay at the Pendry Manhattan West should be on top of everyone's list for a visit to New York City. Located  just a block and a half from Penn Station and Madison Square Garden, two blocks from the High Line and mere steps from Hudson Yards - it is the ideal base for your next Manhattan adventure. This may seem like it would be a noisy spot, but that could not be further from the truth. The Pendry is a quiet oasis in the middle of all that Manhattan has to offer.\nWhen we arrived, we were greeted by Louis at the front desk. He was delightful and gave us great tips about experiences we might enjoy. We also told him that we were celebrating my birthday and he arranged for a birthday cake to be left in our room with a wonderful note. (See Photos) \nThe rooms are beautifully furnished and every need was carefully considered. I needed to steam an evening jacket for a broadway performance and they had a steamer available in the closet. \nWhile the quality of the surroundings was top notch, it was the staff that made our stay so memorable. The morning we left, Naeemah and Deki  graciously found us an ideal breakfast spot near Central Park (our last stop before we flew home.)\nThe Pendry Manhattan West should not be missed.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fabulous hotel","lang":"en","publishedDate":"2023-04-17","publishedPlatform":"OTHER","rating":5,"text":"Top-shelf hotel, great staff, excellent location. The views from the upper floor rooms on the North side of the building are incredible. Zhou Zhous was very nice and so was bar Pendry. We look forward to trying other Pendry locations","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Wonderful first experience at Pendry","lang":"en","publishedDate":"2023-04-16","publishedPlatform":"OTHER","rating":5,"text":"I had an excellent, enjoyable stay at Pendry Manhattan West.  From the moment I entered the hotel, the service, front desk personnel, and other staff were very accommodating, helpful and informative. I hope to stay at the Pendry for future business opportunities, perhaps bringing my spouse in the future.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent hotel and location","lang":"en","publishedDate":"2023-04-16","publishedPlatform":"OTHER","rating":4,"text":"We chose the Pendry because we have stayed at the Pendry in Baltimore. We also wanted a hotel that was close to the train station and Hudson Yards. Excellent service provided by all staff members and the hotel is very comfortable.","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Can’t wait to come back","lang":"en","publishedDate":"2023-04-16","publishedPlatform":"MOBILE","rating":5,"text":"The rooms here are next level and luxurious, especially in comparison to many of the rooms at comparable hotels in NYC. Location, location, location is spot on! Couldn’t ask for a better location in NYC and so fun to walk around and explore. Easily will come back!","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing Stay!","lang":"en","publishedDate":"2023-04-06","publishedPlatform":"OTHER","rating":5,"text":"Great property, excellent location, friendly service! If you want to treat yourself to a special experience, look no further than the Pendry Manhattan West. My 16yo daughter and I planned a trip to NYC for her spring break. We loved being steps from Penn Station, The High Line, and Hudson Yards. We also  appreciated returning to our beautiful and quiet room after being out and about all day, The Pendry exemplifies modern luxury. The rooms were extremely comfortable and decorated with modern, simple and sylish charm. Service was perfect. They exceeded all expectations. We will definitely be back!","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great experience","lang":"en","publishedDate":"2023-04-06","publishedPlatform":"OTHER","rating":5,"text":"It is a beautiful hotel, and the rooms, amenities, and staff exceeded our expectations.  The staff was warm and accommodating, we used the fitness center and restaurant and all was excellent.  The location was perfect and we hope to get back soon.","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A Weekend of Luxury","lang":"en","publishedDate":"2023-04-03","publishedPlatform":"OTHER","rating":5,"text":"We felt pampered from the moment we set foot in the hotel. Excellent service, excellent amenities, excellent location. Highly recommend this hotel to anyone seeking a soul-cleansing vacation. The best trip we've had in a long time!","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"NYC weekend at Pendry","lang":"en","publishedDate":"2023-04-03","publishedPlatform":"OTHER","rating":5,"text":"Beautiful, clean, comfortable accommodations. Great convenient location. Staff was efficient and helpful. \nJohn at front desk and Kelly in sales went out of their way for our family. We will look forward to another weekend in the future. ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Highly recommend ","lang":"en","publishedDate":"2023-04-03","publishedPlatform":"OTHER","rating":5,"text":"Overall great stay at the Pendry. Clean, friendly staff, and in a great location. We enjoyed our stay and would go back. The only drawback is they do not have valet which was a bit of an inconvenience but everything else was great.  ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great location and high quality throughout","lang":"en","publishedDate":"2023-03-29","publishedPlatform":"OTHER","rating":5,"text":"We stayed here based on reviews and were not disappointed. The hotel itself was very well presented, and provided a comfortable base from which to do all our sightseeing. It is situated well in mid Manhattan, and provides good accessibility to the subway and the rest of Manhattan.   Juan in particular, from the concierge and bell team, was an absolute star and always provided service with a smile and was able to guides us around navigating this busy city, and always had answers to our questions. ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent!!!!!!!","lang":"en","publishedDate":"2023-03-27","publishedPlatform":"OTHER","rating":5,"text":"Amazing from the door to my room. Good job Pendry NYC. \nThe rooms are spacious and they are not outrgeous in price. It’s luxury feels and 5 star hotel hospitality. The staff was amazing. I would recommend them over and over. ","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23528665,"title":"Fantastic Stay","lang":"en","publishedDate":"2023-03-27","publishedPlatform":"OTHER","rating":5,"text":"First time staying at a Pendry and the cleanliness and comfort was over the top. The turndown service before bed made me feel even more welcomed. Bar was great, breakfast spot was pretty poor service but the food was good","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Wonderful Hotel","lang":"en","publishedDate":"2023-03-26","publishedPlatform":"OTHER","rating":5,"text":"Beautiful Hotel. Rooms and amenities are really great. Staff is wonderful! I will definitely be coming back. Location is great, close to lots of restaurants, shops and highline walking park. The hotel restaurant Zou Zou’s was wonderful too.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Friest Stay but not the last","lang":"en","publishedDate":"2023-03-26","publishedPlatform":"OTHER","rating":5,"text":"This hotel was very impressive, in all areas. Made you feel welcomed and looked after. I will, not only will return to this location, but will look out for all the locations when making a travel plans.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Comfort, Style and Service on the Westside","lang":"en","publishedDate":"2023-03-19","publishedPlatform":"OTHER","rating":5,"text":"Pendry Manhattan West is fantastic in every way. It is located in Hudson Yards, a new development in Manhattan's West Side, between the Chelsea and Hell's Kitchen neighborhoods. Lots of fantastic restaurants and shops are within easy walking distance.    Access to public transportation is a few blocks away, including Penn Station. The bell and front desk staff got to know us right away and we felt like we were coming and going from our home. We stayed in 2 room types; Deluxe City King and Corner Studio Suite. Due to the curve of the exterior walls, the Deluxe City King had a sitting area up against the floor to ceiling windows, which made the room larger than the average hotel room. The bathroom in the Suite included a soaking tub, double vanity with drawers, shower room w\/both a rain shower and hand held shower. The sitting area in the Suite was in the Corner of the room and was very spacious. The design style is clean, bright, warm and comfortable. Both rooms had plenty of drawers and closets. Toiletries are in refillable dispensers which reduces waste. Black Fox Coffee is right next door and offers fantastic coffee and a well chosen assortment of fresh baked pastries. We will definitely stay here again.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Gorgeous stay, super close to everything","lang":"en","publishedDate":"2023-03-19","publishedPlatform":"OTHER","rating":5,"text":"We had a super easy stay at the Pendry.  It was a convenient location from Penn Station, and a very easy walk to Hudson Yards and Javits for my convention.  It was on a quieter stretch and it was on a clean\/peaceful block.  It was $$$$$ but worth the stay.  ","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Natural Perfection","lang":"en","publishedDate":"2023-03-18","publishedPlatform":"OTHER","rating":5,"text":"Hotel walks the fine line of paying attention to you without everything feeling fussy.  Staff are friendly and authentic.  The hotel style blends cool influences from California, Japan and Scandinavia (at least to my eye).\nThis is my second time to stay in their hotels in a month and I absolutely love them.  ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing","lang":"en","publishedDate":"2023-03-18","publishedPlatform":"OTHER","rating":5,"text":"Pendry M.H was a great experience for me. The team is lead by a great leader. This hotel will be success for the future. Everyone understands there job and does it the best. I can't wait to take things I learned to Pendry d.c","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Very good Experience","lang":"en","publishedDate":"2023-03-14","publishedPlatform":"OTHER","rating":5,"text":"Great location with very friendly staff.  Thanks for Daniel and his team for making sure I am very comfortable stay.  They made sure, I got checked in, got the room that I needed, help me with my luggage and bags.  Made sure everything was OK.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"SPECTACULAR in every way","lang":"en","publishedDate":"2023-03-13","publishedPlatform":"OTHER","rating":5,"text":"From the time we checked in and were greeted with a welcome refreshing drink and a personal greeting by the manager, we felt at home. The room, the location, the food, and cocktails, couldn't have been more terrific (special shout out to Bar Pendry and Zou Zou's!). The service was so personal, without being obtrusive. The hotel staff knew us by name (we stayed five nights), and made sure to acknowledge us each time they saw us. \n\nIt was cold when we were in town, so when we'd go out to wait on our car service, the doormen would  come and offer to wait for us, so that we could stay warm in the lobby. It was these extra touches that sets Pendry Manhattan West apart from most other NYC hotels. It will definitely be our home-away-from home when visiting our daughter at college in NYC.  Thank you to the entire Pendry team for such a fantastic stay!! \n","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Luxury Stay That Didn't Disappoint","lang":"en","publishedDate":"2023-03-13","publishedPlatform":"OTHER","rating":5,"text":"From arrival to departure, the staff and the level of service we received was impeccable. I booked this hotel for my husband's birthday trip and we absolutely loved it. the accommodations were top notch and I can't say enough about the staff. They were all so warm and welcoming. Every aspect of this hotel did not disappoint. We will absolutely stay here again. And will be staying at more Pendry hotels as we travel. ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Elegant, Upscale, Quiet, and Well Located New Hotel","lang":"en","publishedDate":"2023-03-09","publishedPlatform":"OTHER","rating":5,"text":"This Hudson Yards area hotel was selected after reading about its facilities and the many 5 star reviews.  We were delighted by our stay will definitely return.  The room was well designed, spacious (for NYC), and quiet.  We heard little to no street noise.  It is located near all the activities in Hudson Yards, as well as having easy walking access to the subway.  When we needed an Uber to get somewhere, they were always only a few minutes away.  Every person at this hotel was friendly and welcoming.  We also enjoyed the bar there.  Next time, we will try one of their restaurants.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great stay for a business trip","lang":"en","publishedDate":"2023-03-06","publishedPlatform":"OTHER","rating":5,"text":"Loved my brief stay at Pendry Manhattan West. I was impressed that they honored my requests for foam pillows and a yoga mat without my having to ask on check-in. The digital baggage tag system at the front desk was an efficient way to store bags while I waited for my room to be ready. We had great cocktails at Bar Pendry (be sure to try their Spicy Margarita) and room service breakfast was a treat. Everyone I encountered was warm, hospitable and willing to go out of their way to help. Will be back!","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Special property for a special celebration","lang":"en","publishedDate":"2023-03-05","publishedPlatform":"OTHER","rating":5,"text":"One of the hotel's suites was a perfect treat for a family celebration.  The spacious floor plan, luxury amenities and hotel team's excellent hospitality made for an memorable visit.  The hotel even arranged for some family photos to be on the table in the room to make the celebration feel personal.  We will certainly return on trips to NYC.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"New favorite hotel in Manhattan","lang":"en","publishedDate":"2023-03-02","publishedPlatform":"OTHER","rating":5,"text":"Wish I could give this hotel more than 5 stars! The location is amazing and within walking distance of the best restaurants and shops. The hotel was so great we barely wanted to go explore anywhere else. The hotel bar and restaurant are outstanding. The rooms were luxurious and had so many great features I’ve never seen in any other hotels. The staff was friendly, accommodating and everyone went above and beyond to make our stay memorable. ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The only way to experience Manhattan at night","lang":"en","publishedDate":"2023-02-23","publishedPlatform":"MOBILE","rating":5,"text":"After staying here for an overnight layover, I'm convinced there's no other place to go to experience the glamor of Manhattan. I'll never stay anywhere else. \n\nFrom the detailed interiors to the professional warmth of the staff, Pendry Manhattan was a delight at every turn during our very short stay. We were on our way to a tropical resort the next day and still had to drag ourselves out of our beautiful suite. I will be back and hopefully soon. ","travelDate":"2023-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"I will be back!","lang":"en","publishedDate":"2023-02-13","publishedPlatform":"OTHER","rating":5,"text":"I must say I loved the Pendry! The room layout was so smart. Books in the room, great in-room bar, loved the shower. The restaurant has a great vibe, great food, it really complements the hotel. Hope to get back in the warmer weather and check out the roof!","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23528665,"title":"The place to be","lang":"en","publishedDate":"2023-02-12","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is one of those places you absolutely need to experience. They deliver  on service in such a way the Ritz, better watch out. The Pendry is in town and they are commanding attention, I am so glad I was there!","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Another wonderful stay...","lang":"en","publishedDate":"2023-02-09","publishedPlatform":"OTHER","rating":5,"text":"Walking through the front door of the lobby never gets old. It's beautiful and well kept. The rooms are all exquisite. Comfortable, handsome and well designed. Lovely amenities at the hotel. The location is close to a Whole Foods and a collection of high-end shopping. ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic boutique hotel","lang":"en","publishedDate":"2023-02-08","publishedPlatform":"OTHER","rating":5,"text":"We loved this hotel in Chelsea, conveniently located, friendly helpful staff and delicious food,. All requests were handled quickly with ease and all employees were well trained and versed in excellent customer service. ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Favorite place to stay in NYC","lang":"en","publishedDate":"2023-02-07","publishedPlatform":"OTHER","rating":5,"text":"Very impressed with the outstanding level of hospitality and service offered at the Pendry Manhattan West. It is a perfect hotel to revitalize after a busy day. The amenities and food are top-notch. It is my favorite place to stay in NYC!","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Special experience","lang":"en","publishedDate":"2023-02-07","publishedPlatform":"OTHER","rating":5,"text":"We treat ourselves to the Pendry when visiting the NY Now gift show. We say it’s convenient to the Javitz but it’s an excuse to be pampered there!  The rooms are beautiful, the beds so comfortable and the service impeccable. We always eat there too. The food in the bar is delicious so there’s no need to leave the property. ","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Night in the City","lang":"en","publishedDate":"2023-01-27","publishedPlatform":"OTHER","rating":5,"text":"Exceptional spot, great location ,able to enjoy the walk to shows, dining, shops and attractions. It even has an adjacent beautiful Ice Skating Rink. Classy in a non pretentious way and the effort by staff to create a comfortable stay is quickly noted. Staff professional and attentive. Highly recommend.","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Superb","lang":"en","publishedDate":"2023-01-23","publishedPlatform":"OTHER","rating":5,"text":"Great location, friendly staff and beautiful property. Highly recommend. Restaurants are both very good.  Location is great - near the highline and Hudson Yards. Looking at the Pendry in Chicago for our next trip. ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Thank you","lang":"en","publishedDate":"2023-01-19","publishedPlatform":"OTHER","rating":5,"text":"Wanted to thank you all. The only sleep complaint was there was some sort of construction going on above us that woke me up. That's the reason I didn't give you a perfect sleep score. All in all we all had an amazing time!","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Weekend NYC trip","lang":"en","publishedDate":"2023-01-18","publishedPlatform":"OTHER","rating":5,"text":"The Pendry Manhattan West was a great place to stay for us and our family.  We felt so comfortable and safe at the Pendry.  Great location, walking distance to so much and just a short cab ride to more.  I felt very close to everything but also enough away from the hustle and bustle of the big city.  We all slept peacefully, I’m generally sensitive to outside city noises, and was not bothered by any.  The staff was so helpful and friendly.  I highly recommend the Pendry.  We can’t wait to come back!   ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Close Comfort!","lang":"en","publishedDate":"2023-01-18","publishedPlatform":"OTHER","rating":5,"text":"If you are visiting the Javits Centre or Hudson Yards this is the place to stay. Very comfortable hotel with great\/new bedrooms and great staff. The rooms aren't massive but you get a big bed (very comfortable with high quality bedding) and a massive TV. The lighting is high end (Lutron) and you get a great mini bar and Nespresso machine (with capsules). Wifi is free and so is bottled house water. No bath in my room but large walk-in high powered shower. ","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great vacation","lang":"en","publishedDate":"2023-01-17","publishedPlatform":"OTHER","rating":5,"text":"The staff was excellent. They were very helpful. The rooms were spacious and clean. It was wonderful. I completely recommend this hotel to anyone who wants a easy and pleasurable experience in NYC. My children loved it as well. ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pendry Manhatten West","lang":"en","publishedDate":"2023-01-09","publishedPlatform":"OTHER","rating":5,"text":"Thank You Pendry for an amazing unforgettable weekend getaway, My girlfriend and I spent are first weekend away together and it was so magical, relaxing and special thanks to everyone at Pendry Manhatten West! We both lost our spouses a few years ago unfortunately, so this was some much needed Quality time together. Thank you again to everyone at Pendry for making us feel so welcome, comfortable and relaxed! We will be back and look foward towards experiencing other Pendry locations. ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Eat Like Your In The Mediterranean","lang":"en","publishedDate":"2023-01-07","publishedPlatform":"OTHER","rating":5,"text":"Located in the epicenter of Manhattan's West Side, encompassed by a jaw-smashing, surfs-up wave exterior, sits the West Coast inspired, Pendry Manhattan West.\n\nI relished in my Deluxe City King with floor to ceiling windows sporting a city view. A cozy sitting area butted up to a windowed alcove provided a homey ambience to the surroundings. The room was outfitted with swanky wood furniture and other accoutrements as well as a bevy of high-tech room appliances. The bathroom was marbleized with a walk-in shower.\n\nThe Pendry is a culinary oasis that boasts 4 unique food venues including the Zou Zou eatery, the Chez Zou lounge, the Bar Pendry and the Garden Room. The signature Zou Zou is a Eastern Mediterranean restaurant with a medley of food fare from Turkey, Israel, Jordan and other countries. I sucked down choice oysters, worked through a myriad of dips and flavors, savored smoked lamp chops and enjoyed the live fire Mediterranean cooking bonanza.\n\nPendry features a 24\/7, 1700 sq. ft. fitness center which amply took care of my exercise needs.\n\nSo, if you want to stay in Luxe surroundings steps from Hudson Yards and garnish outstanding fine dining..........................then try the.................Pendry Manhattan West..............................Eat Like Your In The Mediterranean.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"The  quietest hotel in New York","lang":"en","publishedDate":"2023-01-06","publishedPlatform":"MOBILE","rating":5,"text":"The Pendry was incredible. Wonderful staff that constantly went above and beyond. The doormen were particularly attentive. \n\nPeaceful lobby, and an incredible location. The rooms are the quietest that I’ve ever experienced in New York. No sounds  of traffic, sirens, garbage trucks. Silence. \n\nWe usually use the executive lounge where we stay, Pendry does not offer one, however the Garden room proved better. Quiet, empty and full service. A great place to hang out and relax. \n\nThe location is superb, between Hudson Yards and Pen Station. Next time I’ll splurge on larger rooms.","travelDate":"2023-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23528665,"title":"Amazing experience at the Pendry! Highly recommend ","lang":"en","publishedDate":"2023-01-04","publishedPlatform":"OTHER","rating":5,"text":"The Pendry hotel experience from check in to check out was absolutely seamless and a wonderful stay. We thoroughly enjoyed all of the little details, starting with Juan upon arrival - he was so kind, helpful and thoughtful. Every time we came back to the hotel he asked specific questions about our day or night before that he remembered us mentioning that we were doing. It really felt like \"home\" while we were there. The hotel is centrally located, clean, gorgeous rooms\/decor, comfortable bed, amazing sunset view from our room, well appointed with everything we needed. Room service was wonderful and Josh made sure we had everything we needed during our stay. Absolutely loved staying at the Pendry and can't wait to come back! ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing stay! Beautiful hotel!","lang":"en","publishedDate":"2023-01-03","publishedPlatform":"MOBILE","rating":4,"text":"Amazing hotel!!!!! Still has some room for improvement but it was amazing! The hotel and room are very nicely appointed, a nice amenity was set at our arrival as well. I enjoyed the bed very much, also the shower! The room was a bit smaller than what we had in mind but we liked it! There is not much space to unpack, the closet is tiny! The service was good, even though we sometimes felt like it is a self service kind of hotel, leaning more to business-like. For the price paid, I would encourage the service to be more present... But overall had an amazing four days, the location is exceptional!","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Understated luxury in the heart of Manhattan","lang":"en","publishedDate":"2023-01-02","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is truly an oasis in the middle of NYC – my wife and I had a short yet amazing stay there and from the moment of arrival and the way the staff greeted us, we were blown away as service was unlike anywhere else. More than luxury, the Pendry is truly a one of a kind hospitality experience – the staff is kind and gracious, making it feel like you're staying at a friend's beautiful place. The lobby feels extremely intimate, warm, and inviting, while the rooms and view of the city are absolutely stunning. Location is very close to Hudson Yards and connect to Manhattan West, which has plenty of retail and dining options, as well as a convenient Whole Foods. Overall, a great stay and look forward to visiting again soon!","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Stay here because there is NO better hotelin ALL of Manhattan! Plus it's close to everywhere you want to be. Guaranteed!","lang":"en","publishedDate":"2023-01-02","publishedPlatform":"OTHER","rating":5,"text":"\nWe stayed for New Years Eve and it was fabulous indeed! Got upgraded to an even more fabulous corner suite. Immaculate. Roomy. Luxurious. Whole hotel smells like it's brand new and looks it too. Great service from every facet. Wonderful turndown service and room service and fulfillment of needs  (ice, Champagne glasses, silverware, slippers  - fast and immaculate!!!) Probably never had better service anywhere. My kinda used experience. Will always stay here in future. Above par for hotel and I am truly a stickler to be honest.\n\nYou won't be sorry - believe me.\n\nThe only issue that stood out was valet garage was t working so no valet service currently.  Will probably be fixed soon in 2023. But they do direct toa gars erythromycin one that will valet overnight for around $45 per 24 hour period. It's safe and close. They do stress 24 hours exactly tho. If over that, you will be charged for a second day, so be aware.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best hotel experience ever","lang":"en","publishedDate":"2022-12-31","publishedPlatform":"OTHER","rating":5,"text":"Simply the best. We stayed for 2 days and wished it was for 10. Great hotel and excellent customer service. Every employee went out of their way to ensure we felt comfortable and pampered. Looking forward to the next stay!!","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Very Comfy and quiet hotel","lang":"en","publishedDate":"2022-12-29","publishedPlatform":"OTHER","rating":5,"text":"If you have the budget, this is the place to stay in Hudson yard area. The hotel is right next to the mall and the parking was close enough. I parked at the MPG at 30th street but it only took me 5 min to walk back to the hotel, faster if I cut through the wholefood The only down side is they do not offer valet parking. ","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"The Perfect Getaway","lang":"en","publishedDate":"2022-12-28","publishedPlatform":"OTHER","rating":5,"text":"Pendry Manhattan West is situated in the perfect location for the perfect Christmas weekend in NYC! Actually...any weekend at any time of the year! The staff at Pendry know exactly what to do to make all guests feel special.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"great holiday stay","lang":"en","publishedDate":"2022-12-23","publishedPlatform":"OTHER","rating":5,"text":"we stayed for a holiday vacation.  the location is fantastic and the hotel and staff were great. we were always able to catch an uber right outside the hotel and the hotel is so calming and warm.  the double beds are a little small, but comfortable.  a whole foods and foodcourt are steps away","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful hotel in a great location if you want to be a bit outside of the madness","lang":"en","publishedDate":"2022-12-21","publishedPlatform":"OTHER","rating":5,"text":"I visited for a business trip and had a wonderful stay.  The staff is very friendly and the decor warm and inviting.  I like the fact that this hotel is a bit outside of the chaos of Manhattan during the holidays and just a few blocks from  Hudson Yards and the very impressive Vessel.    \n   ","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23528665,"title":"100 out of 10!","lang":"en","publishedDate":"2022-12-11","publishedPlatform":"OTHER","rating":5,"text":"Excuisite. Gorgeous. Amazing. Refined.  We heard all the buzz, read the reviews, saw first hand at times from a distance but finally had the opportunity to stay.  No further words can describe how amazing our stay was.\n\nThe experience at the Pendry is unmatched.  ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The best rooms and location!!!","lang":"en","publishedDate":"2022-12-07","publishedPlatform":"OTHER","rating":5,"text":"Flight got delayed and had to stay an extra night in Manhattan. Decided to stay by Hudson Yards and The Pendry was an amazing choice! Excellent room and decor. Super beautiful bathroom and verrry comfortable bed and view out room was lovely! Will definitely stay again.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent Customer Service","lang":"en","publishedDate":"2022-12-02","publishedPlatform":"OTHER","rating":5,"text":"The Pendry staff made us feel very welcome through our stay and made everything very convenient for us. The customer service was outstanding. The rooms were very clean and comfortable. I felt very welcome and comfortable through out my stay. I will definitely be back! ","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Wonderful Experience","lang":"en","publishedDate":"2022-11-28","publishedPlatform":"OTHER","rating":5,"text":"This property is beautiful & the staff are fantastic!  Can't wait to come back. I can't say enough about how perfect our stay was.  We traveled from Australia and this was our first stop and a great intro to America. ","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The perfect mix","lang":"en","publishedDate":"2022-11-26","publishedPlatform":"OTHER","rating":5,"text":"Came to NY for business, but also stayed through the weekend to visit friends and enjoy the city.  Was able to book a suite to conduct my meetings which offered a living room w\/TV for presentations and a dining room which made for a great atmosphere but still allowed for overall privacy.  It never felt like you were in someones guest room, but more like someones house, but with all the service and amenities you would expect from a Montage or Pendry.  The hotel is perfect situated next  door to Moynihan Station, so you can arrive by LIRR and have direct access to ACE to get around the city.  Unless I am staying with friends, I wouldn't stay anywhere else.","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellence from Top to Bottom","lang":"en","publishedDate":"2022-11-25","publishedPlatform":"OTHER","rating":5,"text":"The title says it all. From the moment you pull up to the hotel, the flawless experience of your stay begins. The bell service is second to none and the staff is friendly. The rooms are well appointed and offer tons of amenities. I would stay here again any time I make a trip to NYC! ","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great West Side Hotel","lang":"en","publishedDate":"2022-11-24","publishedPlatform":"OTHER","rating":5,"text":"Great brand and quality that is consistent across locations. The building and hotel were new. The design and room layouts were really great for four of us to stay organized in a double room. Keep up the good work Pendry team. ","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great Weekend Getaway","lang":"en","publishedDate":"2022-11-21","publishedPlatform":"OTHER","rating":5,"text":"From the moment we entered the Pendry we were treated with kindness and respect. We checked in easily and were shown to our beautiful room. The hotel is located near Hudson Yard which was a very fun place to explore, dine and shop. We were able to walk to many bars ,shops, parks, also close to many metro stations and a few blocks from Penn Station and Madison Square Garden  We ordered room service. It came quickly and was delicious. The staff was incredibly helpful and nice with every interaction. Kenneth at the front desk was especially kind and professional. I would highly recommend this hotel to anyone traveling to NYC","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fabulous location and rooms, great service","lang":"en","publishedDate":"2022-11-20","publishedPlatform":"OTHER","rating":5,"text":"We stayed just one night at the Pendry and had a great experience.  What we loved about it is easy access to Penn Station and Madison Square Garden, Hudson Yards, Whole Foods and a close by subway stop which connects you throughout the city.  The room was well appointed, comfortable and quiet.  The staff at the front door and the checkin were friendly, efficient and helpful.  We will definitely return.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A Stay to Remember","lang":"en","publishedDate":"2022-11-18","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is one of the best hotels I have ever had the pleasure of visiting.  The rooms are spacious and immaculate.  The staff is exceedingly gracious, and the entire environ is spectacular.  Can't wait to visit again!","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Checked all the boxes","lang":"en","publishedDate":"2022-11-17","publishedPlatform":"OTHER","rating":5,"text":"Beautiful midsize hotel, exceptional staff, great location. Right across from the new Hudson Yards so there are lots of restaurants and shops within a very short walk. Zou Zou, The Pendry’s in-house restaurant was very good. Bar Pendry was fun and Black Fox Coffee, which was right outside the front entrance was very good! ","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Outstanding Experience","lang":"en","publishedDate":"2022-11-17","publishedPlatform":"OTHER","rating":5,"text":"We had a wonderful stay at the Pendry Manhattan West recently to celebrate my wife's birthday. I connected with the General Manager in advance to make special arrangements for my wife since our stay was a surprise for her. Shortly after checking in, we were delighted with the wine, cake, and chocolate which was brought to our room, all of which was excellent. Everyone at the hotel was kind, thoughtful, and quick to assist or answer questions. The room itself was terrific - spacious, well-appointed, exceptionally clean, and very quiet. We had heard many wonderful things about this property, and it definitely lived up to our expectations in every respect. We look forward to returning again the next time we are in town.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing!","lang":"en","publishedDate":"2022-11-15","publishedPlatform":"OTHER","rating":5,"text":"Incredible location, food at ZouZous was outstanding, drinks in Bar Pendry were perfect, from the moment we walked through the door until we left I felt unparalleled hospitality! So many associates addressed me by name, the genuine care I felt when talking to Daniel made me want to stay longer! I am already planning another weekend getaway! ","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Put the Pendry down as a must stay in Manhattan.","lang":"en","publishedDate":"2022-11-06","publishedPlatform":"MOBILE","rating":5,"text":"I had not been to Manhattan since May 2019.  News stories about crime and other issues had created some apprehension about visiting,\n\nThose stories could not be further from reality.\n\nThe Pendry is located at Manhattan West, which honestly, is probably the best area of the city now, among many great areas.\n\nThe hotel is a 10, the staff is amazing, from front desk to housekeeping.  Astoundingly good restaurant on the main level and excellent bar scene.\n\nThe fitness center is among the best I’ve ever experienced.\n\n(There is a little engineering issue with restaurant exhaust that needs to be worked out - minor irritant)\n\nPendry had to be a top option when seeking a luxury accommodation in an area with quick access to subways and other mean of getting around.  Brilliant.","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23528665,"title":"The Perfect Stay","lang":"en","publishedDate":"2022-11-01","publishedPlatform":"OTHER","rating":5,"text":"Every aspect of this hotel was the perfect blend of luxury, style, and coziness. The decor and design of the hotel are stunning, the room was beautiful, bed and linens were so comfortable... I could not have hoped for a better stay. We enjoyed in-room breakfast on our last day in NY, and Choephel delivered our food promptly, perfectly, and was such a joy to talk to. I would recommend this hotel to anyone --- You won't be disappointed!","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best stay in NY","lang":"en","publishedDate":"2022-10-31","publishedPlatform":"MOBILE","rating":5,"text":"Elegant hotel in a modern luxurious setting in Hudson Yards near a new upscale mall, the Highline and the Edge.  \n\nWe had 2 side by side rooms for our family of 5 adults. Staff were warm and friendly (Kenny deserves special mention!).  Loved his hotel!","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"WOW","lang":"en","publishedDate":"2022-10-26","publishedPlatform":"OTHER","rating":5,"text":"I will sing this hotels praises constantly! From the moment I stepped in it was a delight! All of the staff were absolutely wonderful and not to mention the most exquisite rooms and service. From the amazing bath products to the perfectly curated amenities this hotel deserves all 5 stars! ","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Gorgeous Understated Luxury In Manhattan","lang":"en","publishedDate":"2022-10-25","publishedPlatform":"OTHER","rating":5,"text":"This beautiful hotel in the new Manhattan West complex has a modern, residential style that says luxury but does it quietly. The staff is welcoming. Zou Zou's restaurant has a buzzy atmosphere with great food. Location - very close to Hudson Yards, the Highline and Penn Station - is great.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent escape - Felt welcomed and Pammpered","lang":"en","publishedDate":"2022-10-24","publishedPlatform":"OTHER","rating":5,"text":"Our experience at the Pendry Manhattan West was outstanding. From check in to check out we felt welcomed, special and pampered. Juan went out of his way to make our stay extra enjoyable. We highly recommend this property.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Terrible location for premium room","lang":"en","publishedDate":"2022-10-17","publishedPlatform":"OTHER","rating":3,"text":"Had a deluxe rm for our 24th anniversary. Rm was situated directly across from a housekeeping closet that was accessed more then frequently. This opening & closing of the loud solid core door kept us awake & even  startled as it sounded like someone was opening our own door.  ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing is an understatement","lang":"en","publishedDate":"2022-10-16","publishedPlatform":"OTHER","rating":5,"text":"Okay. So I have been in some amazing hotels. All over the world. Pendry Manhattan West is absolutely at the top. John was amazing. He let us know we had an upgrade available so our stay was extra wonderful! We stayed in the One Bedroom Skyline View. The guy in the coffee shop was also so nice! I loved how the team knew our names when walking around the property and even asked us about our Broadway show! How they can remember these details is beyond me. But Pendry is now my go to. Especially in Manhattan but opened my eyes to this hotel chain-so I can't wait to explore the other properties!!\nOh-and we walked from Penn Station it was so fast! It's so quaint and quiet in the middle of the city. There's a Whole Foods right there as well. The entire property was so clean. I can go on and on about my experience but my mother and I are both just so impressed with this hotel!","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Mid Centrury Elegance and Tranquility","lang":"en","publishedDate":"2022-10-13","publishedPlatform":"OTHER","rating":5,"text":"I work in TV and travel across the country. My company usually puts me up with our talent in the nicest hotels in each city. The Pendry is far and away one of my favorite hotels I've ever stayed in. It's calm design and mid century modern feel epitomize elegance and comfort. Always excited to stay in the Pendry.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Outstanding hotel","lang":"en","publishedDate":"2022-10-12","publishedPlatform":"OTHER","rating":5,"text":"Spacious, quiet, modern accommodations and an entire staff who truly care about their customers. Two blocks from Penn Station with several dining options within steps of the hotel in the Manhattan West and Hudson Yards area. There is a terrific fitness center in the hotel as well. I would definitely stay here again whenever in NYC. ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Good but Improvement on Some Basics Needed","lang":"en","publishedDate":"2022-10-11","publishedPlatform":"OTHER","rating":4,"text":"Stayed 3 nights in late September. Relatively new hotel with high end design located close to Hudson Yards and High Line. Really attentive and welcoming staff. Amenity\/Transition areas of the hotel are quite compact and seating around reception can get quite busy. Rooms are extremely well furnished and beds comfortable. Rooms have separate shower and toilet areas but the shower wasnt particularly hot. Our main gripe was most of the rooms are arranged around quite a tight lift core and despite being new the lifts appeared quite noisy and in need of a bit of maintnenace. Everytime somebody exited through the night you could hear the lift squeaking and dinging away which isnt particularly condusive to a good nights sleep. The hotel is located in an area of new office developments so the bars and restaurants always seemed quite busy and quite buzzy. We did however get refused entry to the 4th floor roof terrace one evening because of a drinks event. Its not particularly good when you seem to be prioritising non staying guests over staying ones particularly when you are charging circa £750 per night. All in all the hotel has potential but some of the basics informaing a good stay need addressing.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Best in the Business","lang":"en","publishedDate":"2022-10-01","publishedPlatform":"OTHER","rating":5,"text":"The Pendry was magical!  The staff makes you feel at home and the facility is comfortable and luxurious. They expected my arrival and were ready to receive me despite being early.  The room was spectacular, if not for the many entertainment venues in the hotel I might have not left my room.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Zen in New York","lang":"en","publishedDate":"2022-09-29","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is in a great location with quiet surroundings and close to the High line and the Hudson yards.  The staff are warm, kind and caring, we felt safe in the neighbourhood.  The rooms are spacious, great view, amazing comfortable beds, - we loved the experience and really appreciated the thought to make your stay more comfortable.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great experience","lang":"en","publishedDate":"2022-09-28","publishedPlatform":"OTHER","rating":5,"text":"Outstanding service by all staff members.  Bed was soooo comfy!  Convenient location for Hi Line, Hudson Yards, Vessel, train station.  The fitness center was well equipped and immaculate.  I would do it again.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Luxe and relaxing birthday weekend stay","lang":"en","publishedDate":"2022-09-27","publishedPlatform":"OTHER","rating":5,"text":"Such an incredible stay at Pendry Manhattan West! My boyfriend and I stayed there to celebrate his birthday and the team there made it such a special experience. The room was immaculate with beautiful views of the city. The bed was so comfortable and the room design and layout was welcoming and comfortable. The hotel was centrally located in Hudson Yards and was close to a ton of shopping and dining.\n\nThe staff at both the hotel and the restaurants in the hotel were so friendly and helpful (shoutout to David who helped us with our bags upon arrival.)\n\nHighly recommend considering this hotel for your next trip to NYC! ","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best Hotel in the new Epicenter of Manhattan: Midtown West","lang":"en","publishedDate":"2022-09-24","publishedPlatform":"OTHER","rating":5,"text":"Having lived in NYC years ago, arriving at the Pendry is like visiting a new city. To say nothing of the fact that you are steps from the coolest new restaurants and shops, within walking distance of Broadway, Madison Square Garden, and Rockefeller Center, when you step into the Pendry you are enveloped in an oasis of glamour and comfort that is simultaneously relaxing and invigorating. Best bed and bathroom in a luxury hotel by the way!","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"The best in NYC","lang":"en","publishedDate":"2022-09-23","publishedPlatform":"OTHER","rating":5,"text":"My new home in NYC! The staff and support were amazing. The restaurant and bar were great. If you want to feel like you are home the Pendry Manhattan is where you want to stay. I have been traveling to NY for 30 years. Now I have a home. ","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great stay","lang":"en","publishedDate":"2022-09-12","publishedPlatform":"OTHER","rating":5,"text":"Very nice hotel. Value was average. Ignored initially upon arrive for ~10 minutes, which was fine, we are patient. Brought up to our room by bellhop\/doorman. Employee knocked and entered room 3 seconds after the knock. Luckily we were dressed, but weird they just entered- we were on our way to answer the door. Hours of the bar and dining options are limited. In room dining was average- a few items were not available. All in all this is a great hotel, I just add in all the specific details with the hope they continue to improve and provide even more exceptional service to others!","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great Find near Penn Station","lang":"en","publishedDate":"2022-09-10","publishedPlatform":"OTHER","rating":5,"text":"Stayed at the Pendry for trip out for USOpen.  So happy with the choice.  Rooms were very comfortable and clean and above average size for NYC.  Everyone in the lobby, from check-in to bellman to everyone else just hanging around looking to be helpful were so friendly and cheerful.  And location next to Penn Station and far away from Time Square was just perfect.  Highly recommend.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Séjour agréable","lang":"fr","publishedDate":"2022-09-10","publishedPlatform":"OTHER","rating":5,"text":"cet hôtel est très bien placé, dans un quartier neuf et propre. Il y a pleins de restaurants et magasins autour, le métro est aussi tout près, quelques minutes à pieds. Les personnels d'hôtel sont sympas et serviables. Notre chambre était propre et spacieuse, aussi très calme. On a bien dormi. ","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Comfort, service in prime location","lang":"en","publishedDate":"2022-09-06","publishedPlatform":"OTHER","rating":5,"text":"We thoroughly enjoyed every aspect of this hotel. It is located close to dining, shopping at Hudson Yards, the Vessel, subway, the High Line and Hudson River. The rooms are very quiet, we had excellent service from all staff and the rooms are very well equipped with large TV, umbrella, steamer, nespresso machine, mini-bar, complimentary macaroons & water with turn down service. Welcomed by staff each & every time we walked in.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Pendry Manhattan West,","lang":"en","publishedDate":"2022-09-05","publishedPlatform":"OTHER","rating":5,"text":"It is almost impossible for a hotel to  score 5-STARS on all counts...but the Pendry Manhattan West absolutely does!  \n\nThe location is PERFECT.   If traveling from NJ via the Lincoln Tunnel, once you exit the tunnel, you are almost there.  This is especially great if you're not a fan of tedious Manhattan traffic before reaching your destination.  I'll be honest, back in the day, this area used to be a bit dodgy (sandwiched out between Hell's Kitchen and Chelsea), but it has now been redeveloped into a Swanky, Safe and Clean little pocket of Midtown Manhattan Heaven! Hudson Yards is just a block away with fabulous sites, shopping, restaurants and beauty salons.  \n\nThe Staff is PERFECT.  So welcoming, kind,  helpful, resourceful, respectful and discreet.  No judge zone here, and everyone goes the extra mile to make sure your stay is as comfortable as it can possibly be.  I will not begin naming everyone who I had the pleasure of meeting, as this will take up at least 500 more characters on this page - but you know who you are :)) !!  Thank you for making my 2 stays here so incredibly perfect!\n\nWhat else.  The Amenities are just FABULOUS.  From the Restaurant to the Bar with the kindest Waitstaff, to the beautiful Fitness Center with magnificent High Line and NYC views.  \n\nAnd then the Rooms.  OMG, the views are ridiculous, the beds are oh-so comfortable (not too hard, not too soft, just right), the bathrooms gorgeous with fabulous designer toiletries out of pump bottles, rather than the annoying little throw aways in the shower (because you can't get anything out of them).  At night during turn down, there are delicious little macarons nestled on your pillowcase, and there is always tons of really good bottled water, so you don't have to dip into the mini bar. \n\nLast but probably 'a quite important' for many .... AMAZING lighting and mirrors.  This does so much for your esteem to know as long as you wake up, stay, and go to bed here, you will look glowing, refreshed and a tad more slender than your usual.  Haha!  Big smile.  You can also change the lighting to daytime, evening, etc.in the bathrooms, and this is great for makeup application for those who wear make up.  They really nailed it with this one.  \n\nLove, love, love the Pendry Manhattan West and everyone who works there!  I can't wait to return!  <3","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Business networking trip","lang":"en","publishedDate":"2022-09-03","publishedPlatform":"OTHER","rating":5,"text":"Location near everything and everything to come. Young opera star bartending. Incredibly welcoming and accommodating staff everywhere. Guestrooms are great size with all needs met including books that are hard not to pick up and skim through. Great NYC turndown music, too.","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"An incredibly hotel stay!","lang":"en","publishedDate":"2022-09-02","publishedPlatform":"OTHER","rating":5,"text":"We love Pendry hotels, this is the third one we have stayed at in recent years, they were all excellent but this particular hotel, its location, decor, amenities and guest services made it our favorite hotel stay period. Staying here is true luxury, but at the same time it has a very \"homey\" and relaxed feel to it. Its location is terrific, easy access to what Manhattan has to offer but away from the busiest parts of town. Yes, its pricey, but in return they offer an outstanding environment.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Quick trip","lang":"en","publishedDate":"2022-09-02","publishedPlatform":"OTHER","rating":5,"text":"A 24 hour trip was made seamless by every human working at Pendry MW during my stay. I really liked the location. The food was great and the hotel is beautiful, perfectly in New York style. Anxious to return.","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Understated luxury","lang":"en","publishedDate":"2022-08-31","publishedPlatform":"OTHER","rating":5,"text":"Located right in the heart of Hudson Yards, walking distance to shopping, many dining options, and if you are a Pelaton member the studio is right there so book a class in advance!  If interested in sight seeing, The Edge is only a block away.  The Pendry is centrally located to it all. The Scandinavian designed rooms are elevated with lux for maximum comfort, no detail spared. Courteous staff, trendy bar and restaurant on site. I would definitely recommend and certainly visit again.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great New Spot","lang":"en","publishedDate":"2022-08-29","publishedPlatform":"OTHER","rating":4,"text":"Clean and Appears new.  Staff is wonderful and location is perfect for Madison Square events.  Misael was exceptionally welcoming and helpful.  Pricey but very comfortable and quiet. Highline stars here and worth the walk! The Vessel was close but closed for security reasons.  Edge Bar (triangle on the top of 40 Hudson Yard Wes fun, but lines were long and cost $100 for 2.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"My new favorite NY hotel","lang":"en","publishedDate":"2022-08-27","publishedPlatform":"MOBILE","rating":5,"text":"Pendry Manhattan West is my new favorite hotel in NY!  You absolutely nailed the understated luxury and California cool.  The room design is beautiful and functional, the views and location near Hudson Yards are perfection.  The staff exudes genuine personalized hospitality—Juan the bellhop greeted me by name with bottled water every time I left or returned and the Brooklyn chocolate bar amenity made my day.  I also appreciate the price point for Pendry brand.  My sister works for Four Seasons resorts so we usually stay in their properties, but I have no desire to pay thousands per night for a room in NY when I’m out in the city!  We plan to stay at Pendry in Park City next!","travelDate":"2022-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing property","lang":"en","publishedDate":"2022-08-25","publishedPlatform":"OTHER","rating":5,"text":"Awesome property in a great location. Boutique high end style. Very nice rooms very comfortable, wood mill work and trim throughout the property were very nice and well done. Definitely recommend this one!","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best hotel in NYC","lang":"en","publishedDate":"2022-08-24","publishedPlatform":"OTHER","rating":5,"text":"This is the best hotel in NYC. The service quality, the building and amenities, cleanliness, EVERYTHING. The dinner at Zou Zou was incredible...everything we ordered was the best version of the food I've ever had. We can't stop talking about it!","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best of NYC!","lang":"en","publishedDate":"2022-08-23","publishedPlatform":"MOBILE","rating":5,"text":"One of the best hotel experiences in the city thanks to the staff. I’ve never experienced a hotel where everyone seemed to go above and beyond. It’s a beautiful hotel and a great location but we will be returning because of the exemplary staff!","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great hotel and service!","lang":"en","publishedDate":"2022-08-23","publishedPlatform":"MOBILE","rating":5,"text":"The service level at this hotel is amazing and everyone we met was so helpful and kind!  Ms. Menawi went above and beyond to make sure our stay was the very best. Sasha, Juan and the rest of the staff make sure you always have exactly what you need when you need it. \nMy wife has a dog allergy and with the help of Ms. Menawi and housekeeping they made sure the room was perfect for our stay and we had no issues. \nAs for the location we enjoyed the plaza directly behind the hotel with the restaurants and Whole Foods for anything we needed. The high line and Hudson yards are just a few blocks away so we took advantage of that being so close. \nThank you for the wonderful stay and we look forward to seeing you next time.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Manhattan West comes alive!!","lang":"en","publishedDate":"2022-08-17","publishedPlatform":"OTHER","rating":5,"text":"A wonderful stay on every point!  I stayed at the Pendry, Manhattan West just a few days shy of it's first anniversary.  The hotel is well done, guest rooms are well thought out and nicely accessorized.  The bath was perfect - no complaints.  ZouZou was hopping with a fun crowd and the food was yummy.  Stay here whenever you are in the neighborhood.","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"A really good place to stay","lang":"en","publishedDate":"2022-08-15","publishedPlatform":"OTHER","rating":5,"text":"A excellent new property, eager to please staff and interesting position in a rapidly developing location. The precinct is being developed and will eventually link up with the High Line. Lots of good places to eat in the general area and within walking distance.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Highly recommend","lang":"en","publishedDate":"2022-08-15","publishedPlatform":"OTHER","rating":5,"text":"Everything about the Pendry elevated my trip. They listened, they cared, and they did any little thing they could to improve every moment of my stay with them. Highly recommend the Pendry for any New York trip - they did not disappoint for even a second! ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beat hotel in NYC","lang":"en","publishedDate":"2022-08-13","publishedPlatform":"OTHER","rating":5,"text":"This is an amazing property in the perfect location with the compliment of an amazing staff who are articulate in the art of making you feel at home. This hotel is in the perfect proximity of all of the local attractions and there is an abundance of great food locally. ","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing Stay","lang":"en","publishedDate":"2022-08-11","publishedPlatform":"OTHER","rating":5,"text":"I stayed at Pendry MW and I had a very good time! I was surprised for the service and the daily amenities that I found in my room. The architecture design as well the decor are really off the chart! Jhon from FD did it caring for detailed service, Sasha, the door man, was on top!\nThere´s no doubt I'll book my next visit in NYC in this beautiful property, see you next time!","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Loved our stay here","lang":"en","publishedDate":"2022-08-09","publishedPlatform":"OTHER","rating":5,"text":"Room was so nice and the staff was very welcoming. Happy to recommend this hotel to anyone. We really enjoyed our stay. The location was perfect. Right next to Hudson Yard. Short walk to Chelsea market and a Wholefoods next door. ","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Treat yo'self!","lang":"en","publishedDate":"2022-08-08","publishedPlatform":"MOBILE","rating":5,"text":"We live in Ditmas Park, Brooklyn but our home was undergoing some work. The first stay was purely unexpected and we needed a place where I felt comfortable, last minute. On a gut feeling I booked The Pendry and the rest, as they say, is history!\nIt's become our second home. \nEverything is top of the line and I freaking love it.\nIt's on the pricey side, but you feel it in every single thing. The location.  The room layout,  the comfortable bed, the staff, the cleanliness, the professionalism wrapped in friendly warmth. Room service. The attentiveness.\nThe yummy refreshing specialty drink in the lobby for your taking (I'll admit, I may have helped myself to it a bit, but eh it's my home away from home). The herb fires!\nThe hubs and I were extremely WELL cared for. \nI love this place.\nI'm pretty sure they'll be seeing me soon a couple more times before the year is out.\nWell done Pendry Manhattan West.\nDon't EVER change!","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great Hotel and Customer Service.","lang":"en","publishedDate":"2022-08-02","publishedPlatform":"OTHER","rating":5,"text":"If you have never stayed at a Pendry hotel it is a must you do so. Not only is the decor beautiful, but the customer service is outstanding. The bell service, doorman and front desk agents show that they truly care about their guests. I would definitely book again. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Highly recommended","lang":"en","publishedDate":"2022-08-02","publishedPlatform":"OTHER","rating":5,"text":"Pendry fits all of your NYC needs. Shopping mall one block, Vessel one block away, Restaurants one block away. Since street is one-way it is easier to read your Uber\/Lyft plate. Clean room and warm welcoming. Truly a elegant experience. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"EXCEPTIONAL EXPERIENCE","lang":"en","publishedDate":"2022-08-01","publishedPlatform":"MOBILE","rating":5,"text":"What an excellent stay!\n\nNew property a block away from Hudson Yards.\nGreat location, close to Penn Station and Madison Square Garden. Within walking distance to The Highline Park , The Edge and Vessel.\n\nThe rooms are large, very comfortable and tastefully decorated with natural wood decor and cozy sitting area. Panoramic windows with beautiful views.\nMarble bathroom including a large walk-in shower.\nOne-Bedroom Suites with option to adjoin to a deluxe room, perfect for parents with kids.\n\n1700 sq Fitness Center, well equipped. \nThere's a wonderful fireplace with cozy sitting area in the lobby.\n\nThe entire staff was incredibly friendly and helpful. The front desk provides excellent advise for sightseeing .\n\nThe Pendry is a haven of peace in the hustle and bustle. Thank you for thist  WONDERFUL EXCELLENT stay!!","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Classy and Sophisticated","lang":"en","publishedDate":"2022-07-29","publishedPlatform":"OTHER","rating":5,"text":"This ultramodern luxury facility at the heart of Manhattan is conveniently located next to many of the tourist attractions. We loved the prompt service,  warmth and kindness from  the associates. Would definitely recommend this property to anyone hoping to have a lovely stay in New York!","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Lovely Soothing Hotel - Customized stay, with attention to detail","lang":"en","publishedDate":"2022-07-28","publishedPlatform":"OTHER","rating":5,"text":"The experience was extremely welcoming from the walking in the door to the access to amenities and restaurants. The room was perfectly clean and staff was responsive for requests. The hotel ambiance was relaxing and soothing with ease of stay. Highly recommend.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"GREAT LOCATION, TRE ELEGANTE'","lang":"en","publishedDate":"2022-07-27","publishedPlatform":"OTHER","rating":5,"text":"Great staff, elegant decor. Beautiful rooms, great responsive housekeeping. Love the small bar. 5 minute walk to Penn station is a big plus. Basically in the center of the universe. Easy travel anywhere in the city. ","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"What a lovely, peaceful place.","lang":"en","publishedDate":"2022-07-26","publishedPlatform":"OTHER","rating":5,"text":"The Pendry's expensive, but the experience is worth it.  Attentive staff, comfortable, sleek rooms and a great location near the High Line.  If you're looking for a cool, peaceful retreat after a day in the city, treat yourself to a stay at the Pendry.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing Hotel","lang":"en","publishedDate":"2022-07-26","publishedPlatform":"OTHER","rating":5,"text":"One of the best hotels my wife and I have stayed in NY.  Clean, Amazing Customer Service, Great Restaurants, and amazing location. I will be coming back with the entire family end of August.  Cant wait.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Your new Manhattan West Destination Hotel","lang":"en","publishedDate":"2022-07-25","publishedPlatform":"OTHER","rating":5,"text":"From the moment I stepped o to the property I was greeted with a smile and anything they could do to help me.my room was beautiful. The bathroom is full size and the bedding was beautiful. My room had floor to ceiling windows that looked out to a great court yard. We went down to the outdoor bar before dinner and it did not disappoint!  I can not wait to come back to the Pendry. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fabulous Stay","lang":"en","publishedDate":"2022-07-23","publishedPlatform":"MOBILE","rating":5,"text":"If you love Japanese-themed environments and hospitality, you will love this hotel.  The service was beyond reproach.   The rooms - both our own and the common areas - were stunning.  Restaurants inside the hotel offered spectacular food, again with outstanding service.  The first three photos below show the bar area that doubles as the breakfast area. The next three show the view from the outdoor bar.  Hotel is located in a new, hip neighborhood called Manhattan West (very close to Hudson Yards).  Couldn’t be happier with this hotel!","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best in NYC","lang":"en","publishedDate":"2022-07-21","publishedPlatform":"MOBILE","rating":5,"text":"Everything about our stay was perfect. The front office staff was unbelievably kind and accommodating to make sure we had everything we needed for our stay. 10\/10 the Pendry is a must visit when staying in the city.","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Number 1 for good reason","lang":"en","publishedDate":"2022-07-21","publishedPlatform":"MOBILE","rating":5,"text":"Wonderful experience!  From making our reservations to pre arrival communication to our stay and after, the Pendry was amazing.  Anna Lisa and her team could not have been more accommodating.  In a time when many hotels are struggling w staffing, the Pendry seems to have all the right people in all the right places.\nStylish and clean, every detail has been thought of.  Wonderful location w transportation nearby making it easy to see and do everything we had planned.\nSeveral options for food and drinks as well as 24 hour room service which our group took advantage of and did not disappoint.  In the city that never sleeps, we slept well each of our 4 night stay; comfy and quiet.\nMany thanks to the team for a wonderful and memorable stay; it’s no wonder you are number 1 in all of Manhattan.  Well deserved!","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Wonderful stay in West Manhattan","lang":"en","publishedDate":"2022-07-19","publishedPlatform":"OTHER","rating":5,"text":"We had a great couples stay in this beautiful hotel with amazing and engaging warm staff.   Great hospitality and beautiful views.  Great bars for a nightcap. Highly recommend. Nice restaurants on property and great access to high line and Hudson yards.  Excellent staff.  Thank you for a great stay. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful property and great staff at the Pendry","lang":"en","publishedDate":"2022-07-18","publishedPlatform":"OTHER","rating":5,"text":"Our family stayed at the Pendry while visiting NYC.  Convenient to Penn station and nearby many restaurants and shopping.  Our family especially enjoyed the staff at the hotel, where they made us feel at home and made our stay personable.  We will definitely be staying here again.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Awesome new hotel in Hudson Yards area!","lang":"en","publishedDate":"2022-07-18","publishedPlatform":"MOBILE","rating":5,"text":"The Pendry is by far one of the nicest hotels we’ve ever stayed at. We stayed over July 4th weekend and I can’t think of any other place where we felt so welcome and cared for than at the Pendry. The suite we stayed in had a lot of space including a full dining table which was great for room service and delivery orders. The decor is very modern with high end amenities. We definitely took it all in while wearing the complimentary robes! The hotel is also a short walk from Hudson Yards and the Highline which made it even more convenient for a family like ours with 2 grade school age kids. Also highly recommend eating at Zouzou in the hotel. Thanks to the staff here for making our stay so pleasurable and relaxing. Five stars all the way!!","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great Overall Experience","lang":"en","publishedDate":"2022-07-18","publishedPlatform":"OTHER","rating":5,"text":"Great stay. The staff, service, cleanliness, in-room dining, restaurants and cocktail lounges all excellent. Next time I’m back in NYC I will be returning to The Pendry and will look for other Pendry’s in other cities. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best staycation","lang":"en","publishedDate":"2022-07-17","publishedPlatform":"OTHER","rating":5,"text":"4th of July weekend…Celebrated with a staycation for both our daughters birthdays.\nFrom beginning to end the attention to detail and the above and beyond hospitality was definitely noticed and appreciated by all of us. \nWe were touched from the cake and stuffed animals to the tiny luxurious bathrobes.\nSo family friendly yet feeling super glamorous at the same time. This was by far the nicest hotel\/room we’ve ever stayed in. \nEven our birthday meal at ZouZous was unforgettable with every bite being more delicious than the last. \nI can’t recommend the Pendry Manhattan West more with their superb staff extremely convenient location and just a wonderful memorable experience the whole weekend. We can’t wait to go back!! Thank you Pendry!","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent stay!","lang":"en","publishedDate":"2022-07-13","publishedPlatform":"OTHER","rating":5,"text":"Staff's attention to delivering outstanding service couldn't be beat. Swift and friendly check-in experience, and can't say enough great things about the beautiful rooms. Luxe, comfortable, and every finish detail was thought through thoroughly. Bell staff was always there to open the door when coming and going, and always offered a friendly greeting with a smile. As a bonus, the location is perfect right near Hudson Yards which resulted in us opting to use the High Line to walk everywhere!","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"NYC WEEKEND LUXE EXPERIENCE","lang":"en","publishedDate":"2022-07-11","publishedPlatform":"MOBILE","rating":5,"text":"I was in town to see “Dear Evan Handsen” on Broadway.  I had an amazing experience at the hotel.  Juan the doorman, the front desk and housekeepers were all so attentive and kind to me, my husband and our dog.   The view on our room was spectacular and the location is bar none for me as I work in the Loreal building often. I highly recommend the Pendry and Ricky Grunden who helped us make this weekend very special! ⭐️⭐️⭐️⭐️⭐️","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic stay with great service!","lang":"en","publishedDate":"2022-07-09","publishedPlatform":"MOBILE","rating":5,"text":"This was my first time staying at Pendry Manhattan West and I loved every part of it. John checked us in was very helpful and made us feel very welcome. We then headed to bar Pendry and we were taken care of by Gina the bartender. Gina made us some delicious cocktails and we had a chance to get to know her a bit since we were the only ones at the bar at that time. She was very pleasant and kept us entertained while also giving us some great tips for where to go in the city. Also a big shout to Mccord and his in room dining team! They were very prompt and professional with every order and the food was delicious. Violet checked us out and held our bags for a couple hours while we toured the city a little more before we had to catch our train which was made everything effortless. Now while the building is beautiful, and I can't wait for the rooftop bar to open up so i can visit again, the thing that will actually keep me coming back is the friendly service from the whole staff! ","travelDate":"2022-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful Respite to be Savored","lang":"en","publishedDate":"2022-06-29","publishedPlatform":"OTHER","rating":5,"text":"Research trip for business and also the opportunity enjoy the wonderful art exhibitions. \n\nThe Pendry Manhattan West has created a quiet oasis with light-filled rooms, ease of location just a short walk from the new Moynihan Train Hall, and yummy food options s that beyond the typical fare. \n\n","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fabulous Stay in Hudson Yards","lang":"en","publishedDate":"2022-06-28","publishedPlatform":"OTHER","rating":5,"text":"Pendry Manhattan West will greet you style and treat you like family ! \nFabulous location, staff and wonderful bar & eatery.  Late night drinks at Bar Pendry was wonderful. Pre-dinner get together with friends at Chez Zous outdoor space delightful.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful Property, Amazing Service!","lang":"en","publishedDate":"2022-06-27","publishedPlatform":"OTHER","rating":5,"text":"As a former NY, I am quite picky about where I spend my time and have to say that I was blown away by the location of this property. The restaurant and bars within the hotel are top notch, and anything else you need is right outside your door - amazing shopping, more great food, beautiful spaces to relax and walk.\n\nThe rooms are so smartly appointed, clean, and comfortable. They did not miss a beat in the design.\n\nMost importantly, the team is AMAZING. I was recognized and welcomed back every time I returned. The Front Desk and Bell teams were so warm and welcoming. Our server at the Gold Bar was the perfect balance of attentive and engaging without being obtrusive.\n\nI cannot recommend this hotel enough. It checks every box - great food and cocktails, great location, and most importantly great people!","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Awesome","lang":"en","publishedDate":"2022-06-25","publishedPlatform":"OTHER","rating":5,"text":"Great location,  friendly staff , great restaurant and bars. I recommend  Pendry hotel's  super clean. Staff very helpful with directions to attractions.\n\nSuper recomendado este hotel,  muy limpio, gran comida y empleados ambled, cerca a las atrscciones turisticas.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Elegant and Warm","lang":"en","publishedDate":"2022-06-24","publishedPlatform":"OTHER","rating":5,"text":"The staff is genuinely warm and interested in how your stay is going, and the hotel is beautifully appointed. It is elegant but extremely comfortable. Rooms are generously sized by New York standards and the multiple restaurants and bars are all of superb quality. ","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Spectacular Experience","lang":"en","publishedDate":"2022-06-23","publishedPlatform":"OTHER","rating":5,"text":"My wife and I spent the weekend at Pendry Manhattan West and could not have been happier with our time there. The Restaurants were amazing, in room dining made us not want to leave our room, and the cocktails we had throughout our stay were perfect. From the front office team to the crew in in room dining, there was not an experience anything less than perfect. The room was super comfortable and the bed super plush. We cannot wait to go back!","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The hotel service staff is very patient and attentive","lang":"en","publishedDate":"2022-06-21","publishedPlatform":"OTHER","rating":5,"text":"It was a very good experience, the hotel's customer service staff was very welcoming and on call, the hotel room was also very nice, very bright and comfortable, if out of 100 points, I would probably give a high score of 97 or more.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Lovely hotel, perfect location!","lang":"en","publishedDate":"2022-06-21","publishedPlatform":"OTHER","rating":5,"text":"We enjoyed our stay! 10\/10 would recommend. The hotel is in the perfect location to easily access anything in Manhattan. We love sailing with Classic Harbor Line and Pendry Manhattan West is an easy walk to their location at Chelsea Piers. We were traveling with our 7mo old and the hotel went above and beyond to accommodate us. Don't miss the Vista Lounge - you won't be disappointed with the ambiance, food or drinks. We loved it!  ","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"The Pendry Is Home","lang":"en","publishedDate":"2022-06-15","publishedPlatform":"OTHER","rating":5,"text":"I traveled to Manhattan to see Billy Joel at MSG. I booked a 5 night stay at the Pendry Manhattan West for myself and a friend. There was not one moment when I didn't feel like I was at home. As we dashed in and out, Sasha and the doorman\/valet crew not only welcomed us as if they missed seeing our faces, but actually looked out for our safety. We were always offered water, assistance in acquiring transportation, an open door, and a friendly \"Welcome Home\"or \"Enjoy your day\"! The Hotel itself is hip and trendy but not pretentious. The Outdoor lounge on the fourth floor was beautiful for an early Summer Night. Our room was impeccable with a tremendous view from West 33rd. The Pendry Manhattan West (and other locations) will always be my home for future travels.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing hotel and impeccable service","lang":"en","publishedDate":"2022-06-14","publishedPlatform":"OTHER","rating":5,"text":"My family just stayed at the Pendry and I have to say, it was amazing. The hotel is beautiful everywhere, the rooms and bathrooms were fantastic, the location two blocks from Penn Station allowed us to train in from Newark and train out to Long Island. And as nice as all that is, the staff was even better. Everyone was so polite and helpful, opening doors, offering water when we came in, mailing a card for us when we forgot to bring a stamp, helping with restaurant and transportation recommendations. It was like a throwback to old times when people took pride in providing the best service possible. Simply superior.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great new addition to NYC!","lang":"en","publishedDate":"2022-06-14","publishedPlatform":"OTHER","rating":5,"text":"The Pendry Manhattan is a great hotel in Hudson yards. Customer service goes above and beyond most hotels we have visited. The bars and restaurants - all 5 stars! Rooms were very comfortable and overall we had an amazing weekend stay.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Incredible hotel and staff","lang":"en","publishedDate":"2022-06-13","publishedPlatform":"OTHER","rating":5,"text":"The inroom dining was wonderful and the kind people on the phone we’re so helpful. - Choephel and Katar went above and beyond and very professional. We loved our stay at the Pendry. It is an Excellent  hotel and the views are incredible. The entire hotel and staff are an oasis in the big apple.  Thank you to the entire Pendry staff for being so marvelous.","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Not worth the squeeze","lang":"en","publishedDate":"2022-06-13","publishedPlatform":"OTHER","rating":3,"text":"I travel frequently for business and typically choose a hotel from the Amex program of Fine Hotels. When the Penury was available as an option I was excited to try it out. It was an adequate stay, but I will not go out of my way to stay at this property again.  Room service food was below average.  The lighting in the room is very moody, but not conducive to working or applying make-up. I was placed in room on the 11th floor, but there was a band playing in the courtyard below until well after midnight that made getting to bed\/sleep at an early hour nearly impossible.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Don’t believe the hype","lang":"en","publishedDate":"2022-06-11","publishedPlatform":"MOBILE","rating":3,"text":"Wanted to love the hotel, but it’s various cons outweighed it’s pros and it’s really just not a 5 star experience. \n\nPros- Beautiful design and modern architecture in a serene setting in both common areas and rooms. Great common areas behind the hotel. Location is also great to access Hudson Yards. 4th floor bar terrace is beautiful and Zou- Zou is great. \n\nCons- lobby smells like a bbq restaurant at all times from the Zou Zou wood burning oven. 4th floor is frequently unavailable because of “private” events - without notice. Bar Pendry staff was less than accommodating 15 minutes before their stated closing time on a Friday night. Hotel fronts the tunnel entrance so traffic gets snarled there at times and getting a ride share\/cab or being dropped off can be really problemtic. \n\nWanted to love the experience given the reviews and accolades, but came away very, very underwhelmed. Not a good value for the price and they could use a bit more hospitality training to focus on client service and a 5 star experience. Had several borderline rude encounters with various staff (Bar Pendry) and 4th floor restaurant workers (the patio servers were great) that shocked us as guests of the hotel. \n\nWith other true 5 star options in the city and the glaring negatives, we will not be back.","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fabulous liftoff every morning from  Pendry Manhattan West- HIGHLY RECOMMEND","lang":"en","publishedDate":"2022-06-11","publishedPlatform":"OTHER","rating":5,"text":"We took a trip with grandmom, parents and grandsons and stayed at Pendry Manhattan West.  It is a BEAUTIFUL brand new  property with gorgeous views.  The rooms were spacious, crisp and comfortable.  The location is great! \nEverything from the Valets to the Front Desk Registration plus maid service to indoor eating and room service was F A B U L O U S.\nI ended up sick in the room a bit and everyone checked on me offering Tea and etc. \nLovely people jumping to help and brighten our day....\nSome standouts Choephel, Katar, and Bronson. \nThank you for making our stay a great memory!","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Good looking property, friendly staff, new, but…","lang":"en","publishedDate":"2022-06-11","publishedPlatform":"OTHER","rating":4,"text":"great looking property, brand new, very friendly staff. however No one ever answered the phone. if i called “guest services”. “housekeeping” or dialed “0”.  i tried all of the buttons multiple times and let it ring for 5-10 minutes.  i tried every phone in the room.  so everytime i needed something i had to go down 19 floors to the front desk and request something. pretty ridiculous for staying in a $3k a night suite at supposedly a 5 star hotel. ","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing stay","lang":"en","publishedDate":"2022-06-10","publishedPlatform":"OTHER","rating":5,"text":"we stayed a week and it was wonderful. great location, amazing staff and beautiful interiors. this is my go to hotel when in NY. I can’t wait to try all other properties in the US. The only minor issue I had was the in room coffee maker was not good. They should bring Nespresso!","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great stay","lang":"en","publishedDate":"2022-06-05","publishedPlatform":"OTHER","rating":5,"text":"Love the hotel, room was beautiful and the service was great!!!!!!And the restaurant was delicious!!!!!. And cannot beat the location!!!!! Would recommend for business or pleasure trips. Either would be great ","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pit stop before heading on to Europe","lang":"en","publishedDate":"2022-06-04","publishedPlatform":"MOBILE","rating":5,"text":"Pendry Manhattan West was by far the most superior hotel stay I have ever had. I travel a lot for work and pleasure and have had the privilege of staying in many very high end hotels and resorts over the years.Pendry by far supersedes all other past hotel stays for me. The attention to every little detail and the atmosphere was so exquisite and very well thought out. Bar Pendry and Zou Zou’s are such stunning spaces, the drinks and food are beyond fantastic. The amazing customer service begins curbside upon arrival and you are truly made to feel like you’re  family by everyone working there. Misael was the absolute best, he was so engaged and welcoming and right there for your every need at any time!","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Perfection","lang":"en","publishedDate":"2022-06-03","publishedPlatform":"OTHER","rating":5,"text":"A true stunner! Pendry is a wonderful oasis in busy NYC. Prepare to be blown away by the beautiful and thoughtful design and welcoming staff. Loved the location-easy access to transportation. Intend to make the Pendry our preferred NYC hotel. There are a lot of high end choices in this price range in the city- but none that you feel as welcomed and comfortable at. A true pleasure, thank you!","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Exceptional","lang":"en","publishedDate":"2022-06-01","publishedPlatform":"OTHER","rating":5,"text":"Lovely experience, overall A+ service. The front desk staff members were pleasant and helpful. The doormen were attentive from carrying luggage to hailing a cab. The rooms were slightly smaller than the Pendry Baltimore location, but other than that - everything was exceptional.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"5 Star NYC Experience","lang":"en","publishedDate":"2022-06-01","publishedPlatform":"OTHER","rating":5,"text":"The quality at the The Pendry was second to none!  I highly recommend the hotel for family and friends.    Everything from the warm & welcoming staff to the soft linens and robes made my family's trip to the city feel even more special. Thank you again!","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A beautiful hotel in an amazing area","lang":"en","publishedDate":"2022-05-30","publishedPlatform":"OTHER","rating":5,"text":"The Pendry Manhattan west is a beautiful and tastefully decorated hotel with great service.  It's located in Manhattan West, which is an entire city block developed with the hotel, restaurants and a Whole Foods Super Market.  There are high end restaurants, a food court and plenty of space to walk or sit.  Hudson Yards is right across the street and the High Line is quite near as well.  I highly recommend this hotel and the area!","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Perfect boutique 5-star hotel for business or leisure stay","lang":"en","publishedDate":"2022-05-22","publishedPlatform":"OTHER","rating":5,"text":"Great midtown location especially if your company’s office is right next door.  Soundproof rooms, great bed, premium bed linens, doorman always there to open the door for you.  Great open space right next to it with Wholefoods and restaurants, even a racquet court and stage for performances.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pendry NY","lang":"en","publishedDate":"2022-05-22","publishedPlatform":"OTHER","rating":5,"text":"First time staying at  Pendry MW. It is truly world class   The staff was freiendly, accomodating and go above and beyond. Attention to detail was incredible. Everywhere you looked whether in your room or common areas it was immaculate. ","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A Personal Touch, Even In Manhattan","lang":"en","publishedDate":"2022-05-17","publishedPlatform":"OTHER","rating":5,"text":"Greenwich village resident here, looking for a staycation on our wedding weekend. As far as boutique hotels go, the Pendry should be the international standard. Unreal service, where the personalties of the staff shine through in every interaction—you will have your New York moment every time. We are beyond grateful, humbled by the design and style, and walked out feeling this place just redefined luxury for all of us.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A great hotel in a great location","lang":"en","publishedDate":"2022-05-08","publishedPlatform":"MOBILE","rating":5,"text":"Hard to improve on the previous reviews but here goes. From the minute you arrive you are greeted by warm and friendly staff. Everyone tries to do their best to ensure that you are made feel welcome. Check in is quick and seamless. Your luggage is taken to your room and the staff member explains everything. Special mention for the mini-bar. It’s a mini-bar. It’s expensive and if you take out an item for more than 30 seconds you are charged for it. If you think it’s excessive or unusual, read up on hotel mini-bars. Lighting is complicated. Might be worth a quick run through by staff when you get to your room. The showers are not the best. They are very hard to turn on and unless you use force when you turn it off, it will drip continuously. A lot of these points are guest experience for the hotel to improve on. The room and view were great. Overall experience was excellent. Did I mention the wonderful door staff? Can’t wait to go back again.","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best new hotel in Manhattan","lang":"en","publishedDate":"2022-05-08","publishedPlatform":"OTHER","rating":5,"text":"My wife and I stayed one night to attend the ballet. The Pendry exceed our expectations, even at that price point. The front of house staff is as good as it gets, especially Sasha, the door man. Great food and drinks, and the room was spectacular. Highly recommend this new, desperately needed midtown gem.","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Top Notch","lang":"en","publishedDate":"2022-04-26","publishedPlatform":"OTHER","rating":5,"text":"I stayed at Pendry Manhattan West for an overnight stay in NYC and the whole experience was impeccable from start to end. Attention to detail is noticeable in every aspect of this hotel. The staff is warm and accommodating, the rooms are spacious and extremely clean, the design is stunning and the central location is perfect. The food at Zou Zous was delicious and refreshingly unique. I will be back and highly recommend the Pendry for your NYC stay.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The Beds Ruined Our Trip","lang":"en","publishedDate":"2022-04-22","publishedPlatform":"OTHER","rating":3,"text":"We went here with a large group of family members. The problem with this property is form over function. The staff were all so wonderful and so helpful and really went above and beyond. It's the room itself that's the problem.\n\nFirst of all please be very cautious because what looks like a refrigerator isn't really a refrigerator. Most of us know about the mini bar in hotels. This is different. If you take anything off of the shelf in the fridge and keep it out for over 60 Seconds you get charged for it. I think cokes were $9 Plus a 20% restocking fee. Waters with Pendry branding were either $12  or $14 plus the 20% fee. Repackaged drugstore candy like MnM's and sour gummies in plain little tins that hold maybe a handful of candy cost $18 between the cost of the item and the restocking fee.\n\nDo not put anything in this refrigerator. If you do you can throw off the sensors and end up charged. You have to contact housekeeping if you want a fridge in your room. \n\nI still have no idea how to get ice there, absent calling downstairs for it. I think they'd bring you a baby elephant if you asked. Maybe the Lost Ark, even. The service is \n great. \n\nThere is just no comfortable place in the room unless you like extremely soft beds. They are ok to sit on for a bit. That's it for me at least. I like\/need reasonably firm beds. I woke up every day in increasingly intense pain and with an ever-increasing sleep deficit that made me so fatigued I didn't have the energy to do anything while I was in New York. In fact I woke up so often during the night I'm not sure I ever got any deep sleep. The last night at about 5 in the morning with tears running down my face involuntarily, I pulled the velcroed-on cushion from a little bench in the room and tried to lay on the floor, but that wouldn't work either as it was too small. I think they have soldered the comforter to the mattress somehow so I couldn't lay on that on the floor either. \n\nThere is a little bench that's kind of built into the wall and looks like something you find in one of those tiny homes. There was only 1 chair, in front of the floor-to-ceiling windows that make up the whole outer wall. It is small, orange, and turns in a full circle. Neither the bench nor the chair are comfortable for sitting. \n\nThis was the most uncomfortable I have ever been in my entire life. It was worse than middle school. It kind of ruined my trip.\n\nThat being said, if you like extremely soft beds you may be okay. ","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Well appointed with luxury amenities and service.","lang":"en","publishedDate":"2022-04-19","publishedPlatform":"MOBILE","rating":5,"text":"Beautifully appointed with luxury amenities and service.  Proximity to Hudson Yard with lots of dining\/shopping options.  \n\nService was top notch.  Hotel Manager Daniel was gracious and personally recognized us.  I forgot an item in the room and when I called a few hours later they had  retrieved it and stored it safely until my return visit in 2 weeks.\n\nHighly recommended for your visit to NYC.","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent","lang":"en","publishedDate":"2022-04-16","publishedPlatform":"OTHER","rating":5,"text":"Great stay! The service and attention to detail was outstanding. Enjoyed the personal service from before I arrived until leaving for the airport. Really appreciated that once you step in the hotel, the hustle and bustle of the city falls away. I was surprised at how quiet it was in the hotel and in the rooms. ","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Awesome getaway","lang":"en","publishedDate":"2022-04-15","publishedPlatform":"OTHER","rating":5,"text":"Great location and the most amazing staff around.  They made my trip not only successful but worth it.  The view from my room of the Empire State Bulging was priceless and very sentimental since it was the first time I was back in the city since my partner passed away a year ago today. The Pendry is a property that offers the best of NYC and a one spot where all your needs are fullfilled!","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic Hotel","lang":"en","publishedDate":"2022-04-14","publishedPlatform":"OTHER","rating":5,"text":"I booked Pendry Manhattan West for my girlfriend's birthday in March. When we arrived the staff acknowledged her birthday and sent us cake and champagne. It was such a special treat. We love Zou Zou's and highly recommend. The staff, location and guest rooms are fantastic. We are going back for a wedding in June and can't wait to visit this hotel again. Best hotel in NYC.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Perfect!","lang":"en","publishedDate":"2022-04-14","publishedPlatform":"OTHER","rating":5,"text":"Loved our stay at the Pendry!  Every employee was welcoming and very accommodating but we'd like to recognize Misael and Sasha and thank them for their exceptional service, they really made our stay special with their friendly greetings and always made sure we were well taken care of. The location was perfect, there is a huge selection of restaurants steps away as well as an incredible Whole Foods.  Our room was large with a very comfortable bed and the shower had the best water pressure ever.  \n Highly recommend this excellent hotel.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Spectacular hotel with incredible service!","lang":"en","publishedDate":"2022-04-11","publishedPlatform":"MOBILE","rating":5,"text":"One of the most beautiful & impeccably clean hotels we’ve ever stayed in! The service was incredible and all the extra touches were truly appreciated…from the welcome fruit basket at check in, to the warm cookies & champagne on our last night…we didn’t want to leave! Everyone was so helpful and welcoming throughout our stay. Yes, it’s a pricier hotel, but worth every cent! Great location with Whole Foods across the street and close to the new shops & restaurants at Hudson Yards. Hope to return to this amazing hotel again soon!","travelDate":"2022-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Perfection and calm, quiet luxury","lang":"en","publishedDate":"2022-04-10","publishedPlatform":"OTHER","rating":5,"text":"Could not have loved this hotel more. The room was beautiful, fabulous bed and shower and view. Shockingly quiet for being in the middle of a ton of wonderful attractions and restaurants. The hospitality is second to none and the staff was incredibly attentive to every detail. The bar has an excellent vibe and the cocktails were perfection. We will absolutely be back!","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Always the best experience","lang":"en","publishedDate":"2022-04-07","publishedPlatform":"OTHER","rating":5,"text":"The hospitality of the staff at the Pendry is second to none, and the hotel rooms are relatively huge for Manhattan and brand new. I don’t have a single complaint for what was an excellent stay at a gorgeous hotel. 5\/5 would return again.","travelDate":"2022-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic service!","lang":"en","publishedDate":"2022-04-06","publishedPlatform":"OTHER","rating":5,"text":"We had a fantastic staycation at the Pendry last week, including wonderful in-room dining service from Choephel. He brought us the best breakfast. Thanks Pendry Manhattan West team (especially McCord Henry!!) for a relaxing, fun stay.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Incredible Stay","lang":"en","publishedDate":"2022-04-05","publishedPlatform":"OTHER","rating":5,"text":"My wife and I stayed at the hotel a couple weeks ago and were honestly blown away by the experience. The staff was attentive and thoughtful. The room felt luxurious and warm. The food was inspired and delicious. What's wonderful is how the hotel feels both cosmopolitan and urban while being intimate and luxuriously domestic. Not an easy thing to pull off. We'll be back!","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing","lang":"en","publishedDate":"2022-04-05","publishedPlatform":"OTHER","rating":5,"text":"The staff was super welcoming, the room was amazing, the bed was so comfortable, I usually have trouble falling asleep but not in that bed, I fell asleep almost instantly.  Housekeeping was great, kept the room tidy all the time. ","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful hotel but the highlight was the staff","lang":"en","publishedDate":"2022-04-03","publishedPlatform":"OTHER","rating":5,"text":"My wife and I had a wonderful experience at this new hotel.  First, the building itself is very finely constructed and decorated - sophisticated but not overdone.  The room was very comfortable and spacious with a nice seating area looking out over the plaza below.  The beds were super comfortable, the bath fixtures deluxe.  The Bar Pendry is very cozy with a cool vibe - a more modern version of a Palm Springs speak easy.  The food at Zou Zou was outstanding and pleasantly different.  But the highlight of the stay was the staff - everyone we interacted with was exceptionally helpful and made us feel right at home.  Several went out of their way to help us with a challenge we had.  This is clearly a well run hotel.  We will be back.  ","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The hotel gem in Manhattan","lang":"en","publishedDate":"2022-04-01","publishedPlatform":"MOBILE","rating":5,"text":"We had an amazing experience at Pendry Manhattan West. It was truly an experience from being greeted warmly throughout our stay, consistent help from the staff and receiving their suggestions regarding the best places for shopping, eating and enjoying the attractions. IRD’s menu was filled with many options (including late night). Choephel was great as we chatted about our families and received his suggestions on NYC attractions.\n\nWe look forward to returning.","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best new hotel in Manhattan","lang":"en","publishedDate":"2022-03-29","publishedPlatform":"MOBILE","rating":5,"text":"Absolutely loved the hotel.  Great location.  5 min walk to Penn station and can’t wait to to stay there again.  Love boutique hotels.  Rooms are a perfect size and has two sinks!  Bed and bedding were so comfortable and toiletries were so good that we are going to purchase.","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Very satisfied","lang":"en","publishedDate":"2022-03-28","publishedPlatform":"OTHER","rating":5,"text":"When we booked our suite, we had high expectations from all the reviews we had read.  The Pendry did not disappoint! \n\nThe suite was spotlessly clean.  One member of our group had allergies and we were concerned about Pendry allowing pets.  They assured us, that the cleaning is extremely thorough and that they would take extra care for us and that, they did.  Our guest with allergies had absolutely no issues.\n\nEveryone we met in the lobby, at the front desk, room service was very hospitable.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Wonderful Family Stay","lang":"en","publishedDate":"2022-03-20","publishedPlatform":"OTHER","rating":5,"text":"The staff at The Pendry made my family vacation special. They are knew all of our names and were always a step ahead of us. They made our boys feel like the most important people at the hotel.  I can’t wait to visit all the Pendry hotels!","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A perfect place for a perfect location!","lang":"en","publishedDate":"2022-03-20","publishedPlatform":"OTHER","rating":5,"text":"This is a very special place, where you feel at home. Outstanding service in the hotel (Front desk, doormen, concierge). Centrally located, a few minutes away from the Highline, Hudson Yards and Madison Square Garden.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Subtle Luxury, Pampered Experience.","lang":"en","publishedDate":"2022-03-19","publishedPlatform":"OTHER","rating":5,"text":"The interior design drew us to the Pendry, but it was the service that truly made the stay. From the moment we walked through the door, we felt welcomed by the Pendry Manhattan West's warm wood accents, beautiful textures, and subtle luxury. That feeling of welcome continued with Violet at the front desk and their entire team. We enjoyed a room overlooking the plaza and were quite impressed with the fit and finish throughout. Breakfast at the Vista Lounge exceeded our expectations, and Vista Lounge now holds the title for my favorite pancakes thus far! Don't sleep on those. We also loved the intimate vibes in Bar Pendry both evenings. They've made fans of us, and we'll be back for sure.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Highly Recommend","lang":"en","publishedDate":"2022-03-15","publishedPlatform":"OTHER","rating":5,"text":"I highly recommend this hotel. I had an excellent stay. I felt very welcomed. Housekeeping was excellent. Front desk was amazing, made great recommendations on where to visit. Views from the room were amazing. I have stayed at a lot of hotels and was extremely impressed. Location was quite convenient. Pretty walkable to everywhere but not too busy like times square hotels. Also Penn station was close by which was really convenient. ","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":2,"locationId":23528665,"title":"Perfect getaway in New York","lang":"en","publishedDate":"2022-03-14","publishedPlatform":"MOBILE","rating":5,"text":"Pendry Manhattan West is a brand new hotel ideally located, one block away from Penn Stqtion and from Hudson Yards.\nFirst thing you notice is the impressive wavy glass  facade. And once inside you can’t help but appreciate the beautiful materials used everywhere with a balanced mix of wood and stone.\nThe hotel has brought a Californian vibe to Manhattan and it works perfectly.\nIt feels like the rushing vibe of Manhattan completely stops once inside to convey a peaceful atmosphere.\nI loved the standalone bath \nHad a drink at the Pendry Bar, look for it, it’s hidden behind a door on your way to Zou Zou’s the hotel restaurant !\nStaff is super friendly \nAnd if you come later this spring you will be lucky to experience the rooftop bar and it’s amazing view\nWould strongly recommend!","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Recent Stay at Pendry Manhattan West","lang":"en","publishedDate":"2022-03-13","publishedPlatform":"OTHER","rating":5,"text":"Such an escape from your typical NYC hotel experience. The design, the lighting, the service level, accommodations and F&B outlets all come together to create an impeccable place to stay. 10\/10 recommend!","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Very Clean Hotel with Beautiful Decor and Friendly Staff","lang":"en","publishedDate":"2022-03-09","publishedPlatform":"OTHER","rating":5,"text":"The woodwork in the rooms and hallways of the hotel is exceptional! I had to mention this because the attention to details at the Pendry Manhattan West was shown from their customer service to the building's craftsmanship. ","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Girl's Weekend","lang":"en","publishedDate":"2022-03-07","publishedPlatform":"OTHER","rating":5,"text":"My friends and I had a getaway weekend in the city and chose Pendry for its location and great reviews. This hotel is STUNNING! The rooms are such a great size for NYC, and the in-room dining experiences we had were top-notch. The staff is so welcoming and the lobby has such a great cozy vibe to come back to. We also enjoyed the restaurant in the lobby as well as the bar. It's also across the street from Penn Station - very easy to hop on the train from Philly\/Baltimore\/DC. Hope to come back in the summer!","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Incredible Stay","lang":"en","publishedDate":"2022-03-07","publishedPlatform":"OTHER","rating":5,"text":"One of the most amazing hotel stays I've ever experienced. Every detail of the room and the staff was designed to optimize our stay and make it a memorable experience. Food was excellent at the restaurant and for in-room dining. Highly recommend the speak-easy style bar for a late night drink.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Weekend Visit","lang":"en","publishedDate":"2022-03-02","publishedPlatform":"OTHER","rating":5,"text":"When we visited this hotel last November 2021; it was very newly opened. We were greeted with a very friendly staff. Only the Garden Lounge was open where they served wonderful breakfast along with friendly staff. Definitely worth a second visit.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Really lovely new hotel in Manhattan","lang":"en","publishedDate":"2022-02-28","publishedPlatform":"OTHER","rating":5,"text":"I stayed recently and this location cannot be beat - right next to the vessel, the Shed and the entrance to the highline. The staff across the board were warm, welcoming, accommodating. Really top notch service. We loved our room, the alcove where we snuggled up and had some great conversations and that plenty of water was provided during our stay. Zou Zou's was delicious and a beautiful spot for a meal. We loved the decor and everything about our stay!!","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Stunning New Property","lang":"en","publishedDate":"2022-02-27","publishedPlatform":"OTHER","rating":5,"text":"What joy to have an exceptional hotel near or practically right next to Madison Square Garden. For years the area has been sorely lacking in both hotel properties and restaurants, and this newcomer ads a double win.\nIt seems every detail has been paid attention to, the custom wood surfaces, the linens, fabrics, carpets, furniture, and the exterior of the building is stunning - almost hidden on the street, and then you walk into an OASIS like feeling in the lobby. Zou Zou's on the first floor is a delicious eastern Mediterranean restaurant and is as wonderful to look at as it is to eat at.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Simply the best!","lang":"en","publishedDate":"2022-02-26","publishedPlatform":"OTHER","rating":5,"text":"My wife and I came in the city to celebrate her birthday.  At arrival we were welcomed by a bottle of champagne and cupcakes from Magnolia with welcome note. The interior is very modern and high-quality. Room is very clean and quiet, and has the most comfortable bed I ever slept in. It was great to soak in the bathtub while peeping out manhattan traffic. Bar on the ground has exceptional vibe and offers great cocktail list.  The staffs are fantastic and service is excellent from the moment we arrived. We cannot wait to come back for another special night. Thank you Pendry team for such an incredible accommodation.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"NYE","lang":"en","publishedDate":"2022-02-25","publishedPlatform":"OTHER","rating":5,"text":"I stayed at the Pendry West Manhattan in February, my time was pleasant. The location is great, the team is amazing and service present.\nIRD food was very delicious, well presented and was serve very fast. \nAnnalisa at the front desk was extremely helpful in making sure I had everything during my stay. \nI will be back for sure.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent Stay","lang":"en","publishedDate":"2022-02-21","publishedPlatform":"OTHER","rating":5,"text":"Our stay with Pendry Manhattan this weekend was top notch from start to finish. The accommodations were immaculate and welcoming, and the overall decor of the hotel is stunning. We took full advantage of the in room dining options, and can’t speak highly enough of our server Choephel. The staff was warm and knowledgeable and we look forward to visiting again! ","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"CEO, Organic Spa Magazine","lang":"en","publishedDate":"2022-02-20","publishedPlatform":"OTHER","rating":5,"text":"Excellent experience all around. Great service, cheerful and friendly staff, the rooms are meticulous with a sublime esthetic and decor, and excellent onsite fitness and restaurant options. The Pendry exudes the new modernist approach to hospitality.","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23528665,"title":"Shines Bright Like a Diamond","lang":"en","publishedDate":"2022-02-14","publishedPlatform":"OTHER","rating":5,"text":"My husband and I came in town for a very brief one night stay to see a show at Carnegie Hall.  I suffer with OCD and after a prior NYC visit where we stayed at another hotel I had to ensure we stayed at an extremely clean and quiet hotel.  \n\nSince it was just one night we opted for the “regular” king room.  It was far from regular.  The size of the room was perfect.  The layout was perfect.  Anything that you could possibly want\/need was available in the room or hotel.  We were welcomed with open arms as soon as we exited the car with staff members that work extremely hard, simple valet parking, smooth check-in, a hand written note, fresh fruit, sparkling water, bottled water, beautiful surroundings, amazing turn down service and more!  Early check-in & higher room preference was noted but due to traffic we arrived around 4pm and the 18th floor room was ready.\n\nDue to expected snow we planned to checkout early the next morning, however our minds were telling us to get up and our bodies were saying let’s enjoy just a little longer.  I had the best sleep ever in a hotel and I am so very grateful.  \n\nHudson Yards is an easy block away.  Theater District was approximately 20 blocks away, but Uber worked well for our needs.  We hope to have an excuse to return sooner rather than later for a longer stay, when it is warmer and we can walk around the area until our hearts are content.  The area has a lot to offer.  First visit at any Pendry hotel but it won’t be our last.  Thank you Pendry staff, particularly the evening team (I don’t want to forget anyone’s name).","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Memorable Stay","lang":"en","publishedDate":"2022-02-14","publishedPlatform":"MOBILE","rating":5,"text":"Everyone from the valet to the front desk to the wait staff made our stay truly pleasant and enjoyable. My wife and I felt as if we were the only guests staying in the hotel from the care and professionalism by everyone at Pendry. We cannot wait to take another weekend getaway and unquestionably we will be staying here again. Thank you to the entire team there at Pendry!","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best in NYC","lang":"en","publishedDate":"2022-02-10","publishedPlatform":"MOBILE","rating":5,"text":"I stayed at the Pendry West Manhattan twice during the months of January and February and each time was absolutely thrilled with my experience. \n\nThe location is great and the rooms were clean and spacious but what separates the Pendry from other hotels is the amazing staff and service they present to you. \n\nJuan, who greeted us when we arrived, graciously brought us drinks while we checked in and brought our bags up to our room. \n\nMcCord, Rotimi, and Katar provided us excellent food and beverage service (which was delicious). \n\nAnnalisa and Deki at the front desk were extremely helpful in making sure we had everything we needed to enjoy our stay!\n\nJoli Specia in HR is also a rockstar, along with the rest of the staff who’s names we didn’t get. \n\nAll in all it was a great experience and we will be returning soon!","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Dedicated to a Great Guest Experience","lang":"en","publishedDate":"2022-02-09","publishedPlatform":"OTHER","rating":5,"text":"This was my first stay at the Pendry.  The first impression I had was with the doorman who was unbelievable welcoming and personable.  Then the front desk folks continued on with the same tone.  During my stay, I interacted with bar staff, restaurant staff, and even a maintenance tech.  Every interaction was the same.  These people are very service-oriented and go out of their way to make sure you are having a great stay.\n\nOn top of this, the hotel is gorgeous.  Extremely clean and modern.  Everything felt like it was new.  They have a super modern and clean fitness room as well.  The food at the restaurants was almost as good as the service.\n\nOverall GREAT experience and will definitely go back.","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Glowing Perfection","lang":"en","publishedDate":"2022-02-05","publishedPlatform":"MOBILE","rating":5,"text":"A truly breathtaking bar with impeccable service. Thank you for such a lovely escape.❤️\n\nThe drinks were delicious, the fire a comfort, the water glasses refilled frequently.  Cannot wait to return to stay at the Penney soon. What a jewel box in midtown.","travelDate":"2022-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Definitely going back!","lang":"en","publishedDate":"2022-02-01","publishedPlatform":"OTHER","rating":5,"text":"It was a memorable experience from the moment I stepped in the hotel to when I checked out. Everyone I met was amazing! Shout out to Juan at the front desk. He was thoughtful, friendly and exceptional. I will never forget how he made me feel. The hotel is new and in a great location. What made it really exceptional for me was the warmth of the staff","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"My new favorite NYC hotel!","lang":"en","publishedDate":"2022-02-01","publishedPlatform":"MOBILE","rating":5,"text":"10\/10 would recommend the Pendry Hotel! The hotel was beautiful and the staff were very friendly and attentive. It’s in close walking distance to several restaurants and is just a short walk away from MSG\/ Penn Station. We can’t wait to stay here again.","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Can’t wait to be back","lang":"en","publishedDate":"2022-01-30","publishedPlatform":"MOBILE","rating":5,"text":"Californian Approved!\nI just checked out of the Pendry Manhattan West after a wonderful one night stay with my sister to celebrate her birthday! I was warmly greeted by Violet and Juan after a rough commute to the hotel in the snow storm. It was an instant defrost both mentally and physically from being in such a beautiful lobby. The fireplace, calming color scheme, and friendly people all just makes you feel at peace. We were upgraded to a beautiful corner room on a high floor facing south. Beautifully designed rooms with the most comfortable sheets, plush towels, and robes we were determined to never take off. A very friendly Bronson came to the room shortly after I arrived to deliver a celebratory amenity on behalf of the entire hotel to wish my sister a Happy birthday. As we were rushing to make our dinner off property, the house car conveniently was available to drive us which was such a great surprise because we were dreading the walk through the snow. To top off our experience we enjoyed a beautiful breakfast in room which was delivered by Katar who clearly loves what he does. The food was excellent! Their Brioche French Toast is sooooo good. While checking out of the hotel, we also saw a celebrity so that was pretty cool. From a Californian living in the hustle and bustle of New York City, this staycation really reminded me of the calmness of home while still delivering top notch service from the staff. It’s a very laid back aesthetic yet intricate details. Hard to explain, you will have to visit to understand. I highly recommend!!","travelDate":"2022-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Peaceful oasis in Manhattan","lang":"en","publishedDate":"2022-01-27","publishedPlatform":"MOBILE","rating":5,"text":"Stayed here twice in the past month, and both experiences were outstanding.  The feeling of warmth and hospitality from the staff is really amazing.  Tensin, Victoria, John, …. all were great.  The rooms and common spaces have been crafted with incredible attention to design and detail — perfect without trying too hard.","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Crown Jewel of NYC","lang":"en","publishedDate":"2022-01-25","publishedPlatform":"OTHER","rating":5,"text":"Stayed at The Pendry for a business trip, and was very impressed with the room, the service, and the location. Everything was top notch - and Zous Zous is the perfect restaurant to host a meeting.\n\nWould highly recommend!","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful Hotel with Superb Service","lang":"en","publishedDate":"2022-01-25","publishedPlatform":"OTHER","rating":5,"text":"My husband and I stayed at the Pendry recently for a night in the city and we could not be happier with our experience.  The hotel is contemporary and luxurious, while still feeling warm and cozy.   The architecture and design is really beautiful; I loved all the amazing wood work.  The service was top notch.  We ordered breakfast to our room and it was delivered with a bright smile by a very genial server named Bronson. The breakfast sandwich was delicious and the bagel spread was classic NYC.  The presentation was lovely and it was even accompanied with a little handwritten quote!  Such a nice touch.  Unfortunately, we weren't able to make it to the restaurant this time, but the space was very cool.  If the room service is any indication, then I am sure the food is amazing.  We are definitely going to return to the Pendry next time we are in town.","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Relaxing Night at the Pendry","lang":"en","publishedDate":"2022-01-20","publishedPlatform":"MOBILE","rating":5,"text":"I stayed at the Pendry last weekend for a girls night and had the most amazing time. You feel the luxury and attentiveness the minute you walk in. What I loved the most was the view of the ice skating rink and city from the 12th floor. I also enjoyed the bar and the restaurant. I am already planning my next stay!","travelDate":"2022-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Super fun Girls Night Out!","lang":"en","publishedDate":"2022-01-20","publishedPlatform":"OTHER","rating":5,"text":"My girlfriends and I had a staycation and had an amazing experience. Although it was only for one night, we were blown away by the service, the decor, and overall aesthetic. We had drinks at the bar and had dinner at Zou Zou! Everything there was delicious and I would definitely return for a romantic evening with my husband.  The room was gorgeous, unbelievable view and super clean. The big screen TV and mini bar were definite plusses!","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"A wonderfully memorable stay","lang":"en","publishedDate":"2022-01-17","publishedPlatform":"MOBILE","rating":5,"text":"My fiancée and I were celebrating my birthday with a night in the city. Although it was only one night, we were incredibly impressed by the accommodations, food, and the overall customer experience. The staff was incredibly courteous and welcoming. A house car was provided, free of charge, so we could avoid taxis\/Uber. The overall esthetic was incredibly warm, swanky, and sharp. \n\nI would like to make special mention of one particularly lovely moment. We had room service delivered by a gentleman named Rotimi. Rotimi and I had a brief but pleasant exchange where I shared it was my birthday, we were going to see a show, and that my fiancée is pregnant. He was incredibly warm and kind and shared some words of celebration and congratulations. \n\nLater that evening, when we returned from the show, we found that Rotimi had arranged a little gift be sent to our room. If that wasn’t special enough, he had left a handwritten note with well wishes for us in this exciting chapter of our lives. \n\nI wish there was more that I could do to show my genuine appreciation and gratitude to Ro. It was a simple gesture that had an amazing impact and was the cherry on top of a lovely stay with Pendry.","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Hands down best customer service","lang":"en","publishedDate":"2022-01-17","publishedPlatform":"OTHER","rating":5,"text":"This was my first time at the Pendry and I cannot wait to return. From the moment I arrived at the hotel to the moment I left to return home, the service was amazing. Misael and Thinley at the door were super pleasant and helpful as was the front desk staff, housekeeping, in room dining staff and the housekeeping staff. It was an amazing experience.","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Can't wait to return","lang":"en","publishedDate":"2022-01-12","publishedPlatform":"OTHER","rating":5,"text":"My fiancé and I had a wonderful staycation at the Pendry Manhattan West. First, the hotel is absolutely stunning from the unique exterior, warm lobby, and perfectly appointed room. Aside from the gorgeous design, the service is what blew us away. We had incredible service starting with check in with Misael, Violet assisting us at the front desk, Nicolai delivering our delicious room service (breakfast in bed was particularly amazing) and Ngwang in housekeeping, we were treated like royalty throughout our stay. We ate dinner at ZouZou which was so convenient, fun, and fantastic (we will be returning with friends soon). We cant recommend Pendry enough and hope to stay here again soon!","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Top Hotel","lang":"de","publishedDate":"2022-01-11","publishedPlatform":"MOBILE","rating":5,"text":"Ich habe 3 Nächte in dem Pendry West Manhatten gewohnt. Top Hôtel, top rooms and best service!!!\nDie Lage ist sehr gut und der Service hervorragend. Besonders ist zu erwähnen, das Bett ist so angenehm und komfortabel. Alle Zimmer super ausgestattet und sehr sauber. Alles ist brandneu. Danke an das Team !","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Oasis in NYC","lang":"en","publishedDate":"2022-01-10","publishedPlatform":"OTHER","rating":5,"text":"This hotel is tucked away in such a peaceful little nook of NYC that you'd never know you're steps away from all the best attractions and experiences. The rooms are clean and sleek with a spa-like ambiance of wood tones, and the staff is absolutely wonderful, actually making conversation and learning about you to make your stay even better. Great hotel in a great area, and I would choose it again and again when seeking accommodations in the city!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Wonderful Place to Stay","lang":"en","publishedDate":"2022-01-08","publishedPlatform":"OTHER","rating":5,"text":"Can’t say enough about this hotel and how fabulous it was along with all of their staff! Sasha the driver was so special and the tall doorman couldn’t have been nicer and professional. We loved it and will be back!","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing stay from start to finish","lang":"en","publishedDate":"2022-01-05","publishedPlatform":"MOBILE","rating":5,"text":"My boyfriend and I celebrated his birthday on Christmas Day at the Pendry and I’m so glad we did! What an amazing establishment. Service was 100% from beginning to end. Violet at the front desk was an absolute delight to talk to and she made sure we were well taken care of and answered all of our questions. The hotel is brand new so you can still smell the fresh new scent. The rooms are so amazingly clean and much bigger than other hotels rooms in NYC being that I’ve stayed in different hotels in New York! Upon arrival they sent us a bottle of champagne to celebrate Christmas\/birthday with the most amazing note written by hand by McCord! He is so sweet and attentive. The common area with all the plants sets such a relaxing vibe to the hotel wether you’re just chilling, reading or enjoying a cup of coffee. We did order room service and the entire experience was absolutely amazing, please try the burger or the pancakes or both!! The bar is a whole different vibe, what I loved about it was the intimacy of it. I really really enjoyed chatting with Chris at the bar and he made me a delicious drink which I cannot remember the name lol \nAt some point we got back to the room to drop something off and we crossed paths with the housekeeping and they asked us if we needed more ice for our champagne that we haven’t yet opened and I told them in two hours would be great, and in exactly two hours we had a knock at our door by someone bringing us ice… it’s the precision and attention to details for me. \nLastly I wanted to thank all the door men for being so helpful and attentive, and thanks to especially IsMael( can’t remember if that was really his name) very sweet guy and very personable…  We can’t wait to go back ♥️\nThank you to the whole Pendry team","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Incredible Experience","lang":"en","publishedDate":"2022-01-05","publishedPlatform":"MOBILE","rating":5,"text":"The staff was so accommodating and friendly. The hotel is absolutely stunning and we loved the bar and restaurant. Delicious food and cocktails. Cute coffee shop next to the lobby as well. Location was super convenient to everything. Will definitely be staying here again!","travelDate":"2021-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing in every aspect!","lang":"en","publishedDate":"2022-01-02","publishedPlatform":"OTHER","rating":5,"text":"Just loved my stay at Pendry Manhattan West. Staff is amazing, extremely kind, gentle and very very helpful. Everything was great. Everyone wants to make sure you are well taken care of. The property was great too. If you are looking to relax and be well treated (rare in NYC), this is the place!","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing hotel in Manhattan West","lang":"en","publishedDate":"2021-12-29","publishedPlatform":"MOBILE","rating":5,"text":"Loved everything about this hotel. Especially the design and the central location. Staff is very friendly and helpful with everything. I recommend having breakfast at Vista Lounge. The breakfast sandwich is delicious. The gym is very spacious and I enjoyed working out there every morning.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing Stay","lang":"en","publishedDate":"2021-12-28","publishedPlatform":"OTHER","rating":5,"text":"Such a wonderful hotel. From booking, through to check in, right up until we checked out. The team at the hotel make you feel very welcome and comfortable. The rooms are awesome, and in room dining was great! The hotel location is great for tourists too.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"A time to remember!","lang":"en","publishedDate":"2021-12-28","publishedPlatform":"OTHER","rating":5,"text":"The staff is welcoming ,friendly, accommodating, as we felt welcomed  from the time we were helped from our car. The service is second to none and The accommodations are spectacular. When we stay in New York we will stay at the Pendry west side. ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Simply superb!","lang":"en","publishedDate":"2021-12-24","publishedPlatform":"OTHER","rating":5,"text":"Where to start? The feel of this hotel is luxurious and warm. The staff is both professional and friendly, and throughout our stay our family felt welcome and looked after. Rooms are generous in size and extremely comfortable, and the interiors overall are simply gorgeous - the entire place feels like a serene oasis in the city. We ate at Zou Zous and were not disappointed. The food is amazing, and we especially loved the varied and flavorful small plates. Also, don't leave without trying a cocktail from the bar, a true NY experience! Thank you Pendry for an incredible stay!!","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Perfect holiday season family trip","lang":"en","publishedDate":"2021-12-21","publishedPlatform":"MOBILE","rating":5,"text":"From the moment we arrived until the moment we left our whole experience was first class. We were a family of 9 and nothing was too much trouble and everything was done with a smile. Thank you for making our trip so special. Nice area to explore with the high line on the doorstep and close to good shopping and nice places to eat. The rooms are beautiful with great views.","travelDate":"2021-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic design and warm hospitality. Classic Pendry\/Montage","lang":"en","publishedDate":"2021-12-20","publishedPlatform":"OTHER","rating":5,"text":"Traveled to New York from Los Angeles to meet my parents for a holiday get together. From the moment we arrived, we were greeted with poise and warmth from Sean and Deki at the front desk. After that, Juan the Bellman escorted us to our rooms promptly - he's a total gem! Enjoyed beautiful rooms with city views and fantastic amenities. I highly recommend a martini or Manhattan enjoyed in Bar Pendry; the copper ceilings are beautiful and space feels very NY. It was too short of a trip and I will be back soon. When it was time to leave they kindly offered to arrange travel to Newark for me. Simply the best.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best of the best !!!!","lang":"en","publishedDate":"2021-12-20","publishedPlatform":"OTHER","rating":5,"text":"Best location, attentive service, first class amenities and a truly memorable stay. \nMy kids loved all the amenities, room was comfortable and the personnel were amazing. The location is very convenient..","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing, Best Hotel Yet","lang":"en","publishedDate":"2021-12-20","publishedPlatform":"MOBILE","rating":5,"text":"This place is a must , 10\/10 recommended. I would like to start off with Violet who definitely made my first 15 seconds memorable & very welcomed, right by her side was Juan who was very attentive and caring. But it doesn’t end there from In room dinning being 24 hours , wonderful customer service even at 1AM, they still made sure everything was great. I would like to give a special shout out to the Food & Beverage manager Mccord who was very welcoming and down to earth while making sure we were well taken care of! Down to Chris at the Bar ! very cool and funny guy, great conversation! The ending touch with Tsewang who made sure every door was open when we walked in and out, helped us with our bags and made us laugh while doing so! Let me not forget the house car driver I was unable to get his name, but he was great. Thank you Pendry Manhattan West for making my Anniversary trip amazing ! We can’t wait to be back !","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Hands down the best.","lang":"en","publishedDate":"2021-12-20","publishedPlatform":"OTHER","rating":5,"text":"A perfect week end. \nBeds are comfortable. Sheets are great. Welcomed and brought to our room. Check in and checkout seem less. Room set up was clean and roomy. Beautiful and perfect extras to make ur stay amazing. The location was easy to walk down to the important must sees for Christmas. Excellent hotel! ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A perfect location...close to everything but the mayhem of NYC","lang":"en","publishedDate":"2021-12-13","publishedPlatform":"OTHER","rating":5,"text":"We could not have found a better location with great hospitality and professionalism! We were away from the mayhem and crowds of midtown Manhattan during the holidays.  But so easy to walk everywhere (Rockefeller Center, Theatre District, Highline).  Best shopping mall (the Hudson Yards Shops) 1 block away... where a visit to the EDGE is a must (one of our favorite experiences).  Very classy experience; experienced staff.  Safe protocols in place.  Amazing 24\/7 gym with Peloton bikes and all the equipment anyone would need.  The views from the standard rooms not the best, but that is NYC with so much construction going on. ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Winter trip","lang":"en","publishedDate":"2021-12-06","publishedPlatform":"OTHER","rating":5,"text":"Beautiful room and such a comfortable feel. Such a warming welcome from walking through the doors and walking out. I would 100% recommend this place to everyone I know. This will be where I stay from now on every time I’m in New York.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Awesome Midtown Getaway Option","lang":"en","publishedDate":"2021-12-05","publishedPlatform":"OTHER","rating":5,"text":"Just tried out the new Pendry in Midtown. Birthday celebration with Broadway show and dinner. The hotel is very conveniently located - 5 min walk from Penn Station and away from the noise and congestion of Broadway\/Time Square. Beautiful rooms that feel oversized. Amazing and attentive staff. Great lobby bar that is small and intimate. Highly recommend for a NYC getaway any time as it’s a short walk shows, Madison Square Garden, and great restaurants (although the food at the hotel is fantastic). We had a great view down to the Statue of Liberty. Highly recommend!","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"My Favorite New NYC Hotel","lang":"en","publishedDate":"2021-12-04","publishedPlatform":"OTHER","rating":5,"text":"Exceptional service, food and facilities.  Absolutely loved the room, drinks at the lobby bar and dinner at Zou Zou's.  Hotel is centrally located and everything you need is close by.  Also loved the coffee shop off the lobby.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Most Hospitable and Engaging team","lang":"en","publishedDate":"2021-12-03","publishedPlatform":"OTHER","rating":5,"text":"This new hotel was an absolute WOW.  From the sleek, modern and comfortable rooms to amazing food, it was such a great visit to New York.  The team is so friendly and really knowledgeable about all the hotel details, the room service server shared all the features of the new restaurants and bars, and the employees at the front door helped with directions.  Other highlights of my stay included all our meals, the grilled branzino was amazing, chicken Caesar salad one of the best I've ever had and fresh pastries each morning, the super comfortable beds and location.  I can't wait to go back- Way to go Pendry Team!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"The best new hotel in the city!","lang":"en","publishedDate":"2021-12-02","publishedPlatform":"MOBILE","rating":5,"text":"The new Pendry hotel located in the trending Hudson yard area is an absolute gem. The location, rooms and amazing staff are simply the best. The team is welcoming, warm and want to make sure you have a flawless stay. The room I stayed in was on of the best I have ever experienced: modern design, spacious, comfortable, functional and luxurious.  The front office manager Anastasia was extremely welcoming and very professional pre arrival and through my entire stay.The wonderful bellmen are Juan, David, Misael, Thinkey, Tsewang were so helpful & genuine l! The food was outstanding and I truly enjoyed the breakfast thanks to the outstanding service provided by the fabulous sever Jessica and the manager Joseph. The proximity to the mall (a 5 minutes walk) made it very easy to grab last minutes gifts and anything needed. I can’t wait to come back to visit again and I can’t recommend this stunning property enough for anything visiting the city for business or simply for leisure.","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Bar Pendry","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"OTHER","rating":5,"text":"I was in the garden room served by a waitress named Evelyn. The manner in which she serves is superior and she clearly comes from executive level service. I will recommend her to all of my colleagues in the area. Thank you Evelyn.","travelDate":"2021-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing Stay at Pendry","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"OTHER","rating":5,"text":"I cannot say enough great things about this hotel. Our stay was incredible. The hotel is conveniently located within a 5 minute walk from Moynihan Station in the brand new Manhattan West development. The hotel is stunning from the moment you enter, but what really made this hotel shine was the staff. Everyone was so kind and eager to assist. The Front Office Manager, Anastassiya, in particular was incredible and always greeted us by name with a smile. I highly recommend this hotel and it is a great addition to the NYC luxury hotel scene.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing Luxury Hotel in NYC","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"OTHER","rating":5,"text":"We stayed at the Pendry Manhattan West during the busy post Thanksgiving weekend and couldn't be happier with the service, location and amenities.  The adjoining rooms on the 16th floor were perfect for our family of 5, and right in the heart of all the action in Hudson Yards.  From the warm welcome to fabulous dinner recommendation\/reservation last minute late Saturday night, we were welcomed with open arms.  The rooms were very comfortable, with incredible views !  The highlight for us was the staff.  Jorge at the door, Anastaysia and her team at the front desk and then entire crew were exceptional. What an oasis of calm tranquility in the middle of all the action.  Steps from the Edge, the Vessel and Skating Rink, plus shopping galore.  Highly recommend this spot in Hudson Yards, we will be back!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Loved this Property in Manhattan","lang":"en","publishedDate":"2021-11-29","publishedPlatform":"OTHER","rating":5,"text":"Loved being able to stay at Pendry Manhattan West. It was so refreshing to be in the city in an area that isn't so busy, but has so much surrounding it and it's pretty easy to get around. We stayed at one of the suites and it was so beautifully designed with everything so intentional and well done. We loved that it was also so pet friendly. the staff immediately felt like family, and we loved breakfast at the Vista Lounge. The property also has a car that guests can take if available and there's a really cute coffee shop by the lobby as well.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Our New Favorite NYC Luxury Hotel","lang":"en","publishedDate":"2021-11-28","publishedPlatform":"OTHER","rating":5,"text":"We stayed at the Pendry during the busy post-Thanksgiving holiday shopping time. The hotel is well-located in the Hudson Yards area which has a lovely high-end shopping mall, outdoor skating rink, Whole Foods, food court, coffee shops, restaurants etc. The hotel's decor is new, fresh, and soothing. The comfy beds and quiet location provided us with a great night's sleep. No horns honking or sirens! We found the hotel staff to be super friendly, welcoming, and accommodating. And breakfast in the lounge was delicious! My only suggestion for the hotel would be to add detailed room layout info to its website to help with room selection. We have found our new favorite NYC luxury hotel!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Magical 48 Hours in Manhanttan","lang":"en","publishedDate":"2021-11-26","publishedPlatform":"OTHER","rating":5,"text":"From the moment we were greeted by the Doorman at the new Pendry Manhattan West, we knew we were going to have an amazing weekend in New York City.  The front desk was very kind, explaining the layout of this new hotel, think it only opened a few months ago.  Our room was very spacious and had all the amenities that you would come to expect from a luxury hotel.\nThe main restaurant was closed, but we had In Room Dining once and utilized the lounge on the second floor.  The server in room service was fantastic, going through our order, wishing us a wonderful visit and personal the entire time.  Food was excellent.\nWe were able to access all of Manhattan from this central location, dining in lower NYC for lunch one afternoon before going to Broadway that evening.  \nLook forward to our next trip to NYC and Pendry Manhattan West, hopefully next time for more than 48 hours!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing","lang":"en","publishedDate":"2021-11-23","publishedPlatform":"OTHER","rating":5,"text":"From the email I received before my visit to walking out the door, Pendry knows customer service!  Check-in seamless, room perfect, beautiful, comfortable, food so so good! Don’t leave without stopping at Zou Zou for a specialty drink and some great food.  In a great location so much to do outside, but I didn’t want to leave the hotel.","travelDate":"2021-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Excellent Hotel","lang":"en","publishedDate":"2021-11-22","publishedPlatform":"OTHER","rating":5,"text":"My overall experience was excellent.  The room was perfect. The staff exceptional.  Give Bar Pendry a try and don't forget Zou Zou.  Also, take advantage of the house car...super convenient.  I am definitely coming back!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic new hotel","lang":"en","publishedDate":"2021-11-22","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is a fantastic new hotel with beautifully designed rooms, courteous staff, and great central location to get to anywhere you want in NYC. I would highly recommend this hotel for your next stay in the city. ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Service was excellent","lang":"en","publishedDate":"2021-11-19","publishedPlatform":"OTHER","rating":5,"text":"The way a hotel distinguishes itself from the pack is with service in my opinion.  The hotel itself was beautiful, clean, well located but what makes me want to go back and stay there are the people who run the hotel.  The extra little steps they take to make your stay exceptional was the highlight of the trip.","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"In a city that never sleeps, this gem is a respite of relaxation","lang":"en","publishedDate":"2021-11-18","publishedPlatform":"OTHER","rating":5,"text":"From the moment you are welcomed through the doors, the staff is warm and kind. The lobby and rooms have an understated elegance that, in juxtaposition with the hustle of the city, make you feel relaxed and at home. The room amenities are neat and well appointed. The location on the west side is ideal, with many options for shopping and dining all around you. Though I stayed for business, I would absolutely bring my family back to share in the experience.","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"EPIC NYC","lang":"en","publishedDate":"2021-11-15","publishedPlatform":"OTHER","rating":5,"text":"From the moment you walk through the door at Pendry Manhattan West, a feeling that whatever is going on in your life is going to be OK, takes over. Every aspect of the stay is next level. The tile in the bathrooms, the comfort of the sheets, the room service, the customer service...Romantic, comfortable, exhilarating.  ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Love Pendry Manhattan West!","lang":"en","publishedDate":"2021-11-10","publishedPlatform":"OTHER","rating":5,"text":"This was the second Pendry property we have stayed in, and 4th Montage\/Pendry.  We absolutely loved everything about the hotel.  The Margarita's were awesome. The burger and breakfast was fantastic.  The room was amazing. The Staff notably McCord and Daniel made us feel so welcome.  We loved our time at the property and cannot wait to come back. 10 out of 10 stars. New York is back baby!!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"A Manhattan West Sanctuary","lang":"en","publishedDate":"2021-11-09","publishedPlatform":"OTHER","rating":5,"text":"We had a wonderfully warm and quiet stay.  The staff made us feel like residents in a door man building.  The experience exceeded our expectations.  The rooms are beautiful.  A separate space for the toilet and shower is a great touch and the Gym\/Exercise facility is fantastic.  This will be our go to hotel in NYC","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Serene and Luxurious Respite","lang":"en","publishedDate":"2021-11-08","publishedPlatform":"OTHER","rating":5,"text":"This new hotel is the perfect place to decompress after a busy day in NYC. The design is modern and minimal, but very warm and comfortable. The staff is superb-- managers Annalisa and Anastassiya reached out to me prior to arrival to ask what time I would be arriving and if I had any preferences, and they were able to take care of everything I needed. The Front Desk agents Paul, John and bellmen Juan, Thinley, and Steffan were all so gracious and friendly. I appreciated the excellent complimentary shoe shine by Thinely. The room was perfect-- spacious, elegant, functional. They didn't miss any details. The bar is extremely attractive and a perfect place to catch up with a friend. I also had a great workout in the fitness center and enjoyed the natural light and vaulted ceilings. In Room Dining was delicious. The rooftop terrace and lobby level restaurant are not yet open, but they do have a restaurant on the 4th floor which I did not have an opportunity to try, but looks very chic. Neighborhood is great too, lots within walking distance including a Broadway show! Highly, highly recommend this hotel.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing hotel and even BETTER staff","lang":"en","publishedDate":"2021-11-08","publishedPlatform":"OTHER","rating":5,"text":"Where to begin....our entire stay was fantastic. Arrival to the hotel was flawless, service during stay was personal and departing the hotel felt like leaving family behind.\n\nThe rooms are delightful and fresh. The finishes, decor and design are top notch.\n\nThe hotel was such a calm oasis after a long day of hustle and bustle in the city.\n\nHighly recommend if coming to NYC for any reason whether it be business or leisure. Thank you again for a great stay!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Welcome to NY!","lang":"en","publishedDate":"2021-11-08","publishedPlatform":"OTHER","rating":5,"text":"Candidate for best hotel in NYC. Intimate and classy. Location is very good, with lots of amenities in the immediate vicinity. Rooms exceptionally well done, and service extremely responsive but not stuffy. We will certainly be back.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Impeccable service","lang":"en","publishedDate":"2021-11-08","publishedPlatform":"OTHER","rating":5,"text":"What a warm, welcoming, hard-working crew staffing this gorgeous new hotel.  There is a commitment to service with universal buy-in from everyone I came across during my short 3 day stay.  I recommend this place without hesitation. ","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"New favorite hotel in Manhattan!","lang":"en","publishedDate":"2021-11-06","publishedPlatform":"MOBILE","rating":5,"text":"After spending 4 nights at the plaza we decided to extend our NY trip 2 extra nights and wanted to explore a different part of Manhattan. After considering many 5 star options we decided to stay at the Pendry and our only regret was that we didn’t stay there our entire visit! From the moment we arrived we were greeted like family. Juan made us feel incredibly special, and we loved our welcome drink (with the optional “spike” from the bar)! Sasha, the hotel driver, took us to our lunch when it was “too cold to walk”, and the front desk staff, Paul, Violet, Aaron or John warmly greeted us every time we were welcomed back from our daily adventures. The rooms are perfectly appointed (I love the split bathroom concept) and the bed and sheets were heavenly. Every evening our rooms were turned down with the blinds closed for privacy, a sweet surprise and complimentary water (and slippers) next to the bed, and soft music playing with the lighting left on so we wouldn’t have to stumble into a dark room. Lastly, there are fabulous dining\/bar options in the hotel as well as nearby, like Citizens and Whole Foods, and we visited the high line and Hudson yard during our stay. If you are considering Equinox or any other luxury hotel in Manhattan I cannot imagine a more perfect hotel than the Pendry. I, personally, will not stay anywhere else from now on!","travelDate":"2021-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"A fantastic new hotel in New York","lang":"en","publishedDate":"2021-11-05","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is outstanding in every way. It starts with the great service when you walk through the door. I was so impressed that within 15 minutes of arriving every staff member knew our name. The check in was fast and perfectly arranged. The desk and door staff are incredibly attentive. The hotel has only been open one month and everything was perfectly curated. \nThe hotel is magnificent and so calming and relaxing. The lobby is an oasis of calm right in the middle of busy New York. It has a relaxed California vibe throughout with its muted tones and simple but luxurious comfort. The hotel is also super quiet with no crowds at all which is very welcomed during Covid.\nThe rooms are outstanding with light woods and muted tones. The beds are amongst the most comfortable I have ever slept in. The room size although not large was very spacious by New York standards. The technology and lighting are all state of the art.\nThe bathroom although not large was well laid out with a nice size walk in shower. The bathroom amenities provided are first class. \nWe ate breakfast in the lounge each morning of our 3 day stay. The surroundings are beautiful. The food and service was simply outstanding. \nThe location has you right in the middle of Hudson Yards which is an area of Manhattan that has been virtually re-built. You are surrounded by brand new sparkling buildings, shopping, eating and just about anything else you could want. Right around the corner from the hotel is Citizens food court with the finest food court food I have seen, Whole Foods is also there along with the Hudson yards shopping complex being a half a block away. If that isn't enough you can quickly and easily access the High Line. The hotel is also 2 blocks away from MSG and Penn Station. You are right in the middle of everything. \nThis is a first class hotel in every sense, it is the new standard in Manhattan. I will never stay at another Manhattan hotel after having stayed at the Pendry. It is a quiet, calm and beautiful hotel right in the middle of it all.  It is expensive but well within what 5 star hotels in New York will cost you. The Pendry is worth every penny, you won't find better. Well done Pendry!\n","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing hotel!","lang":"en","publishedDate":"2021-11-04","publishedPlatform":"OTHER","rating":5,"text":"Absolutely gorgeous!!!  The top notch staff and service made us feel so welcomed. The decor has a modern yet warm vibe to it, refined and refreshing. Our room was so pretty and clean. Was a pleasure to return to our oasis of a room after a full day out and about.  We were surprised with 2 oversized  yummy cookies along with a birthday message.  We loved the Pendry so much that we already booked a room for the holidays! June and Deka were so helpful in booking our stay. Can’t wait for our visit in December!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Best Hotel in New York","lang":"en","publishedDate":"2021-11-03","publishedPlatform":"OTHER","rating":5,"text":"When we arrived, we were greeted by name. The front desk staff was amaziing! We arrived at 11:30 am and was not sure if we could get a early check in, however they were able to check us in with a complementary upgrade. The room was amazing with a fantastic view of the city. The hotel concierge sent us a email prior to our visit for any detailed needs we needed for our visit. When we travel, my wife always likes flowers in the room, just like home. When we arrived the flowers were sitting on the table in the window perfectly for her to see. All of the doorman and bellmen were always attentive from when we arrived to the time we left. Always addressing us by name. The Cadilac car service was a great amenity, we were able to use the service for our show reservations. The great thing about the hotel as well was the location. In the middle of Hudson Yards, with Penn station two blocks away, the Shops and Whole Foods accross the street, and the High Line around the corner, the location could not have been better. Overall an amazing stay, can't wait to return. ","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"My New Address When I Visit NYC","lang":"en","publishedDate":"2021-11-02","publishedPlatform":"OTHER","rating":5,"text":"Wonderful hotel. It's just the right size, and stands in a very good location near Chelsea, the High Line, the Hudson... I typically stay further downtown but I really enjoyed Pendry NYC. I'll be back for sure.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful Hotel with Excellent Service","lang":"en","publishedDate":"2021-11-02","publishedPlatform":"OTHER","rating":5,"text":"Stephan at the door was like an instant friend! Everyone at the desk was happy to help with all of my questions and  recommendations. The service was A+++++ and the hotel is beautiful!! It has a great vibe. It was so close to Madison Square Gardens! My 17 year old and her friend went to a concert this weekend and this was the perfect place to stay.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Fantastic","lang":"en","publishedDate":"2021-11-02","publishedPlatform":"OTHER","rating":5,"text":"All the staff were very friendly and helpful, awesome rooms and great location. Room was gorgeous. The hotel is located very close to the Hudson Yards mall and shopping. Nice fitness studio. Impeccably clean. ","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Easy luxury","lang":"en","publishedDate":"2021-10-30","publishedPlatform":"OTHER","rating":5,"text":"Beautiful interiors, excellent service. Staff was detailed, fast, and attentive. Love the spiked drink password at check in and the accommodating early check in and late check out - it makes all the difference.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"A spacious gem in NYC","lang":"en","publishedDate":"2021-10-26","publishedPlatform":"OTHER","rating":5,"text":"Beautifully appointed guest rooms, featuring fantastic views, great natural light, super comfortable and timelessly chic, and well thought out floor plans, providing space and calm amidst the hustle and bustle of The City. ","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"FANTASTIC!","lang":"en","publishedDate":"2021-10-26","publishedPlatform":"OTHER","rating":5,"text":"Our family of five (three adult children) stayed at the Pendry. We all cannot say enough great things about this hotel!  The rooms are luxurious, beautifully appointed and extremely comfortable. The real treat is the staff—from the door, to baggage, to front desk\/concierge, to housekeeping—they are kind helpful and good at their job. No attitude. The main restaurant had not yet opened but the upstairs restaurant was excellent (had breakfast and one dinner there) and beautifully decorated—a visual treat, actually. The downstairs bar is also gorgeous—intimate and cozy. Highly recommend this hotel.","travelDate":"2021-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23528665,"title":"A New Kind of Vibe","lang":"en","publishedDate":"2021-10-25","publishedPlatform":"MOBILE","rating":5,"text":"I recently visited the Pendry West Hollywood so for my trip to ny I thought I'd stay Pendry again plus I love visiting new hotels and spaces.  I'll start by saying Manhattan is so curious because you have those \"institutions\" or staples of hotels & restaurants that between us I find stale, antiquated and frankly extortionate for what you get in return (you know the ones 25 dollars for an unimaged cocktail with torn leather seats that hasn't update their menu since Nick Noltey was the \"sexiest man alive\" but people still like to been seen there for whatever reason ... you know the ones 👀) which is why I was buzzing to try a spanking new hotel. The space itself is actually really thoughtfully designed and despite being more modern (no dated drab browns or suffocating drapes here) it is still classic in a New York way. All the tones are calming and the common spaces inviting. I eventually hung out in the front lobby to do some work and the vibe was nice. I was in town just for a few days but concluded every evening with a drink at Bar Pendry, a cozy intimate bar complete with a fireplace. This hotel is what I use to love about some of the hotels here that IMO sort of lost their way the past five years (I won't name names but a few are in SoHo 👀) - it isn't pretentious but still has a special feeling to it, you feel * something * when you're there. The guest room itself was spacious and everything was conveniently placed. The rain shower and soaking tub are to die for - especially if you've had a long flight or busy work week. The location is great too if you're in town for leisure too bcs you're perfectly set in the middle whether you're in the mood to go uptown or downtown. The hotel is really what luxury New York hotel should be - buzzy but not overwhelmingly so, attentive staff but not stuffy or buttoned up, good food and drink - and of course a fireplace. Highly recommend","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Perfect Space, Perfect Location and Perfect Staff","lang":"en","publishedDate":"2021-10-23","publishedPlatform":"OTHER","rating":5,"text":"Love the Pendry Manhattan West! Rooms are comfortable, and spacious. Location feels like the new \"in\" place to be! Hudson Yards, entrance to High Line, easy access to penn station (but you wouldn't know it!!). First time staying in this part of town and it is fantastic! Staff is like all Pendry Hotels ~ warm, welcoming and thoughtful! Would highly recommend!!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"New favorite in NYC!","lang":"en","publishedDate":"2021-10-21","publishedPlatform":"OTHER","rating":5,"text":"We had an exceptional experience checking out the new Pendry in Hudson Yards. The hotel is brand new, contemporary and inviting - we love the trendy vibe that Pendry offers. What really makes them stand out is the service. Violet, Paul, Juan and Anastassiya are just a few team members we had the pleasure of meeting and received genuine assistance from.","travelDate":"2021-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23528665,"title":"Awesome place with Amazing people","lang":"en","publishedDate":"2021-10-21","publishedPlatform":"OTHER","rating":5,"text":"New hotel in Manhattan West area! 5min from Moynihan Train Hall station. Located in the new Manhattan West Plaza. Easy access to High Lane and Hudson Yards. Staff is warm and make you feel at home. Rooms are beautiful and spacious, larger than your average NY room size! Pendry Bar is beautiful, ideal to have a drink before or after dinner. Vista Lounge Restaurant has the best chickpea hummus ever!","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23528665,"title":"Brand new and wonderful!","lang":"en","publishedDate":"2021-10-18","publishedPlatform":"OTHER","rating":5,"text":"My first stay at a Pendry but will not be my last.  I love the rooms!  Great size and lots of light.  The staff was very friendly and I love the location by Hudson Yards!  Had a great breakfast in the main dining room and loved the tucked away lobby bar!","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"A must!","lang":"en","publishedDate":"2021-10-18","publishedPlatform":"OTHER","rating":5,"text":"Love the 05 line- one bedroom corner suites. Service was excellent as was the food. Staff is very friendly. Room service was excellent as was the in room coffee machine. LOVE this property. I would definitely stay here again. ","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"We found a gem..","lang":"en","publishedDate":"2021-10-18","publishedPlatform":"OTHER","rating":5,"text":"Our stay at our hotel has to be the absolute best place we’ve stayed in many years. The management team excellent, the staff excellent. Especially the front door staff. As stated earlier you’re second to none. We will be back very soon.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"New #1 in NYC","lang":"en","publishedDate":"2021-10-17","publishedPlatform":"OTHER","rating":5,"text":"We stayed at the Pendry West for a night -- and will definitely come back. The service, quality of the materials and design -- and the bar! Top-notch. We're already planning our next visit, and we'll be at the Pendry for sure. A great discovery!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"New hotel in Hudson Yards!","lang":"en","publishedDate":"2021-10-16","publishedPlatform":"MOBILE","rating":5,"text":"No teething troubles for this new hotel opening. Wonderful quiet rooms. The bed was really comfortable. The bar on the ground floor is very stylish. Staff were very friendly and helpful. I’ll be back and back a lot. Stayed in a corner skyline corner king.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great staff... great hotel","lang":"en","publishedDate":"2021-10-11","publishedPlatform":"OTHER","rating":5,"text":"We were made welcome from the minute we walked in the door. Great, friendly, helpful staff. Beautiful, clean room. Hotel is just a short walk from MSG and Hudson Yards. Restaurant is very good. We will definitely return.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"NYC Has a new gem with Pendry Manhattan West","lang":"en","publishedDate":"2021-10-10","publishedPlatform":"OTHER","rating":5,"text":"I recently booked a stay at Pendry Manhattan West. I was unsure about choosing a property that had just opened. However I was pleasantly surprised to experience a well run property that passed all the tests a five star property is expected to deliver on. Open less than a month, the room service was delivered as promised (30 minutes or less), the check-in process was efficient and welcoming, the food and beverage options were above par and delicious and the interiors were sophisticated, current and inviting. The staff was very friendly and accommodating to any need including delivering a microwave to warm up cold takeout food. I have not stayed at other Pendry properties but I look forward to soon visit other properties in Chicago and Park City. I might even half to do a staycation at the new DC property. \n\nHighly recommended to anyone wanting five star service, a warm staff, chic interiors and a super location next to Hudson Yards and the famous High Line.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Pendry Manhattan BEST","lang":"en","publishedDate":"2021-10-08","publishedPlatform":"OTHER","rating":5,"text":"What a gorgeous new property! I was lucky enough to stay opening weekend and was so impressed with the attention to detail in the service, design, and warm hospitality shown to me by all of the associates. It was also a short walk from Penn station. ","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":23528665,"title":"The only hotel I will now stay in‼️","lang":"en","publishedDate":"2021-10-08","publishedPlatform":"MOBILE","rating":5,"text":"We love this chain and now we add this to our New York trips.   The hotel is beautiful and in the Chelsea area two blocks from\nMadison square garden.    The rooms are perfect and the staff was amazing.  They truly understand customer service.  Thanks to juan,decki,Ana Lise, Paul and Aaron.   They get it and made the trip even better.   This chain had great spots in San Diego , West Hollywood and Chicago which we have stayed in.  They are getting it right.  Thanks for making our stay even better.   \nLW.  Scottsdale Arizona","travelDate":"2021-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Refreshing Spin on New York Hospitality","lang":"en","publishedDate":"2021-10-06","publishedPlatform":"OTHER","rating":5,"text":"What a remarkable addition to the NYC Hotel  World.  Now my preferred choice all due to the culture this property boasts.  Not only the beautifully appointed accommodations and views, but hidden delights like Bar Pendry, Garden Room and a full fitness studio accompanied by Peloton Bikes, but it was the Kind, Gracious and Warm Hospitality at its best is what I experienced and enough of it that I have begun to share my recommendations with my own network to seek out Pendry Manhattan West upon their next visit to NYC.  Keep up the great work and you will surely make your mark as well as a refreshed statement in an iconic city that deserves it.","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Absolutely Exquisite","lang":"en","publishedDate":"2021-10-06","publishedPlatform":"OTHER","rating":5,"text":"wow, just wow…. no words can adequately describe how amazing everyone and everything was…. awesome location close to Madison Square  Garden, High Line, Little Island and great shopping. I highly recommend!!!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"AMAZING NEW HOTEL IN AMAZING LOCATION!","lang":"en","publishedDate":"2021-10-05","publishedPlatform":"OTHER","rating":5,"text":"I just got back from a week of business meetings and stayed at the newly-opened Pendry Manhattan West, which is located in the newly developed Hudson Yards area.  I loved this hotel.  It is so beautifully designed.  Brings a very fresh and California feel to New York City.   I attended some events at the hotel and Bronson and Ro were both exceptional service providers.  I absolutely loved Bar Pendry - so stylish and initiate, and once again with excellent servers.  Shout out to Gina and Orlando for going above and beyond with beverage recommendations.  My housekeeper, Ms. Thubtwn was excellent and so thorough.   And last but not least I must give a HUGE SHOUT OUT to Juan, who welcomed me in\/back every day.  His presence at the door is beyond impactful and his hospitality is first class.  I am so impressed with this hotel, can't wait to return in December.  I know it will be a huge success!","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Great New Location for New Luxury!","lang":"en","publishedDate":"2021-10-04","publishedPlatform":"OTHER","rating":4,"text":"Cozy, warm sense of arrival at the new hot spot in West Manhattan. \nPeople were very nice, just opened Hotel, the brand transmit youthful and modern luxury vibes, nice size of rooms and it look very nice places will be around to dine out. \nPls try it! ","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Girls weekend","lang":"en","publishedDate":"2021-10-04","publishedPlatform":"OTHER","rating":5,"text":"Four mom's and our daughters stayed for a long weekend. It is a beautiful new hotel. The staff were helpful, friendly and professional. They were happy to assist with anything we needed. We ate dinner at the hotel, and the food was excellent, the staff was knowledgeable.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Absolutely beautiful hotel and a very well trained staff that made us feel very welcome and comfortable","lang":"en","publishedDate":"2021-10-04","publishedPlatform":"OTHER","rating":5,"text":"We came in for the weekend to celebrate my birthday with friends and family. The welcome staff from outside to in we're friendly and very welcoming. The room was absolutely stunning and clean. The entire weekend felt as if this hotel had been open for years because it was so well run. We cannot wait to return!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Exceptional stay","lang":"en","publishedDate":"2021-10-03","publishedPlatform":"MOBILE","rating":5,"text":"I am on night 3 of my 5 night stay at the Pendry and feel that I would be doing a disservice by not immediately singing the praises of this property. I am a 15 year veteran of the city and would never in a million years have thought this was a good location, but it somehow is! A block from Madison Square Garden, not on my usual list, but very convenient for my daughter’s Harry Styles concert. Just up from the village, my favorite stomping grounds, but only a few blocks from the theater district, which should only be  visited for theater. The entrance to the Highline and Hudson yards are steps away. So, the location is actually quite good.  \n\nBut the hotel as a whole gives off a very warm feel. The decor is extremely calming and polished. The staff are exceedingly attentive and really make all the difference. As one would expect of a Montage property, they immediately remember who you are and what you like. However, I have discovered that even though I expect that level of service from many high end establishments, I rarely actually receive it, but I did here. \n\nThe rooms are lovely. Thoughtful floor plans in all of them. We are a large group and have 2 double rooms, a king room and a corner studio. All of the rooms are far larger than a typical NYC hotel room with an incredibly well thought out floor plan. But the kicker in these rooms is the rounded window. Photos do not do it any justice. It makes the room feel incredibly expansive and takes full advantage of those amazing NYC views.\n \nTo sum it up, this is an absolute treat to stay in Manhattan.  Book it now before the word gets out and it is completely booked up.","travelDate":"2021-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Can I live here!?","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"OTHER","rating":5,"text":"Absolutely loved my stay at Pendry Manhattan West. The hotel is gorgeous and the attention to detail is unmatched. The entire staff was so welcoming and kind. A 10\/10 experience and can't wait to come back.","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Please can I go back?","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"OTHER","rating":5,"text":"What an amazing experience at the Pendry Manhattan West!  The rooms are luxurious, yet comfortable and much larger than you'd normally see in New York. The curved window provided such an amazing view of the city. The bed was by far the comfiest bed I've ever slept in at a hotel. The staff made me feel like I was their number one priority from the moment I stepped into the building.  The bar was fun and beautifully designed. The rooftop terraces were amazing.  The only problem was that my stay was only one night!  I can't wait to go back.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"LOVE IT HERE","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"OTHER","rating":5,"text":"I had the most amazing stay at Pendry Manhattan West. The staff was so accommodating and welcoming! The beds were so comfortable and the rooms were spacious!\n\nNot only that, Zou Zou's is one of the most beautiful restaurants I've ever seen!\n\nOverall 10\/10 experience and I can't wait to be back!!!","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Beautiful hotel in the newest NYC hot spot.","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"OTHER","rating":5,"text":"Pendry Manhattan West is one of a kind - there is definitely nothing else like this in New York City. It's part of a new development called Manhattan West near Madison Square Garden, the Theater District, Hudson Yards, and more. It's the perfect place to stay before or after visiting any of those attractions. Manhattan West has a ton of amazing shops and restaurant - including Katsuya, Ci Siamo (the newest Danny Meyer restaurant) Zou Zou's (from the restaurant group behind Don Angie) and more. It's the coolest new neighborhood in New York City. \n\nI also have to mention that the service at the hotel was unbelievable. I was only there for 2 nights, and the staff consistently greeted me by name and helped with anything I needed. I truly felt at home!","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Manhattan's Best New Hotel! Can I move in?","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"OTHER","rating":5,"text":"Pendry Manhattan West is New York's newest and most needed hotel in the market. Located on 33rd Street between 9th & 10th Avenue, the site is incredibly easy to get to from major transportation and via car. The moment I arrived, the staff at the front opened my car door, grabbed my bag and kindly guided me to the front desk. The scent upon arrival was so lovely and not overpowering. The front desk staff was incredibly welcoming, kind and professional. Every detail was considered and the entire experience was so impressive. My room overlooked the Manhattan West plaza which is now full of tremendous dining and shopping. Pendry Bar is going to be my new favorite bar in New York. It's intimate atmosphere and décor drew me in. As a Californian myself, I particularly love Pendry's California-inspired take on luxury. I'm beyond excited to have a Pendry in New York and seriously wish I could move in. I highly recommend you stay, visit and return again! I know I will. ","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing stay at the Pendry!","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"OTHER","rating":5,"text":"I had a wonderful experience at the Pendry Manhattan West. The room was elegant, the views were great, the bed was comfortable, and the staff were all extremely welcoming. I highly recommend this hotel! ","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Incredible","lang":"en","publishedDate":"2021-09-29","publishedPlatform":"OTHER","rating":5,"text":"Staying at the Pendry Manhattan West is absolutely incredible.  The beds are heavenly and the tables in the rooms are perfect to work from, with tons of natural sunlight.  The bathrobes are the best I've ever worn - so soft and cozy.  The Pendry Bar on the ground floor and the bar on the 4th floor are beautifully designed and have an incredible vibe; I think they will truly become one of New York's iconic hotel bars.  \nNot to mention the hotel is located in the center of the Manhattan West plaza so you can wake up and get breakfast from Danny Meyer's Daily Provisions and have dinner at the incredible Zou Zous, inside the hotel.  Highly recommend!!","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Birthday trip","lang":"en","publishedDate":"2021-09-29","publishedPlatform":"MOBILE","rating":5,"text":"I visited Pendry Manhattan west for my Birthday and had a fabulous time . When i arrived i was greeted  by Anastassiya   at the front desk and she was so helpful and accommodating. I loved the welcome drink she offered us . Our room was beautiful and larger than what i usually see in New    York. When i entered my room there were Black and white cookies with a wonderful birthday card from McCord the food and beverage manager. I ordered room service during my stay and Ousman the server who delivered my food was the best . At the front door Juan was so helpful with my luggage and with an umbrella when it rained. I cannot recommend this property more everyone that i encountered at the Pendry west made my birthday trip forever memorable, i can’t wait to return","travelDate":"2021-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23528665,"title":"TOP NOTCH Service and Gorgeous Design","lang":"en","publishedDate":"2021-09-27","publishedPlatform":"OTHER","rating":5,"text":"I was able to experience Pendry Manhattan West days after their new opening and I and rave enough about my time at the hotel. The service was top notch. Their training program must be very well thought out as from arrival to departure, the service was seamless. Even on departure, Juan (the bellman door gentleman) was so endearing that all the way to my car door I felt the staff were super happy to be working there and it showed. The design is so soothing (lots of light natural wood colors to their green plants that give NY the feel of California) and the lighting in the evening is super warm and inviting. Bar Pendry is very cool and their pebble ice made my drink look super fancy (never knew of pebble ice!). Evelyn at Zou Zou's is one of the bartenders that was super engaging and interesting!  Staff is typically what makes a luxury hotel and Pendry Manhattan West has both; service and design which makes the best of both worlds. \n\nI am not new to Montage, yet new to staying at Pendry brand and pleased to have! A must try!","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"new favorite hotel in NYC","lang":"en","publishedDate":"2021-09-27","publishedPlatform":"OTHER","rating":5,"text":"Having never stayed in this neighborhood before, I was uncertain of how the experience would play out.  Loved the Pendry Hotel and loved the overall Hudson Yards area.  Whole Foods close by was so convenient.  Overall excellent experience at the hotel.  Very friendly, professional and knowledgeable staff.  Always willing to research further to give me a complete answer.  The rooms were beautiful adn felt luxurious.  Extremely cozy bed, spacious bathroom and good closet space. The best housekeeping experience I have ever had at a hotel - my room was sparkling clean and immaculate every day.  Very impressive.","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Amazing Hotel","lang":"en","publishedDate":"2021-09-27","publishedPlatform":"OTHER","rating":5,"text":"The Pendry is an amazing hotel - certainly the best I've stayed in while in NYC.  The rooms are spotless, the staff is over the top friendly, and they made our entire group feel welcome and safe.  I highly recommend staying here.  ","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"10 10 10!  Everything about this hotel is a 10!","lang":"en","publishedDate":"2021-09-26","publishedPlatform":"OTHER","rating":5,"text":"Exceptional service and staff.  The best of the best.  The materials used for this hotel including the lighting was exquisite.  The staff were so helpful and friendly which made our stay ever the nicest.  AThis hotel has it down!","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23528665,"title":"Fantastic new hotel in NYC","lang":"en","publishedDate":"2021-09-23","publishedPlatform":"OTHER","rating":5,"text":"I was thrilled to be a guest of the Pendry Manhattan West during it's first week open in September 2021. The property is beautiful, my (corner king) room was exceptionally large for NYC, the staff is kind and professional, and the location can not be beat if arriving in NY by train!","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"In room dining service was horrible","lang":"en","publishedDate":"2021-09-23","publishedPlatform":"OTHER","rating":4,"text":"Quality of in room dining service was poor food order was wrong and no condiments after trying to let supervisor know of the issue this is not what I would expect of the Pendry. In addition, the value was not there for that kind of service ","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"The best five-star experience","lang":"en","publishedDate":"2021-09-21","publishedPlatform":"OTHER","rating":5,"text":"I can't say enough about how amazing this hotel was. I was one of the first guests to check in and have to say, what I thought five-star hotels should be has completely changed. From the moment I walked in, everyone was extremely welcoming and accommodating. The hotel, the restaurant, the rooms are so luxurious and the service was impeccable. I have stayed at many five-star hotels and have never experienced service like what I had at the Pendry Manhattan West. I have cancelled my NYC marathon hotel and rebooked at the Pendry. I cannot wait to come back and experience it all over again. ","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23528665,"title":"Trendy Luxury in NYC","lang":"en","publishedDate":"2021-09-20","publishedPlatform":"OTHER","rating":5,"text":"This is a wonderful hotel in Manhattan West. The staff was warm and welcoming, the building stunning, and the location, perfect for events at the Garden, or conducting business in the nearby office buildings of Hudson Yards. The rooms are very spacious (Especially for New York), and have the latest tech available (GIANT TVs in all rooms, and very fast WIFI). If you find yourself needing a place to stay in this part of town,  I would certainly consider the Pendry!","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23528665,"title":"Phenomenal property and great experience","lang":"en","publishedDate":"2021-09-17","publishedPlatform":"OTHER","rating":5,"text":"The hotel is beautiful and the guest room was very nice.  The restaurant and bar areas, along with great quality, were very inviting and comfortable.  The staff are 100% welcoming and very helpful when help is needed.  I am highly recommending this property.  ","travelDate":"2021-09","tripType":"BUSINESS"}
