{"helpfulVotes":0,"locationId":15530677,"title":"Loved it","lang":"en","publishedDate":"2024-04-01","publishedPlatform":"MOBILE","rating":5,"text":"Great ambience, tremendous service by every single member of the ample staff, and very good restaurant. The room was small but very stylish and functional; quite happy with it. I chose this property due to longtime previous experience with the Renaissance brand, and because it was an event in Chelsea that took my to NYC; not only did it not disappoint, but I loved it and would happily stay there again.","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15530677,"title":"not worth the price","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":3,"text":"Cons: 1\/Rooms are really small and dark with little sunlight 2\/TV had glitches 3\/Did not deliver utensils to room after confirming that they will. 3\/Baggage handler is running his own taxi hustle and interfered with our Uber ride 4\/Rooftop bar is usually closed to hotel guests but the hotel website makes you believe that it is available.\n\nPros: Close to subway stops, but that is probably true for all hotels in Manhattan.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great Nee York Stay","lang":"en","publishedDate":"2024-03-10","publishedPlatform":"OTHER","rating":5,"text":"Great location. The ambience is incredible and the customer service is amazing. From my room, I even had a view of the Statue of Liberty. Wonderful hotel if you are traveling as a family. Lots of food options and shopping options in walking distance. Great adjacency to 5th Ave","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Exceptional Hosts","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":5,"text":"We have been staying at the Renaissance Chelsea since it opened 4 years ago. The former management team was lovely and now we are fortunate to have Paul, Phoenix and others as our gracious hosts whenever in NYC. We are Marriott Bonvoy Platinum Elite Lifetime Members and are always treated the the utmost care and kindness. I can't imagine wanting to stay anywhere else! \nWe highly recommend staying at the Renaissance Chelsea!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Our new favorite NYC hotel","lang":"en","publishedDate":"2024-02-06","publishedPlatform":"MOBILE","rating":5,"text":"Fantastic stay with 2 rooms at this location.  \nGreat check in experience, two modern\/clean rooms on a low floor , accommodating staff, and a cute lobby bar.  Gym is small but has everything you need to get in a workout.\n\nLocation is also great.  Less than ten minutes minute walk from the 7th Ave side of Penn Station.   Lots of parking lots near by as well. \n\nWe had the full breakfast Buffett and it was above average for a Marriott Buffett and the staff (including Charlie) was gracious and accommodating.  \n\nWe concur with the other reviews about getting a lower floor (at least on the weekends) due to the roof top club.  We overheard several folks who were staying  on the 34th floor who said they heard the music until 4am \n\nOverall great experience and we will be back !","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Poor customer service from staff.","lang":"en","publishedDate":"2024-02-03","publishedPlatform":"MOBILE","rating":3,"text":"Our room had a great view and was clean and comfortable. Bathroom shower head did not work properly. Overall my experience was average due to the staff. My friends and I were waiting in the lobby for an Uber late night and was basically harassed by the lobby security. Instead of asking what room I was staying in they they assumed we were attending the onsite club, and were threatening to kick us out for hanging in the lobby. Also at check in I was asked if I wanted a late check out at 1pm, and said yes, and then received a call from the front desk asking why we did not check out at 12pm. I think that hotel management needs to reevaluate their customer service standards. I would not stay here again due to this experience.","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Chic in Midtown","lang":"en","publishedDate":"2024-01-30","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here for six nights. Perfect location in Midtown Manhattan and about a 10 minute walk from Penn Station. Steps away from restaurants, cafés, and a supermarket. As with other Renaissance hotels, the atmosphere is upbeat and chic. If you’re an elite member expecting a full breakfast, you may want to make other plans. They do offer a continental breakfast, with limited items. I was offered a room towards the top floor, however, I was advised by hotel staff there could be noise from the nightclub. I decided to take a room on one of the lower floors. Beautiful property. Highly recommended if you’re considering.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Ideal location for what we needed.","lang":"en","publishedDate":"2024-01-30","publishedPlatform":"MOBILE","rating":5,"text":"This hotel embraces the Renaissance Discoverer vibe that we look for.  The hotel staff is attentive and friendly.  The hotel facility is clean.  Our room was the standard sized room, but we were on a corner that allowed for great views of the Empire State and the river.  The breakfast was standard fair, the service made the morning. A coffee bar in the lobby with pastries for a grab and go opportunity. Located in Chelsea and 2 blocks from the F line trains we were able to get about rather easily.  It is a 30 block walk to Midtown and the Theatre district,  The area had a good vibe, we went to an outdoor flea market, there is a supermarket across the street and 2 Bros Pizza for that late night fix.  We will stay here again on a return to NYC.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Excellent Hotel","lang":"en","publishedDate":"2024-01-18","publishedPlatform":"OTHER","rating":5,"text":"I stayed here in July 2021 when the hotel first opened, and stayed again this past weekend. I really like this hotel. The front desk staff, especially Jessica, is always friendly and welcoming. I really like the cool hanging chairs in the lobby. I had a quesadilla at the restaurant and enjoyed it. I had a corner room on the 32nd floor with an excellent view of Midtown. I love the design of this hotel - very artistic\/floral among many aspects. Also the location is great.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15530677,"title":"Hip and Comfortable in Chelsea","lang":"en","publishedDate":"2023-12-27","publishedPlatform":"OTHER","rating":5,"text":"We stayed at the Renaissance Hotel in Chelsea for two nights in early December to celebrate our anniversary. The location is great, close to subways, near many restaurants and perfect for seeing the city's sites both uptown and downtown. We were able to check in early - thanks Renaissance! - and welcomed by a very friendly and courteous front desk staff. Our room was NY-style cosy with a vibe that's both comfortable and hip. Bedding is perfect for a good night's sleep. The breakfast buffet is serviceable, complete and convenient - attended to by a friendly staff (cappuccino anyone?). Our checkout time was extended which was greatly appreciated. An excellent way to extend a very nice stay in the big Apple!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Extraordinary service & beautiful room!","lang":"en","publishedDate":"2023-12-24","publishedPlatform":"OTHER","rating":5,"text":"From the moment we arrived to the moment we left,  we felt warmly welcomed and taken care of!  What great friendly and service minded staff!  Shout out to Phoenix in the reception for exceptional hospitality!!!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Xmas at the R","lang":"en","publishedDate":"2023-12-23","publishedPlatform":"OTHER","rating":4,"text":"The hotel seemed bigger on  pictures but it was okay. Comfy bed, friendly front desk staff! We also dined at their restaurant. Food was good and we loved that there was live entertainment at the lobby at Night. They sang classic Christmas songs. My daughter loved the complimentary hot cocoa :) we will come back.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Tiny rooms, poor service, good location","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"MOBILE","rating":2,"text":"Tried this new renaissance property in the West 20s near Chelsea and the flower district.  The hotel is only about 2 years old.  However, a decent King room was barely bigger than the bed!  Rooms are TINY. Beware.  And for the rates we paid (one night was over $600), it was NOT worth it at all. The service quality was poor at best - for example, multiple calls to front desk, housekeeping and restaurant went unanswered; staff were kind of curt; as a lifetime elite member, I did not feel\nLike I was valued at all. No upgraded room even offered.  Towels were flimsy. Toiletries are the mass toiletries bolted to the wall. Room decor was ok, but the room was so small it didn’t help much. The safe was half the size of a normal one - laptops had no chance of fitting.  WiFi was choppy at times.  Location was convenient. But I would not stay here again.  There are larger rooms with better value and service at other properties.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"A déconseiller pas sérieux ","lang":"fr","publishedDate":"2023-12-04","publishedPlatform":"OTHER","rating":2,"text":"Attention publicité mensongère \nLit double très petit \nChambre très petite mal située\nL’hôtel ne répond jamais!\nEt la possibilité d’aller sur le toit toujours fermé !\nPas de piscine\nNe pas passer par Booking qui de s’engage …. De toutes responsabilités….. et personne ne réponds ! A déconseiller \nTrès cher \n","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Not terrible, but I won't stay again","lang":"en","publishedDate":"2023-12-03","publishedPlatform":"OTHER","rating":3,"text":"The location of this hotel is great. It's very central to subway stops and a part of NYC I had not spent much time in before now. The room was much smaller than I remember NYC hotels being but that's probably more on me than them. I didn't have any issues with loud music from the nightclub, although I did hear some \"adult playtime\" through the vents. I had issues with housekeeping which forgot to clean my room and when I came back I was in quite a hurry to make my evening plans. I tried using the mobile app chat for requests but they were ignored at first. And when I had food delivered and someone at the front desk told me they would have it brought up, they must have forgotten and I had to follow up 20 minutes later. I think the service and attention to detail could be much better. I love Marriott hotels and the Renaissance brand but I don't think I'll stay at this one again.  ","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15530677,"title":"Dirty, Gross, Disgusting","lang":"en","publishedDate":"2023-10-06","publishedPlatform":"MOBILE","rating":1,"text":"After a long day of travel I decided I go up to my room for an afternoon nap. Just as I was about to slip into bed I stopped in shock of what I had just seen. As I lifted the cover the afternoon sunlight was peeking in and showing all the dirt, mold and whatever else was on the duvet. I immediately called management. The housekeeping managers response to what he saw was simply appalling. He stated “the discoloring is due to overwashing”. Even if that was the case how would one even think a guest would feel comfortable slipping into this bed. The pictures to follow will speak volumes. If you are looking for one of the grungiest hotels in NYC this is your spot. Gross, gross, gross!!!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15530677,"title":"Bonvoy’s Worst Experience Ever","lang":"en","publishedDate":"2023-09-16","publishedPlatform":"MOBILE","rating":1,"text":"Worst experience I ever had in NYC. My holiday has been ruined by this unfriendly cheap overpriced hotel. I didn’t feel like staying in a Bonvoy’s hotel. I was so surprised to see how small the room was with total rates USD 5000 for 10 nights Non-refundable. Overpriced even for New York and this is not my first time to visit NYC.\n\nAs Bonvoy member and stayed for 10 night, they allocated us in the worst smallest possible room available in the hotel. Room 2509. Avoid this room !! Very dark, very small with no view. Similar to Ibis style hotel. No bath robe, no slipper, no minibar and very small closet even for 1 person. I attached the photos how they setup the hair drier in the bathroom. \n\nThe breakfast wasn’t included . You have to pay their low quality breakfast USD 38 \/ person where you get dry pastries and coffee in a paper cup served by unfriendly waiters.\n\nPrior to my arrival, I tried to send them e-mail as I have some requests. They simply didn’t care. When I check-in and asked why was my e-mail wasn’t replied, They were just smiling. No bother giving explanation. The attitude of front desk staffs here shall be urgently fixed. No customer service oriented at all. No greeting, no welcome, nothing. The first thing they asked was my credit card. This hotel seems like having bad management.\n\nThey did not replenish the coffee and tea automatically until you ask. HK was placing DND letter as fast as they could, even before 1 pm. The cleaning lady was nice, but was difficult to communicate as she doesn’t speak and understand English at all. Cleaning quality can be improved. I ve attached a photo of alarm clock where full of dust on top.\n\nShameful to Bonvoy Marriot as Renaissance is one of their premium brand.","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":15530677,"title":"SCAMMED US OUT OF $350, MONTHS LATER STILL NO ANSWER FROM HOTEL ABOUT CHARGE AND STILL HAVE OUR MONEY. DO NOT STAY.","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":1,"text":"My partner and I stayed in this hotel in August. We had originally booked for July 23rd however had to change the dates. After a week of this hotel refusing to help or even speak to us about this issue, we had to contact booking.com (who thankfully done their job and helped us straight away). Once we got to the hotel we were asked to give our card details again and were assured this was only a precaution so that they had our information on file incase we ran up any room charges. We explained that we had paid for our stay up front when we initially booked, to which the employee on the front desk confirmed. After our stay, we checked our bank statement only to discover they had charged us TWICE. After two months we have emailed and called endlessly and have had no help and no response in either form of communication. They still have our money… DO NOT BOOK, ABSOLUTE SCAM!!!!!!!! Also, horrible location, fairly central but on a dodgy street. ","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Amazing stay!! 💯 recommended!","lang":"en","publishedDate":"2023-09-06","publishedPlatform":"OTHER","rating":5,"text":"What an amazing hotel!! Renaissance Chelsea has the perfect location, Emar Fernández and his staff went above and beyond to make my stay spectacular!\nI won’t stay anywhere else when I go to NYC but there!\nThe breakfast was super yummy! The gym had all the machines I needed, the room was so beautiful and had an amazing view and I also loved the shower!! I didn’t want to leave!!","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"The street is full of drug taking homeless people asking for money and injecting and defecating in front of you.","lang":"en","publishedDate":"2023-09-06","publishedPlatform":"MOBILE","rating":3,"text":"The hotel was lovely but it should be clear the roof bar and pool are not for hotel guests to use. There is also one less elevator in use as the club upstairs has sole access so getting up and down is not straightforward, there is a long wait and it’s packed every time. \n\nThe welcome was cold and staff don’t tell you any info unless you ask. How to work the lift with the card, what time breakfast is, the tax charge and when you pay (I asked and was told I didn’t have to pay anything but I knew I would have to) they took it off my card without asking and then returned it on the last day to then ask me to pay on check out. That was inconvenient as it was my spending money for the trip, a few other things such as the rewards programme or what is Included in your stay. The barman is also never at the bar so hard to get a drink. \n\nThe worst part (which I’m shocked isn’t mentioned in other reviews) is the road the hotel is on is used as a drug meet up where sales are made and homeless people inject themselves in front of you. We also had someone defecate in front of us and there is faeces all over the street. Homeless people ask you for money constantly when you’re at the hotel patio and in the morning before 10am the street looks like the walking dead with drugged up people all over the place. \n\nIt’s a shame as the hotel design is chic and clean and the location is fab. The rooms are small but I expect that for NYC.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"A great option, in a good location.","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":4,"text":"I was a little nervous as to whether we'd made a good choice in booking Renaissance Chelsea as reviews ranged, and it wasn't mentioned at all on the Facebook page I was part of prior to our trip. \n\nI was pleasantly surprised though. Everything was clean, comfortable and had a nice feel. Yes, the room was a little on the small side, with nowhere to really store luggage without blocking the walkway, but the location was excellent and I would certainly consider staying here again. \n\nTop tip - make use of the guest perks. We visited the Guggenheim museum and spent time on the TopView hop on and off bus - both exceeding expectations. \n\nMaddison Square Park just along the road adjacent to the flatiron building is a great spot to sit and watch the world go by. \n\nWalking distance to everywhere - the only subway ride we took was to Brooklyn. \n\nNiggles - tiny bottles of water that you have to get from reception create lots of plastic waste. Never saw any of the 'snacks' available while we were there.\n\nHotel doesn't respond to social media - sent enquiry on Facebook and Instagram prior to visit but both remain unread. ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Excellent ","lang":"en","publishedDate":"2023-08-30","publishedPlatform":"OTHER","rating":5,"text":"Excellent hotel Room was very clean The bed was very comfortable, excellent shower love the rainhead shower. Staff was very helpful and accommodating. We were greeted with cookies when we checked in. Very welcoming and warm feeling. Ideal location Central to everything.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Amazing Hospitality Services","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"MOBILE","rating":5,"text":"Hospitality is extremely important to us and the staff at this hotel go over and beyond to make you feel welcomed. Starting at the top Joe Kelly GM greeted us at the front door with a big smile and a great conversation. Then we had the pleasure to meet Emar Fernandez Assistant GM who was amazing.\nMr. Fernandez went over and beyond like no other manager we ever met with class. He is amazing person.\nLeonardoPacheco always smiling was the perfect host (navigator) he was amazing, nothing too big for him to handle). The list goes on Christian (Bellman), Jessica (PM\nManager), Brian (Supervisor), Loren (Supervisor), Ema\n(Housekeeper), Mariam (AM\nManager), Phoenix (FrontDesk), (Housekeeper), Mariam (AM\nManager), Phoenix (FrontDesk), Stefan (FrontDesk), Andrea (FrontDesk), Shanna (FrontDesk) and Vinny (Housekeeper) all gave top notch service and hospitality.\nEveryone always kept a genuine smile willing to assist you in all your needs. This is a memorable hotel based on excellent service.\nFirst choice for us to stay. Top NYC hotel that strives for excellence.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Stellar Stay at the Renaissance!","lang":"en","publishedDate":"2023-07-27","publishedPlatform":"OTHER","rating":5,"text":"We took a chance booking the Renaissance last minute and it paid off! Phoenix offered AMAZING customer service, from check-in to checkout. We showed up before 4pm checkin and Phoenix let us know he had a room available, however it was on the 35th floor right under the rooftop bar. He was kind enough to let us know that on the weekend we might be able to hear some music, but most people don't find it bothersome. In exchange, he guaranteed we would have an amazing city view. I seriously appreciated Phoenix being upfront with us, and we decided to take the room on the 35th floor. AMAZING views! We barely heard the rooftop bar with the TV on, so don't let that deter you! I will be coming back here again, no doubt.  Comfortable beds, great location and overall great customer service!","travelDate":"2023-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great hospitality","lang":"en","publishedDate":"2023-07-17","publishedPlatform":"OTHER","rating":5,"text":"The front office manger was excellent (Paul).\nAnything that we requested,he made happen.\nThank you for the great service.we will be back again.\nHe also  took us to the rooftop bar ,that was amazing.we had a great time at somewhere nowhere.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great service, excellent location!","lang":"en","publishedDate":"2023-07-07","publishedPlatform":"MOBILE","rating":5,"text":"First time in NYC! The staffs at Renaissance go out of their way to make me feel welcomed here! They put gifts and card in my room, and I really appreciate the personal touch. It is really an experience! The room is very clean, albeit it is on the smaller side. But hey, it is new york city haha. The bar has decent selections.","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":15530677,"title":"Underwhelming.","lang":"en","publishedDate":"2023-07-02","publishedPlatform":"MOBILE","rating":3,"text":"This hotel is just ok. It is nowhere close to the quality of normal Renaissance Hotels. It is dark, the restaurant is weak for breakfast, there is no lounge for frequent travelers, and you have to deal with a rooftop bar that is constantly taking up the elevators. The quality of the finishes in the rooms is suspect. The rooms are quite small. I ended up having to call security on multiple occasions due to significant noise. This is candidly my least favorite Renaissance worldwide. If you want a better one in the same brand stay at the midtown one which is much much nicer.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"The hotel is not safe","lang":"en","publishedDate":"2023-06-30","publishedPlatform":"OTHER","rating":1,"text":"I would like to report to the hotel that on 30.06, around 22:40, I was attacked by a woman who left the rooftop drunk. It is inappropriate and absurd to mix guests and extremely altered people. because I don't feel safe, I want to cancel the other daily rates and get a refund of the amount paid. We didn't feel safe in this hotel.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Not bad but much better choices in the area.","lang":"en","publishedDate":"2023-06-28","publishedPlatform":"MOBILE","rating":3,"text":"Hotel was fine.  The location is great.  The room looks nothing like the photos online. It’s dingy and dark whereas the online photos are light and bright.  Bar choices looked like a college bar - nothing even close to premium. Was told no upgrade was available ( even tho I didn’t ask ) but they weren’t really very full ( checked online ). . Also received no welcome gift . Asked about it when I left but they said my level doesn’t get one . My benefits state that I do get one. Didn’t even get water in the room . \nManager was nice -had to ask for her when employee refused my late check out - she gave it to me right away. \nWouldn’t stay here again - too many choices in new York and the price point on this hotel would indicate 4 stars but the hotel just isn’t that nice.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"hit or miss","lang":"en","publishedDate":"2023-06-12","publishedPlatform":"OTHER","rating":3,"text":"Our three complaints: staff service, amenity fees not living up to the expectation and the elevator.\nWe made a five hour trip by car to come to the city, we couldn't grab a spot outside the hotel for valet so we were about one or two spots away for now. We went in first and asked what we could do and we were basically told that we still have to pull up regardless of the busy street. I knew something like this would happen: it's the city and parking sucks. But it would've been nice if the staff at least tried to be helpful. It could've been a liability issue but they could've told us that. Check in itself was cold and it felt like they just wanted you out the way. At check out, right as we finished packing the car and got in (it didnt take very long), we were immediately told to move by either a doorman or valet. How can we do that when we cant even get to the road?? I understand, they need to pull around more cars, but being just told to move is especially rude. As someone who has worked in the hospitality industry for a long time, how you say things to customers can form nearly their whole experience and set the tone for their stay. \nThis hotel also charges you a $30 amenity fee which you can apply to food. The buffet breakfast was $35 per person I think, which is incredibly expensive since the selection of food that was just the basics (eggs, bacon, bagels etc). This was not ideal for us and not worth it either. In the evening, the menu wasn't as limited which is great because we were all able to get something to eat. But some of the pricing is ridiculous. I know it's supposed to be a \"higher end\" hotel, but half of the menu items I could get down the block for way cheaper and way better most likely. For a place offering so little for a credit you have to use in order to not be charged for it, they're really trying to give you a marathon for your money. \nThe elevator was very hard to use, half of the people we got into it couldn't work it either. The high-tech elevators with touch screens just simply don't work. \nThose complaints aside, there were staff members that genuinely cared about our experience. One front desk agent followed up with us about our housekeeping requests, the bartenders were very attentive despite their big crowds and very personable. Regardless of our feelings about the food, it was still very good and filling (but my chicken was dry). The hotel itself is beautiful and you can walk basically anywhere from it. We still walked to the \"major landmarks\" like Times Square, Central Park, museums... but we don't mind the walk. We were also able to request a mini fridge for our stay which was very helpful given that we brought some food with us too. I'm not sure if I'd stay again, but other things were able to make up for the things that made us feel it wasn't worth it. ","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Stay here if you need to be in Midtown","lang":"en","publishedDate":"2023-05-25","publishedPlatform":"OTHER","rating":5,"text":"Stayed for 4 nights on a business trip. Fantastic service from check in to check out. Friendly and helpful staff, comfortable lounge \/ reception area, comfortable bed and clean \/ modern bathroom with everything I needed. Good location for midtown or downtown visits. My colleagues wish they booked this place instead of their hotel haha. Didn't try the breakfast, or hit the fitness center or rooftop bar. Nice views.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Stay at the renaissance","lang":"en","publishedDate":"2023-05-09","publishedPlatform":"MOBILE","rating":5,"text":"The hotel was clean, the rooms comfortable. The bed and pillows were overly comfortable. All around pleasant experience. Would highly recommend going to this hotel. The bar in the lobby was cool and chic as well. Just wish we had more time in the city to enjoy the hotel more","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great Location","lang":"en","publishedDate":"2023-04-13","publishedPlatform":"OTHER","rating":5,"text":"My stay here was amazing. The services and facilities hotel provides were great. Food is the other thing I need to mention from this hotel which were delicious. Great location, easily accessible to major parts of town.","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"una exelencia de servicio ","lang":"es","publishedDate":"2023-04-01","publishedPlatform":"OTHER","rating":5,"text":"exelwnte servicio y atención  especialmente gracias a julio morales por su excelente atención  la seguridad  que ofrece el hotel  las facilidades  nos fuimos muy contentos y felices por su servicio  los recomendáremos a nuestros familiares y amigos ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15530677,"title":"Very friendly service","lang":"en","publishedDate":"2023-04-01","publishedPlatform":"OTHER","rating":4,"text":"Nice hotel with very very nice service and staff. I travelled with friends and stayed for eight nights. Two of us stayed at double room 705 and one of us had own room 708. Nice comfortable beds, lots of pillows - good ones - which was very nice. Hotel also gave free bottles of water every day which was super nice.\nSurprisingly little space for clothes.... very little closet in the double room. In the shower the water tap was little tricky but we learned to get hot water.\nWi-fi worked nicely. Rooms were cleaned nicely every day.\nThey had a breakfast buffet and served every morning scrambled eggs, boiled eggs, bacon, bagels, bread, fresh fruit, fresh strawberries and blueberries, porridge, yogurt and some sweet. Juices, coffee and tea. Some mornings they also served pancakes and fried potatoes as well as some kind of sausages. If you can't eat yogurt and don't like porridge.... quite a limited selection for eight mornings so some mornings we went to diner. \nLocation was ok - subway stations were quite close. Also Madison Square Garden where we watched hockey one night was in walking distance. \nIf I would choose a hotel for 8 nights' city break again I would choose a different location however. The kind where there are lots of good restaurants nearby in walking distance. But the hotel itself was nice and I could stay there again if just the location would be different. \n","travelDate":"2023-03","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Excellent customer service","lang":"en","publishedDate":"2023-03-24","publishedPlatform":"MOBILE","rating":5,"text":"I can’t thanks Leonardo and Chris enough for making mine and my wife’s stay for our anniversary super special! A suite upgrade, in room amenities and more, were truly amazing and that coupled with the amazing customer service of everyone at the property was above and beyond.\n\nGreat location, really cool decor, and excellent customer service make this property\nMy go to every time I’m in Manhattan!","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"ok but far from good","lang":"en","publishedDate":"2023-03-23","publishedPlatform":"OTHER","rating":3,"text":"Nice entrance, very good bellman...Julio makes you feel special.....they need more people like him.....Room tiny, nowhere to put anything...very noisy hallway at all hours...no refrigerator to keep a cold drink....overall a very fair hotel...had to call for towels daily....","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"I <3 Renaissance NYC!","lang":"en","publishedDate":"2023-03-12","publishedPlatform":"OTHER","rating":5,"text":"If I’m ever in New York, I’m always staying at Renaissance. Our room was closer to the rooftop, where it can get a bit noisy late at night. But, the view of the city was absolutely breathtaking so it was well worth it. Just pack some earplugs and you’ll be fine.","travelDate":"2022-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Five Star Service from Vincent ","lang":"en","publishedDate":"2023-03-04","publishedPlatform":"MOBILE","rating":5,"text":"Five Star Service from Manager Vincent. I stayed for New Year's Eve and January 1. Upon arriving at around 8pm, Vincent or Vinny, the manager on duty could see that I was having a rough night with the drenching rain. I called two nights before to inquire about a suite upgrade. When I got there Vincent was able to upgrade me to one of their finest suites. It was mind blowing for my birthday, and he really went the extra mile in making certain I had everything I needed for this special occasion.  He deserves to be the manager of this facility. His devotion to customer service truly shows, and he shines in his role and deserves a raise. Marriott, take not of this rising star in the hospitality industry. ","travelDate":"2022-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15530677,"title":"Lovely hotel with really caring staff. ","lang":"en","publishedDate":"2023-02-27","publishedPlatform":"OTHER","rating":5,"text":"Lovely hotel with really caring staff. \n\nI stayed for 5 nights with my wife, 11yo and 8yo boys in February. We were super excited about the kids first visit to NYC. Hotel was nicely located within reasonable walking distance of all the areas we wanted to see. \n\nWe had an unfortunate incident outside on the street just after arriving in NY, which had nothing to do with the hotel. It took the shine off our vacation. I mentioned it in passing to the hotel's 'Navigator' (like a super helpful customer liaison manager), Leonardo P, and he brought over the manager, Vincent C.  Even though my situation had nothing to do with the hotel, they wanted to help as were grateful that we had chosen to stay with them. They were ind enough to upgrade us to a larger room and even placed gifts for my kids in the room (and some wine for the grown ups). it was super thoughtful and helped turn the vacation around into an awesome experience that the kids will never forget.\n\nChelsea is a great location for exploring NYC, slightly away from the hustle and bustle of Times Square, but easy to get to. Like all places in NYC at the moment there is a homeless problem and you need to have you wits about you at all times of the day. But despite that it is still an amazing life experience to visit.\n\nOn behalf of my wife and kids, thanks Leonardo and Vincent for being so cool and caring, and thanks Renaissance Chelsea for being home from home for the week.","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Sleek new hotel ","lang":"en","publishedDate":"2023-02-22","publishedPlatform":"OTHER","rating":4,"text":"We decided to stay at this hotel as it is within walking distance to our relatives. As with many other hotels in NYC this hotel sits on a small plot of land and only has about 8 to 10 rooms per floor. The rooms are rather small but are well equipped with interesting touches. The property offers a small bar and restaurant on the main floor. Free bottled water is always available in the lobby which was a nice touch. Breakfast was included with our status and it offered a decent selection of items. As with many hotels in NYC this property also charges a \"resort fee\" without any resort offerings. You can use your $25 'non cumulative' credit at the restaurant or bar. The problem is that the bar is closed for part of the afternoon and if you have plans in the evening you won't be able to utilise your credit, convenient for the hotel but not for the guest. I wish that 'non resort properties' will give up charging such silly fees. The hotel shares one of the elevators with an external night club - it didn't bother us during our stay and we were on a high floor an had no negative experiences with either long lines for the elevator nor noise across the hotel.\nOverall it was a good experience and I can recommend the property to anyone staying around Chelsea and the Flat iron district.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Top Notch Service","lang":"en","publishedDate":"2023-02-09","publishedPlatform":"MOBILE","rating":5,"text":"I stay here 4-6 times a year. It’s convenient to my job but I have other options. I choose this property for the staff. Vincent Copobianco is super welcoming. Always makes me feel welcome. The property has a modern hip aesthetic and it’s quiet. Yes, amazing insulated windows. Get a high floor and you won’t hear any street noise.","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great hotel","lang":"en","publishedDate":"2023-02-05","publishedPlatform":"MOBILE","rating":5,"text":"Great hotel in NYC. Booking process was super easy on booking.com. Checking it was super fast and efficient. They offer complimentary snacks in the lobby and there’s a bar and restaurant downstairs. Included in your fees is a $25 charge you can apply to drinks or food you get from the restaurant or bar but if you don’t use it you loose it which kind of stinks. Elevators are very technological and a little confusing at times to use. But the hotel itself is very clean and updated. Smart tvs in room. The room itself was a bit small but very clean so we didn’t mind. We visited the rooftop club Somwhere Nowhere so this was a good location for that. Great stay for an overnight trip.","travelDate":"2023-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great location, comfortable beds","lang":"en","publishedDate":"2023-02-04","publishedPlatform":"OTHER","rating":4,"text":"I stayed four nights and the location is excellent, plenty of food, dining, great markets on either avenue near hotel.  The hotel is new and stylish. The room I felt while efficient felt very compressed.  There was a small desk and a minimalist desk chair and it wasnt terribly comfortable.  The bed was great.  I requested and got a mini fridge which was difficult to place anywhere given the room size\/layout.\n\nAs with many full service hotels in NYC, they add an 'amenities fee' that is frustrating.  You get some comp's in laundry and food\/bev credits but given the prices for anything there, you wont recoup it without going out of pocket further.  Most people I suspect don't get it back.  I find this practice as annoying and voiced my concern on checkout.  I wish they would do away with it and just reflect it in the room rate as things used to be that way.\nThe gym was alright, on the warm side in the basement. As others remarked there is a lively night club and a lot of people around the lobby and elevators.  They had a bouncer there and a dedicated elevator for the patrons of the club.  It was not a big deal waiting as the remaining elevators were fast and operating.  \nTheres no club lounge at this hotel for marriott elites, they give some points instead.","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"ok stay","lang":"en","publishedDate":"2023-01-25","publishedPlatform":"OTHER","rating":2,"text":"I stayed here in December. My stay was alright. Nothing exceptional and there were a lot of drunk people from the club next door in front of the hotel. I thought the hotel should have done a better job with crowd control.","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Excellent Stay","lang":"en","publishedDate":"2023-01-25","publishedPlatform":"OTHER","rating":5,"text":"We had a great experience at the Renaissance NYC Chelsea. All of the staff members that we encountered were friendly and welcoming. The room was clean, bed and pillows were very comfortable, the bathroom was nice. Overall an excellent stay!","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Different experience!!","lang":"en","publishedDate":"2023-01-22","publishedPlatform":"OTHER","rating":4,"text":"I stayed at this hotel for about 17 nights . And i changed my room 3 times at different nights because of the AC which wasn’t working properly. The last room they gave me has a great view of the empire state building . The complimentary coffee was always there also you could grab water at the front desk. Most of the front desk are perfect except a one or two who are not that friendly others were really helpful.\n\nThe breakfast was not on the room and it was ok . They haven’t tried to bring up new things or at least change some items so everything was always the same .\n\nThe most annoying part is the noise coming from the club which is located at the roof top of the hotel and specifically at the weekend wouldn’t let you sleep till 4 am . I had a bad experience of an extra noise from the room above me which gave me headache and i called the front desk several times so you could imagine paying around $300 p\/n and couldn’t sleep . \n\nThe worst part was the new years night i think it was Saturday night 1st of January the black guy was sitting in front of the restaurant and i asked if the restaurant is open which wasn’t. So he start talking to me and I politely answered that from which country i coming from and he talked about politics and the normal conversation.Later on he saw me again and told me how can i find you to say hi specifically at night ???? Which was disgusting. I don’t know how a personnel would let themselves to be this rude . I didn’t see him again .i hope the person who is in charge will take care of this . \nOverall experience was good . But since i pay cash to extend my stay and they ask for deposit as well i had an experience that they told me your balance is $16 which i asked please double check and they said oh yes it’s $116 !!  And I don’t know how the big hotel like this could made a huge mistake .and when i told that she said i gave you discount i hope you appreciate it!!! I paid almost $5000 for my stay and the extension.\n\nAnd last but not least when i moved to the second room at night i found the safe box is not open so the staff came and fixed it for me since the AC still didn’t work they gave me a new room for the next day when I supposed to change the room i took my stuff from the safe box and i found a sunglass cover .i called the front desk and told them shall i leave it here and they said they gonna send someone to picked that up . I gave it to the staff and one minute later he knocked at my door and said it is empty . I said i have no idea since I didn’t checked that and not even opened it . Later on the front desk called me and said the same thing !!! It gave me the feeling that i have to know why it is empty ???? So i think the person who pays 17 nights for this kind of expensive hotel obviously doesn’t need a sun glass . So definitely the next time i find anything will leave it there only so the housekeeping will find .","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15530677,"title":"Helpful, efficient staff and small, clean rooms in a central location.","lang":"en","publishedDate":"2023-01-20","publishedPlatform":"MOBILE","rating":4,"text":"This hotel had helpful, efficient staff and small, clean rooms in a central NYC location.\n\nService and check in at this hotel were lovely. But like most NYC hotels, rooms were on the (very) small side. \n\nThe large-ish shower was a delight. As were the provided small bottles of Pharmacopia shampoo, conditioner and body gel. Two small bars of Aveda soap for the shower and bathroom sink were also provided (and replace daily as necessary).  As were clean bath towels, hand towels, wash cloths and bath mat.  \n\nIn a tasteful rustic-modern style, the room was clean, quiet and the bed conformable.  \n\nIf I had one gripe, the outside of the windows were curiously *covered* in bird droppings, so what otherwise may have been a partial lovely sunset city view, was marred.  The window opened a sliver, which was great to let out steam after showering. \n\nThe room had a *very* mini, tiny closet space, barely wide enough for a winter coat, a jacket and one dress.  \n\nBreakfast was served downstairs for a fee. They hotel also served at its downstairs bar coffee drinks and a few items for “grab-and-go” breakfasts, such as fruit cups and a yogurt parfait,  Mini-bottles of water were available in the lobby at all times for guests. \n\nThe hotel felt safe and secure. The staff was great.  I would defiantly consider staying again while in the city, or in recommending it to friends whose criteria is a decent area for not too expensive of a price.","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"OUTSTANDING Stay, property and its staff","lang":"en","publishedDate":"2023-01-17","publishedPlatform":"OTHER","rating":5,"text":"We stayed at the Renaissance for one week from December 28th to January 4th, 2023. From the moment we arrived the check-in person asked how our flight was, if we were needing water or snacks and if there was something special she should know about our room preference.  She accommodated us with a room with a balcony but it was too small for us. That night she found us a larger room with 2 beds. We then ask for extra lamps as the room was a little too dark. We have Titanium status with Marriott and this allows us to request upgrades when available. The Later during our stay, we were moved to one of their suites.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Incredible experience!!!","lang":"en","publishedDate":"2023-01-11","publishedPlatform":"MOBILE","rating":5,"text":"Incredible experience!!!!!\nFrom the moment of the check-In to the checkout !\nThe staff is incredibly nice and attentive, they recognize you all the time, carefully attentive with your needs, housekeeping staff above and behind ! The location is just amazing, the rooms are incredibly nice and especially clean. Loved the design of the rooms, the balcony, and the entrance. \n\nFive star to the entire staff !!! Well done !!","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Modern Hotel in Chelsea","lang":"en","publishedDate":"2023-01-09","publishedPlatform":"OTHER","rating":5,"text":"We had a great experience staying at the Renaissance New York Chelsea.  This hotel is modern and clean.  We received friendly service checking in\/out as well as at the lobby bar.  There are a few Titanium perks, like free breakfast and a discount at the bar, but note that there are not any upgrade options for rooms with 2-beds.  But not to worry because the standard rooms are nice!  The bathroom is decent size, but dimly lit.  A safe and plenty of USB and standard outlets are included in the room.  Bring a noise machine to drown out the conversations, etc coming through the vent from surrounding rooms.  The adjacent club, Somewhere-Nowhere is worth checking out, but it is not affiliated with the hotel, so you're on your own there!  There are a handful of restaurants, bars, cafes nearby as well as the Flower District.  We will definitely consider this spot for our next trip to NYC","travelDate":"2023-01","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":15530677,"title":"Wonderful Stay!","lang":"en","publishedDate":"2022-12-20","publishedPlatform":"OTHER","rating":5,"text":"Just returned from staying at this hotel for 3 nights.  What a gem!  I was able to check in early and my room on the 17th floor had a nice view.  The rooms are not as small as I expected compared to other NYC rooms and were very clean.  The housekeeping dept was outstanding during my visit.  They were able to work around my schedule and remain friendly and efficient.  The front desk people both upon checking in and check out were great. I did have to have them correct my room and beverage credit that was not initially given.  But it was done in a fast, friendly way and they were able to call a Taxi without passing me on to somebody else.  The elevator situation was not bad. I think they may have worked out a better system.  We did encounter the patrons going up to the club \"somewhere, nowhere\" on the top floor but it seemed like they had their own elevator and hotel and\/or club staff were vigilant keeping the club goers away from hotel elevators.  The club I think was using some room in the lobby as a coat check.  Finally the hotel bar staff were great.  After coming in around 11:30 pm from a long day in the city I had a nice glass of win that I ordered just as \"last call\" was being given for drinks at the lobby bar.  I was not rushed in any way and as a matter of fact I was encouraged to sit, relax and finish my drink.  I saw the same bartender treat all of the bar guests with respect and efficiency - -  even when some were not returning the courtesy.  Will definitely stay here again.  ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Family","lang":"en","publishedDate":"2022-12-15","publishedPlatform":"MOBILE","rating":5,"text":"The lobby is warm and the bar is inviting. And so nice to have treats available! We love this Hotel!!! The staff is amazing!!!!! Christian was so sweet! The room was clean and spacious. Definitely will return to this hotel!","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15530677,"title":"No Elevator Access to My 18th Floor Room","lang":"en","publishedDate":"2022-12-03","publishedPlatform":"OTHER","rating":1,"text":"Renaissance dedicates 2 of their 3 operating elevators to a private club, leaving one functioning elevator for paying hotel clients.  As a result, the one elevator is jammed full all the time and people queue up to get to their rooms.   I had to walk up 18 floors to get to my room.  And, all staff know it is a problem as I even passed two cleaning staff in the stairwell as they know the one elevator is full of paying clients.  To top it off, the several elevator attendants working the night club were rude, telling us to stand back away from the two working elevators servicing the night club.  This hotel solves for serving the club guests and punishes the hotel guests.  It may be the worst hospitality experience I have ever had.  I not only will never stay at this hotel again, I’m taking all Renaissance hotels off my travel plans in the future. ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"When staying in NYC","lang":"en","publishedDate":"2022-11-28","publishedPlatform":"MOBILE","rating":3,"text":"There was leakage in our bathroom on 2nd night. Had to ring staff THREE times to get someone up to check the leakage. We had to shift rooms at 11+pm! Rooms shifted was smaller and not to what we initially had. The very next morning we had to shift to another room lower level and no view. Reception mentioned that there will be a compensation for the inconvenience but upon checking out nothing was being compensated.\nConnection to room WiFi was complicated. It could have been simplified since it free WiFi. Why all the hassle to make payment and refund later. \nThe only thing that was great was that there was $21 usd food and beverage credit included in the hotel package.","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great hotel, good location","lang":"en","publishedDate":"2022-11-15","publishedPlatform":"OTHER","rating":4,"text":"Some reviews were critical, but we enjoyed the Renaissance Chelsea.  Staff was very accomodating, room was quite and quite comfortable.  As others have said, don't get stuck under the rooftop bar;  The front desk advised we did not want to be there due to the noise.  Looks like a lively place however.\nWill stay here again.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Lackluster property with noisy rooftop nightclub - Beware if you need quiet or upscale stay","lang":"en","publishedDate":"2022-11-13","publishedPlatform":"MOBILE","rating":2,"text":"My room and experience was nothing like the website describes! I was meeting my friends who were running the marathon and really needed a nice long relaxing quiet weekend. I had noted in my profile that I wanted a quiet room away from elevators, etc., yet when I went up to my room on the 35th floor it was a bit rough around the edges. the view was fantastic of the city, yet that didn’t make up for the fact that it was extremely tiny, threadbare towels, tiny bathroom and the list goes on. Unbeknownst to me, at around 11pm the 1st night I was hearing loud club music, thinking it was in the hallway or something. No, it carried on and at midnight called the front desk. They informed me it was the nightclub a few floors above me on the rooftop, which they failed to mention at check-in. after scrambling, they moved me to an even smaller room until they could find something they next day. Of course, by then it was 1pm & had a hard time getting back to sleep. When I got back later the next day to get a different room, management was nice enough to take off the daily fee + give me a couple of breakfast vouchers. Granted the $25 daily fee is steep and not entirely sure what you get for that. The room I was moved to was away from the nightclub which was a plus, I wasn’t upgraded which you would think that they would have done something for my troubles. The towels were threadbare in this room as well and looked like the room could have been refreshed as it was beat up pretty bad. For the price, I would have thought that the rooms were a bit more upgraded like the pictures shown on the website. \nNo room service, tiny tiny tiny gym, no ice machines that I was aware of, plastic cups in the room, 2 towels that were very worn and a host of other negatives that I won’t be returning to this property again. The manager was nice, but I would say that this is not worth the money paid as the overall experience was lackluster. \nIn addition, I was not greeted as a Bonvoy member, nor given any amenities for my 4 night stay.","travelDate":"2022-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Ren Bon Voy in Cheslea","lang":"en","publishedDate":"2022-11-11","publishedPlatform":"MOBILE","rating":5,"text":"Hotel in NYC - so far, the lobby is terrific! There’s a short wait for our early check in but the front desk clerk convinced us that it would be worth it to keep the room assigned. The bday celebration has landed in Manhattan and happy to be here at the Bon voy property.","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Good but far from great","lang":"en","publishedDate":"2022-11-01","publishedPlatform":"OTHER","rating":4,"text":"The hotel is new and nice. The rooms are well decorated and high spec. The air conditioning works brilliantly. The room view was great. \n\nI wish the rooms was bigger, but it is NYC. I also wish there was more drawer space.\n\nThe service at the hotel is generally good. Every time I asked for towels they ignored how many I asked for and brought 2-3x as many! The room didn’t have a mini fridge and they brought one over quickly. \n\nIt’s a bunch of little things that prevented me from giving it more stars. \n\nThe breakfast leaves a lot to be desired. It’s a higher end version of what you’d get at a Residence Inn. It was also consistently cold because no one lit the burners under the metal trays - at least two of the three things (eggs, potato and bacon) were off every day. One day there was no hot water only coffee. If you asked the staff they’d fix it but you had to ask. \n\nThe hotel rooftop pool - we never figured out how to access it. We were told it wasn’t open “until the fall, you know that season before summer”. That was part of the reason we picked the hotel - to be able to use the pool. However there was one floor where there were parties. It was loud at night. I thought this was the rooftop bar but that can’t be right if it is closed until the spring. \n\nThe WiFi cut in and out a couple of times during our stay which made business Zoom calls challenging. Only a couple of times but enough to be irritating. \n\nAnd one day they didn’t come to clean our room until 3pm. And they only clean until 5pm. That isn’t a big deal but it meant no room cleaning that day. \n\nThe other thing that got me is that the hotel charges a $25 daily fee, but gives you back a $25 credit on food (if you spend at least $50) and does the same with laundry with a $20 credit (if you spend at least $25). Our little one needed some baby clothes washed bc of an accident. We gave the front desk a few items and labeled the baby stuff as best we could given the form is designed for grown ups. They decided to charge us $12 for a onesie when men’s undershirts are charged $9. Weird nickel and diming behavior. \n\nI told my wife this plays tries hard to be a cool boutique hotel and give off that vibe, but some of the things make it feel a lot more like a Residence Inn. I think if we had to do it again we’d rather stay at the W Hotel in Union Square. Much better experience all around.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Shoutout to Julio!","lang":"en","publishedDate":"2022-10-27","publishedPlatform":"OTHER","rating":5,"text":"Great hotel and super friendly staff! Shout out to Julio who was always in such a great mood and super helpful! The rooms are spacious enough especially for NY standards and CLEAN! Would def stay there again!","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Julio is FANTASTIC!","lang":"en","publishedDate":"2022-10-27","publishedPlatform":"OTHER","rating":5,"text":"Julio at the Renaissance New York Chelsea Hotel was fantastic. He always had a smile on his face - any time of day or night. And he would often be dancing in the lobby to put a smile on my face. He was also very helpful when checking in or checking out. Thank you Julio!","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Ondermaatse beleving","lang":"nl","publishedDate":"2022-10-19","publishedPlatform":"MOBILE","rating":3,"text":"Goed gelegen hotel. Kamer en badkamer ruim voor New York. Minpunt was dat men de eerste dag onze kamer en badkamer vergeten was te kuisen en de bedden op te maken. Dit is zeer frustrerend na een lange dag NYC.\nDaarenboven was het rooftop zwembad gesloten zonder ons te verwittigen.\n\nZeer Onaangenaam was dat ze 2x een garantie hebben genomen op mijn Visa kaart waardoor deze was geblokkeerd. Niet echt klantvriendelijk. Ik ga er niet meer terug.","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15530677,"title":"Good enough that I want to try it again next time I come visit","lang":"en","publishedDate":"2022-10-06","publishedPlatform":"OTHER","rating":4,"text":"I had a brief stay here in a small room on a lower floor.  Sleep quality was better than expected (esp wrt noise and light which I am sensitive to both).  Elevators were reasonably quick and I was nervous since there were only really 3 in action.  The front desk was helpful and I loved how they just had water bottles out - need me some hydration after flying in and staying out!  There's not really a bar scene but since you are charged a resort fee or something, you can just redeem a glass of wine or a drink in the evenings which we did.  I did check out the lounges\/bars at the top - 1 floor had a swing\/jazz dance thing going on - not quite my scene but was cool to peak in.  Didn't get a chance to check out the gym\/pool which I very much want to next time.  What I really liked was the location - so walkable.  Lots of things nearby - stores, restaurants, etc.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"The Most Amazing Stay","lang":"en","publishedDate":"2022-09-26","publishedPlatform":"OTHER","rating":5,"text":"Great location, interior, bar, restaurant and nightclub. I really enjoyed my stay and the staff were all incredible lovely. Big thank you for upgrading me and leaving treats in my room for my 30th birthday. \n\nThe location was perfect, 15 min walk to midtown and 15 min walk the other way to downtown.\n\nA special shout out to James at the front desk for being incredible polite and also to Svetlina at the bar. She was lovely and makes the best cocktails. Personal favourite the Margarita & Espresso Martini - I have tried a lot and these were the best I have had.\n\nOnly critique would be to warn guests on high floors of the noise from Somewhere Nowhere.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15530677,"title":"Disappointing","lang":"en","publishedDate":"2022-09-16","publishedPlatform":"OTHER","rating":2,"text":"I am currently at the hotel, and I am very disappointed.\nThe strong points are the location, the view of the rooms (on the Empire state building) and the comfort of the mattresses.\nbut the customer experience is disappointing.\nWe booked 7 nights and during our week, we thought we would have access to the hotel's rooftop and swimming pool. Impossible ! unless you book like other non-hotel guests.\nThe most disappointing thing is that we are leaving in 3 days. Our plane is in the evening and we have to leave the room for noon. I wanted to book 1 more night, to enjoy a few more hours (to take a shower and be fresh for my evening flight). The hotel told me ok for 850 € per night extra (twice the usual price). I expressed my astonishment, and reminded that I only needed the room for 6 hours more, they offered me 4 hours more for 450 dollars ... what a shame!\nspending a week in their establishment, I expected more consideration.\nThe experience is unsatisfactory.\nFor the same location, I would recommend other neighboring hotels (Motto Hilton for example).","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"The best employee julio !!!!","lang":"en","publishedDate":"2022-09-11","publishedPlatform":"OTHER","rating":5,"text":"julio is the best employee, very nice friendly and always available. it was the best of this hotel . when you arrive at the hotel ask for the best employee JULIO!\nThe hotel was good but the food is very bad.","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"What a pleasant surprise!","lang":"en","publishedDate":"2022-09-01","publishedPlatform":"OTHER","rating":5,"text":"I moved from a Times Square hotel where my room was old and the size of a closet to the Renaissance Chelsea.  I used points for the stay and the manager Jessica greeted me by name and told me that she had been working on my reservation and was happy to upgrade me to a suite.  They offered the standard points and also offered points in lieu of breakfast, along with a late checkout.  This was wonderful and much appreciated.  What I appreciated even more was the beautiful, spacious, clean suite with a fabulous view of the Empire State Building and New York City.  Beautiful art throughout and nice clean furniture. Even though the room as ADA, it was still nice and I felt so relaxed in this space vs coming from a space that was brown, small, noisy and hot\/humid. Oh, they also gave me a brand new (still in the package) compact umbrella for the threatening evening rain.  - I will definitely stay here on my next trip to NYC!","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great location! Nice rooms.","lang":"en","publishedDate":"2022-09-01","publishedPlatform":"MOBILE","rating":4,"text":"Great location. Nice hotel. Main floor outdoor seating is lacking ambience but inside small bar was decent. Free water bottles and breakfasts were very good! Room was nice, only complaints were that ESPN didn’t come in properly. They were aware of this ongoing issue but have not corrected it. Also, great rooftop terrace (39th floor) with a pool but not owned by them so access was difficult and limited.","travelDate":"2022-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great stay!","lang":"en","publishedDate":"2022-08-30","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here for a week and had a great stay.\nUpon arrival we were lucky to meet Miriam who went out of her way to make sure we had a great stay.\nAs Platinum Elite we were upgraded to a larger room and offered free breakfast.\nThe breakfast buffet needs to improve ( it doesn’t even have cream cheese…)\n\nThe hotel has one major disadvantage : it has a rooftop bar ( that is not part of the hotel but the bars guests still use the hotel elevators and walk around the lobby, sometimes drank and late at night).\n\nAll in all, a very good stay , not the first and definitely not the last!\nLuckily we met Miriam who made this an excellent stay!","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Lovely stay","lang":"en","publishedDate":"2022-08-25","publishedPlatform":"OTHER","rating":4,"text":"I was a little nervous to stay here based on the reviews. In the past we have stayed at the Essex House and the St Regis. We are Titanium and I do consider myself to be picky. Having said all that we really  enjoyed our stay at the Renaissance NY Chelsea. The hotel is stylish, very welcoming. I thought every single employee we had interaction with was pleasant. I had requested a low floor due the night club noise. We were on the 4th  floor and I did not hear a thing.( not even street noise)  No view from the room but that was ok since we were not in there much. We only had trouble getting an elevator once. ( Saturday around 7pm) Great location. We walked everywhere! The pool is not part of the hotel but guest have access to it certain hours. We just popped up for some photos. It is an amazing view. We had the American breakfast one day which was perfect. I would stay here again. Really a great value, which is nice when you need to get 2 rooms! Also the area is safe. I was worried. And if you like gelato Anitas in flatiron is amazing!!!","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great experience- wonderful staff.","lang":"en","publishedDate":"2022-08-21","publishedPlatform":"MOBILE","rating":5,"text":"Beautiful hotel. Must acknowledge Julio, bellman He is so friendly and helps any way he can. This is a man who goes out of his way for guests. He always has a smile on his face and makes you feel so welcome. I wish every hotel I stayed at , had a Julio. Every time we entered the lobby he greeted us with a warm hello and smile. Julio made our stay memorable and we look forward to seeing him when we return .","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Very Misleading","lang":"en","publishedDate":"2022-08-17","publishedPlatform":"MOBILE","rating":2,"text":"The pool was not active and there is a fee to get to the rooftop because supposedly the rooftop and hotel are not the same entity. Very poor advertising. My wife and I had to book another hotel from all the issues we encountered, one of which was the water was cold.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Don’t stay here","lang":"en","publishedDate":"2022-08-12","publishedPlatform":"MOBILE","rating":1,"text":"Terrible experience. I have a credit card which I specifically instructed to not charge, only for the deposit. Ofcourse this amateur hotel charged it. I replaced the card and ofcourse they charged the same amount on the second card, the little problem is, that they never returned me 600$ to the first card. 1,5 weeks I AM WAITING, I am calling to the accounting department, nobody answers. I am calling to reception, answer one in 5 times and then they tell me to call the accounting department. Zero responsibility for stealing from me. I have to waste my time calling you 10 times? \n\nThe downstairs bar is pathetic, the bartender was never there, he didn’t set his priorities even when he was, never asked who was first, so I DINT GET A SINGLE drink in 10 days staying there. One time my friends got a drink finally, we waited maybe 30-40 minutes too. \n\nThey were always chatting in reception and the lines were huge, nobody answered the phone. \n\nThank you for stealing from me and being the worst hotel I have ever stayed at in NYC. Pathetic","travelDate":"2022-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15530677,"title":"A sad goodbye lightened up","lang":"en","publishedDate":"2022-08-03","publishedPlatform":"OTHER","rating":5,"text":"It’s been a rough few weeks for me. Mom was diagnosed with cancer and I have to travel abroad to help her during her treatment. I will be gone for two months. T’was two days before I leave… and needed to celebrate my boyfriend a little earlier before I leave and we chose this hotel.\n \nBEST DECISION!! \n\nThey surprised us with an amazing selection of desserts and a bottle of wine with a hand written note from the amazing Leonardo Pacheco. I hadn’t even met him before he delivered the treats. \n\nI had however mentioned the celebration to the front desk agent Wesley who not only organized for us to have a beautiful room on a high floor with amazing views. But also ensured he shared with Leonardo to deliver the delights.  \n\nI chose this hotel because I had family in town a couple of months ago and they stayed here. They said it was the best stay they had in Manhattan. The front desk agents, the housekeepers, the door men and everyone we encountered were exceptional. At the time because I didn’t stay, I only visited my family, I didn’t get their names. But it was because of the way my family raved about the hotel that I decided to give it a shot. Now because of this exceptional service they have gained a loyal local! I want to shout from the rooftops how great they are. \n\nThank you!!! I needed this. It’s been rough and I have a tough journey ahead. You definitely made my last summer night in New York memorable.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Now my go-to hotel in NYC","lang":"en","publishedDate":"2022-08-02","publishedPlatform":"OTHER","rating":5,"text":"One of the best hotel experiences I've had in numerous trips to NYC.   This hotel checked all the key boxes for me.   Quiet rooms, clean, comfortable beds, great location, friendly & professional staff, and good amenities.\n\nI'll list the few small negatives first - small room - although OK for NYC, room windows directly across from another hotel so limited privacy, no in-room mini-fridge although they could bring one up, and no Marriott club room.\n\nThe positives far outweighed the negative and while I'm not often in Chelsea, this is on my list of go hotels to stay at in the future.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Amazing stay at Renaissance Chelsea Hotel","lang":"en","publishedDate":"2022-07-31","publishedPlatform":"OTHER","rating":5,"text":"My family and I had such an amazing time at the luxury New York City hotel. Our room was clean, modern and with the best NYC views. We enjoyed swimming at the Rooftop pool lounge and shopping in the local area just blocks from Macy’s Herald Square. The Front Desk staff was the best and went out of there way to accommodate our needs. I definitely would recommend staying here if you are visiting NYC and we look forward to going back again soon.  Ishmael Alvarado & Family. (Marine Corps Veteran)","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Beautiful Hotel with Stunning Rooftop","lang":"en","publishedDate":"2022-07-30","publishedPlatform":"OTHER","rating":4,"text":"Stayed here on a business trip for a few days. The hotel is beautiful but the lounge upstairs and rooftop is absolutley stunning. Service on rooftop was amazing compared to what I have experienced elsewhre in Manhattan. Will be coming back for another stay.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15530677,"title":"Nice Hotel no respect for guests","lang":"en","publishedDate":"2022-07-23","publishedPlatform":"MOBILE","rating":1,"text":"Nice hotel but we realized that the pool\nIs only available from 8 am to 11 am on Sunday because the poll is turned into a private bar. Please avoid this hotel they do not deserve your business with this attitude especially when is not specified in the hotel description. Shame on them","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Horrible stay","lang":"en","publishedDate":"2022-07-12","publishedPlatform":"MOBILE","rating":2,"text":"Stayed here for business expecting a luxury experience and felt like I was at a two star motel. How can this be a 5 star property with hotel rooms with no hot water, horrible restaurant service and incompetent front desk every time you call with a request. The only luxury experience I got was up at the rooftop\/pool as service & hospitality  was impeccable for afterwork cocktails. They had amazing live jazz bands on our visit. Will come to visit the rooftop but will not be staying here again","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":3,"locationId":15530677,"title":"Private club nonsense and resort fees","lang":"en","publishedDate":"2022-07-11","publishedPlatform":"OTHER","rating":2,"text":"Traveled from Bay Area for a week of meetings in NYC office with coworkers from London.\n\nBooked based on it being a Marriott (expectation of quality\/comfort), having a rooftop lounge area, and a pool.\n\nCould not use the rooftop lounge\/bar because it is a private club. Were told after waiting in line one late afternoon that we needed hand stamps and to visit the hotel desk to get them. Bouncer\/host also wanted us to get back in line to await being permitted to enter. Ultimately this was too much hassle for an after-work drink so we went elsewhere.\n\nNot very welcoming.\n\nExpected to be treated as a welcomed guest all week, not jump through hoops to get access to rooftop lounge after work.\n\nHotel charges a $25\/day resort fee. Considering how hard it is to use the \"resort\", I found this to be ridiculous.\n\nLocation, views, room comfort, and lobby staff were very good. Just miffed about having no place at the hotel to spend down time during the long work week.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15530677,"title":"Not recommended","lang":"en","publishedDate":"2022-07-10","publishedPlatform":"MOBILE","rating":1,"text":"Room did not have any fridge or water during entire our 5 stay. Peak summer time and 5 star hotel with no fridge and no water \nNever seen in life any five star hotel like this.\nBreakfast is paid but very limited option. You are forced to pay 15-20% gratuity as part of the bill despite poor breakfast option","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Loved Our Stay!","lang":"en","publishedDate":"2022-07-01","publishedPlatform":"OTHER","rating":5,"text":"Had a wonderful 2 night stay with my wife and 2 boys (age 10 and 12)!  The bellman, Julio was awesome and super nice - teaching my boys dance moves in the lobby, and Mariam at the front desk was lovely as well!  Beautiful property, perfectly located for our NYC getaway! View from our room looked right out at the Empire State Building - short walk to Mad Sq Park, the High Line and Mid-Town.  We were will definitely be back!","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15530677,"title":"Worst Hotel Experience Ever","lang":"en","publishedDate":"2022-06-28","publishedPlatform":"MOBILE","rating":1,"text":"The rooms are not maintained. The phone didn't work. The building's hot water was out of service for 24 hours. The shower head sprayed water everywhere except out of the shower head. The Front Desk resolved NONE of our issues (other than to offer us 5000 marriot points to appease us --- when each room was costing us 58,000 points or $450+++).","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15530677,"title":"Bellman","lang":"en","publishedDate":"2022-06-26","publishedPlatform":"MOBILE","rating":3,"text":"Julio was amazing! A lot better than the other people at the hotel. The rest of the staff was okay except for the rude guards at the door who asked if we are guest of the hotel almost everytime we walked in the hotel and it was extremely annoying and belittling to be asked that when we paid so much to stay at this hotel.","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"You can hear the party in your room!","lang":"en","publishedDate":"2022-06-21","publishedPlatform":"OTHER","rating":2,"text":"I stayed last night. When I got to my room, I could hear loud thumping from the pool party going on the roof (was on floor 35). Was told all they could do was re-locate me. When I asked why I wasn't warned about this, they simply said I should have been. Question: why put guests in rooms where they are going to be disturbed...at a \"nice\" hotel like this? Desk people rude about this too like I should have known. Will NOT be returning.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Stay somewhere else","lang":"en","publishedDate":"2022-06-19","publishedPlatform":"MOBILE","rating":3,"text":"This hotel has real potential but there are too many inconveniences to not note them. \n\nTLDR: I love Renaissance properties but this one left too much to be desired. \n\nPros-\n* Beautiful newer property. One of the best Marriott hotels I’ve stayed in the NYC chelsea area. \n* Plenty of bottled water provided complimentary at the front desk. \n* the property’s gym is adequate. Good amount of space and towels\/bottled water available + core gym necessities.\n\nCons—\n* Service is severely lacking at ALL areas of this hotel- starting with the front desk but I will say the absolute worst service was the staff at the Cotto restaurant for breakfast (more on that shortly)\n\n* $25 “destination fee” for no amenities except bottled water is astonishing. They will offset spending at the hotel on food and beverage with this fee - and trust me, you’ll use it at that nightmare of a breakfast restaurant - Cotto. \n\n* Cotto - where do I begin? I was encouraged when I checked in and learned that Cotto honored either a complimentary continental breakfast or $20 voucher towards breakfast for Platinum elite. This is where everything turned sour with my experience at this place - I visited 4 mornings for breakfast, the first morning was painfully slow (almost 2 hours for 1 person to have breakfast - a simple omelette with toast) and the 3rd morning they refused service due to being “too busy and understaffed” — on a Saturday! The prices at this restaurant are a joke - $20 does not get you much folks. Coffee is $6, juice is $8, toast $4, oatmeal with 3 blueberries and 1 strawberry $18, an omelette that you can only have bacon in for a protein (?) but you could order sausage, salmon on the side of course.  And the rudest staff I have encountered at any Marriott property to boot. It was as if they were really doing me a favor to bring salt and pepper to the table. \n\n* Rooms are very small. I was upgraded to a room with “20% more room” but really can’t imagine what a smaller room would look like. I did have to use the desk regularly for work and was traveling alone and it was very tight quarters. \n\n* Pool is not for hotel guests. They should work on allowing some dedicated hours for hotel guests at the pool considering we are inconvenienced by the club the entire stay. \n\n* check in was a disaster. Granted I requested an early check in and understandably those are not guaranteed - however, I did the mobile check in and then chatted w the front desk and they said they could not add me to their “waiting list” for check in until I arrived in person at the property - what is the point of mobile check in if you require folks in person? Seems redundant and the hotel should consider using the mobile check in as their waiting list since that’s what every other Marriott property does.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"POOL is not for hotel guest!  Cotto restaurant is a mess! Small room but nice views!","lang":"en","publishedDate":"2022-06-06","publishedPlatform":"MOBILE","rating":2,"text":"Pool is an entire different business, NOT AN AMENITY for hotel guests!  TripAdvisor AND Marriott needs to update this critical information! Plus, during the busy weekends it causes problems for hotel guests with noise and ability to use two out of four lifts!  All reviews about issues with lifts is indeed correct because we experienced it!\nWe got ‘upgraded’ to a corner King on the 27th floor, which offered incredible views but the room is the size of a walk-in closet!  We were offered a 20% bigger king room starting our second night, but who wants to move!?!??\nOur shower drain was clogged constantly and never fixed by hotel!  We just took our own action to make it work. Cabinet hinge broken which make 50% of drawer space very unusable. \nThey offer Marriott Platinum members a good fixed bfast at their only restaurant Cotto, but the restaurant is small and outdoor is not open. When we do pickup order, it’s always wrong!  \nThey also offer a daily CR of 25.00 to offset the resort fee, nice idea but with only one restaurant it’s tiring for a 7 days stay!\nOverall impression, nice newer property if u don’t mind all the inconveniences, and don’t overpay!  I would say 200 or lower would be reasonable.","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"So-so","lang":"en","publishedDate":"2022-06-06","publishedPlatform":"MOBILE","rating":3,"text":"Things I wish I had known: 1) They charge a $25\/night resort fee, you’re able to use this in the restaurant, bar, laundry etc, but they don’t tell you this at check-in so didn’t know until check-out; the laundry is closed on Sundays. Felt misleading. 2a) The rooftop and pool are not available to hotel guests; if you want to visit, you have to reserve with a $100\/per person minimum. Misleading given the photos, was hoping to have a quiet place to do some work outside. 2b) The rooftop is actually a club so on the weekend there’s a long line of club-goers outside the hotel and one of the inside elevators is dedicated to the club. I didn’t have any noise issues on the 21st floor but definitely something to check. \n\nOther than that, the rooms are new and the location is convenient, especially for coming in and out of Penn Station. The service was so-so.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Excellent service with kindness","lang":"en","publishedDate":"2022-06-05","publishedPlatform":"OTHER","rating":5,"text":"I stayed for four nights at the hotel recently and had a wonderful experience. It was a last minute trip due to a personal emergency, and the hotel team ensured that I had a pleasant stay. I was placed in a quiet room on the lower floors, which was calming to come back to each evening.\n\nThanks to Paul and his team, including Amani, Omar and the folks at Cotto restaurant, I really appreciated every interaction, your professionalism, but even more so your kindness.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15530677,"title":"Not Ready for Prime Time","lang":"en","publishedDate":"2022-05-30","publishedPlatform":"MOBILE","rating":1,"text":"A colleague and I recently booked a few rooms, 4 nights, mid-week, for a business engagement hosting out of town visitors in NYC. Because I was working, I needed a few amenities: room service, shipments to the front desk, a quiet room…and not much more. Upon check-in it became apparent that Renaissance Chelsea hotel was challenged in providing these very basic amenities, for the “bargain” rate of $600-$800\/night, for a single king room. After flying in on a red-eye from the West Coast, upon check-in, I was told the room I booked would not be ready until later in the day. I had to point out the actual calendar date to the reception associate, and also remind them that I had specifically booked the room a night in advance in order to check-in when I arrived early in the day. Once that was sorted out, I made my way to said designated room, only to find that the room key was inoperable.  Though it was cumbersome and time consuming, I was moved to another room. \n\nWhile the hotel did make an effort to accommodate my room request (quiet and away from the club on the 30th floor), the hotel restaurant and morning room service was among the worst I have experienced, anywhere. I was required to rise early and attempted to order in-room delivery of, 1) a pot of tea, and 2) toast. Both items appear on the in-room dining menu. First morning, I was told by the woman running the dining service, “No toast. Only bread.” Day two, I attempted to refill my tea cup with hot water directly FROM the restaurant downstairs, and was informed by the SAME woman, “No hot water.” A short walk down the hall to the coffee station revealed, a) coffee to go, b) hot water, and c) all the necessary accoutrements (cups, milk, sweetener, etc.)  This woman was by far the rudest, most hostile “hospitality” worker I have encountered, anywhere. It is worth noting that my requests were made politely and patiently, and I have no pre-existing gripe, disagreement or relationship with any of these people.\n\nFrom there, items that were shipped to the front desk for business purposes were misplaced.  I was told they had not arrived (they had, and surfaced after much back and forth and several phone calls.) \n\nThe worst experience of the stay was when a tragic incident occurred on my floor in the room across the hall. I returned to my room one afternoon, and encountered several NYPD officers stationed outside the door. I asked if there was cause for concern, and was not fully satisfied with the response. Leaving the room an hour later and encountering two new NYPD, I inquired again if there was cause for concern. The officer then explained what had happened, and a short time later I witnessed emergency workers pushing a gurney up the hallway. It is worth noting that at no time during my 4 days as a guest did the hotel notify me that there was an “incident” and I was likely to encounter this scene upon returning to my room. Nor did they offer to move me to a new room…or offer any explanation whatsoever. Once the matter was resolved, the room remained sealed with NYPD tape for the remainder of my stay. Come ON, Marriott! I expect more from a company of this size and reputation.\n\nWe paid more than $3,000 for a 4-night stay accompanied by some of the worst service I’ve encountered, anywhere. I will add, there was one very helpful “navigator” named Leonardo who deserves props for good customer service. Also, the rooms were clean. Aside from that, this hotel needs a lot of improvement. Cannot recommend.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Highly recommend staying in Chelsea at The Marriott Renaissance. Our Bellman, Julio was so helpful and friendly with us","lang":"en","publishedDate":"2022-05-30","publishedPlatform":"MOBILE","rating":5,"text":"Our Bellman, Julio, from the Dominican Republic is so terrific!  He’s very kind, helpful and friendly.  And he’s a great dancer!  The hotel is very clean and bar had a decent wine list.  We used the gym facilities each day where there is bottled water and fresh towels of course. It has become our favorite place to stay in NY","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15530677,"title":"Good NYC hotel","lang":"en","publishedDate":"2022-05-30","publishedPlatform":"MOBILE","rating":4,"text":"Pros :\n- front desk staff were wonderful and truly understand the art of customer service.\n- room (albeit small, but standard for New York) had very high ceilings on the 11th floor and are new and fresh\n- restaurant was good.  The food was tasty and moreover the staff were very friendly and accommodating.  Everything was served with a smile and they went out of their way to accommodate my family.\n- location was excellent for my needs.  I loathe Times Square and tourist traps, so this was a wonderful location in Chelsea.  We are a walking family, so walkable to things we like to do in NY (Flatiron, Madison Park, etc) but may not be as good  for people who want to spend more time in the crowded chaos of Times Square.  It is a very short Uber ride to the Theatre District.\n- I read other reviews complaining about noise.  I heard nothing from our neighbours and I heard no noise from the rooftop bar or the street.  It was very quiet.  The 11th floor was perfect!\n\nCons : \n- elevators are SLOOOOW.  Four elevators, but one tends to be reserved for private rooftop club not available to hotel guests. \n- rooms are dark.  Needs more lighting.\n- it’s disappointing that the rooftop pool isn’t available to hotel guests.  It had previously been advertised as a hotel with a pool, but things have changed.\n- for guests who would like more space, the hotel only has a limited number of suites, so it is hard to book them.\n- the bartender and the housekeeping staff seemed stressed.  Nothing egregious, but nowhere near as friendly as the front desk staff or the restaurant staff.\n\nOverall a decent stay.   I would consider staying here again.","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":15530677,"title":"Avoid this hotel","lang":"en","publishedDate":"2022-05-27","publishedPlatform":"MOBILE","rating":1,"text":"Find somewhere else to stay!!  Room was small but perfectly ok. Check-in was friendly and efficient. But the hotel is awful for 2 reasons. 1) there are 4 elevators but when leaving at 6pm it took nearly 30 mins to get one (2 were permanently in use by housekeeping and the 3rd was used by a guy from the rooftop who said he doesn’t work for the hotel so he wasn’t letting anyone in).  2) breakfast is truly abysmal","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Personal and warm","lang":"en","publishedDate":"2022-05-21","publishedPlatform":"OTHER","rating":5,"text":"Everyone we encountered at the hotel was personable and hospitable.  The front desk staff is particularly warm and accommodating, and the hotel itself is unexpectedly inviting and almost cozy, especially for a large corporation hotel in NYC.  The location, at least for us, couldn't be more convenient - nestled between Whole Foods, 2 Bros Pizza, and Whole Foods, your choice of fresh grocery products or restaurant food is yours, and the area feels safe with multiple attractions within walking distance including Madison Square Garden.  On a personal note, my husband and I must mention Jessica by name, as she is absolutely delightful, attentive, patient, and so friendly and helpful - and made our stay and trip awesome!  Paul is the manager and oversees an excellent, affable, and helpful front desk staff - Lauren and Lucy (now in sales) are wonderful too!  Pauls's suggestion for Brooklyn Bagel (just a block or two away) was perfect!","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great Stay in the City","lang":"en","publishedDate":"2022-05-19","publishedPlatform":"OTHER","rating":5,"text":"Julio the bellman was the master of great first impressions! Greeted us with a smile and bottles of water! Neighborhood was decent and not touristy. Rooms were clean, bed was comfortable and shower had great water pressure.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Wonderful Staff!","lang":"en","publishedDate":"2022-05-17","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here for 5 days and we’re very impressed with the staff. Julio and Cristian were so helpful with all our luggage, and getting us cabs. They were so friendly and nice, and treated us very well. Julio’s dancing always made us smile. I didn’t get her name, but there was a very attentive and friendly waitress who was so helpful to us and my daughter.  The rooms are clean and nice decorated. We would definitely stay here again.","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Lovely stay at the Renaissance hotel in Chelsea","lang":"en","publishedDate":"2022-05-09","publishedPlatform":"OTHER","rating":4,"text":"The room was nice and clean. Check-in was smooth and the front desk was very accommodating as my friends and I wanted rooms on the same floor. \nUpon arrival, Mr. Julio is there to greet you in the lobby - He was wonderful and was always checking in to see if you needed anything :)","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Paper thin","lang":"en","publishedDate":"2022-05-07","publishedPlatform":"OTHER","rating":2,"text":"We could actually hear people in next room having a conversation,and they were talking not loud at all. I have never experienced this.it wa as if they were in the same room . Nice looking hotel ,bad restaurant terrible lunch and the waitress left .the cook served and cooked  . Should be 2 stars","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Hospitality At It’s Best","lang":"en","publishedDate":"2022-05-02","publishedPlatform":"MOBILE","rating":5,"text":"The hospitality the staff provided to us as guests made the whole experience! Louie was nothing but professional and went above and beyond to make us feel comfortable and showed us how to get around the city! Louie is truly one individual I look forward to seeing again while visiting the Renaissance. Julio was also nothing but professional and courteous to take our luggage all the way to the parking garage. He was very helpful! Please give these two employees the acknowledgement they deserve.\nWe look forward to seeing all of you at the Renaissance very soon! I also would like to add that Leo and the very sweet front desk guest service clerk were definitely nothing but the most kind, patient and worked very hard to help us settle into our room. Thank you all!!!!","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":4,"locationId":15530677,"title":"Something is badly wrong with this hotel! People need to know before booking because the positive reviews are misleading","lang":"en","publishedDate":"2022-04-24","publishedPlatform":"MOBILE","rating":1,"text":"This hotel provides poor service and poor quality accom. The services compare with a hostel despite the expense. The rooms are dark, lack space and are poorly designed. A refurb would be required to correct this. The breakfast is miserable","travelDate":"2022-04","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great FD!","lang":"en","publishedDate":"2022-04-19","publishedPlatform":"MOBILE","rating":5,"text":"Good stay. Would stay again. \n\nPros-\n* Very very friendly staff. I encountered many of the Front Desk agents and they were all fantastic. They really want to please you. They helped me with dining suggestions, locating a small fan for the room, as well as getting me in early. I feel terrible I do not know their names but all five stars. I want to say Katie\/Keli and Vince were who I encountered the most. \n* good location if you do not want to be in the main tourist area. Near subways, basic shopping, and numerous dining options. Even a small massage parlor across the street which was great. \n* good size room for NY. Our room on the 11th floor had a very high ceiling which was a nice touch and made the room feel large. \n* Room was spotless. \n\nCons-\n* The Front Desk is cashless and cannot make change. Very annoying for all parties especially as I was trying to get change for gratuities. They need some sort of change bank. \n* The room needed some more light. Very dark. \n* I requested a taxi to the airport. The taxi they ordered us more than twice the cost of yellow cab. I wish I knew that before he got there as I couldn’t refuse service once he arrived. Not sure if it was a taxi or a car service. \n\nBottom line- Great hotel. Caring FD.","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Excellent","lang":"en","publishedDate":"2022-04-18","publishedPlatform":"OTHER","rating":5,"text":"Friendly and helpful staff....and then there is JULIO!!!  I accidentally tipped him way too much. USD all looks the same!  He sought me out when I came downstairs and returned the extra bill I hadn't intended to give. I couldn't help but give it back to him. Such integrity!  His smile and friendly manner made each interaction so memorable. A gem of fellow in a lovely hotel!","travelDate":"2022-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15530677,"title":"Mostly great!","lang":"en","publishedDate":"2022-04-18","publishedPlatform":"MOBILE","rating":4,"text":"The hotel is nice and located in a great area. The style is nice and staff is great. Julio, the door\/bellman, really was a pleasure. Seeing him and having his cheer each day started things off in a great way. \n\nIt would have been nice to have access to the pool, and other areas on the highest levels. Unfortunately there’s a night club in the building, and they get priority over hotel guests in many respects. I really wish that wasn’t the case.","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"I love NY I love Chelsea Hotel","lang":"en","publishedDate":"2022-04-15","publishedPlatform":"MOBILE","rating":5,"text":"Loved our stay and highly recommend this hotel, great location as well. From the moment we spoke with Vinny Capobianco at the hotel we knew we were in for a great stay. He was so accommodating, professional & personable. My daughter is moving to NYC and they made her feel so welcomed and even congratulated her on her new job! Loren Hernandez was so friendly at check in.  Always greeting and acknowledging us throughout our stay. Such a cool vibe & comfortable hotel. The decor is so enchanting & calming in the hallways, with the leaves\/ trees back splashes. The room was so clean & housekeeping is daily. Spacious room with high ceilings with a great view! Breakfast buffet is an option & free with certain Marriott privileges. Bottled water available & unlimited in the lobby. We ate a fabulous Italian meal at Cotto in the hotel, Bolognese was delicious. Can’t say enough about the staff & hotel. Thank you for making our stay such a memorable one!","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Outstanding customer service, well appointed rooms","lang":"en","publishedDate":"2022-04-15","publishedPlatform":"MOBILE","rating":5,"text":"Front desk and restaurant staff are absolutely warm, welcoming go out if your way to truly welcome you. The hotel is artistic, modern. The views are stunning. The room is sufficient for a couple. We did take the 27th floor and it was quiet as other reviewers stated noise from the rooftop lounge if you go higher. The rooms are clean. The shower is awesome and the beds most comfortable. Really enjoyed the stay. The decor is unique (bunny rabbit lamps in the room). Will be back. The restaurant food was good. We received a $25 voucher so had a chance to use it. If order water at the restaurant you’ll be charged $7. Which we didn’t realize after all it’s just regular water but sparking or bottled. They do provide complimentary water bottles which is very thoughtful and appreciated. \nIt’s centrally located. Hotel security is fantastic. They make sure only guests enter in the elevator as there is an assigned elevator for those going to the rooftop lounge. In fact you’ll need your room key to activate the elevator buttons. So very secure and safe. A true Marriott hotel with exemplary service, cleanliness and warmth.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Nice property that is actually OPEN","lang":"en","publishedDate":"2022-04-08","publishedPlatform":"OTHER","rating":5,"text":"Post covid and this hotel actually has daily housekeeping and free breakfast (buffet) for those with status.  Breakfast buffet is OK - eggs pretty weak but fruit is solid and bacon and sausage also OK.  Alice and WOnderland theme throughout - hard to explain but worth the visit.  Well located - free bottled water -pleasant staff.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Mariam Front desk!","lang":"en","publishedDate":"2022-04-05","publishedPlatform":"MOBILE","rating":5,"text":"Very cool hotel in a great location in chelsea! \nThe corner room is highly recommended. We stayed in a high floor one and the view was amazing. \nMariam at the front desk was very nice she helped us a lot and even invited us for breakfast during check out until our cab ride comes","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Comfortable and Convenient Marriott","lang":"en","publishedDate":"2022-03-11","publishedPlatform":"OTHER","rating":4,"text":"We stayed here for 3 nights during a long weekend in March. It was our first time at this particular hotel, but we've been to NYC many times. I think the location is convenient, but it's a bit more gritty in my opinion compared to other areas we've stayed like the financial district and soho. \n\nThe front desk staff is exceptionally friendly and helpful, extra towels, coffee and water were offered during our stay since we did not have maid service. The room itself was definitely compact although esthetically pleasing. It seems like a lot of the new hotels now have poor storage which is true for this Marriott. For a short stay, I don't think it's a problem. The bed was comfortable and we had a nice view of the city.\n\nRegarding noise, we asked for a lower floor due to the complaints about noise coming from the night club on the top floor. We were on the 25th floor and did not hear any music. There is now one elevator roped off that people use for entering the club, the other elevators are for guests and we didn't have to wait at all getting to and from our room. The walls are definitely thin and we could hear people talking next door. It's unfortunate that the hotel has the club situation preventing people from enjoying a higher floor and better view. We did get a drink from the bar in the lobby, but the bartender definitely prefers the female guests and our drinks were poor. \n\nOverall our stay was fine, but with so many hotels in the city, I'd be a little hesitant to return given the room size and potential noise issues.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great Hotel in an Excellent Location","lang":"en","publishedDate":"2022-02-25","publishedPlatform":"OTHER","rating":5,"text":"Stayed one night before a flight from JFK to Asia. Very nice hotel. Great Service Jennifer Chen was especially helpful. The rooms have great views and are ideal for a single traveler or a couple. They are well appointed but small.  The hotel and area businesses were cautious about Covid and had sensible protocols in place. If you need a fast PCR test for international travel, there are many options within walking distance.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Beautiful and Quiet NYC Hotel","lang":"en","publishedDate":"2022-02-02","publishedPlatform":"OTHER","rating":5,"text":"It's so hard to find a beautiful and quiet hotel in New York City. We were so pleased with our stay there and we were easily able to get two adjoining rooms so there was space for us and our three kids. The room with two double beds was larger than we had anticipated for an NYC hotel. The bathroom was really spacious and the guest rooms and the whole hotel were beautifully decorated. We will absolutely stay here the next time we go to the city.","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"We live right near and still would opt to stay or put up guests here. It’s simply great.","lang":"en","publishedDate":"2022-01-20","publishedPlatform":"OTHER","rating":5,"text":"I visited when they first opened and was actually wowed by the incredibly friendly staff and spotless hotel. I recommend it to anyone (and I’m always asked) who needs to stay in nyc. When pool is open we will surely be doing a staycation. Vince at front desk is just what one hopes for when traveling.","travelDate":"2022-01","tripType":"FAMILY"}
{"helpfulVotes":6,"locationId":15530677,"title":"Awful experience, awful hotel.","lang":"en","publishedDate":"2022-01-12","publishedPlatform":"OTHER","rating":1,"text":"My stay at the renaissance Chelsea has been terrible from the start. First off, the rooms are incredibly tiny and so is their poor excuse of a “fitness center”. \n\nFor $2,000+ for a week stay,  you get a small room, loud nightclub music and domestic violence incidents during the middle of the night. As someone who typical enjoys Marriott hotels and their high level of service, the the renaissance chelsea really dropped the ball! \n\nPlease avoid if unless you want to pay 5 star hotel prices for a 1 star hotel experience.","travelDate":"2022-01","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":15530677,"title":"A nice hotel","lang":"en","publishedDate":"2022-01-11","publishedPlatform":"MOBILE","rating":3,"text":"There was a glitch upon check in . I had used my points for my stay , obviously , the required points were deducted accordingly to get a confirmation no. . But during check in was told that I do not hv enough points . Shown the reservation and points deduction on my screen shots and later they had contacted Marriott Bonvoy to solve the matter . \nNo elite member recognition . \nThe room  itself is quite nice so that is a consolation. \nThe staffs were nice and the location is good","travelDate":"2022-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Are you new here?","lang":"en","publishedDate":"2021-12-21","publishedPlatform":"MOBILE","rating":5,"text":"I was looking for a romantic view with a classy ambiance for a little adult role play. I got exactly what I was looking for. The aesthetic was giving what it was supposed to. The staff was very friendly.\n-clean room\n-quiet on the floor-\n- easy check in and out\n-bathroom was not only clean but had quality soaps and lotion\n\nCon\n- there should be a menu in the room to allow for easy ordering for room service","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great hotel but ask for a floor <30","lang":"en","publishedDate":"2021-12-20","publishedPlatform":"MOBILE","rating":4,"text":"Great location. This is a really trendy and friendly hotel. We enjoyed our stay, but be sure to stay below the 30th floor. There is a club on the rooftop that stays open well into the morning and will keep you up all night. We started on 35 and could feel the bass. The next nights we were able to move to 23 and it was perfect.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15530677,"title":"Wonderful Experience. Restored my faith in hotels.","lang":"en","publishedDate":"2021-12-18","publishedPlatform":"MOBILE","rating":5,"text":"Let meet start by saying that, because off my work, I've had to travel throughout the pandemic. I've seen hotels in the early days not know what to do so basically a stay was a, \"here's your key, good luck, make sure to order door dash”—and this is at the premium Marriotts (Ritz-Carlton, Edition, St Regis, JW, Luxury Collection)\n\nAs time went on and things started to open up, I had high hopes of hotels getting back to creating great experiences for their guests. Unfortunately, instead of that happening, COVID is being used as an empty excuse just to not rehire people, have bad service, and oh by the way charge more than pre-pandemic prices. The strategy being “since all hotels are doing it, we can charge the same prices and do way less, why stop now!” So basically luxury hotel prices for motel service.\n\nIn all of my 130 nights in Marriott’s this year that was the case. No matter how nice the hotel had been or how expensive, every stay was mediocre at best with ALL the compromises and adjustments pushed onto the guest with an incredible lack of empathy from management or staff.\n\nI got used to it and resolved to expect nothing more and just deal with it.\n\nSo when I checked into the Renaissance New York Chelsea hotel, it was a shocking surprise. From the second I walked in the door at 7am to check-in and was greeted with a, “no problem and thank you for being an Ambassador” (don’t remember the last time that happened) to the great rooms, to the OPEN lobby bar, to the fact that they actually clean your rooms, to the unbelievably happy and friendly staff. I was there for a business meeting in a conference room and even the catering staff went out of their way to smile and make things pleasant. And the food, and we’re talking buffet food for 40 people, was outstanding.\n\nI thought about it for a while. Was this hotel experience so great because I had be treated like crap for 2 years straight? Or were they just really great? And the answer is they are twice as great at the Renaissance New York Chelsea Hotel. First, they run a beautiful, well oiled hotel with an amazing staff. Second, they do this while all the other hotels in the country are taking advantage of the pandemic situation to not make taking care of their guests not a priority.\n\nSure, there were some things closed because of COVID at the hotel, but the staff never let you feel the inconvenience.\n\nThey next time I check into hotel and they start the conversation about all the things they don’t have, followed by the DoorDash QR code, I’m going to have them call the Renaissance New York Chelsea Hotel to tell them how it’s done.\n\nThanks everyone.","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":3,"locationId":15530677,"title":"Night Club Hotel","lang":"en","publishedDate":"2021-12-13","publishedPlatform":"OTHER","rating":2,"text":"I'm not one to do reviews, but I think you need to know: This is night club hotel. It's has a rooftop bar called \"Somewhere, Nowhere\" and we stayed Friday - Sunday night with  hoards of young people trying to get upstairs to the roof bar. Which means, they used two of the four elevators for the club, which left two to serve the 30 floors of rooms (with 10 rooms on each floor). You'd end up waiting for up to 10+ min for a lift. Then comes the partying. Our first night, \"our neighbors\" checked in around 3am and one of the \"guest\" vomited violently until 5am. The sound proofing isn't great, so we heard EVERYTHING through the vests. It was as if the person was vomiting in our room. It was clear they partied too hard and had to check in to the hotel. The continental breakfast in the morning is only good until 8:30am. After that, it's DECIMATED and the kitchen has a hard time keeping up. THEN, you get hit with a $25 fee each day that you won't get back, but you can use it at the bar\/restaurant. The location is great, the beds are comfy, but I would 100% pass on this hotel. To cancel this bard review, I'm going to go leave a positive one for The Hilton Garden Inn that's in midtown west that's not exactly a \"boutique\" hotel, but it's a tried and true hotel that's ALWAYS delivered and I wish we hadn't thought to \"try something new\" this time around.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Very disappointing stay….","lang":"en","publishedDate":"2021-12-04","publishedPlatform":"MOBILE","rating":2,"text":"We planed  our anniversary in New York this year! Unfortunately we have to say that we are very disappointed with our hotel. No great food & beverage concept at all. The bar is next to the reception and if you expecting something nice in terms of food or beverage,this hotel is deff. the wrong hotel for you! Thanks god, the hotel is surrounded by restaurants…..  As a Bonvoy Titanium Platinuim member of Marriott, we most of the time treated a little bit different! Welcome card on the room, or even a bottle of water…. Nothing at all. I travel 110 nights in 2021 and this only with Marriott, and we also saw how vivid 19 changed the hotel industry, but what we experienced here is very disappointing.\n\nHeavy service cut …..\n\nWe did not expect this kind of service reduction from a Renaissance Brand at all.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":15530677,"title":"Best staff and rooms for nyc!","lang":"en","publishedDate":"2021-11-28","publishedPlatform":"MOBILE","rating":5,"text":"Out of all the nyc hotels I have stayed at over the years this is one of the best! Staff is very friendly and treats you like a member of the family.  Great location just south of midtown but not too far from downtown and soho.  Rooms facing north have the best views but south is ok just not as pretty.  (Empire State is just north).\n\nBreakfast is perfect each morning and small lounge for drinks with Tony at night is fun.  The managers Miriam, Cory, Umar and others provide a very high level of service.  The doorman and victor do an abasing job as well.  \n\nWill definitely return!","travelDate":"2021-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15530677,"title":"Good location\/why charge a resort fee?","lang":"en","publishedDate":"2021-11-27","publishedPlatform":"OTHER","rating":4,"text":"We recently stayed 2 nights at the renaissance Chelsea.  The hotel is confidently located 2 blocks from the subway.  The rooms were small, I have stayed in other NYC hotels with larger rooms.  We made due with the smaller room.  As other reviewers have noted the hotel gym is tiny and due to Covid only 3 guests at a time.  Wi-Fi worked well.  The hotel charges a resort fee (it was included on my reservation) but since there re no amenities, this is confusing,  I know the hotel is in to make a profit but if you need to charge a resort fee, provide some services (not Wi-Fi since that is a Marriott bonvoy status perk).  \n\nIf we visit NYC again, we might stay here again.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great for a boutique hotel","lang":"en","publishedDate":"2021-11-21","publishedPlatform":"MOBILE","rating":5,"text":"Good for a boutique hotel. I stayed here for 6 days for work and some pleasure.\n\nThe front guest services team were amazing. There was a billing issue where the wrong person was billed but they were able to be patient and supportive.\n\nThe rooms were painfully small but they were clean and welcoming. The bed and pillows were out of this world! Best sleep I’ve had in a while. \n\nThe food at the restaurant located in the hotel was subpar. \n\nThere’s this random rooftop lounge on top of the hotel which is always jam packed and so busy. You can never get in even if you stay at the hotel. \n\nI would recommend this hotel and I would stay here again!","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Really nice stay!","lang":"en","publishedDate":"2021-11-15","publishedPlatform":"OTHER","rating":4,"text":"After reading some previous reviews we almost cancelled but I'm very glad we decided to stay. Most of the negative reviews were noise related with the rooftop bar.  We requested to stay on any floor below the 30th floor and we had no problem with the noise.  Our room was on the 21st floor.\nOur room was very clean with a wonderful view.  The front desk staff was friendly and accommodating. Our king size bedroom had wonderful space and updated decor.  If you're wanting to stay in or near Chelsea, this is the place!  We didn't use the gym or eat at the restaurants but noticed people enjoying a nice bar area in the lobby.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Nice Hotel, Clean, Spacious Rooms, Gym with Peloton","lang":"en","publishedDate":"2021-11-13","publishedPlatform":"OTHER","rating":4,"text":"Nice hotel, first time here. Rooms are clean and spacious.  Nice location, lots to do around here. Staff have been a bit hiss and miss.  \n\nFront desk super helpful, but getting into the restaurant for breakfast a little less so.  \n\nAll in all, very good and I will be back again.  All staff wearing masks and most guests.  \n\nGym is smaller that it looked online, a few treads and bikes, plus 1 peloton.","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great hotel, room for improvement","lang":"en","publishedDate":"2021-10-31","publishedPlatform":"MOBILE","rating":4,"text":"Overall great hotel. \n\nPros: staff was very friendly. Hotel is modern, clean, well located. Rooms are comfortable, albeit small with nice views. We had a city view room and unfortunately didn’t get a Marriott titanium suite upgrade. Didn’t eat at restaurant so can’t comment.\n\nCons: very poor at responding to requests made via app. We ordered extra towels and it consistently took several hours. My wife was cold one night so I messaged the desk asking about an extra blanket. They knocked on the door and woke us up at 3am (2hrs 45mjn later) with the blanket. Also, no fridge in room and only one ice machine in the hotel. Also, it’s 2021 and they still have drip coffee machine in room. Most hotels have gone to espresso machines and that would have been nice.\n\nOverall good stay and nice hotel but they couldn’t definitely make it significantly better by improving on the above.","travelDate":"2021-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"New property still working through things","lang":"en","publishedDate":"2021-10-26","publishedPlatform":"OTHER","rating":3,"text":"For two nights in October 2021, I settled into Room 402 at the Renaissance New York Chelsea.  This is a new property and my first time staying here.  I booked the two-night stay on the Marriott App, but when I arrived the front desk system only showed my stay as one night.  They looked up the reservation number I had been provided and were eventually able to find the reservation and adjust their system.  They also had the wrong nightly rate.  Both were corrected and they said their system was a little bit older and did not always sync well with Marriott’s system.  I thought it was odd that a new property would have an older system, but ultimately, they were able to quickly correct the information.\nThe decor of the hotel is a little bit on the modern side but with classic touches.  It was not overdone and overall appealing.  I read reviews that the nightclub caused lots of noise and could make it hard to sleep.  I think the club wasn’t in operation during my stay and overall found the property extremely quiet.  Being on the fourth floor, I expected some street noise but it was quiet, especially for New York standards.  The first morning at 7am I ventured to the concierge lounge for coffee.  When I returned to my room, the coffee was cold.  I mean cold, not even room temperature.   That was very disappointing as I didn’t want to make another track downstairs.  It was surprising as I was clearly one of the first guest of the day.  The coffee should have been freshly made and hot.  I called downstairs to make them aware hoping to save someone else from the same cup of cold coffee.  They offered to bring up a fresh cup, which I greatly appreciated.  However, when it arrived, it was cold too.  The second morning, I didn’t even attempt to get a cup of coffee on property.  I dined at the onsite restaurant, Cotto, for dinner on night two.  I had a question about the wine and the manager couldn’t provide much detail past what was written on the menu.  I choose a cabernet and it was nice.  I’d highly recommend the pappardelle al ragu.  The portion was more than enough.  It was flavorful.  While it was filling, it wasn’t heavy.  That evening had there been a restaurant of interest nearby I probably would have chosen other than the hotel restaurant but I’m glad I didn’t.\nRoom 402 is an accessible king.  It is appointed with king bed, a small desk and chair, sofa, side chair and coffee table. There is floor to ceiling windows looking out over 25th street allowing in tons of natural light.  There is both a sheer and blackout curtain that automatically will open and close with a slight pull of each.  Both the bed and sofa were comfortable.  There is a cabinet which provides a few doors for storage, a microwave, safe and houses the iron\/ironing board.  Space to hang clothes is almost non-existent.  Maybe one or two items but not even worth bothering moving the items being stored in there to use.  There is also a large bar area to the left of the bed, offering counter space and a few drawers for storage. The in-room coffee\/tea was Starbucks and Tazo\/Bigelow.  I’d prefer if it were a Keurig as those seem more sanitary than the units which hold the water in a reservoir.  It looked clean and I hope it was given how new the property is but overtime, it could get pretty gross.  There is also a small bar sink and refrigerator in this area.  The bathroom was spacious but offered absolutely no counter space or shelving for toiletries.  That was maybe the most disappointing feature of the room.  The shampoo\/conditioner brand was a generic.  I would have expected a little nicer option but not worth any fuss.  The one feature of the room which probably gets overlooked but actually makes the room pretty great is the very tall ceilings.  When most New York hotel rooms can feel cramped, the large ceilings and windows really made this room feel extremely spacious.    I actually booked this room for the balcony and paid more for it.  The weather turned out to be a little cooler than forecasted so I didn’t get to take advantage of the space as I was hoping to.  It is furnished with a small sofa, chair, coffee table, a few artificial plants and screens on both sides to provide privacy from the neighboring balconies.  As mentioned, the room overlooks 25th street.  Directly across the street are low rise buildings so the view expands beyond a couple blocks but certainly not the views that I saw in the online listing.  The balconies are not covered nor is there a heater so really only useful when the weather is nice, which for New York, is probably less than fifty percent of the time.  And hopefully, the neighboring balconies are respectful of the semi-private space.  In the end, I wouldn’t book the room again given the price point.\nWhile it has been a couple of years since I was in the Chelsea area, it was not an area I would recommend for now.  Traveling alone, I didn’t feel as safe as I expected.  I walked the 9 blocks to Macy’s and overall it was fine, but definitely clutched my purse tight and was on guard.  The crowd is a mix of characters, some which made me feel concerned for my safety or at minimum, on high alert.  There were store fronts shut down and more grafetti than I saw in other parts of the city, such as Mid-Town.  Until New York fully returns to pre-pandemic crowds, I think I would choose another part of the city for my next stay.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Terrible Management\/ people with disabilities beware","lang":"en","publishedDate":"2021-10-26","publishedPlatform":"OTHER","rating":1,"text":"The worst part of our trip was dealing with the elevators.   There are only four and on a good day they are slow.     On Saturday afternoon at least one elevator broke - - management never put up signage warning people, but we tried to use it and figured it out on our own.  On Sunday when we tried to get downstairs we waited over 30 minutes for an elevator.  We saw people were walking down the stairs.  My husband who has heart issues and difficulty walking any distance was forced to walk down 12 flights of stairs with his luggage so that we could make out train.  No employees in sight to help.  No signs.  No warning.  When we got to the front desk the clerk laughed a little when I told her what had happened.  When I asked her if the situation amused her she did not apologize and merely stated two elevators were out and the engineers had been called (at least one elevator had been out for over 12 hours).   On a different note, the water in the shower was lukewarm at best and would revert to ice cold at times.  So unpleasant we each only used it once over the whole weekend.   Very bad experience!!!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Expected better customer service","lang":"en","publishedDate":"2021-10-25","publishedPlatform":"OTHER","rating":2,"text":"This was my first time staying at this hotel. Rooms here are standard NYC sized (read: small), which is fine for me. The bed was very comfortable, but I found the closet space (less than 1ft of hanging space + 1 drawer) a bit challenging. \n\nThroughout the week, my room was not made up twice while I was away for the day (I was out of the room 9am to 10pm each day, and there was no do not disturb sign up either time). The first time it happened, I called the desk and the concierge apologized and offered to send towels. Unfortunately, it took over an hour for those fresh towels to arrive, so I didn’t bother asking the second time it happened. I also never received my welcome gift during the week, which I normally get as an elite member. \n\nThere is also a strange dynamic between guests for the rooftop bar and guests of the hotel, where the former get priority over the elevator use. On several occasions, I had to wait well over 10 minutes to get in an elevator to go up to my room because any available elevator would be used for the bar guests.\n\nWhat was most disappointing was at checkout, when I reiterated the challenges I had during my stay, the staff member just commented “that’s strange”. I don’t know what I was expecting, but I felt disappointed with how my feedback was handled. \n\nThe only silver lining for this stay was that there was a room available for my early check-in at 12 when I arrived. However overall, I felt the experience was disappointing for the $ spent. I travel to NYC for work frequently and am not sure I will return again for future stays, despite it being my only option for Marriott hotels nearby. \n\n—-\nOne other note if indoor masking matters to you - little to no members of the staff wear masks indoors, and neither do most of the guests. I’m not sure what the rules are in NYC since I was just visiting, but sharing in case this is helpful info to someone else.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Clean hotel,  good service and a great vibe!","lang":"en","publishedDate":"2021-10-19","publishedPlatform":"OTHER","rating":5,"text":"I stayed at the Renaissance Chelsea Hotel last week for a work meeting.  I loved it!  The hotel is new, so the lobby and rooms are updated with great decor.  The front desk staff was courteous and my room was SPOTLESS.  I had both breakfast and lunch at the hotel restaurant and was very pleased.  Our meeting room was on the 36th floor and the views were spectacular!  I was there with 8 other people from work and we all agreed that the stay was ideal- great location, great food, awesome views and a great vibe!  I highly recommend staying here and I look forward to returning in the near future.\n\nNMK","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great Hotel!","lang":"en","publishedDate":"2021-10-19","publishedPlatform":"OTHER","rating":5,"text":"Tremendously kind and courteous staff.  Picturesque views of seemingly all of Manhattan, north of 25th St. Also really appreciated the room decor.  Not something I would normally notice, but it's the perfect blend of trendy, yet comfortable and homey.  Can't wait to return.  \n\nPS: Delicious craft cocktails at the lobby bar","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"All night music!!!","lang":"en","publishedDate":"2021-10-18","publishedPlatform":"MOBILE","rating":2,"text":"Always stay at Marriott’s but this was very disappointing. The Roof top pool and bar is not available to guest it requires a reservation and fee. Also on the 38th floor they have a night club “somewhere nowhere” that plays loud thumping music from 10pm till 4am…YES!! 4:00am. That also is not accessible to guests and they even take half the elevators at night. Other than that it’s a beautiful hotel with amazing views!! Maybe they are catering to the under 30 crowd (??)","travelDate":"2021-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Not for sleep before 4am","lang":"en","publishedDate":"2021-10-17","publishedPlatform":"MOBILE","rating":2,"text":"The hotel is ok BUT there is no getting sleep here. The nightclub on the roof has kept us up every night. It’s currently 1:30am and two white noise apps on our phones can’t even drown out the thumping.  When you return to the hotel late at night you are greeted by drunken nightclub crowds in front of the hotel and in the lobby. The free breakfast for elite members is also abysmal.  We gave up and walked down the street every day to get breakfast. The people that work at this Marriott are very kind, but we would never return because of the loud thumping music. I can sleep through most things but this is excessive.","travelDate":"2021-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Will be back","lang":"en","publishedDate":"2021-10-02","publishedPlatform":"MOBILE","rating":5,"text":"This hotel was opened just before the pandemic and was closed for several months until it reopened again. So basically it’s a new hotel . The room we got was not too spacious but modern and very clean. Service at front desk was very friendly . They don’t have a bellboy or concierge - which is a hit if a disadvantage.","travelDate":"2021-07","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15530677,"title":"The Suite Life - Not","lang":"en","publishedDate":"2021-09-23","publishedPlatform":"OTHER","rating":4,"text":"This is a cautionary tale for those Marriott road warriors who are Platinum or Lifetime Titanium like myself.\n\nFor the first time since they have been offered, I decided to take advantage of the Suite Night upgrade that is offered once a year to Elite's. Not having used it before, I read the instructions carefully and made the request several weeks before my trip. Imagine my surprise when I received an email four days before arrival that an upgrade to a suite had been confirmed! This five day trip to the Renaissance was a very special one for my wife and myself and I didn't let on that we were going to be staying in style. Once the confirmation email arrived I looked at the hotel website to see what the suites looked like and was in awe, wondering which one we would be assigned.\n\nWe arrived at the brand spanking new Renaissance Chelsea and was immediately impressed with the property. After a quick check-in we went up to the room and I opened the door, anticipating my wife's excitement. Then it happened.. it was an ordinary, small New York City hotel room, and then I had to spill the beans to my wife that it was supposed to be a suite. Knowing that I had the suite upgrade confirmation with me, we went back down to report that we were given the wrong room. But as it turned out, it was anything but a mistake. I politely spoke to the person who checked me in and without a flinch she sought the help of the desk manager. After some fancy keyboard work the manager said that there weren't any suites available and that at this property a suite upgrade isn't really an upgrade to a suite but a one room level upgrade, you know, the kind that Elite's are supposed to be given if available. I'm a type \"M\" personality (mellow) and didn't raise my voice or give her a hard time, but I did try to stand my ground. In the end she wore me out as I tucked my tail up between my legs and walked away, totally defeated, seething and worst of all - feeling slighted. I wasn't even offered a goodwill gesture like a bottle of wine, the attitude being that I was granted an upgrade from a 225 square foot room to a 226 square foot room and that I should be thankful for having received even that.\n\nAccording to the Marriott site, I have stayed at Marriott's a total of 1,760 nights over the years, and that doesn't include stays which were in my wife's name, so I would venture to guess that's it's more like 2,100 nights. I have been to hundreds of Marriott's worldwide, from Australia to Zurich and have never been more disappointed and felt dejected as I did last week. \n\nI will follow up with my assessment of this property.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Wonderful visit","lang":"en","publishedDate":"2021-09-17","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here for two nights and had a wonderful time. The location is terrific And centrally located for getting around New York City. The room  was Very comfortable and immaculate.  The view From the room ,of New York City ,was spectacular. The staff was very friendly and professional. We will be back!","travelDate":"2021-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Phenomenal Hotel","lang":"en","publishedDate":"2021-09-17","publishedPlatform":"MOBILE","rating":5,"text":"I do not usually write reviews but I felt it necessary to write a review for this hotel after our stay. The renaissance was beyond clean and sanitized. We felt safe during Covid staying here. The staff was very accommodating especially the men\/women that kept the rooms and common areas clean. They were courteous and followed all protocols that seem to be in place for NY. Our room was always cleaned when asked and we saw staff wiping things down and cleaning throughout our stay to keep all of the guests safe. I would highly recommend staying at the Renaissance in Chelsea if you plan on visiting NYC. Not only was the hotel very clean, but the entire staff was friendly, accommodating and courteous, the views are picturesque and the location was perfect for anyone traveling. Thank you Renaissance for a wonderful stay, you made our stay in NYC that much more pleasurable.","travelDate":"2021-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Fun Getaway","lang":"en","publishedDate":"2021-09-15","publishedPlatform":"OTHER","rating":5,"text":"My wife and I stayed at the Renaissance Chelsea on a recent Saturday night.  Great central location near trains and subways making it easy to get to a friend's birthday dinner.  Loved the lobby with a cool bar for a night cap.  We were on the 36th floor with great views of downtown. Room was clean and décor was modern.  I had read some reviews on noise from the club, but we didn't have any noise issues and slept well.  Would stay here again.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Looks were certainly deceiving","lang":"en","publishedDate":"2021-09-14","publishedPlatform":"MOBILE","rating":2,"text":"Modern decor and centrally located. But if you care about cleanness, you might think twice about staying at the Renaissance NYC Chelsea hotel. I suspect the Marriott is understaffed or unwilling to pay for staff with hotel management and hotel housekeeping experience. Housekeeping is practically nonexistent at the Renaissance. Yes, kudos on the chic club vibe the hotel is going for. I prefer to sleep in clean sheets and not find the previous guest(s) hair all over the bathroom floor and shower. And I don't mean a strand of hair, here and there. I mean balls of hair! The shower didn't drain. There were water (or urine?) stains on the floor around the toilet.  The sheets looked clean at first glance. On the 3rd (and last) night of my stay, I noticed housekeeping made the bed but left all sorts of lint and trash that I left on the bed that morning. I then wondered, if they failed to shake the bed cover and remove trash off the bed, yet the bed is made, what else are they not removing. I removed the bed covers to find dark stains (fluid stains) on the sheets by the foot of the bed. I had been sleeping on dirty sheets my whole stay!!\nYes, I reported it all to front desk management twice. There weren't rooms available. I suggested to the front desk manager to send in housekeeping to clean my room while I was out. At the very least, vacuum and clean the bathroom floor and shower. That never happened. BTW, upon checking in, front desk will charge your credit card $25 per person per night. Mind you this \"resort\" fee was not disclosed in the reservation. The hotel justifies the daily $25 fee by offering a hotel credit in the same amount that you can redeem for breakfast at the hotel restaurant or drinks at the hotel bar.\n\nHousekeeping staff did not wear masks. It is so irresponsible for the hotel to not take proper health and  cleaning measures in the middle of a pandemic.","travelDate":"2021-09","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15530677,"title":"Super Loud Hotel!","lang":"en","publishedDate":"2021-09-12","publishedPlatform":"MOBILE","rating":2,"text":"It’s a hotel with roof top night club located at the very top floor. I checked in Saturday 11pm, got inside my room on the 33 floor, showered and could not go to sleep because of a loud music bang noise from the club upstairs! Had to wait until 4am to finally get some sleep. Next day, requested for a room change, luckily they’re willing to put me on a lower level to the 27th floor.. but still, a bang noise from the club… \n(Not as loud as before but you can still a techno style music in your room) \n\nIf you’re traveling and looking for a peaceful place for a good rest.. you’re in the wrong place, but if you’re here for just a night for fun, a room to crash after a heavy night in the club, then this place is for you. \n\nSuch a waste of money and time, expected a nice and comfy rest which Renaissance Chelsea could not provide.","travelDate":"2021-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Good service, small room","lang":"en","publishedDate":"2021-09-10","publishedPlatform":"MOBILE","rating":4,"text":"Staff very helpful and pleasant. Very responsive. Room was small hence only 4 stars. High floor wasn’t too noisy. Gym was ok - lots of cardio and free weights but no machines. They have a Peloton bike. Decor is nice throughout. Area seems ok regarding safety","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Nice hotel in a bit of an odd location","lang":"en","publishedDate":"2021-09-08","publishedPlatform":"OTHER","rating":4,"text":"Overall great stay at the hotel - the staff were super friendly and accommodating (which you don't always get in NYC).  There is a nightclub somewhere in the hotel, but we were high enough that we didn't hear anything from it (just the velvet rope and the one blocked elevator).  The hotel is on a bit of a shabby block going toward 7th Ave (stay on the side of the road as the hotel and you will be better off) but the 6th Ave side was fine (and closer) with plenty of shops and restaurants nearby.  A bit pricey but you also expect that from NYC.  We did have breakfast at the hotel and the quality was good though again a little spendy vs. what you could get just outside.  Also used the workout room which was decent sized (and gave a chance for some social distancing due to the pandemic).","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Not coming back.","lang":"en","publishedDate":"2021-08-24","publishedPlatform":"OTHER","rating":2,"text":"I will not chose this hotel again. I had a short list of three hotels in NYC. The three of them with a roof or a terrace. After we arrived here they told us that the terrace on the pictures where not part of the hotel so guests are not able to enjoy it. Like showing a swimming pool from another neighborhood. I think it is totally misleading as I would not have chosen this hotel having known that. BTW there is no refrigerator in the room. Next time I might need to ask if there is hot water in the shower.","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Amazing!","lang":"en","publishedDate":"2021-08-17","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here for my husband’s birthday. Chris and his team were so gracious and accommodating. Our huge suite was absolutely gorgeous with a large terrace overlooking 25th street. Central location close to everything! We didn’t get a chance to try the bar or restaurant, but it looked great. This hotel will be my new go-to for all future business and personal trips to the city.\n\nMy only hope is that hotel guests will be given special privilege\/access to the rooftop bar in the future.","travelDate":"2021-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great hotel!","lang":"en","publishedDate":"2021-08-16","publishedPlatform":"MOBILE","rating":5,"text":"After reading some of the reviews here I was hesitant to book this hotel.  I was traveling with children and I was concerned about the club on the roof of the hotel. We were there during the week and had a room on a lower floor so the club was no problem at all.  In fact, the hotel turned out to be great.  It is in a central location so it’s easy to go anywhere around the city.  The decor was haunted mansion chic in the best possible way.   Plus there were swinging chairs in the lobby that my kids loved.  Waters were provided at the front desk all throughout the day which was great on a hot summer day.  We also ate at the restaurant for dinner one night and that was pretty good, not great, but pretty good.  It even had good options for kids. In addition, everyone at the front desk was super helpful. \n\nMy only complaints are that the hotel is advertised as having a pool, it does not.  The pool is run by a third party and while adults can make a reservation, it is not generally available to hotel guests. \n\nIn addition, if you are eligible for the complimentary breakfast as a Marriott Bonvoy member, you are not seated in the dining room.  You are seated in a weird little room off the buffet area.  There was a leak in the ceiling, construction going on behind a wall, and uncomfortable seating. But these were minor issues, and overall we had a wonderful stay.   \n","travelDate":"2021-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15530677,"title":"EXCELLENT Hotel Experience - MUST STAY","lang":"en","publishedDate":"2021-08-11","publishedPlatform":"OTHER","rating":5,"text":"I'm a native New Yorker and have lived in Manhattan for 20 years.  Needed a night  away from the kids so my wife and I booked a room here.  I've seen the best and worst of the NYC hotel experience - and this place is top notch.  Beautiful building, overly attentive and welcoming\/friendly staff, solid lobby hotel bar, VERY clean rooms, great views, and a fair price.  Also centrally located in the city making it easy to get everywhere.  It's really everything you want in a New York City hotel.  We all know some NYC hotels can totally suck.  You're in great hands here.","travelDate":"2021-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"NYC  Chelsea Experience. Great location for walking the city but the neighborhood is a bit gritty.","lang":"en","publishedDate":"2021-08-09","publishedPlatform":"MOBILE","rating":4,"text":"Mariam, a manager, and Tony, the lobby bartender pushed this review to four stars. They were so friendly and worked really hard to make you feel like a valued guest. Pros:  great staff, decent fitness center, very clean. Cons:  extremely small rooms, noisy at night because of Club on top floor.","travelDate":"2021-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"No vengan a este hotel. Las fotos mienten","lang":"es","publishedDate":"2021-08-06","publishedPlatform":"MOBILE","rating":1,"text":"Un espanto! Las habitaciones no solo son pequeñas sino que no tienen el mínimo c confort. No limpiaron nuestra habitación y por ello nos “compensaron” con un desayuno buffet que es el más feo que probé en mi vida. En la habitación córner con vistas te chocas contra las paredes. En las fotos muestran una piscina de dicen que no pertenece al hotel. Todas las noches hay fiesta en la terraza con un ambiente desagradable que perjudica a los huéspedes. No vengan a este hotel!","travelDate":"2021-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15530677,"title":"Do not stay here!! Insanely loud nightclub","lang":"en","publishedDate":"2021-07-31","publishedPlatform":"OTHER","rating":1,"text":"We had a horrible stay here last weekend. There is very loud rooftop club and music is blaring into the rooms. There are crowds of people outside the club making it joke around the hotel. Do not stay here. They claim the rooftop is not affiliated with the hotel but it’s out of control.","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great Visit","lang":"en","publishedDate":"2021-07-18","publishedPlatform":"OTHER","rating":5,"text":"Great location. Beautiful room. Awesome views. The staff was super accommodating. Cory at the front desk was very nice  and Victor was fabulous. No doubt  this will be my new homebase every time I visit New York City.","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Excellent Stay!","lang":"en","publishedDate":"2021-07-17","publishedPlatform":"MOBILE","rating":5,"text":"The Renaissance in Chelsea is my new favorite hotel in NYC!\n\nEverything about this hotel is perfect. This hotel is in Chelsea, but it is very close to Midtown and Madison Square Garden, and walkable to Times Square. The location is excellent and close to trains, convenience stores, restaurants, shops, and so much more. The lobby is classy and elegant, and the front desk staff really made my trip special through their kindness and recognition of my Marriott status. The room was really well-appointed, and I loved the nightlight design in the bathroom. I had a room on the 30th floor, and the view was excellent – a view of Chelsea, Midtown, and the top of the Empire State Building. I really loved the tasteful decor throughout the hotel. \n\nI didn’t get a chance to visit the restaurant or the rooftop but the rooftop club seemed to be a popular destination on the Friday night when I stayed here. I had a great time in the Chelsea neighborhood during my stay- LOVE the area!\n\nThank you to the front desk staff who helped me when I arrived. I will be back. Truly an outstanding stay in July 2021.","travelDate":"2021-07","tripType":"SOLO"}
{"helpfulVotes":4,"locationId":15530677,"title":"Too many shortcomings","lang":"en","publishedDate":"2021-07-14","publishedPlatform":"OTHER","rating":3,"text":"This hotel is not what it appears.  From the outside, its a Renaissance, newly built slightly over 1 year ago, with upgraded finishes.  When you check-in, you realize there is no restaurant and no room service due to Covid.  You can't even get a coffee in the lobby.  The rooms are small, even for NYC standards.  The Aveda toiletries advertised are gone and replaced by another brand you've never heard of that is an inferior quality.  The walls are thin to the point where you can hear conversations in the adjoining rooms.  While the bathroom is slightly above average it also lacks the ability for someone to put on makeup directly in front of a mirror with good lighting.  Also, and its not the hotel's doing, but the homeless encamped on the sidewalk is unsightly but harmless, at least in our experience.  Lastly, like other posters have commented, our AC unit struggled to keep the temperature cool.  It was humid when visiting and our clothes, while hung in the room, became damp as the AC wasn't able to cool the room.","travelDate":"2021-07","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Nice new hotel, but loud","lang":"en","publishedDate":"2021-07-07","publishedPlatform":"OTHER","rating":3,"text":"Overall we had an okay stay here. The rooms are small but brand new and with great decor. Bed was comfortable, showers are nice. Our bathroom door did not close properly, and a maintenance worker was unable to fix it, but not a huge issue. We asked for a high floor as I am a light sleeper and we wanted to avoid noise. We got a room on the 34th floor, thinking we’d be far from street noise. Unbeknownst to us when booking, a rooftop club opened the weekend of our stay on the top two floors of the hotel. Hotel guests have no special privileges or access to the rooftop club or pool—we were just told you have to get your own reservation separately. Very strange for a higher end hotel to offer no benefits to guests or help with access. Also, these were advertised as amenities for the hotel and are absolutely not.\n\nThe real problem started our second night—Saturday night, we arrived home to go to bed to find a massive crowd around the hotel of people trying to get into the rooftop club. No issue, we went around them and up to the room. Except we could hear loud bass through the walls\/ceiling from the club FIVE floors up and music through the window. This noise went on until FOUR IN THE MORNING. And was audible over the earplugs and sound machine we brought. We called the front desk about the music, and they said no one else complained and the club was closed. A lie. After another call at 4am with the music still going, the front desk said they were wrapping things up upstairs.  \n\nThe next morning, we requested to be moved to a lower floor away from the club. The front desk was very helpful and accommodating and we had great service. However, they said no one else had complained, but we met a women in the elevator saying she had also complained and could hear the music on the 35th floor. We did not hear music on the lower floor after moving rooms, but not sure if it was because the club closed earlier that night (Sunday).\n\nOverall, the noise issue was ridiculous. We wish we had been informed of a 4am club and poor soundproofing when we were put on the 34th floor and had specifically requested a quiet room. Were it not for this problem, I would have given this place 5 stars. They seriously need to sort out the noise problem. Definitely do not stay anywhere near the rooftop club on a weekend.","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Fine hotel on a quiet block","lang":"en","publishedDate":"2021-07-06","publishedPlatform":"MOBILE","rating":4,"text":"Fine stay at this clean and comfortable hotel.  The location is quiet, even on a lower floor (we were on the 9th) we had minimal street noise. The staff has that predictable NYC attitude. Lots of leaning and avoiding eye contact and when you ask a direct question it seems like a lot of effort to answer you.","travelDate":"2021-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Poor customer service","lang":"en","publishedDate":"2021-07-03","publishedPlatform":"MOBILE","rating":2,"text":"When we checked in we were asked about housekeeping, and if we wanted to schedule for housekeeping services. We said yes and scheduled for 12PM the next day.\n\nIt’s the next day and no one cleaned our room. I asked the front desk guy, he tells me there was no such service scheduled. He then went on to tell me the guy who checked us in was new, and that he has been there a week… why do i care? And why are you telling me that? Learn customer service and find solutions and don’t throw your own staff under the bus. We requested for fresh towels… guess what? We didn’t get them when we returned. \n\nWe returned and i called front desk again for towels and the front desk was ready to run me the same story from earlier. \n\nYou can’t even get housekeeping right after COVID?!?! Come on.","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Tiny room, the worst service!","lang":"en","publishedDate":"2021-07-01","publishedPlatform":"OTHER","rating":1,"text":"This might have been the smallest hotel room in a city known for tiny hotel rooms. It barely fit both mine and my girlfriends suitcases and we had climb over them anytime we wanted to got in our out of bed\/the bathroom\/enter or leave the room. But the worst part, you apparently have to request maid service 24hrs in advance, and they DO NOT TELL YOU THIS! It is very sad because this hotel is conveniently placed next to my new office and I will never stay here again.","travelDate":"2021-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"an Average Renaissance","lang":"en","publishedDate":"2021-06-19","publishedPlatform":"OTHER","rating":4,"text":"Good: Location was perfect for a foodie, close to the metro. Furnishings felt modern, decent sized gym, and the price for a \"nice\" hotel in Manhattan was more than reasonable.\n\nBad: The Service. It wasn't bad, it was just absent, which for a hotel like this seemed bad. I've stayed at a lot of marriotts and it just seemed odd. Also, with the rooftop bar and pool closed it felt like more of a soft-opening than a fully-fledged hotel. \n\nUgly: Nothing. But if this wasn't a new hotel it would probably be a 3\/5.","travelDate":"2021-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Nice view, kind of lackluster experience.","lang":"en","publishedDate":"2021-06-16","publishedPlatform":"MOBILE","rating":3,"text":"There's quite a bit to say, so I'm just going to itemize them for the folks looking for info.\n\n- Very small rooms, no fridge by default. Little room for suitcases even!\n- No fan in the bathroom. \n- At least in room 3507, the mirror in the room is perfectly placed to see from the toilet to the bed, lmao.\n- Shower products are good, but the bar soaps are TINY\n- Not enough towels for 2 by default, and the body towels are again tiny.\n- Bed was very comfortable, actually.  View from 3507 was amazing.  \n- Rooftop bar and pool is still closed. Restaurant downstairs is still closed.\n- TV supports a good number of streaming services, nice perk.\n- Alarm was set for 6:00am either automatically or by the previous stay. Always check the alarm clock. 😴","travelDate":"2021-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Family weekend","lang":"en","publishedDate":"2021-05-31","publishedPlatform":"MOBILE","rating":5,"text":"We had a great stay here for a quick family weekend in the city. The staff was friendly, accommodating and welcoming. The rooms were very clean and the views were great! The hotel is in a perfect location for exploring the city! We were with children ages 3-7 who all had a great time.","travelDate":"2021-05","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15530677,"title":"Hotel not capable of managing Covid restrictions while upholding basic standards of service and is not ready.","lang":"en","publishedDate":"2021-05-26","publishedPlatform":"OTHER","rating":1,"text":"Horrified to find a dump in our bathroom toilet as we checked in. Carpets were filthy. The hotel cut back on staff services like cleaning because of Covid but is now profiting from that by making no effort to get back to normal. I guess they like the lower labour costs too much. The restaraunt is still closed when most of NY is back open. \nWe prepaid for the room and I have been charged (without any notification $297.00) It is impossible to reach to anyone at the hotel because of phone system. Holding for 30 minutes, who can do that? Essentially customers are an inconvenience to this organisation and any opportunity to cut back on customer service has been taken resulting in a very alienating guest experience. I feel for any organisation trying to get back on their feet after the pandemic but this hotel is not ready and should not be open. It's a terrible thing to promise a service and then treat your customers with contempt. Splash out a little more on a hotel that will at least provide you with decent hospitality.","travelDate":"2021-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Buena ubicación y lindo hotel.","lang":"es","publishedDate":"2021-05-15","publishedPlatform":"MOBILE","rating":5,"text":"Excelente ubicación, en la cuadra del lado tienes un citi Bike lo que era muy conveniente pues decidimos no tomar metro ni tren sino recorrer ny en bici. Tiene las estaciones muy cercanas. Café y súper al lado del hotel. Adicional muy lindo habiataciones cómodas y de buen tamaño.","travelDate":"2021-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great experience!","lang":"en","publishedDate":"2021-05-13","publishedPlatform":"OTHER","rating":5,"text":"Always looking for a good hotel to stay in NYC, I decided to try the Renaissance New York Chelsea Hotel. As a Marriott Titanium member, I contacted the property in advance with some questions and requests, and was delighted with the warm professionalism of Assistant General Manager Matt Cerabona. When I arrived at the property, Lucy at the front desk provided a wonderful welcome. I had reserved three rooms for a combination of a work and family trip. \n\nThe location of this property is great, and the views of the cityscape and Empire State building breathtaking. The hotel is not yet functioning with food service due to the pandemic, but there are many options close by. Will return!","travelDate":"2021-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Poor communication from front desk","lang":"en","publishedDate":"2021-05-06","publishedPlatform":"OTHER","rating":2,"text":"Clean hotel, spacious rooms for NYC, and convenient location. \n\nTook away stars because they didn't let us know upon check-in that we had to link our Marriot Bonvoy account to get free wifi. We followed the instructions when connecting to the wifi network and signed in with our Marriot Bonvoy account info but we still got charged for 2 nights of wifi usage. I had to call and follow up about the charges since they didn't provide an itemized receipt when we checked-out. They also refused to refund those charges since we completed our stay, but there was no way to review the charges since they did not provide a receipt.\n\nWon't be staying here again due to their lack of communication from the front desk.","travelDate":"2021-05","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15530677,"title":"Friendly Service, Peaceful Stay!","lang":"en","publishedDate":"2021-05-03","publishedPlatform":"OTHER","rating":5,"text":"Had a great experience, check in was great Lucy explained all the hotels amenities, and policy's. Lucy was very courteous and displayed excellent customer service. I wish the room was a little bigger but overall I enjoyed my stay and the friendly customer service. I forgot to mention, the bed is super comfortable, I fell asleep instantly felt like I was sleeping on clouds lol.  I would definitely recommend and would book again. :)","travelDate":"2021-05","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15530677,"title":"Fantastic Newcomer to the scene","lang":"en","publishedDate":"2021-04-25","publishedPlatform":"OTHER","rating":5,"text":"I am a very frequent traveler and spend about 2 months per year in and out of NYC....so I have tried many of the hotels.  This newish Renaissance checks all my boxes.  Great front desk staff (if your nice, some guests are deplorable), an Excellent General Manager, Chris and its a new property well kitted out.  It's location cannot be beat, blocks from Fashion institute of Technology, Macy's, Chelsea, over 100 restaurants and bars.  Pre-Covid rates were around $275-$375 +tax and fees per night....so anyone staying today is on a half price sale if you book smartly.  Coffee shops on both corners as well as a strong creative, gay and homeless population all living together in that \"Flower district\", this is a great NYC edgy Neighborhood and one I would even consider living in.   Rooms tends to be rather small as most are 230 square feet but they are perfectly planned and the beds are super comfy as are the linens.   Lobby Bar and Restaurant is due to open soon and the roof top pool with a spectacular Empire state view I was told is opening around Memorial day.   During my 7 day stay, I asked for housekeeping services every day and they came 7 days....some days they were more thorough then others, but during covid, you must be realistic.  Even 7 days cleaning is far better then most hotels around.....  There are only 5 suites out of 341 rooms so if you want one, book it.  Even if you are the Marriott king.....There is no upgrading to those suites.....People are paying full wack and hotels are indeed a business where $$ talks.   Currently bottled water at the front desk.  They actually helped with my vast luggage which was greatly appreciated, as I said, lovely staff.   I left because I had friends coming in to another hotel which was indeed less $ but cannot compare...While its been fun, I look back at my time in the Renaissance Chelsea with much fondness and I will return soon.   There are some great rates out there, so look around.  Please don't steal the sheets.....ooh yes,  with lower rates they are getting some players who are outrageous guests and you can see them if you sit in the lobby and work for a while with your ears open......   You are also allowed to order in food to the lobby to eat if you wish and avoid the strong smell of dinner \"lingering\" in your room.    They have really made the best of what they have, given the circumstances.  Stay healthy and I wish Safe Travels to all.  Cheers!","travelDate":"2021-04","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15530677,"title":"Excellent","lang":"en","publishedDate":"2021-04-25","publishedPlatform":"OTHER","rating":5,"text":"The Renaissance Chelsea is a great addition to the downtown hotel scene, filling a gap that existed for a high-end hotel in Chelsea.\n\nI stayed for 5 nights earlier this month.  The hotel is doing a very good job operating in a covid world.  Understandably, not all hotel services were available, but essential services such as housekeeping were available. \n\nI am looking forward to returning to the Renaissance Chelsea.  As New York continues to open up, I look forward to enjoying the hotel fully, with all services restored.\n\nFor now, my commendations to the management and staff.  You are doing a great job.","travelDate":"2021-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great upscale hotel","lang":"en","publishedDate":"2021-04-20","publishedPlatform":"OTHER","rating":4,"text":"Very nice hotel in a peaceful neighborhood. Staff very friendly and helpful, and rooms were clean and comfortable, especially the beds. We also enjoyed the city view from our room. I booked on expedia and for extra twenty bucks I was able to add free parking. By the front desk they handed me the free ticket, the garage was only a block away, so parking was quick and easy, no hassle. The reason I took off one star is the fact that it's impossible to contact the hotel thru their number, this was very frustrating for me.","travelDate":"2021-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Real issues pertaining to cleaning room","lang":"en","publishedDate":"2021-04-18","publishedPlatform":"MOBILE","rating":2,"text":"I stayed there from 4\/9-12 like room cleaned 4\/10&11\nOne day they cleaned it then other day they just put towels in the bathroom and that’s it\n\nThey did not have stickers that you should break to ensure cleanliness \n\nNo valet and yet the parking lot still cost 54.00 a day\n\nIt is new and the room is small but very well organized \nAlso wow terrible toiletries\n\nBoy are they cheap they do not even replace it when they clean the room\n\nVery disappointed \n\nWill not stay there again","travelDate":"2021-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15530677,"title":"Wouldn’t go right now.","lang":"en","publishedDate":"2021-04-09","publishedPlatform":"OTHER","rating":2,"text":"This hotel was very disappointing.   They have a pretty roof top space they use in all their advertising but are keeping it closed. For no reason other than too lazy to staff for it for hour at sunset or evening.   That could easily be done for an hour so guests could use it for pictures.    It’s an outdoor space!   If you can be in their elevator, you should be able to be on the roof looking at the Empire State Building.   The homeless situation on the street next to the hotel is a real problem.   A large group of homeless are next to the hotel and another across the street under street scaffolding that makes it very dark when walking back from restaurants at night and uncomfortable.    The rooms have carpeting and I got a few bites on my feet.   (Bugs of some sort).    They are not cleaning rooms during your stay.   Also did not upgrade our floor despite being very empty.   We were left to look over the Goodwill  Store and the homeless.    So that was just petty adherence to the  Marriott paid rate unless they are only keeping a few floors open to  not hire more staff back.   The front desk crew was nice and decor nice as in the adverts but location is good if you want to use subway two blocks away, but otherwise a bit far from high line and better restaurants in Chelsea.","travelDate":"2021-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great location ","lang":"en","publishedDate":"2021-03-19","publishedPlatform":"MOBILE","rating":4,"text":"Cute hotel, clean and followed all protocols.  The lobby is available if you prefer delivery\/takeout.  Great location! We walked everywhere- Moma, NYU, meat packing district, Times Square! I’d love to come back when the rooftop is open.","travelDate":"2021-03","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":15530677,"title":"A cute little escape","lang":"en","publishedDate":"2021-03-06","publishedPlatform":"OTHER","rating":4,"text":"I live in a house and needed to \"get away\" since I'm still working from home.  I got a nice rate on hotel tonight and stayed at the Renaissance Chelsea for just one night.  The front desk staff was friendly and accommodating.  Covid protocols were being followed and anyone we saw had a mask on and it was very easy yo be socially distant because I barely saw anyone.  \n\nThe rooms are cute, cozy, and clean.  I was impressed it is decorated really well and felt like an actual bedroom as opposed to a standard hotel room.  I also love the hallway decor- it's lovely and a nice surprise.  \n\nWe had a drink in the outdoor heated space- nobody else was there and the bartender was friendly.  We just took it out there ourselves there isn't any service.  I can't remember where we got food from but we brought it back to the hotel and ate outside at the time NYC was still not open for indoor dining.  \n\nEverything was just really cozy, mellow and easy which was what I needed.","travelDate":"2021-01","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15530677,"title":"Wonderful New Property","lang":"en","publishedDate":"2021-02-24","publishedPlatform":"MOBILE","rating":5,"text":"I had a great stay here earlier this month. Prior to check-in I reached out to management to see if they had any rooms with a bathtub due to a surgery I had scheduled. The GM, Chris, was quick to reach back out and block me one of their accessible rooms and clearly had taken note of my preference for a high floor as well which is appreciated as a Titanium Elite. \n\nMatt at the desk really stood out over the course of my four nights on the property. He was always on it in remembering my name and made a point to check-in on me following the procedure. He had a great recommendation for lunch that was truly tailored to what I was asking for with all the restrictions I was given post-op. \n\nMinor issues like missing remotes and a broken chair were addressed reasonably fast. It seemed like the property was trying to work through some bad furniture that they got delivered for their opening still as even the replacements were still a little wonky. The bed was exceptionally comfortable and the desk is a lot better than what other new properties are trying to pass off as a workspace. Pro Tip:  Book of Mormon makes a nice mousepad since the laser doesn’t do well with the glass. Internet was fast and reliable. TV was updated with all the streaming services like Netflix and YouTube to give you plenty to do if you must stay in the room. \n\nRates were reasonable and due to current events points were offered in lieu of food and beverage and the destination fee was waived due to the restrictions in place. I believe the bar re-opened during my stay but I had enough pain meds that I didn’t need to add any booze to the mix ;-). \n\nI’d gladly return again in the future and am watching the rates daily in case a good deal comes back around like last time! Thanks! ","travelDate":"2021-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great stay again, good hotel and staff.","lang":"en","publishedDate":"2021-02-04","publishedPlatform":"OTHER","rating":5,"text":"Another great stay at this property, it is located right in the heart of Chelsea and a bit quieter road.  The hotel staff always welcome you back and even in a pandemic still have that smile feeling under the mask.  Matt at the front desk is awesome, he is always happy to help and a stellar person.  \n\nThe hotel is newer and has a newer feel for sure.  The gym (like most NY gyms) is on the smaller side but they have what you need including a Peleton bike!  The rooms are new, functional, and have what you need - they can be on the smaller side so book a larger one if more space is needed.\n\nThank you again for a great stay team!","travelDate":"2021-02","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15530677,"title":"New Hotel","lang":"en","publishedDate":"2021-01-13","publishedPlatform":"OTHER","rating":4,"text":"One night SAT before xmas, booked a regular room and used a SNA to get corner room 3101.  TA reviewers correct rooms are NYC sized.  Room clean, no fridge but you can ask for one, I requested extra towels and toiletries in the Marriott App and IT WORKED!! See pics.  Ice on same floor as gym and must keep keycard with you for elevators.  Still no lounge or free breakfasts back yet for platinum but did not get charged any destination fees.  Go next door Pisillos for heros at lunch and get breakfast at Johnny Luncheonette the next morning.  Had nice stay.","travelDate":"2020-12","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15530677,"title":"Excellent ","lang":"en","publishedDate":"2020-12-02","publishedPlatform":"MOBILE","rating":5,"text":"I spent five nights here at the end of November- strongly recommended.   Property is new, with a solid balance between design and function.   Staff were great, with particular nods to Matt, for whom all requests were easy and positively received, and Aretha, whose smile lights up the night shift.   \n\nI stayed in a balcony suite.  If you have to quarantine in a hotel in NYC due to state entry regulations, this is your place.  Lots of space, indoors and out.  Loved it and plan to return.   \n\nLooking forward to visiting post pandemic when the rooftop bar and pool are open again ","travelDate":"2020-11","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15530677,"title":"Amazing location, fantastic hotel close to the Empire State","lang":"en","publishedDate":"2020-11-28","publishedPlatform":"OTHER","rating":5,"text":"Second time at the Renaissance and we would definitely go again to the property. \nLobby is comfy modern, front desk folks very helpful as usual. Room is New York small but very functional. Icing on the cake, we got a room on the 33rd floor, with a direct view on the Empire State. Falling asleep watching the Empire State, is quite an experience. Penn Station is 10 mins walking distance only for those coming from Newark Airport.","travelDate":"2020-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"New favorite New York Hotel","lang":"en","publishedDate":"2020-11-24","publishedPlatform":"OTHER","rating":5,"text":"We visit New York at least once a year and have stayed at many different properties in various locations within the city.  This Chelsea area turned out to one of our favorite. You are in the center of everything you want to do.  Easy access to Downtown, Midtown, Times Square and all the shopping areas. There are 3 subway lines within a couple of blocks. Yes there are some homeless around due to a covered walkway at a construction site next door.  That will improve over time. \n\nThe hotel itself was nicely done. A small boutique style gives it character and a welcoming feeling.  Unlike the large hotels you don’t feel rushed or crowded.  There is a small intimate lobby bar that was a comfortable place to socialize.  As a Marriott Platinum we were able to get upgraded to a suite. Actually, more like an apartment. Incredible room.  We had my son and daughter-in-law with us so the extra space was great for getting together. \n\nFinally the staff.  Every encounter we had with the staff was excellent.  They took care of any request we made. It is obvious that they care about their property.  Also the General Manager, Chris, went out of his way to modify our reservations when we had to make a quick last-minute modification. You know he takes pride in his property  when you see his email listed in his remarks. You do not see that often in these reviews. \n\nThis is our new favorite hotel and will return.","travelDate":"2020-10","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15530677,"title":"Fantastic Hotel even during these times, Great Location!","lang":"en","publishedDate":"2020-10-30","publishedPlatform":"OTHER","rating":5,"text":"Great new hotel in Chelsea, the location was just stellar!  It is so close to great food and beverage, the road it is on is easy for Uber drivers to stop and drop off (That isn't always the case in NY) \n\nThe hotel is brand new and it shows, the room was clean and smelled new.  They are on the smaller side as NY hotels tend to be, but the layout is great and great design in the bathrooms.  \n\nHotel is doing the best they can with the restrictions in the city, gym was open (Limited capacity) and the time I was there the bar has just opened back up which was great!  Great patio seating outside to have a drink and watch the city go by.  \n\nMost hotels in NY are getting used to what can and cannot be open.  More and more seems to be opening at the property making things feel a little more normal again.","travelDate":"2020-10","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15530677,"title":"Neighborhood Treasure restored","lang":"en","publishedDate":"2020-10-23","publishedPlatform":"MOBILE","rating":5,"text":"What a wonderful place to stay! \nThe elegant entryway, leads you to a large airy lobby – – seating area and check-in desk to the left, a beautiful bar with cozy seating areas unfortunately under utilized during these Covid times on the right. Matt greeted us with a cheerful welcome, Introducing us to the establishment with a brief history colored with his own personal perspective – – he then graciously entertained the barrage of questions posed then to him about the place with pride and detail. Cudos to Matt!!\nTurns out this hotel sits on the old Chelsea flea market lot, the decor throughout the place playing homage to this detail. Simple, interesting, artistic… Just a lot of fun. We could’ve spent hours in the main staircase alone looking at all the antique odds and ends garnishing the walls. \nAll the electronic conveniences of modern age accompanied the elevators, the wall info units, etc. adding utility to the otherwise spotless Corridors and rooms. Funky stuff intermingled— rows of old leather belts papered the elevators. Very cool\nThe rooms likewise had eclectic decorations and the pure white linens and the comfy beds with featherbeds a-top were much appreciated. The bathroom was spic-n-span clean with a large modern shower made even better by the hot water with strong water pressure.\nGorgeous well-equipped gym in the basement was just an added bonus, with a beautiful pool on the very top\/roof of the restaurant — seen only by picture, never really got up there. \nExtremely economical, usually with valet parking but put on hold by Covid. Would go back in a heartbeat\n","travelDate":"2020-10","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":15530677,"title":"Beautiful Property and Views! Best Rooftop views in the city!","lang":"en","publishedDate":"2020-09-28","publishedPlatform":"OTHER","rating":5,"text":"We stayed this past weekend for two nights at the Renaissance Chelsea hotel (during covid for those that is relevant to) and were very happy.\nThe property is absolutely gorgeous in style and decor, it is very clean and welcoming as well. Sadly, with covid, restaurants are closed at the property and of course you must wear your mask in all common areas.\nThe rooms are a great size for the city (without paying an arm and a leg) and it had a beautiful view. We reserved a Corner King View room and were granted an upgraded floor the day prior due to a special occasion. Unfortunately, the room was taken by another guest upon our arrival; however, we were placed on the 23rd floor with a corner view and the gentleman working that evening graciously discounted our rate a bit due to the inconvenience. \nValet didn't seem to be an option during our stay there, we arrived in the middle of the night and valet typically doesn't run that late anyhow; however, I saw none during the day either. We didn't have much trouble finding parking on the street the hotel is on though - or one street over, no biggie. \nWe had no trouble with customer service, requested towels a few times, tooth brushes, laundry bags, etc. all were met with happy tones and immediate deliveries.\nWe walked from the hotel to Times Square and back, it's a good walk - but a beautiful one. There are tons of restaurants within a few block radius - highly recommend 2 Bros Pizza on the corner, as well as The Smith a few blocks up. Lots of local shopping nearby as well!","travelDate":"2020-09","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15530677,"title":"Mediocre at best","lang":"en","publishedDate":"2020-08-18","publishedPlatform":"OTHER","rating":2,"text":"I do not recommend this hotel. Unprofessional inattentive staff, zero amenities available (no room service, not hotel restaurant, no mini fridge). There are sketchy people that were always hanging out in front of the building and all up and down the street it is on. It was very off putting.","travelDate":"2020-07","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15530677,"title":"Great disappointment, poor customer service","lang":"en","publishedDate":"2020-08-06","publishedPlatform":"OTHER","rating":2,"text":"I'm a disabled veteran who was in the need of get away,  looking online, I found this hotel which is a new hotel in my city, with a striking view. To my chagrin I was met with a rude assistant manager (posing as the general manager ) who informed me that I couldn't have a late checkout, even after notifying  him in ample time that I was staying an additional night, in a upgraded room! After speaking to the  General Manager Chris who heard my grievance and assured me he would get to the bottom of it. I then canceled room and booked at Renaissance Midtown which superseded my expectations.","travelDate":"2020-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great service ","lang":"en","publishedDate":"2020-03-12","publishedPlatform":"MOBILE","rating":5,"text":"Great visit at the new Renaissance.  The staff are excited be there, and it shows in the service.  Anthony at the front door is a shining star.  His smile brightened every day. Monee from housekeeping kept our room spotless and was friendly and gracious.  Can’t wait for the rooftop to open. ","travelDate":"2020-03","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15530677,"title":"Great stay","lang":"en","publishedDate":"2020-03-11","publishedPlatform":"MOBILE","rating":5,"text":"Had a great stay with excellent service and gorgeous rooms. Tastefully designed, great staff, quiet rooms, solid service, perfect location.\n\nAlways nice coming back and leaving to an open door held by the always-attentive Anthony.","travelDate":"2020-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"Brand New and Beautiful, perfect location","lang":"en","publishedDate":"2020-03-11","publishedPlatform":"OTHER","rating":5,"text":"Fantastic team, including Lucy and Mateo.  This hotel opened in Feb 2020 and is in the perfect location for my Flatiron Office visit.  Comfortable rooms, great coffee and yummy breakfast were topped off with an epic view of the city.  \n\nEveryone on our team will now choose this location, when we visit the NYC office.","travelDate":"2020-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Kind Service","lang":"en","publishedDate":"2020-03-09","publishedPlatform":"OTHER","rating":4,"text":"Hotel was pretty good, Anthony the doorman was wonderful, attentive, and kind! \nIt’s not perfectly stocked, and there were some technical difficulties with the phone not working and hall light out. The bed was comfy though!","travelDate":"2020-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15530677,"title":"The Best Service! Boutique Hotel Feels!","lang":"en","publishedDate":"2020-03-06","publishedPlatform":"MOBILE","rating":5,"text":"Everything from the details in the design and decor to the amazing staff, specifically the doormen, make this place special and made my trip feel more like a getaway than work. As I was leaving, I had already planned to write a glowing review based on my 5 nights stay; then, Mateo sealed the deal for me when he joined me outside in the rain with an umbrella and walked my large suitcase to my car after seeing me search for my driver who went halfway down the block and asked me to walk down to meet him. I will absolutely stay here again and again! This is my NYC hotel of choice, hands down!","travelDate":"2020-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great Stay!","lang":"en","publishedDate":"2020-03-06","publishedPlatform":"OTHER","rating":5,"text":"I usually don't write reviews but I feel this hotel is worthy of one. My friends and I stayed at the Renaissance this past weekend and had an amazing stay! We were in town for a bachelorette party so needless to say, many girls, many opinions, and we were all so pleased with the hotel. From the staff to the ambiance, everything was wonderful. \n\nI will definitely be back this summer to check out the rooftop pool and bar!","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great visit","lang":"en","publishedDate":"2020-03-05","publishedPlatform":"MOBILE","rating":5,"text":"First time visiting this wonderful Hotel. Rooms are beautiful and all amenities are fantastic. Staff was wonderful and bent over backwards to accommodate all of our requests. If you're in Manhattan give it a try, one of our best stays while there","travelDate":"2020-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Nice Stay","lang":"en","publishedDate":"2020-03-05","publishedPlatform":"MOBILE","rating":4,"text":"Just returned from a one night stay in NYC at the Renaissance Chelsea hotel. The staff was outstanding and attentive. Elizabeth at the front desk was SUPER!!\nThe room that I had requested was not ready when we arrived early in the day. We accepted a double room on the 15th floor. Room was fine; beds comfortable and all was good except for the lack of soundproofing between rooms. Normal volume conversations were easily heard from the next room. \nOverall the stay was fine. Would return again. ","travelDate":"2020-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Terrific Stay","lang":"en","publishedDate":"2020-03-05","publishedPlatform":"OTHER","rating":5,"text":"Probably one of the best hotels I have stayed at in a very long time. NYC is usually hit or miss for me on my business trips. This the first time I have stayed at this particular hotel and I was pleasantly surprised. The staff was friendly and accommodating. The bar was a great spot to relax with a cocktail after a long day. The bed was extremely comfortable. This might be a weird comment, but the water pressure in the shower was phenomenal. That is a rarity. Overall, great stay!","travelDate":"2020-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Amazing Property in a Great Location","lang":"en","publishedDate":"2020-03-05","publishedPlatform":"OTHER","rating":5,"text":"I stayed here for 2 nights and this is a gorgeous new property. The staff seemed green but they were eager to assist.  The design is very unique and feels very comfortable.  Nice hidden ornate objects around to discover.  \nI will be back!","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great Location! Great Staff! Great Room! Great Views!","lang":"en","publishedDate":"2020-03-05","publishedPlatform":"OTHER","rating":5,"text":"My husband and I decided to take a last minute trip to NYC in February to celebrate our anniversary. We were amazed by everything at this hotel. The location was fantastic - close to anything and everything you need in NYC. The staff was fantastic. The front desk staff were gracious and helpful. When they found out about our anniversary, they sent up a complimentary bottle of wine and a charcuterie tray.  I met the general manager, Chris, who was interacting with all the guests in the lobby. He was making making sure everyone was happy with their stay. The rooms were super clean and the views took my breath away. I can't say more about this hotel. I highly recommend.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15530677,"title":"Disapointed","lang":"en","publishedDate":"2020-03-04","publishedPlatform":"OTHER","rating":3,"text":"Great location (24-hr CVS snd Starbucks within 2 minutes) and friendly staff, but so, so disappointed!! Rooms were small but well designed, good bathrooms and comfy bed. BUT: Lack of amenities in room, tiny closet, no bottled water or bar fridge, tiny towels, no hairdryer. Found a pair of used men's underwear in closet (see pic), complained about it and they were still there the next day...AND my room was really poorly serviced. They have a nice looking restaurant which is only open for breakfast, which makes no sense, and means there's no room service. Could do much, MUCH better.","travelDate":"2020-03","tripType":"BUSINESS"}
{"helpfulVotes":3,"locationId":15530677,"title":"Very Disappointing","lang":"en","publishedDate":"2020-03-03","publishedPlatform":"OTHER","rating":2,"text":"I visited this hotel last month with anticipation and left regretting that I spent my money here.\n\nFirst, the check-in process -- when I checked in, I asked if there were any upgrades (I'm a titanium elite), and was told that I was already upgraded to a city view king.  When I  informed the receptionist that's the room that I booked, I was told that there were no upgrades available.  After getting to our room, I checked the Marriott app and saw that there were at least 1 corner room available (for $30 more than my booked room).  I called the front desk, and the receptionist then went to presumably speak with her manager and came back to tell me that I can have that room for $100\/night more.  I suggested that this was  not the usual response I get from  other Marriott properties and was told that the manager would call me back in about 20 minutes.  The manager never called.\n\nNext the room.  The rooms looked good in photos but in reality, it were much smaller than expected and looked rather cheap with faux tiles and cheap furnishings.  The closet is also tiny and pretty much useless for anything more than a couple of coats.  In addition, there was no safe in the room and we had no real view.\n\nSUMMARY\nDon't stay here.  While the hotel is in a good location and has a cool lobby, it isn't enough to justify a stay there.  There are a lot of Marriott properties in Manhattan and a many are better value and treat elites much better.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15530677,"title":"so many teething problems to sort out before it becomes a great place!","lang":"en","publishedDate":"2020-03-03","publishedPlatform":"OTHER","rating":2,"text":"I stayed at the hotel for 8 days in February. The desk staff here were absolutely fantastic, so helpful, friendly and professional - which is what makes it so hard to write this review...\n\nThis hotel has the potential to be amazing, but at the moment there is a lot of stuff to sort out, so here's a brief list.\nThe very small safe (that wouldn't fit my small laptop) in the room didn't work.\nHousekeeping staff came in on 2 seperate days when I had the do not disturb sign on. They also kept supplying only decaf for the in room coffee machine (annoying because I dont drink decaf).\nRoom phone stopped working mid-stay.\nA\/C stopped working mid-stay and would only blow hot.\nNot much room to keep suitcase in the room.\nNot much room in the closet for hanging shirts and clothes.\nNo fridge in room.\nIce machine only in the basement.\nGym very small and not well equipped - a\/c in here does not blow cold enough.\nWi-fi only free for marriott members, although advertised on expedia as free.\n\nPositives about my stay:\nDesk staff - Can't praise them enough, great people.\nWi-fi speed great.\nDesign and decor throughout the hotel is cool.\n\nI just MAY stay here again, but only if they get things right!","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15530677,"title":"Was hoping for similar to renaissance midtown but not close","lang":"en","publishedDate":"2020-03-03","publishedPlatform":"MOBILE","rating":3,"text":"Staff is very friendly and welcoming.  Rooms are small even for nyc standards.  I was disappointed at room not particularly clean, spots on sheet, and noise from other rooms and hall is surprisingly bad.  \n\nThe building itself is nice, but, very surprising issues for a hotel that is so new and purpose built.  \n\nAnd on top the 25.00 mandatory amenity charge is absurd.  Offensive really.  \n\nMuch better options all available all around.  ","travelDate":"2020-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"New hotel - will be nice but needs a few tweaks - great staff","lang":"en","publishedDate":"2020-03-03","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is beautiful - just needs a few tweaks. I think they opened a bit early. Plumbing\/air\/heat issues...but all were fixed by the awesome, friendly and reliable overnight engineer, JAMES. \n\nAlso really enjoyed how helpful and humble some of the other staff were, like the bellman ANTHONY. He greeted me every time he saw me enter or exit the hotel for 10 days and always insisted on helping even when I told him I had no cash to tip. I appreciated that. \n\nThe area doesn’t have many other clean, affordable and convenient hotels. This new addition is certainly welcome. \n\nWill stay again! ","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Beautiful new hotel in great location with excellent staff","lang":"en","publishedDate":"2020-03-02","publishedPlatform":"OTHER","rating":5,"text":"This hotel is a winner.  It is very well located and only a couple of blocks from a subway that leads downtown and to Brooklyn.  The rooms are beautifully decorated.  The beds are comfortable, the TV's large and the showers are roomy and ample in terms of water pressure.  I can't say enough about the staff.  I requested an early check in by phone from the airport and the room was waiting for me when I arrived.  Also, I never opened a door during my three days there.  The staff was friendly and always present.   The only (minor and somewhat entertaining) issue is the sound insulation.  On our last night there, we were able to clearly hear the conversation of the couple next door.  The conversation led to -- shall we say -- \"more intimate\" activities, which were also quite audible.  After a short time, those activities -- shall we say -- \"concluded\" and we were able to enjoy a restful and comfortable night.    ","travelDate":"2020-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Thank you ANDREW and CHRIS","lang":"en","publishedDate":"2020-03-02","publishedPlatform":"OTHER","rating":4,"text":"It's always great to stay at a new hotel but there are still kinks to be worked out.  Being a Platinum member, I was surprised that I could not check-in (even after doing the mobile check-in and having it confirmed) when I arrived at 12.  Even when I offered to wait, I was told nothing was available until 3:30.  There were several of us in the same boat.   The first time in over 50 stays at least.   Also, when I was able to check in and waited for my stored luggage which was clearly stored somewhere far, far away, I observed all four front desk chatting with a guest about his trip to Barbados when clearly there was another guest waiting and getting increasingly irritated.  I like their enthusiasm and personal attention, but there needs to be more training and efficiency.  My check-in process took over 5 minutes, which is long for a check-in process.\n\nThe outstanding part were the guys out front standing in the cold--a huge shout out to Andrew and Chris.  They provided phenomenal service.  From the moment Andrew patiently waited for me to exit the taxi, which took about ten minutes because of a payment snafu, to their efficiency and professionalism, I was impressed.  Believe me, usually, I'm in a rush in and out so don't notice these things.  And, anytime I tipped, they were appreciative--other hotels, especially in NYC, they feel it's their due.  Whoever is in charge for the bellhop\/valet.\n\nLove the funky\/quirky style fo this hotel.  The rooms are nice but super small.  Also, there is a design flaw in the bathroom sink.   The custom cement\/concrete sink is smaller than average with a shelf above it.  When I lean over the sink, somehow my face is over the ledge with the faucet underneath the ledge.  If I move back a step to wash my face, spit, etc., I'm not fully over the sink.   A small thing that only started bugging when the floor had some water and the towels underneath got a a little wet.","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great New Hotel, Great Location","lang":"en","publishedDate":"2020-02-28","publishedPlatform":"OTHER","rating":5,"text":"Stayed here over Valentine's weekend for 2 nights.  Reached out to Gen Mgr Chris beforehand and received a nice welcome email.  Was able to meet Chris upon check-in and he followed up late with an email - above and beyond.  Front desk staff very friendly and polite as were the doorman (like a 5 star hotel).  I was put in a high floor King corner room, which has amazing 180 views from Hudson Yards to Madison Sq Park and Empire State bldg.  Room is cozy but good for NYC standards, bed was very nice, very quiet - no street noise, or other rooms, well layed out and nice shower, and A\/C worked perfect.  No complaints and would definitely stay here again!  I'm a lifetime titanium bonvoy member and have stayed in many Marriott properties across the country and world.  Very impressed with service and rooms, especially given it was only open 6 days when I arrived!","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"BEWARE of EXTRA CHARGES even months before your stay!","lang":"en","publishedDate":"2020-02-26","publishedPlatform":"OTHER","rating":1,"text":"I made a reservation for June, and they suddenly charged over 300 USD from my credit card on Feb 22 for no reason. I was supposed to pay everything at the property. \nFrustrating to say at least, I have now been contacting them and just hoping they will solve this quickly and refund my money asap!","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"BEST HOTEL IN CHELSEA ","lang":"en","publishedDate":"2020-02-26","publishedPlatform":"MOBILE","rating":5,"text":"Stayed here with my wife the day after Valentine’s Day. This hotel is brand new.  Despite the fact they’re only open for a week or two and have some minor issues to iron out, this hotel was very accommodating and the staff was hands down very polite, patient and helpful in every way. The manager Chris has everything under control! Very nice gentleman. This will be my goto hotel every time I’m in NYC. \n\nOne more thing. Johny’s Luncheonette is right next door for a great breakfast or quick lunch!! ","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great Stay. Wonderful Staff.","lang":"en","publishedDate":"2020-02-26","publishedPlatform":"OTHER","rating":5,"text":"My wife and I were in the city for our anniversary. I had prepaid for the hotel months ago, and became a little nervous when I read the reviews for the newly opened hotel. Everything was perfect the entire weekend. The doormen were extremely friendly and helpful. Check in was a breeze, breakfast was great. Room was gorgeous. This will definitely be our go to hotel in the city moving forward.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great new hotel","lang":"en","publishedDate":"2020-02-26","publishedPlatform":"MOBILE","rating":5,"text":"A boutique style Renaissance that has been open only two weeks.  I love the decor.  The front of house staff is amazing.  Anthony the bellman welcomed me everyday and called my cab for me.  He mentioned they will have a pool and rooftop dining in time for warm weather.  They are still in process of opening restaurant\/room service so plan on eating somewhere in the area for now. Plenty of options to walk to nearby.  ","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15530677,"title":"Do not stay here","lang":"en","publishedDate":"2020-02-25","publishedPlatform":"MOBILE","rating":1,"text":"I am here now and it is a HORRIBLE experience. Arrived late Monday night to room that was 80 degrees. Temp wouldn’t go down past 78 degrees. Complained at 8:30 am Tuesday morning. Told there was an issue in some rooms but it would be fixed. Arrived back at hotel at 11pm Tuesday. Not fixed. Told all rooms in whole hotel had issues and there was nothing they could do except crack a window.  It even a bottle of water in the room. Just a really bad experience. No choice but to sweat it out at this point as it’s now past 11. ","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"New hotel with thin walls","lang":"en","publishedDate":"2020-02-24","publishedPlatform":"OTHER","rating":3,"text":"The hotel is new and fancy, but the walls are very thin and it was hard to sleep. You could hear people in other rooms very easily. Many of the amenities weren't ready yet since the hotel is brand new. I would not stay here again.","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Beautiful new property in Chelsea!","lang":"en","publishedDate":"2020-02-23","publishedPlatform":"OTHER","rating":5,"text":"First of all, greeted by the two nicest bellmen ever, Anthony and Matteo. They were there pretty much (along with other great ones) my entire stay. Never had to touch a door and always pleasant and smiling. Love these guys! \n\nThe hotel itself is situated perfectly for where I work but anyone traveling to the city and wanting easy access to MSG, Penn Station, Times Square, Macy’s, Broadway, etc but wants to stay out of the tourist zone, this is a great hotel for you! Loved the proximity to restaurants and within walking distance to all the hot spots (3-4 blocks away). \n\nThe interiors are beautifully laid out, very biophillic design with the leafy wallpaper, gorgeous rooms (though your typical NYC size) but I like the coziness. The bathroom is great with rainfall shower heads which I loved! Cool headboards btw and loved all the wood-like finishes! Of course everything is brand new (they had just opened) but there were no kinks to be worked out. The staff was on their game and extremely nice and helpful! \n\nI did not try out the restaurant or bar at night but the breakfast was nice. \n\nThis will be my “go to” hotel in NYC from this point forward. Looking forward to many more great stays!","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15530677,"title":"Great Location, Ambiance and Staff","lang":"en","publishedDate":"2020-02-19","publishedPlatform":"OTHER","rating":5,"text":"I have stayed at this hotel on several occasions since it opened and, as someone who has stayed in multiple locations\/properties throughout the City, this one stands out.  During my first stay, I had the pleasure of meeting Issac (front desk) and Lenny (door), both of whom were extremely welcoming and made the stay very pleasurable.  I appreciate the fact that they make the effort to connect with the guests.  I was there this week again and had the pleasure of meeting Mateo and Anthony, who equally were welcoming and extremely helpful.  \n\nAdditionally, the rooms are well appointed and the gym (which has Peloton bike and plenty of dumbbells), is spacious, clean and a great space to work out in.  \n\nWhile there have been some minor glitches with the hotel (testing of fire alarm mid-day), they are to be expected given its recent opening.  When those glitches have arisen, the staff have been extremely responsive and apologetic.  I have stayed at more established hotels in the City, which have not been as gracious or accommodating when similar issues have arisen. \n\nI am booked to stay at this hotel again next month and plan to make it my go-to in the City.","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15530677,"title":"Disappointing stay","lang":"en","publishedDate":"2020-02-18","publishedPlatform":"OTHER","rating":2,"text":"Do yourself a favor and stay somewhere else. .... atleast for now. The hotel is not ready . We had to change rooms twice because of the noise. Banging first ... then what sounded like bandsaw possibly from the roof ? On top of that we never got a good nights rest because the fire alarm went off EVERY MORNING around 9am. We are the types that like to stay out late and sleep in late . Its a VACATION . I couldnt wait to get out of there and go back home . I had some clothing i left in one of the rooms while we were moving ...they said they found but for some reason it took 2 days to get it finally returned to me although i was told numerous times that it was being sent up any minute .\nThe people at the front desk and door and very nice and i liked the location of the hotel. Its obvious the hotel was just not ready to open , which is not their fault, but i really wished we would have stayed down a couple blocks at the eventi where we usually do . Pretty upset that marriott opened a hotel to guests when they were clearly not ready for business","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15530677,"title":"OK, not great","lang":"en","publishedDate":"2020-02-17","publishedPlatform":"MOBILE","rating":3,"text":"Room was decorated nicely and it’s a good location.  Need to work on the breakfast buffet, have cold cereal, oatmeal, etc.  We had to get engineering up to our room to close the window which was open, night light broke for a bit.  Gym was too hot and no cold water there.  Got an upgraded room, but it was still pretty small.\n","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15530677,"title":"Not ready yet","lang":"en","publishedDate":"2020-02-17","publishedPlatform":"OTHER","rating":1,"text":"We stayed at the new Renaissance Chelsea this past weekend.  It has only been open a week, and so we expected some glitches.  And there were many.  We checked in at 6 pm and they had trouble finding a clean room for us.  We were given a room, but not the room we booked (a king corner).  The room we checked in to at first was tiny.  So we asked to move, and that was not an easy process.  At first we were told we could move and so we packed up, only to get a call 5 minutes later to say that no king corner rooms were available after all.  We did stop by the front desk on our way out and they found a room and said they move our bags while we’re out at dinner.  That never happened and when we came back the new person at the front desk had no info on our move request and said it was not possible as all the king corner rooms were booked.  They did move us the next day but our new room had no hot water, which eventually got fixed but that was not pleasant.  We also had to call down and request  bath products as there were none in the room.  The biggest complaint we had was all the waiting, the line to get our new room key was over 30 minutes long, and then we had to wait 25 minutes in a London no elevator line, and that caused us to miss our dinner reservation.  It was complete chaos.\n\nOn the plus side - The staff was very pleasant.  The hotel looks nice.  It is not at alll ready for guests and it was a very challenging stay.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15530677,"title":"Great Stay","lang":"en","publishedDate":"2020-02-17","publishedPlatform":"MOBILE","rating":4,"text":"Staff were very helpful and polite.  Provided plenty of complimentary coffee and water.  Room was comfortable. Housekeeping did not even change sheets once, even though they had coffee stains. Good location and great-view, as we walked around much of Manhattan ","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":9,"locationId":15530677,"title":"Nice hotel not without its flaws","lang":"en","publishedDate":"2020-02-12","publishedPlatform":"MOBILE","rating":4,"text":"I enjoyed my two night stay at the Renaissance Chelsea and will likely give it another try on future trips. The lobby, hallways, and rooms are interestingly designed, no cookie cutter was used here.  But there is some room for improvement.\n\nMy room was thoughtfully laid out and quirkily decorated, with a number of rabbit and plant themed accoutrements that apparently harken back to the property’s former life as a flea market or something.  My room, a corner king, was small but highly functional, perfect for a solo business trip.  Everything is brand new since the property was built from the ground up and opened four days before I arrived, and everything worked perfectly (including the bunny shaped light and coffee maker (Starbucks provided); there is no fridge).  The bedding was comfortable and the towels were awesome. Not a ton of storage - the closet area was literally about 16 inches wide and held the ironing board, so clothes horses might have some troubles.  But the three cute bunny hooks on the wall can hold a coat and other things, and really I had no issues at all with the amount of storage space.  The walls were a bunch of different textures and designs but they worked well together and all in all the bedroom is very nice to look at.  There was a cozy chair in the corner, a couple of handy little trays for your pocket stuff, and both sides of the bed had two nesting tables, more great details. Lots of places to plug things in and lights everywhere you need them.  Wifi was fine.  Housekeeping sadly took my little shampoo bottles and bar of soap after the first night - incredibly wasteful but probably a training issue.\n\nThe bathroom again was on the smaller side but was perfectly fine.  In fact the rainfall shower (no tub - yay!) was one of the best hotel showers I’ve ever experienced.  And the concrete sink and cool etched mirror with nightlight feature were also nice touches.  The framed picture in the bathroom also matched the framing of the bathroom door.  Nicely done!\n\nService was good, and I almost never had to touch a door handle thanks to the many doormen always eager to assist.  The elevators require a key tap before you can type in or tap a screen to choose your floor.  I never had to wait for an elevator but the card reader was very finicky.\n\nBreakfast for Platinum guests was a definite lowlight and almost has to be a temporary solution.  The best I can describe the spread is “sad”.  It was brought in from some outside caterer on a cart and consisted of bins of scrambled eggs, potatoes, and bacon, a bowl of yogurt, a bowl of cut up fruit and some bread for toasting.  It was all laid out on the bar, separate from the dining room, and just looked and felt like an afterthought.  But at least it was offered and it filled me up fine, but I’ve had better breakfasts at a Fairfield Inn.  Even the coffee was brought in from the outside in urns, and my coffee was brought to me in a paper cup even though a nice mug was on my table.  I also had a bottle of beer one night at the bar - disappointed that it was $12 but that’s life in the big city.  “Room service” is handled by an outside company but the prices were very reasonable.  \n\nThe room I had on the 22nd floor featured great soundproof windows but alarmingly for a brand new hotel the soundproofing didn’t seem to extend to the walls. I could fairly clearly hear people coughing and having normal conversations in other rooms, though I never heard like a tv blaring or anything that kept me awake.  But I do wonder what it might have been like had I had bad neighbors.  \n\nI should mention the basement gym is small but had maybe 4 treadmills, a spin cycle, a recumbent bike, and a couple of elliptical machines, along with some dumbbells and mats and things.  Pretty small but functional, and all brand new.  There was an odd filtered water machine that looked like a coffee maker - I’ve never seen a contraption like it before.\n\nOverall I liked the new Renaissance and look forward to seeing the new rooftop pool and bar when they eventually open. But hopefully the walls are not as thin as they seemed and the breakfast situation sees some improvement.","travelDate":"2020-02","tripType":"NONE"}
