{"helpfulVotes":0,"locationId":93561,"title":"Excellent place to stay in NYC","lang":"en","publishedDate":"2024-04-07","publishedPlatform":"MOBILE","rating":4,"text":"My favorite place to stay in NYC. The hotel is super charming, the rooms a little small but very comfortable. The restaurant and bar amazing (recommend the truffle mac&cheese, my kids favorite there since they were little). Amazing food at breakfast as well. The concierge always helpful. I’ve already stayed at soho grand over 5 times in my life and it’s still my first choice while visiting NYC. Great location as well.","travelDate":"2023-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Good vibes and service","lang":"en","publishedDate":"2024-04-06","publishedPlatform":"OTHER","rating":5,"text":"Amazing server named Siri he was very attentive and had a great personality. He filled all our needs. As for the the restaurant the prices were good and the environment was beautiful. Would come again. Amazing vibe with friends again would recommend","travelDate":"2024-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho at its best.","lang":"en","publishedDate":"2024-04-06","publishedPlatform":"OTHER","rating":5,"text":"The staff at the SoHo Grand are all top notch….but one stands out the above the rest….Lerdy. She went above and beyond when there were little bumps in the road. Hotel is in great location. It also has a great lounge on the second floor. DJ during the week so it has a cool vibe.","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Favorite  Place to stay in NYC!","lang":"en","publishedDate":"2024-04-03","publishedPlatform":"OTHER","rating":5,"text":"We had the best time at the Soho Grand!  Every step of the way was seamless, from pre- arrival planning to wonderful corner rooms with great views! Everything has been spectacular!  Thank you Soho Grand especially Kalwson and Naomi for making this an unforgettable trip!","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand was grandish","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":4,"text":"Stayed here recently on an added night to my NYC trip. I was staying at the ACE in their biggest suite and came here from a recommendation from a friend. The hotel was well kept, lots of smell of marijuana out side (real potpourri)  but better then the pee every where else in NYC. The valet gentlemen greeted me and showed me where to go, went to the front desk where I was greeted by Klewson? I think that was his name, was a little different and was kind, First he offered me water, asked me a cpl questions and then offered me my room. He was very polite and knowledgeable of the area when I pressed him for recommendations. \n\nThe room itself was comfortable, but a little smaller (but my other room was 1,500 square feet so of course found it small. Had a nice view of downtown NY. \n\nAt night upon my return from errands I ended up cruising by the bar, the bar was packed, celebrities and beautiful people. it was quite the vibe there. Probably best bar I frequented on my entire trip. \n\nNext time I visit NYC I will plan to stay there.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Thank you for all your help!","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":5,"text":"I book at Soho Grand very frequently and I am constantly impressed with the responsiveness of the reservation staff as I experience a lot of changes in my reservations. They are always on top of it, and it makes my life so much easier knowing I can count on them for help when needed. Thank you so much!!","travelDate":"2024-04","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Just an average experience with mediocre front desk service.","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"MOBILE","rating":3,"text":"Overall only a mediocre experience. Front office staff was not friendly and welcoming at all especially check out was not acceptable for a hotel that charges $500++ a night. Front desk was dirty with chips crumbles left behind. We had a room on the 14th floor but the street noise during the day was very apparent. Water in the shower was only lukewarm. There are better and more charming hotels in NYC. This one I can’t recommend.","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Good value for a top NYC spot","lang":"en","publishedDate":"2024-03-31","publishedPlatform":"MOBILE","rating":5,"text":"Girls trip to NYC and SoHo Grand was the perfect spot to base ourselves. Had a 2 bed suite with a lounge room which was very spacious and fantastic views from the 16th floor. Very comfortable beds, great room amenities. \nGreat service and friendly staff. When we asked for extra hangers, they brought a whole extra hanging rack which was fantastic\nVery easy to walk to SoHo restaurants, tribecca, Chinatown and LES. Great subway access. Fun evenings in the bar and lounge. \nHighly recommend","travelDate":"2024-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Best hotel in New York","lang":"pt","publishedDate":"2024-03-25","publishedPlatform":"OTHER","rating":5,"text":"It's the second time I've stayed here! Always wonderful service and an impeccable room with the best bed and the fluffiest pillows! Impeccable cleaning! Very well located close to the best restaurants and shops in NY! The hotel has\nA spectacular bar but at night it gets a little noisy so it's not a hotel for those who want peace and quiet! I will definitely stay here again!","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Love Soho Grand!","lang":"en","publishedDate":"2024-03-21","publishedPlatform":"OTHER","rating":5,"text":"I travel to NYC frequently and always try out new hotels and now I will only stay at Soho grand! The check in experience was top notch I felt like a king…at the desk Klawson went above and beyond to make sure the room was up to my likings and also recommended several restaurant\/local art galleries that were all 5 stars. I will be back soon!","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":93561,"title":"Stylish with a buzz!","lang":"en","publishedDate":"2024-03-21","publishedPlatform":"OTHER","rating":5,"text":"This hotel plenty of cool vibes, style and a very friendly group of hosts. I really enjoyed the buzz around this place. I was in NYC on business and especially enjoyed the marble desk in my room to get work done wehen suffering from jet lag. The bar and food is amazing the the jazz club very cool.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Everyone at soho grand knows how to make your night special!","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":5,"text":"Right off the bat at the door, Kent and Jermaine were so funny and kind at the while we waited. Once we were in, Tsering made us feel so special. It was our friend's birthday and he went above and beyond to make our night memorable. We were warmly welcomed and felt safe the whole time. Music, food and drinks are also impeccable.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho grand is amazing and their staff even more!","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":5,"text":"Tsering our waiter and dom in charge of the door absolutely amazing, both of them made the experience incredible, Tsering even brought cake to our friend for her birthday, drinks, ambiance everything 10\/10!\n\nSuper recommended, love this place!","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing service!","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":5,"text":"Dom is an absolute sweetheart and Tsering is the absolute best!! He always treats us with such grace and is always amazing. This place is always my go-to!!! I come almost every weekend with my friends and they have the best drinks, the best service, and the best ambiance.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Never disappoints!!","lang":"en","publishedDate":"2024-03-13","publishedPlatform":"OTHER","rating":5,"text":"Soho Grand is always a great time!! The rooms are average size per NYC; bed inens & bath products are high quality; food is always fresh and delicious; friendly and professional staff; and service is top notch. I feel very \"at home\" at every visit. There's always something going on in the evenings and the location is prime!!  Can't wait to go back!","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"Best Location. Stellar Customer Service","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"OTHER","rating":5,"text":"I travel quite a bit for work and have stayed at the Soho Grand a few times. \nI always had a great experience but during my last stay Barrington at the front desk added a wonderful element of genuine and warm customer service that made the hotel feel a bit more like home. Absolutely stellar! \nThat said, the location is the best, and the rooms are very clean (I'm a stickler). Housekeeping is also wonderful and I would highly recommend this hotel.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Still hip after all these years","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"OTHER","rating":5,"text":"After over 20 years , SoHo Grand maintained it is dark and moody deco and high service standard. Barrington  at the front desk is most helpful ! All other staffs including the concierge, housekeep were very courteous . The location is fabulous . Will return","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand Hotel's Guest Service Agent - Barrington Roberts","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"OTHER","rating":5,"text":"An enormous thank you to the Soho Grand Hotel's Guest Service Agent - Barrington Roberts, for the impeccable personalized service. His attentiveness and genuine interest in making our stay extraordinary were evident in every recommendation tailored to our preferences. From unique dining experiences to off-the-beaten-path attractions, Barrington's commitment to ensuring our satisfaction made our visit truly exceptional. Kudos to Barrington and the entire team for their outstanding hospitality!","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Returning on next trip","lang":"en","publishedDate":"2024-03-10","publishedPlatform":"OTHER","rating":5,"text":"The stay at soho grand is always an easygoing one. Food is always  delightful to have. Beds behind comfortable and excellent location. Definitely coming back, Barrington was a big help too and efficient with matching out requests. Looking forward to coming back.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"5 stars","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":5,"text":"Amazing service from staff. Gorgeous room. Barrington at guest services is a delight. He made my birthday staycation memorable. Had a great stay in this beautiful hotel in my favorite neighborhood. The club room was a fun time too. Love \/ recommend","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Exceptional service.","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"MOBILE","rating":5,"text":"I want to extend my heartfelt thanks for the exceptional warm reception I received from Barrington upon arriving at the Soho Grand. His attentiveness and accommodation greatly enhanced my experience at the SoHo Grand.  I will most definitely be back!","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Outstanding service","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":5,"text":"Having not stayed at The Soho Grand for some years i was a bit dubious  what to expect in terms of aesthetic and service. It turns out that The Soho Grand has the best service i have experienced in years mainly due to Barrington Roberts and his fellow reception staff - utterly delightful and could not do enough for my party. The outstanding and friendly service extends to the Concierges and Room Service folk. Cannot wait for my return.\nTerry Hart","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"SoHo Grand. A “grand” experience with Tsering and company","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":5,"text":"Gracious host and late afternoon experience. SoHo treasures and a nice leisurely round of excellent drinks in a lively and classy setting. Tsering was an exceptional professional, a reflection of the Solo Grand style and flair. From the front entry greeting to the second floor to the host to the wonderful service provided by Tsering…… we felt like lucky tourists and we live here. Such a fine aspect of a lovely afternoon of galleries, walking and loving our city","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"I love this hotel!","lang":"en","publishedDate":"2024-03-08","publishedPlatform":"OTHER","rating":5,"text":"This is my second long stay at the Soho Grand and each time from the moment I arrive, I always feel so well taken care of by everyone who works in this beautiful hotel. The Guest Experience Manager Marcus Morales is wonderful! He made sure I was happy with my room and helped me with all of my special requests. Remington Alexander was so sweet and helpful to me each day as I did business from the lovely lounge area in the lobby. The location in Soho is perfect - away from the touristy part and so many great places to eat and shop. The rooms in the hotel are well designed, spacious and comfortable - and the views of the city are so special. I love this hotel!","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Loved the atmosphere","lang":"en","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":5,"text":"Stylish, casually elegant vibe. Love the lobby bar with enormous windows. Downstairs bar felt intimate and warm. Rooms were well thought out to make the most of space. Decor is dark, which can feel cozy or gloomy depending on taste. Excellent service all around. Recommend you do not book a room near the club due to noise at night. Great value for the prime location and outstanding service. Very well run and well-maintained property. Will definitely be back.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Make you feel important!","lang":"en","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":5,"text":"Good breakfast and attendant were friendly and polite,Nichole at the desk is doing a wonderful job ,we had required a certain service late at night and the respond was quick and efficient.\nOverall one of the lowest price you can find while staying in New York,the metro is at the corner and you can walk to Brooklyn bridge","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"My favorite hotel in NYC","lang":"en","publishedDate":"2024-03-05","publishedPlatform":"OTHER","rating":5,"text":"Wonderful hotel. I stay there often, for over 10 years. Good rooms, helpful staff, great food, cool bar. The concierges are always very kind and get last minute tickets to the best broadway plays, basketball matches, jazz clubs...Not to say it is located in one of Manhattan best neighborhood.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Great experience at the SoHo Grand!","lang":"en","publishedDate":"2024-03-04","publishedPlatform":"OTHER","rating":5,"text":"We stayed at the Soho Grand this past weekend. We had a wonderful stay from the moment we got there to the moment we departed. We met some wonderful employees - Barrington, at the front desk was always gracious and helpful especially when we asked him to make arrangements to have a tip delivered to the cleaning staff. William who tends bar is a great guy and showed us his tricks of the trade to making an excellent Old Fashioned! And Alexis Ortiz provided us a list of 6 great restaurant choices. (can't recommend Locanda Verde and Anejo enough!)\n\nWe rented a large king room that had beautiful views of the city. Plenty of room, comfortable bed and large bathroom. \n\nThe hotel is lively and is a crowded, popular place at night for young adults. Even though we are in our 50’s\/60’s, it didn’t bother us and we still enjoyed a drink and the people watching. There is a nightclub in the hotel I understand it can get loud so I recommend a hotel room near the top of the hotel room. We never heard any noise. The hotel is dimly lit - maybe too much so for our liking but it did not take away from a really enjoyable stay.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Best home base in Soho","lang":"en","publishedDate":"2024-03-02","publishedPlatform":"OTHER","rating":5,"text":"Clean, well-appointed rooms.\nPerfect location for shopping, dining and nightlife.\nEasy access to the subway system.\nBest part is the staff, especially Barrington at the front desk who didn’t hesitate to upgrade my room during a longer stay.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Outstanding service and stay!","lang":"en","publishedDate":"2024-03-01","publishedPlatform":"MOBILE","rating":5,"text":"We had such an amazing time. Barrington, the front desk agent, was prompt, professional, and very accommodating! The hotel is amazing. The bed is very comfortable, the food in the lounge and the diner is amazing, the bar is great. Looks like we found our new favorite hotel!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Flawless","lang":"en","publishedDate":"2024-02-25","publishedPlatform":"OTHER","rating":5,"text":"It is a great location and sophisticated environment. The restaurant and bar are excellent, too. Staff are very kind. No complaints. I highly recommend this hotel. I will come back if I come to NYC again. \nAaaassszzzzzzzaaaaaaAAAAAAAAAAA","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"SoHo Grand is the TP! ⭐️⭐️⭐️⭐️⭐️","lang":"en","publishedDate":"2024-02-24","publishedPlatform":"MOBILE","rating":5,"text":"I took my daughter to NYC for a brief getaway.  We arrived exhausted from walking NYC all day.  Barrington met us at the checkin desk with a lovely glass of champs and several water bottles.  Wow what stellar customer service he provided us with. We had a lovely king size bed in our beautiful relaxing room.  I’ve stayed many places in NYC and without a doubt SOHO grand is my new favorite.  I can’t wait to come back for more great customer service and to stay at this lovely hotel.  It will be my go to recommendation for friends and guests coming to visit.  FR SOHO GRAND has all the charm and Barrington has all the rizz. Together it’s the TP. ⭐️⭐️⭐️⭐️⭐️","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Anniversary @ Soho Grand","lang":"en","publishedDate":"2024-02-23","publishedPlatform":"OTHER","rating":5,"text":"Soho Grand was an absolute dream! I stayed with my gf for our anniversary\/ \nValentines staycation. The hospitality, asthetics and service were 5 stars! Special shout out to Mustafa , Raul, Omar and Battington who made us feel right at home. The room was clean, comfortable and had the best fluffiest pillows in town. I will\nRecommend to friends for sure!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Romantic, wonderful place that is insanely Pup Friendly.","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":5,"text":"First off, if you have a dog with separation anxiety, this is possibly the greatest hotel to stay at in NYC.\n\nWe were welcomed quickly and courteously by the wonderful staff, starting with Barrington, who ran through the dog friendly amenities and got us to our well appointed room pleasantly and efficiently.\n\nThe room is well apportioned with some timeless touches, bed is extremely comfortable, and the bathroom \/ shower situation is solid. Robes included to lounge in.\n\nBeing able to eat with your dog is pretty amazing (again, if your pup has separation anxiety, this is a no-brainer), as he was welcome pretty much everywhere on the property. He enjoyed cocktails with me and my partner, and we enjoyed being in a high class venue with our little guy, a rare and welcome treat.\n\nFood and drink, excellent.\nStaff, from start to finish, attentive.\nVenue, beautiful.\n\nWe'll be staying again.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Awesome","lang":"en","publishedDate":"2024-02-21","publishedPlatform":"OTHER","rating":5,"text":"My group had a fabulous stay at the Soho Grand. Every single person working in this hotel went above and beyond to make our stay perfect. Super  clean and comfy accommodations, great location, and fun crowd at night.  We all laughed about how amazingly we slept. I highly recommend the SG.","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Stellar Experience at SoHo Grand Hotel","lang":"en","publishedDate":"2024-02-21","publishedPlatform":"OTHER","rating":5,"text":"Kevin’s warm welcome set the tone for the entire stay. We enjoying finding peace in the bustle of New York City and enjoyed the hotel’s incredible bar and diner. Would highly recommend this hotel and applaud the staffs professionalism. 10\/10","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Warm welcome and unique ambiance","lang":"en","publishedDate":"2024-02-21","publishedPlatform":"MOBILE","rating":5,"text":"Stayed here for a quick business trip and the SoHo Grand never disappoints.  Barrington checked me in with a gracious ‘welcome back’ and made me feel at home right away.  The room was clean, modern and comfortable and the SoHo location was great.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Exceptional stay at the Soho Grand!","lang":"en","publishedDate":"2024-02-19","publishedPlatform":"OTHER","rating":5,"text":"Phenomenal team led by Marcus who always prioritize their visitors. The staff were beyond compare—attentive, friendly, and always going the extra mile. The room was a haven of comfort: spotless, modern, and incredibly cozy. A truly outstanding experience, where every detail was perfected.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"A Great Hotel!","lang":"en","publishedDate":"2024-02-15","publishedPlatform":"OTHER","rating":5,"text":"Background: I recently retired after 41 years as a firefighter and paramedic. My wife and I saved up to celebrate my retirement by visiting NYC, which is actually my original hometown. After much research into which hotel we would stay at, we decided on the Soho Grand Hotel, based on the many positive online reviews and close proximity to several of the neighborhoods that we enjoy.\n\nUpon our arrival, we were greeted by hotel doormen Danny and Jose, who welcomed us and took care of our luggage. These same two gentlemen would continue to look after us during our stay, by offering us a smile and warm greetings as well restaurant recommendations (check out Soho pizza on the corner) and local directions.\n\nAfter checking-in at registration and receiving our room keys, we made it up to our room, which was located in the 11th floor and afforded us some views of the world below. Our luggage soon arrived as well as a welcome gift of a bottle of wine from Manager Marcus Morales. Thank you Marcus! The room itself was spacious and nicely appointed. The bathroom too was really nice  and very roomy. The room’s\nlighting controls were a bit “quirky”, but we eventually got the hang of it. The shower controls were a bit “touchy” and it was somewhat challenging to adjust the water temperature at times.  All in all, one of the nicer hotel rooms that I’ve stayed in. Also, the hotel elevators were extremely fast and almost always available.\n\nOur trip was budgeted for 10 nights and that was a stretch for us, as the hotel is a bit pricey for\nus. Unfortunately both my wife and I contracted COVID while in NYC, requiring a self-imposed 5 day quarantine as well as needing to add 3 additional nights to our stay, until we were well enough to travel back home to California.\n\nWe notified the hotel staff of our illness, as we did not want to expose housekeeping or other hotel staff (or anyone else) to possibly getting sick.\n\nWhile we were on “lockdown”, the front desk manager called and checked on us daily, to see if we had any needs. She offered us tea and fresh towels\/sheets from housekeeping, since we could neither leave our room or let housekeeping in. This was very kind of her and much appreciated. Speaking of Housekeeping, we met a very sweet woman named Muriel, who also checked in on us frequently and offered to meet any needs that we might have. Muriel is a keeper, for sure.\n\nAll in all, we had a great time at the Soho Grand Hotel. Even though we were only able to explore NYC for about 5 full days out of our 13 day trip, we made the best of it. The staff at this hotel turned a crappy situation into a tolerable situation and we were grateful for this.\n\nIf we can afford to, my wife and I hope to return to NYC sometime in the next few months, to see and experience some things that we missed during this trip. Although we may have found our new “home away from home” at the Soho Grand Hotel, we may have to stay elsewhere next time, as our finances took a bit of an unexpected hit this time and we look for something a little bit more inexpensive. That being said, the rates at Soho Grand Hotel are quite attractive in January\/February, so maybe again next year or the year after?\n\nI recommend this hotel to anyone who wants a hip, stylish yet very\nfriendly place to stay. The neighborhood is also great and very walkable.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Uniqueness in SOHO!","lang":"en","publishedDate":"2024-02-11","publishedPlatform":"OTHER","rating":5,"text":"What an experience! From the moment I checked in at the front desk, this place was different. It had character, unique restaurants and great service. Barrington checked me in and I felt like we were instant friends. He cared so much about me, my experience and even helped others around me while I was waiting. He was incredible. Thank you, Barrington!","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Great aesthetic and great hospitality!","lang":"en","publishedDate":"2024-02-11","publishedPlatform":"OTHER","rating":5,"text":"My girlfriend and I had a great experience staying at this hotel.  Barrington at the front desk made me feel especially welcome. He was very helpful and accommodating. We  enjoyed the two DJs that played  music all night long in the lobby. We would definitely come again.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Magnificent hotel and vibe","lang":"en","publishedDate":"2024-02-10","publishedPlatform":"OTHER","rating":5,"text":"Most classy hotel with great furniture art and most unbelievable and friendly service. thank you to Claudia and Danny for making us feel so welcome and special. you guys totally made us feel very at home in the big apple. and we really\nappreciate it. Thank you.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Always a gem","lang":"en","publishedDate":"2024-02-10","publishedPlatform":"OTHER","rating":5,"text":"The SoHo Grand has been my home away from home since the week they opened. Always an oasis and everyone, especially Jose at the door and Barrington at the front desk, is so charming and helpful. And the lobby lounge is the most gorgeous and grand there is. I love how peaceful it is in the morning for coffee and meetings. Just divine — every time!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"CODY best sever EVER","lang":"en","publishedDate":"2024-02-09","publishedPlatform":"OTHER","rating":5,"text":"CODY is the best sever I have had truly ever in my life. It was my friends birthday and he pulled out all the stops. Secret signals for cake, non stop drinks, laughing and joking with everyone. Would come back just to have him be my sever again. Gonna be here for all my birthday events to come.","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Cody is the best","lang":"en","publishedDate":"2024-02-09","publishedPlatform":"OTHER","rating":5,"text":"We had a table and our waiter Cody was absolutely amazing. Very attentive and friendly and personable. Definitely made the experience worth it!! We were never waiting too long for anything and he always was ready to have a nice little conversation in between drinks! Great server!!!!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"World class service","lang":"en","publishedDate":"2024-02-07","publishedPlatform":"MOBILE","rating":5,"text":"The Soho grand is a beautiful hotel, but the real standout feature for me was the service. From the moment I arrived at the front desk, Barrington Was a breath of fresh air after a long day. He offered us water and a glass of Prosecco and was very jovial. We were both belly laughing before we were finished with the check-in process. The room was spectacular with obstructed views, north and west, and we had an incredibly romantic evening. Kudos to Barrington and the team at the front desk for really going the extra mile.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Great Stay!","lang":"en","publishedDate":"2024-02-05","publishedPlatform":"OTHER","rating":5,"text":"My one night stay at the SoHo Grand Hotel was a lovely experience. When I checked in, I was greeted warmly by Barrington Roberts who explained the layout of the property and its amenities with enthusiasm. It was a great stay and I will be back again soon!","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Exceptional Service at Soho Grand - A Shoutout to Leidy","lang":"en","publishedDate":"2024-02-03","publishedPlatform":"OTHER","rating":5,"text":"From the moment we stepped into the Soho Grand, we were greeted with the warmest welcome by Leidy at the front desk. Her professionalism, efficiency, and genuine kindness made our check-in process seamless and set a wonderful tone for our stay. Leidy went above and beyond to ensure our comfort, offering helpful recommendations and attending to our every need with a smile. It's employees like Leidy that transform a good stay into an exceptional experience. We're grateful for her outstanding service and can't wait to return. Thank you, Leidy, for making our visit to Soho Grand truly unforgettable!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Great stay","lang":"en","publishedDate":"2024-02-02","publishedPlatform":"OTHER","rating":5,"text":"Barrington  at front desk was very accommodating and  paid strong attention to details even noticing it was my birthday. The comp champagne and corner room placement went along way for a memorable stay. I would definitely come back and stay for longer.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"A wonderful stay, from check-in to check-out","lang":"en","publishedDate":"2024-02-02","publishedPlatform":"OTHER","rating":5,"text":"What a wonderful treat to stay at the Soho Grand. And GRAND it was. It started at check-in with the incredible Barrington Roberts (and, I mean, what an equally incredible name), who was welcoming, personable and just such a pleasure. The room was well appointed, and the bed so comfortable. The decor, unparalleled, and loved the attention to detail, from the mini bar accoutremounts, the retro radio and the euro-style light switches. Also, THANK YOU for decent lighting, especially in the bathrooms! In addition to guest room, loved the public spaces— the lounge\/bar, excellent for breakfast through cocktails and late night. All in all, a wonderful stay that I hope will be frequently repeated.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":93561,"title":"Beautiful hotel\/ FANTASTIC service!!","lang":"en","publishedDate":"2024-02-02","publishedPlatform":"OTHER","rating":5,"text":"My girlfriends and I recently planned a Girls Trip to NYC and decided to stay at the SoHo Grand Hotel!  This was a new hotel and part of NYC for us - what an absolute pleasure!!!! The hotel felt cozy yet elegant!  Very beautiful in fact!  But the real showstopper was the service we received!  The Guest Manager, Marcus Morales, personally helped us plan the trip, made sure we reserved the best room, and even checked on us throughout our stay.  This was in December when NY is super busy, but Marcus made us feel like the only guests. There is no doubt that we will go back - in fact, I’m planning another trip now with my family and we will definitely stay at the SoHo Grand again!","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"À perfectly fine hotel","lang":"en","publishedDate":"2024-01-29","publishedPlatform":"OTHER","rating":4,"text":"Barrington at the font desk greeted me and welcomed me into the hotel...his bright smile and charming manner definitely invited me in!\nThe balance of my stay was fine...I hesitate to say it was outstanding, because I wasn't really impressed with the room itself.\nAlthough I was \"upgraded\" it was, in my experience, a room in bed of updating, with scratchy linens, lighting and entertainment controls that were over a decade old...and with my having to call the front desk multiple times during my two day stay for things like towels (there were only two), toilet paper (no extra roll...at all), and to get the Wi-Fi fixed.\n\nThe staff were all absolutely delightful and very helpful...but for what is considered a 5 star hotel....I felt like it fell short.","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"Another amazing stay","lang":"en","publishedDate":"2024-01-29","publishedPlatform":"OTHER","rating":5,"text":"Everything is always wonderful at the Soho Grand!  I ended up staying 4 nights but wish I could stay a month! Truly great staff from the doormen to the people in the restaurant to the front desk to housekeeping...everyone is so kind and helpful. I'm also in love with their beds and pillows. So grateful to have such a wonderful hotel right around the corner from my daughter. I will be back soon!!","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Last minute blast","lang":"en","publishedDate":"2024-01-29","publishedPlatform":"OTHER","rating":5,"text":"Booked here on a last minute whim. Perfect location for a night out in Soho. Plus the bar and nightclub were their own scenes. The staff was pleasant and our front desk agent, Barrington, was a huge help. Excellent service all around. All in all it was a great one night… stay.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Soho Grand,  Barrington was the grandest","lang":"en","publishedDate":"2024-01-26","publishedPlatform":"OTHER","rating":5,"text":"Barrington at the front desk made sure my stay was superb.  He greeted my group with a big smile, and made sure my room was just what i needed - quiet. the Soho Grand is lucky to have him.\nEnjoyed the jazz band in the lounge but the minimum per person was a bit high","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Excellent Stay at Soho Grande!","lang":"en","publishedDate":"2024-01-25","publishedPlatform":"OTHER","rating":5,"text":"My stay at the Soho Grande was phenomenal. Big \"Thank You\" to Barrington at the front desk who made my check in smooth, offered me bottle of water and champagne, and also set up a late check out!  \n\nAdditionally, \"Thank You\" to the ballroom staff that made working from bar and grill seamless and enjoyable. \n\nI definitely look forward to another stay!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Great NYC Service","lang":"en","publishedDate":"2024-01-24","publishedPlatform":"OTHER","rating":5,"text":"Barrington at the front desk made check-in easy and FAST! This hotel is my go-to when in NYC and each stay gets better. Service was wonderful and easy to request\/coordinate. Rooms are roomy, much bigger than the typical NYC hotel room. Overall it was another great stay at Soho Grand :)","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":93561,"title":"Home from home in NYC","lang":"en","publishedDate":"2024-01-23","publishedPlatform":"OTHER","rating":4,"text":"The mattress was just wonderful- I felt like I was in heaven. And would like to give a shout out to Barrington Roberts who made my stay just perfect. Wonderful. Just be careful of the treats and booze in your room - a little on the pricey side!!!","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Amazing Team","lang":"en","publishedDate":"2024-01-20","publishedPlatform":"OTHER","rating":5,"text":"Absolutely an amazing time so far! Loni went out of his way to walk multiple blocks in the sub-freezing temps to find a bottle of my favorite drink. The staff and care for their guests set hotels apart from each other. Everyone at the hotel has been so friendly and welcoming. I have high expectations and they have gone above and beyond.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"I am ready to book my next trip back, and it hasn't even been 24hrs since i left Soho Grand.","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"OTHER","rating":5,"text":"First time staying here and I am 100% going back. from the moment we arrived, our bags were taken from us and brought up to our rooms, and then we met Barrington at the front desk, one of the nicest most professional, and customer service-driven guest service agents I've had the pleasure to be assisted by. I was there for work, but this trip also happened to land on my birthday. Barrington quickly noticed and offered my wife and me a bottle of prosecco and upgraded us to a room with a nicer view of the city. \n\nThroughout our stay, he continued to check up on us and would greet us every time he would see us in the lobby. \n\nThe bar staff at the jazz bar were also amazing, Fahim assisted us and made sure we were taken care of even during their busy moments at the bar. \n\nOur room was beautiful, and the bathroom was my wife's favorite, along with how comfortable the bed was and of course the view. I didn't catch the name of our maid but she did a great job so I made sure to leave her a note and tip on our way out. \n\nDuring the late hours of the night (after drinking a bit too much), I needed a few bottles of water, and they were brought up to my room in no more than 2 minutes from the time I called and free of charge. \n\nover we loved our stay and the service, the drinks were good and the breakfast was delicious, but also don't forget to tip well when people are being nice and helpful.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Great Experience","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"OTHER","rating":5,"text":"Amazing stay and nice rooms. I loved the big tv and the shower was amazing. Perfect size for a couple. i love the fact that the hotel had a bar, club and 24 hour dinner. Which I used all 3 every day of my stay. I would recommend this hotel to anybody staying in Brooklyn.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"I will come back! Absolutely recommend!","lang":"en","publishedDate":"2024-01-15","publishedPlatform":"OTHER","rating":5,"text":"My stay at SoHo Grand Hotel was absolute perfection! This hotel is just what I like \/ what I would recommend anybody! Such an unique,  vibey, clean, professional hotel, with one of the best location I experienced in the city! An amazing and helpful personal, and bars \/ night events \/ dj \/ parties \/ Live Bands! Safe to say, there’s something for everybody. \n\nBarrington was the host that took care of me my entire stay, and I’d like to thank him specifically for his great recommendations, but most importantly amazing energy and impeccable service! Thank you B :)","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":93561,"title":"Always a great stay!","lang":"en","publishedDate":"2024-01-15","publishedPlatform":"OTHER","rating":5,"text":"Always love our stay at Soho Grand. Service and staff are fantastic. Rooms are updated and comfy. Love the bar. Great cocktails. Location is perfect. Close to many great restaurants and shopping. This is the only place we stay when we go into the city.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Awesome Hotel","lang":"en","publishedDate":"2024-01-14","publishedPlatform":"OTHER","rating":5,"text":"This hotel is awesome! Loved the atmosphere and the rooms. Also, the staff is SO friendly. Barrington at the front desk was great and made our experience even better! I highly recommend this hotel, especially if you’re looking for a social NYC environment.","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"I’m owed nothing!","lang":"en","publishedDate":"2024-01-11","publishedPlatform":"OTHER","rating":5,"text":"Marcus is the only reason I’m writing this. The hospitality he showed our team was superb and warranted the need to give a review. Traveling to host a major, out-of-state event comes with its own set of challenges, so ease is necessary anywhere you can find it. Marcus gave us that and we are eternally grateful!","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Fabulous Hip Spot in Soho","lang":"en","publishedDate":"2024-01-10","publishedPlatform":"OTHER","rating":5,"text":"The service at the Soho Grand is why I keep going back when I am in NYC.  Staff is well trained and courteous, beds are SO comfy, roomy powder rooms for getting ready.  Check in was smooth and Barrington was so helpful, had a big smile and made it fun!  He was so helpful throughout my stay (I always have questions) They even have a dog park if I want to bring my little dog sometime.  Love the black out curtain and it's very quiet, a must for beauty sleep!  The spicy amenities available in the room are absolutely hilarious, you guys think of everything!  Great place to ring in the New Year and I look forward to my next stay.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"The perfect stay in a prime location","lang":"en","publishedDate":"2024-01-08","publishedPlatform":"OTHER","rating":5,"text":"The hotel was in a prime location which was what caught our attention initially. The food at the hotel was amazing. The service was impeccable. Reagan was so lovely in making sure we were taken care of for our stay. We stayed from December 29- January 2. They had incredible decorations for the new year and we were greeted with champagne upon arrival as well as nye. I highly recommend staying here for a perfect stay in a great location, walking distance from many amazing restaurants and shops. ","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand Stay","lang":"en","publishedDate":"2024-01-06","publishedPlatform":"OTHER","rating":5,"text":"We loved our stay at the Soho Grand.  Our room was beautiful and the bed was incredibly comfortable!  Everyone was friendly and helpful.  It was a great place to stay for a weekend in the city.  We were close to multiple restaurants and bars so getting around was a breeze.  We also ate at the Soho Diner and had a great breakfast!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay ","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"OTHER","rating":4,"text":"Great location, nice rooms but which could use a little refreshment - pillows are way too fluffy!!  The staff is incredible. From the doormen 👍👍 to the housekeepers, everyone is so nice. We went through being sick during this stay, and everyone at the hotel was so nice and helpful. \nThe only negative comment is regarding the room service menu. I bit too expensive and a lack of choice for in-room dining. ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Grand stay","lang":"en","publishedDate":"2023-12-22","publishedPlatform":"OTHER","rating":5,"text":"Grand stay this December at the Soho Grand! Was my first time staying at the hotel on a friend's recommendation, and was impressed with the friendly, above-and-beyond service (from the front door, to reception, to the diner, to the lobby lounge - special shout out to Leidy, Remington, and James). Booked a corner King room which had plenty of room overlooking the street, and loved the overall hotel vibe. Great neighborhood to duck into a million cool spots to eat, drink, and of course take advantage of all the shopping. Easy walk from Soho to east and west village etc. Will definitely be back!","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great Stay","lang":"en","publishedDate":"2023-12-22","publishedPlatform":"OTHER","rating":5,"text":"This hotel is gorgeous, classy and upscale! It's close to the Village area so very convenient. I want to shout out the front desk staff, Barrington- for having such a great smile and being so helpful at check in! I would definitely stay here again. ","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Terrible stay","lang":"en","publishedDate":"2023-12-21","publishedPlatform":"OTHER","rating":1,"text":"Extremly dirty room, the floor hasn’t been cleaned for months! I accidentally dropped a pen under the bed, yikes! We also found old food in the cabinet. We stayed for a week and paid USD 1000 a night, you will find a far better hotel for that kind of money! \n\nThe staff is unpolite and plain rude! \n\nYou should also know that the hotel has a night club and when you return to the hotel in the evening it is really difficult to pass by the (drunk) crowd. \n\nTry Mercer instead, it is fabulous!","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand is THE PLACE to stay in NYC","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"OTHER","rating":5,"text":"I have stayed at The Soho Grand 3 times in the past year and each time has been a wonderful experience! Great location and a great customer experience! \nThe Soho Grand team is all so kind and helpful and phenomenal- they always take care of us and make sure we have everything we need to have the best stay! ","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Xmas time in NY","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"OTHER","rating":5,"text":"Amazing stay.\nPerfectly located and very well maintained.\nPerfect for shopping and dining around! \nMy room on the 14th floor had a beautiful view.\nI was impressed by the cleaning service, impeccable.\nI must thank Mark during the reservation time and Charles and Claudia for the warm welcome. Highly recommended!\n","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Never Fails to Please","lang":"en","publishedDate":"2023-12-11","publishedPlatform":"MOBILE","rating":4,"text":"Love the location and property.  Travel so much, we spend 10-12 days a month in hotels, so we LOVE when the properties partner with AMEX and keep a log of our history with them.  We arrived late Thursday and were greeted wonderfully with a room upgrade (AMEX perk) to a corner room- a note had been placed that i like extra pillows and towels so those items had been placed and water for Will and Prosecco for me lol.  Smallish room but, as always, handsomely appointed with a lovely view up w Broadway.  Had daily full American breakfast (Amex perk) and enjoyed a $100 property credit in the lounge for an afternoon snack (get the ricotta and pita!)\n\nThe lounge has the music WAY too loud at 715 (met friends for a pre dinner drink Friday night and couldnt hear them).\n\nAlexis, at reception, a stand out and AMAZING team member.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":93561,"title":"Best hotel in the city","lang":"en","publishedDate":"2023-12-08","publishedPlatform":"OTHER","rating":5,"text":"Soho Grand exceeded every expectation I had. It has a true boutique feel to it, incorporating elements of the surrounding neighborhood into its design and ambiance. The staff is also wonderful - from the doorman that greeted me upon my arrival to the bartender in the Grand Bar (which has an incredible bourbon selection by the way). You can tell the room is thoughtfully prepared for your arrival, creating a cozy and comfortable home base for you during your stay in the Big Apple. My favorite part of the hotel is the vibrant energy that permeates through the building. From a classic dinner experience to a lively bar and club room, the hotel truly emulates the energy of the incredible city New York is. Could not recommend staying here more.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Nice weekend!","lang":"en","publishedDate":"2023-12-03","publishedPlatform":"OTHER","rating":5,"text":"Enjoyed great weekend stay at hotel. It is pricey, but surely if fantastic. Service and staff 5 Star!. great location, Nice upscale diner attatched. Nice place. Wish it was a bit more affordable. I will go back for special occasions....","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":93561,"title":"Beauty, Grace, and impeccable service.","lang":"en","publishedDate":"2023-12-03","publishedPlatform":"MOBILE","rating":5,"text":"It’s what you would expect from a hotel. The atmosphere is sophisticated with a 1940s decor feel. The staff is extremely cordial and accommodating. The rooms are quiet and comfortable. The dining and room service are impeccable. I would gladly stay here again and again. No gripes here. Not.  One.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Great location","lang":"en","publishedDate":"2023-12-02","publishedPlatform":"MOBILE","rating":3,"text":"Great location which enabled us to walk everywhere we wanted to go. Hotel was very dark, needed more lights. Room size was good. We informed reception we were leaving early in the morning and was told the desk and lobby were always manned. No one was there when we left and luckily we ordered our own Uber as no one was there to get us a cab\/help with luggage","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":93561,"title":"Wonderful experience!","lang":"en","publishedDate":"2023-11-30","publishedPlatform":"OTHER","rating":5,"text":"From the moment I arrived for a week long stay, I felt better taken care of than at any other hotel I've previously stayed.  Everyone is so kind and attentive. Andrew at the front desk made sure I had a room that would be quiet. On a very busy night, Chris, the manager at the Club Room helped me with last minute reservations and seated me at a table where I could watch the show. The rooms are immaculate, spacious and the bed is so comfortable. The room service was fast and the food was delicious. I loved the automatic sun shades and the bluetooth radio was fantastic. My entire visit was wonderful. I can't wait to be back!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Can’t SLEEP HERE!","lang":"en","publishedDate":"2023-11-24","publishedPlatform":"MOBILE","rating":1,"text":"LOUD THUMPING Music PLAYS UNTIL 2am (hopefully) -  we called downstairs at 1 am and were told it was the restaurant and should go off on an hour!! Looks like a nice place but don’t bother to surge the night, maybe just visit the lobby bar for overpriced drinks … MAYBE","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Loyal Soho Grand guests for 25 years","lang":"en","publishedDate":"2023-11-24","publishedPlatform":"OTHER","rating":5,"text":"Wonderful family trip, including our dogs! We always stay at the Soho Grand and the service and experience are always perfect. It’s a luxury hotel but the staff are friendly and down to earth. Everyone is super helpful. And best coffee in town at Soho Diner.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Top notch hotel driven by great service","lang":"en","publishedDate":"2023-11-23","publishedPlatform":"OTHER","rating":5,"text":"First, Thanks to Claudia at the front desk, a welcoming smile in a bustling city. Because we were Capital One members we got a free upgrade and $50 credit. So that was cool. The room was large for NYC, and the bed super comfortable. A ridiculously large TV that I could link to my phone for the remote (but I couldn’t for the life of me figure out how to get my Netflix). Interesting drinks at the bar, and a good diner in the ground floor (pricey…but it’s NY). So many interesting architectural touches, too. I still can’t figure out whether it’s old and redone, or whether it’s new. It was that flawless","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Exceptional Customer Service","lang":"en","publishedDate":"2023-11-22","publishedPlatform":"OTHER","rating":5,"text":"Definitely not inexpensive but worth every penny.  Dave Chapelle stayed there while I was there which gives you an idea of the quality of the hotel.  The staff are very conscientious of all their guests, from nobodies like myself to celebrities like Mr. Chapelle (no one there told us he was there).  The service sets them apart.  Just one example, we told the young woman checking us in about a special event occurring while we were there and she remembered and sent up champagne and chocolates on the day of.  Gratis.  \n\nThere is a top-shelf restaurant located in the hotel and a 24 hr, attached diner both of which provide room service.  \n\nAnd, right around the corner from the hotel is a 99 cent pizza place which is shockingly good in case you have a hankering for pepperoni at 3am.  ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Perfect Stay at the SoHo Grand ","lang":"en","publishedDate":"2023-11-22","publishedPlatform":"OTHER","rating":5,"text":"The Soho Grand is the only property I want to stay in from now on when visiting NYC. Marcus, the property’s Guest Experience Manager made sure I well taken care of before I even arrived. A++ experience, perfect Soho location, staff goes above and beyond to support any request, from printing, shipping etc. I was staying for business and really just used my room to work and crash, but work or leisure, I’ll definitely be back!\n\nX","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great location, staff and ambiance. ","lang":"en","publishedDate":"2023-11-21","publishedPlatform":"OTHER","rating":5,"text":"The location is truly the best. Neat shopping and restaurants. We rarely needed to use public transportation. The staff is helpful and friendly and the rooms are spacious. The ambiance is very cool as well. All around great stay. We will be back. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand ","lang":"en","publishedDate":"2023-11-15","publishedPlatform":"OTHER","rating":5,"text":"I stay regularly at the Soho Grand.  The team there is always kind and friendly. Service is always top notch. Marcus Morales, remembers me and always stops to say hello and offers amazing guest service.  I’ve stayed all over the city and I will keep coming back to the Soho Grand.  ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Chill and luxe","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"OTHER","rating":5,"text":"Great hotel experience in soho, chill vibe, friendly staff, excellent food & beverage, spotless rooms with luxe amenities.   Gym is a little small, but they have decent equipment.  Have stayed multiple times and will continue to do so!","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":93561,"title":"Scrumptious Breakfast","lang":"en","publishedDate":"2023-11-09","publishedPlatform":"OTHER","rating":5,"text":"Scrumptious Breakfast served in the guest lounge. Great service. Cool music. Nice vibe. Relaxed. Great place for business meetings. Staff attentive without being too intrusive. Good choice of dishes and hot drinks","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Best Hotel in The City","lang":"en","publishedDate":"2023-11-06","publishedPlatform":"OTHER","rating":5,"text":"My stay was amazing as usual and the Manager Marcus goes over and beyond for any of your needs. My favorite place to stay by far in New York. Plus you can’t find a better location. Everything you need","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Fabulous Experience at SoHo Grand","lang":"en","publishedDate":"2023-11-02","publishedPlatform":"OTHER","rating":5,"text":"SoHo Grand did not disappoint from the moment we entered the hotel! My husband and I decided to visit NYC for our anniversary, which was a great decision. The hotel staff is superb, the rooms were comfy\/cozy, the location was perfect! Once they found out it was our anniversary, a nice bottle of Champagne was sent to our room as well as 2 breakfast tickets to the hotel restaurant. The bar\/restaurant was the right vibe, love the music, and the ambiance. I will recommend this hotel x10 as we will return in the near future. Thanks SoHo","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Ultimate Hospitality ","lang":"en","publishedDate":"2023-10-31","publishedPlatform":"OTHER","rating":5,"text":"Soho grand is our home (& office) away from home. Marcus made this stay extra welcoming;  our corner room had a view so nice we had to extend our staycation.  Breakfasts in the lobby bar are a must.  Our service animal also gives the hotel and dog park five paws🐾🐾🐾🐾🐾","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing NYC hotel","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"I recently moved out of nyc. This is the only hotel I stay at. The staff is very friendly and attentive. The lobby is nice and quiet during the day like a living room. I frequently sit on one of the couches and read. And at happy hour there is a great crowd. It’s also in one of the best shopping areas in the city. Conveniently located next to all the subways. In my opinion, the Soho Grand is the best hotel in nyc. And I lived there for 16 years. ","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Grand experience ","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"I was on a last minute trip to NYC for business and needed to be in the soho area. While on the plane I didn’t have reception so I called soho grand and they had a room available and I booked it. \n\nWhen I checked in I was greeted by a gentleman named Marcus and I have to say the professionalism and courtesy I received was better than most 5 start hotels I’ve stayed at around the world. Great location, great staff. ","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"The best experience in SOHO","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"The staff at SOHO Grand is second to none. I recommend this hotel to everybody, because I've never experienced a \"frustrating hotel issue\" here.\n\nThey remember me when I pull up to the hotel (and it's usually several months between my stays), check-in is always EASY, and the bartenders in the lounge make a mean drink! 10\/10!!","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Everyone is treated like a VIP there - philmore4 ","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"Marcus was amazing !! We only stay there because of his and the  SGH  team’s hospitality from the door guys smiling while they greet you to the resteraunt team  with Grand  margaritas and comfortable lobby couches to the sexy dog run for our dog  Riley   to even the maintence guys adjusting the wanky cable middle of the night in your suite  lol. It’s all there,  whatever u need,  whenever you need it  !!! ","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Home Away From Home","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"I stay at the Soho Grand often and always enjoy my stay. The hotel staff is very friendly, the rooms and amenities are clean, and there are terrific restaurants and shops nearby. It has become a home away from home for me and the only place I will stay in New York for business and vacation. ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Musty and dark","lang":"en","publishedDate":"2023-10-27","publishedPlatform":"OTHER","rating":2,"text":"The Soho Grande is a dark musty hotel. Our check in experience set the tone for another hotel in NY that gets by because it’s New York, poor customer service. The room was not ready at 3:00. It finally became ready an hour later. The check in took 40 minutes!!! Our room has a terrible odor. Would not recommend this hotel. ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"SoHo Grand is our Favorite!","lang":"en","publishedDate":"2023-10-26","publishedPlatform":"OTHER","rating":5,"text":"SoHo Grand is THE BEST hotel in New York City. The rooms are great (especially the suites); the staff is amazing; and the food and drinks are first rate. The bar is a fun place to relax and the 24-hour diner is amazing. If you want to stay in lower Manhattan, this is the place to be!","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"THIS IS THE PLACE TO STAY!","lang":"en","publishedDate":"2023-10-19","publishedPlatform":"OTHER","rating":5,"text":"THIS IS THE PLACE TO STAY! The location is amazing, right in the heart of Soho, near subway lines and all of the shopping, and I mean ALL. The lounge is comfortable, have live music and a young feel without the feel of blasting music and screaming a conversation. Marcus, the guest customer experience manager is stellar. Rooms are modern, clean, quiet, sheets, pillows, towels are high quality. ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Average stay ","lang":"en","publishedDate":"2023-10-18","publishedPlatform":"OTHER","rating":2,"text":"Not the best fit if you're there for business.   Night club\/DJ  in the bar is super crowded and  there's no where to sit plus it's really loud (you don't want rooms on the 3rd or 4th floor above the bar).   Shower water spills onto the bathroom floor.   Registration desk is on the second floor, no signs on first floor telling you this.    On the positive side, beds are very comfortable, hotel is in a great location, doorman is very helpful and diner next door is convenient.   ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay at SOHO Grand","lang":"en","publishedDate":"2023-10-17","publishedPlatform":"OTHER","rating":5,"text":"Hands down our favorite place to stay when we are in NYC.  Cozy, boutique hotel in SOHO. Attentive staff. Great food and drinks.  And, the hotel is dog friendly with their own zen doggy park! Highly recommend.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Pleasant stay! ","lang":"en","publishedDate":"2023-10-14","publishedPlatform":"OTHER","rating":4,"text":"Kevin is great representative of Soho Grand! He was very professional, helpful and pleasant! The hotel sits in the heart of Soho which makes it easy to walk for shopping and dining! \n\nVery pleasant stay!\n","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"Great Hotel","lang":"en","publishedDate":"2023-10-11","publishedPlatform":"OTHER","rating":5,"text":"Good location \/ neighbourhood, friendly staff, very nice bar\/lounge area, small but functional fitness centre, comfortable room (7th floor was quiet and was able to get a good night of sleep)\n\nCan't fault Soho Grand during this stay, everything was on point.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"5 Star stay ","lang":"en","publishedDate":"2023-10-11","publishedPlatform":"OTHER","rating":5,"text":"Where to start? First impression, from the moment we stepped out of the cab we were treated impeccably. I so wish I could remember names, but we had had a long flight from the UK and were a little dazed on arrival. Property is just beautiful, Jose (?) whisked our luggage away, check in was smooth, reception welcoming. Rooms outstanding, with wonderfully comfortable beds. Club room….again fantastic,  service impeccable. We had two vegetarians in our party and the server went off to find us some veggie options from a different menu, brilliant service, and they managed to squeeze us in for drinks on a very busy Friday night. Nothing was too much trouble. Soho Diner,, very enjoyable breakfast, and again impeccable service. Thank you for a very warm welcome on our first trip to NYC. Certainly won’t be our last, and we would return in a heartbeat. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Fun, chic, very comfortable, and great location.","lang":"en","publishedDate":"2023-10-09","publishedPlatform":"OTHER","rating":5,"text":"Fun, chic, very comfortable, and great location.  \n(We love that the company pays for the college education of their staff's children - it's one of the details that contributes to retaining such outstanding staff from the moment you arrive at the door.)","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Bad staff abd bad service ","lang":"en","publishedDate":"2023-10-06","publishedPlatform":"OTHER","rating":2,"text":"Shocking service and rude receptionist and concierge \nThey pass on the problem to another hotel employee and say ‘ it’s not my problem ‘ \nOverpriced for the service and what it is \nStaff have attitude and no service etiquette\nSo many other better hotels in soho for the same price to go to ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":" A place to come back to","lang":"en","publishedDate":"2023-10-05","publishedPlatform":"OTHER","rating":5,"text":"- we spent 7 great days at the Soho Grand …. and would come back\n- our friends (staying in different hotels in the Soho area always wanted to met up in ‚our‘ bar; everyone was impressed by the ambience, the staff and interiors\n- due to a small defect in our room we were asked to change rooms (no one actually likes that once you‘re installed) and were given an upgrade without asking for it \n- we were thrilled by the professionalism as well as the friendliness, openness of the entire staff; especially reception, room staff and door men","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Always top notch!","lang":"en","publishedDate":"2023-10-01","publishedPlatform":"OTHER","rating":5,"text":"If you’re looking for quality across the board, from the friendly, competent staff to the accommodations, food, drinks and amenities, make the Soho Grand your top choice. Marcus and Axel are amazing at customer service and the whole team will take care of you! ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Dramatic Check-in Experience","lang":"en","publishedDate":"2023-09-26","publishedPlatform":"MOBILE","rating":1,"text":"Business trip: The company sent the voucher on July, obviously the day I checked-in after an intercontinental trip (september…) the hotel realized there was no credit card for the payment of the 4 nights. So I had to call the travel service, who was able to send a copy of the credit card (it took a while to them to realize it was on the email….).\nThen I had to leave my own credit card for the “extra”, for an amount\nof 800 HUNDRED DOLLARS (yes, maybe they were concerned I could have played tennis with the mirror in the bathroom?).\nMy company credit card (which I use everywhere in the world, as well in USA) could not be read by the Soho card reader (this is clearly their problem, as I used it everywhere). Then I had to use my personal one, but it did not work as I had a daily maximum and I could not suddenylchange it.\nWhile I was ready to cry, the girl at the reception told that maybe 400 dollars for the extra were enough.\nWhen you travel in USA, this is the risk, inflexible people who follows rigid silly rules, regardless the fact that my company is frequently booking nights for ita employees in this hotel….","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Best hotel in Soho, if not NYC!","lang":"en","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"My wife and I were in New York City last week and we stayed once again at the Soho Grand. As usual, the stay was fabulous on all fronts. The hotel staff - from the front desk to the front doormen - are fantastic.  The location, restaurants, bars and hotel aesthetics are simply the best.  Thank you again for a terrific experience.    ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing!","lang":"en","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"This is probably our 10th stay at the Soho Grand.  We come back for two consective weekends in September every year.  The staff is beyond accommodating and friendly, escpercial Marcus the manger, Lonie at the front door and Kevin at the front desk.  Beds are beyond comfortable for a great nights rest.  The hotel is in the best spot in Soho. Convenent to all the best resturants and shopping.  And of course this time of the year close to the San Gennaro feast in Little Italy. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"a nice new home away from home","lang":"en","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"We had such a great stay at the Soho Grand!  After living in NYC 17 years, we are new to discovering where to stay when we come to town and have definitely found a home at the Soho Grand.  We loved the elegance and adult-ness of the property combined with the hip elements of the Soho Diner, the fun and kitchy mini-bar assortment and the chic guests.  The service was perfect: Housekeeping, in particular, stood out - slipping in without me ever noticing or being disturbed a single time during an 8-night stay, but cleaning everything to a T.  Dolly was a star!  The Front Desk\/Reception was also so polished and professional.  Beds super-comfy, towels luxe and fluffy and gym was great, too!  We'll be back.  ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Uno degli più belli hotel dove sono stata nel mondo","lang":"it","publishedDate":"2023-09-12","publishedPlatform":"MOBILE","rating":5,"text":"Hotel bellissimo, pulitissimo: \nQuando i nostri amici newyorkesi vi chiedevano dove alloggiavamo, spalancavano gli occhi dicendoci che era uno dei posti più cool\nDi NYC, ed è così. Molto più di un hotel, un’esperienza così come la città di New York. \nUnica pecca la nostra vista, non era granché, ma colazione eccellente, terrazza bellissima, rifacimento della stanza anche 3 volte al giorno, quotidiani, musica di sottofondo quando rientravamo… io che il mondo l’ho girato non posso che confermare uno degli hotel di atmosfera che più mi è rimasto nel cuore","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Classic NYC","lang":"en","publishedDate":"2023-09-11","publishedPlatform":"OTHER","rating":5,"text":"From the doormen to reception to the room itself, everything was top notch.  Was a pleasure to stay at this property with the extra comfortable bed and bedding to the classy shower and products.  Grabbed dinner one night at the diner during a rain storm and was great to be inside, warm and enjoying comfort food.  Definitely will keep this hotel on the top of my list whenever my travels bring me back to New York City. ","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Great stay. Would return and recommend.","lang":"en","publishedDate":"2023-09-10","publishedPlatform":"MOBILE","rating":5,"text":"My husband and I had an excellent stay at SoHo Grand recently with our 2 large dogs. We used SpotHero to secure a parking spot in the garage across the street. Check-in was quick and we appreciated the mimosas and offer of dog beds and bowls. Our room on the 15th floor was spacious by city standards and exceptionally clean and quiet. We stayed for one night; however, if you’re staying longer there’s adequate storage and bathroom counter space. We never heard a sound from the surrounding rooms. Our dogs were allowed to dine with us in both the SohoDiner and Grand Salon. The hotel’s dog park around the corner is a beautifully landscaped spot. You can walk to many good restaurants, cafes, and shops from the hotel. We’d return and recommend. Special thanks to Marcus, the concierge who loved our dogs, and  Michael at the front desk for making our stay great.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Phenomenal Staff","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":5,"text":"The staff at the Soho Grand is absolutely incredible. I brought my dog for a weekend away and cannot express how amazing they were with him. They were so kind, welcoming, and fun.  Tiffanie, Jose, John, James, Dani, Naomi, and Anthony were especially wonderful. We are so excited for our next trip back and can’t wait to see these wonderful people again.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Disappointment @ Stay","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":3,"text":"The stay was mediocre at best.  If you fancy returning to your hotel at night and see the entire lobby area turn into a disco with DJ, see people making out on stairwell, and have the entire lower lobby strewn with spilled drinks and empty glasses all around the stairs...then this is your place.  \nThe hotel per se, is a nice hotel in a great neighborhood.  At no point did we expect that when you come to your day of activities that you can't relax in the lobby area, but rather have to retire to your room.  Disappointment.","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"The Staff really cares!!","lang":"en","publishedDate":"2023-09-02","publishedPlatform":"OTHER","rating":5,"text":"This was our third trip back to the SoHo Grand Hotel, and once again, the hotel and its staff shone brightly! Gracious Marcus Morales and Alexis Ortiz from Guest Services helped us with our reservation, accommodating Axel, Tiffany, and Danny checked us in at the front desk, providing us with flutes of perfectly chilled prosecco and as many bottles of water that we needed, and efficient bellmen Denzel and Kiiloni always had cabs and directions at the ready for use. Truly, I don't know how they do it, but everyone we interfaced with, from servers in the lobby lounge to housekeeping was kind, attentive, and courteous! For us, staying at the SoHo Grand is like staying with a treasured friend, because like a friend, the hotel genuinely cares that you feel taken care of. And we did! We'll be back very soon!","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Perfect Stay at the Soho Grand","lang":"en","publishedDate":"2023-09-01","publishedPlatform":"OTHER","rating":5,"text":"The rooms are upscale industrial with beautiful finishes and sufficiently roomy.\nThe staff could not be more accommodating and friendly from the front desk, to housekeeping, and the valet.\nThe location was perfect.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Highly Recommend the Soho Grand Hotel","lang":"en","publishedDate":"2023-09-01","publishedPlatform":"OTHER","rating":5,"text":"The hotel is in such an amazing location, surrounded by great restaurants. Service was impeccable. Rooms are nice and beds so comfortable. Room service is very prompt and food was delicious. Walking distance to so many things. ","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Shower Broke- Danny was Great!","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":5,"text":"The shower in my room didn’t work but the professionalism and politeness of Danny at the front desk made a big difference. He is truly an asset to the Soho Grand Hotel. I have stayed at the Soho Grand Hotel over the last 10 years without any problems so this was my first but like I said Danny did his best to rectify the issue. Thank You. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Fantastic stay","lang":"en","publishedDate":"2023-08-24","publishedPlatform":"OTHER","rating":5,"text":"What an amazing hotel. Location was central especially for navigating downtown. Very easy to get midtown as well. The hotel and room was very clean and quiet. The room layout and size was very generous. The lighting everywhere seem to be perfect and very rich. This is a perfect hotel for a NYC stay. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Very accommodating","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"MOBILE","rating":5,"text":"Axel at the front desk did an amazing job and went out of his way to accommodate!\n\nThe location is excellent in Soho and the staff at the bell desk and Valet go out of their way to provide recommendations that are very good for food and or shops. Highly recommend this place.","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Love Ian at the front desk….","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"OTHER","rating":5,"text":"Ian at the front desk was amazing! So warm and welcoming. I can’t say enough about him.\n\nAlso loved our room etc which was clean, comfortable and great amenities and vintage touches! We will be back for sure!","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Kevin gave a great check-in process and it's a great hotel!","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"MOBILE","rating":5,"text":"Hotel is at great location, close to soho shopping areas and all the good eat out places.  hotel is clean and room is nicely organized and spacious in manhattan standard.  Kevin also made the check in process very welcoming and pleasant.  Overall good vibe for the stay.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Best check -in experience!!","lang":"en","publishedDate":"2023-08-17","publishedPlatform":"OTHER","rating":5,"text":"I’ve stayed at this hotel several times and I’ve had several decent experiences with checking in at the front desk. This time Ian made me feel like a valued guest. Ian was courteous, welcoming and very professional.  You have an excellent employee that made an impressionable lasting impact. Don’t lose this gentleman!","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Great service ❤️","lang":"en","publishedDate":"2023-08-16","publishedPlatform":"OTHER","rating":5,"text":"We came in without a reservation and Axel took care of us from the minute we walked in.\nBest service, big room, great shower. Felt like home! \nAxel thanks again 🙏🏻❤️ \nGreat view from the room as well.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great location and nice rooms in the heart of soho","lang":"en","publishedDate":"2023-08-14","publishedPlatform":"MOBILE","rating":4,"text":"I’ve stayed at this hotel at least half a dozen times over the last few years. It’s in a great location. The rooms are clean and well equipped. The rooms vary in size, but even the smallest is ok for New York (not big, but at least decent). I’ve only really interacted with the check-in and bell staff. They definitely have a “cool” vibe. They are courteous in a very New York fashion (not overly friendly or kind, but not rude). They definitely don’t go out of their way to help you. But it’s a nice hotel and none of my go-to hotels in soho (the other being the Modernhaus, around the corner).","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"We love Soho Grand!","lang":"en","publishedDate":"2023-08-14","publishedPlatform":"OTHER","rating":5,"text":"Stayed here with my children and had the most amazing visit. Breakfast at the Grand bar and salon was our favorite part of the day. Thank you to the team for such a wonderful and welcoming experience. We’ll be back! ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Love the Soho Grand but housekeeping issues","lang":"en","publishedDate":"2023-08-13","publishedPlatform":"MOBILE","rating":4,"text":"I really love this hotel- best location, cool, wonderful staff and great on-site restaurant and lounge.  That said, this trip i was a little surprised to discover that perhaps housekeeping cuts corners.  I accidentally knocked over my bottle of water so grabbed a towel to wipe the wood floor next to the bed- and was shocked to see the towel filthy dirty after simply touching the wet floor.  I actually went around to room to check - figuring it was a spill that was isolated - not happy to discover the entire wood floor filthy- as if it hadn’t seen a mop or swifter in 6 months.  \n\nProb need to tighten the training on housekeeping staff","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"No-Brainer: Soho Grand Hotel is my easy pick for an amazing, comfortable stay in nyc","lang":"en","publishedDate":"2023-08-13","publishedPlatform":"OTHER","rating":5,"text":"The Soho Grand is exceptional. Thanks to the amazing, kind and thoughtful service, beautiful hotel and amenities, perfect location and more, the Soho Grand has become my go-to destination when visiting nyc.  ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"👍🏻👍🏻","lang":"en","publishedDate":"2023-08-11","publishedPlatform":"OTHER","rating":5,"text":"Ian was fantastic from the moment of check in. He was friendly, informative, and very hospitable. View from hotel is beautiful. Love the finishes in the room. Very upscale boutique and clean! Thank you, Ian!","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Wonderful hotel!","lang":"en","publishedDate":"2023-08-11","publishedPlatform":"MOBILE","rating":5,"text":"Ian P. gave us a wonderful check in after a long flight. The hotel is a great location using the A train from the airport. The room decor is very cozy.  There is a nice tropical style bar attached to the hotel as well. The staff is very friendly!  Thanks!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Raised the Bar","lang":"en","publishedDate":"2023-08-11","publishedPlatform":"OTHER","rating":5,"text":"The hospitality is always great at the Soho Grand. This weekend, Ian P  & Marcus M took it to another level. Their warm reception was fantastic and worth modeling by other team members. \n\nMy wife have made this hotel our FIRST CHOICE every time we visit and will continue thanks to the wonderful service by Ian & Marcus!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand is outstanding.","lang":"en","publishedDate":"2023-08-09","publishedPlatform":"OTHER","rating":5,"text":"I’ve been staying here for years. Consistent, comfortable, with an outstanding staff. \nGreat location. \n\nIan at the front desk is the best. \n\nI’ve never once had a bad experience at Soho Grand. A true example of quality & consistency. ","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"NYC at it BEST!","lang":"en","publishedDate":"2023-08-08","publishedPlatform":"OTHER","rating":5,"text":"The service, the location, the comfort...ticked allllll the boxes. I even left my watch and they had it Fex-Exed to me the next day! I cannot wait to come back! Thank you Marcus for helping me! -Elizabeth Donn","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"A great experience","lang":"en","publishedDate":"2023-07-27","publishedPlatform":"OTHER","rating":5,"text":"The hotel has unique special atmosphere. The service is excellent, specially Miguel in the restaurant. His attention makes one feel at home.\nThe room, which was a suite, was very comfortable, specifically the bed and pillows.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"A must stay hotel","lang":"en","publishedDate":"2023-07-26","publishedPlatform":"OTHER","rating":5,"text":"As one steps out of their form of transportation arriving at the Soho Grand the magic begins. José starts your experience with a genuine smile and welcoming hug. Full disclosure: I've been a guest here before. However it never gets old getting such a wonderful welcome.\n\nAs you arrive at the front desk you can tell the level of training and detail Mr. Marcus Morales, Ms. Lauren Conolan-Richards and their team strive to achieve. Warm and engaging, genuine interest in making your stay exceptional, willing to go above and beyond.\n\nThe rooms are well appointed and very clean. The bedding is dreamy. The amenities are sufficient and the mini bar is the bomb. I had an issue with my shower that was promptly attended to.\nMy experience at the bar was heightened by the presence of Sean. He is one of the bartenders. He is charming and a kickass bartender. Every drink was spot on. By my second day at the bar he knew my preferences and didn't hesitate to make me feel welcome. Not usual for NYC bars these days, unfortunately. The concierge helped me with an issue that would have made my travels home a nightmare. The gentlemen did not hesitate and solved my problem. \n\nBeing in hospitality myself, I applaud and marvel at the effort it takes to deliver exceptional hospitality. The Soho Grand management and team members do just that.\n\nBook a room, stay a couple of nights, it well worth it ","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing customer service and great room!","lang":"en","publishedDate":"2023-07-16","publishedPlatform":"OTHER","rating":5,"text":"Most beautiful room with a view. As a local New Yorker out for a special evening, the Soho Grand truly delivered. Ian at the front desk was particularly accommodating when I checked in and went above and beyond to answer all my requests, with a smile. Can’t wait to repeat the experience!","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"World class hospitality","lang":"en","publishedDate":"2023-07-15","publishedPlatform":"MOBILE","rating":5,"text":"Unbelievable hospitality at the soho grand, thanks to Axel and Ian. My flight home from NY was cancelled last minute so I booked myself a room on a whim while I figured out my plan B. Axel was so kind and friendly when I was checking in and helpful in getting me situated, he totally turned my day around. After dinner, I went to the check in desk again for help deciding where to go. Ian went above and beyond to make me and my sister (who lives in NY) feel welcome. Had a wonderful stay here—what started out as a travel snafu ended up as an excellent extension of my trip. Would certainly stay here again and recommend this hotel highly. World class.","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Top notch in every way!","lang":"en","publishedDate":"2023-07-11","publishedPlatform":"MOBILE","rating":5,"text":"I travel to NY frequently and this may be my favorite hotel yet! The location can't be beat - several subway lines close by, fabulous coffee, bar, and nightclub affiliated with the hotel, and lots of inexpensive food options and fabulous shopping on the same block. Walking around by myself at night as a woman felt safe. \nThe hotel staff is incredibly friendly, and the rooms are very chic and well-appointed. I've been staying here since they opened almost 30 years ago and I always feel cooler when I walk in the front door.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Comfort, Style and Excellence at the Soho Grand Hotel","lang":"en","publishedDate":"2023-07-06","publishedPlatform":"OTHER","rating":5,"text":"The Soho Grand has remained an iconic boutique hotel experience. The service is exceptional. Everyone we encountered was polite, helpful and engaging. We were repeat visitors and were so surprised when a bottle of Prosecco was delivered along with a note saying \"welcome back to the big apple.\" \n\nWe had drinks at the lovely bar one hot afternoon while reading magazines. We also had breakfast a couple of the mornings. The food and drinks were delicious.\n\nOur room was a fairly nice size and worked well for 2 people. The bed is incredibly comfortable and we slept well. The shower had good water pressure and the water was as hot as we wanted it. \n\nThe location is perfect if you like the West Village, Soho, Chelsea, Notlita, LES, and even the Financial District. We like to walk and over 4 days we covered about 20 miles on foot. We went to the Metropolitan Museum of Art to see the Karl Lagerfeld and Richard Avedon installations on day. The Spring Street subway station is very close by and very convenient if you want to take the 6 uptown.\n\nWe look forward to returning as soon as we can! We really love NYC and are happy to have a \"home base\" at the Soho Grand when we are in town.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Perfect!","lang":"en","publishedDate":"2023-07-04","publishedPlatform":"OTHER","rating":5,"text":"We had a great little romantic getaway here, and will definitely stay again! Yes, rooms are on the smaller side, but are beautiful and thoughtfully appointed. All staff we encountered were friendly and helpful. It's a lovely oasis of comfort in a fun neighborhood.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Still got it","lang":"en","publishedDate":"2023-07-02","publishedPlatform":"MOBILE","rating":5,"text":"I’ve stayed here many times so it’s become very familiar for me. To be fair, I didn’t really use a lot of services to test the hotel properly but what I did have was all excellent.\nIt’s an unbeatable location as far as I’m concerned.  Check in\/out was slick as usual. \nI actually think the rooms have been smartened up a bit.  In fact the whole place felt sharper in some way.\nIt started to get a bit tatty even pre Covid.\nI could not find fault in anything.\nNot only would I stay again, I am doing in 3 weeks.","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay and great service","lang":"en","publishedDate":"2023-06-29","publishedPlatform":"MOBILE","rating":5,"text":"The check in experience was first rate, Axel was so great to us! The room as fabulous, we had a wonderful stay. I’m glad we decided to book the Soho Grand to celebrate our wedding anniversary and we may make this a tradition in the coming years. I would definitely recommend.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great experience","lang":"en","publishedDate":"2023-06-27","publishedPlatform":"OTHER","rating":5,"text":"Great hotel! The staff is friendly and helpful. The rooms are big for New York standards and the bar menu is great. It's in a perfect location in the heart of soho. Very walkable. I've stayed there a few times before and will definitely stay again. ","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Back again and again!","lang":"en","publishedDate":"2023-06-26","publishedPlatform":"OTHER","rating":5,"text":"People are over friendly and genuine. Coming from Columbus, Ohio, that is very refreshing. Doorman asks where we are going for the day and always welcomes us back.  The Soho Diner is the place to get your breakfast and have a perfect drink at the same time. The best NY Olde Fashioned in the city, hands down. Doesn’t matter who makes it, it always is perfect!  Thank you to Aaron for making each visit feel like we’re special!  You are why we return!  Remington in the Grand Bar and Salon cannot be beat when it comes to making a person feel welcome when they arrive. Thank you, Remington!  The rooms are impeccably clean and service is complete right away. Mini bar is packed with everything you need. The grand bar and salon is a hopping place in the evening with music and plenty of great service. We have been coming to the city for 9 years to visit our son, and he mentioned this visit was the best hotel we’ve stayed at over the years. Thank you, everyone, for making us feel welcome when we come to New York! ","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing customer service and guest experience!","lang":"en","publishedDate":"2023-06-20","publishedPlatform":"OTHER","rating":5,"text":"Absolutely incredible staff experience. Everyone was truly SO friendly, accommodating, and helpful. Location was perfect. Rooms were clean and comfortable. Restaurant and bar were great. Would 100% stay here again","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Best customer experience\/service","lang":"en","publishedDate":"2023-06-19","publishedPlatform":"OTHER","rating":5,"text":"first time in New York city and Soho grand was amazing, The room was great and the bed super comfortable. best customer service!! Marcus was amazing made sure I was taken care of my entire trip gave me reccomendations where to go for my first time\nin NY. Also kevin and Andrew were so great and so nice, I've stayed at multiple hotels but this one was the best customer experience! Totally reccomend staying there, def coming back when i'm in NY :)","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing location for a hotel! ","lang":"en","publishedDate":"2023-06-18","publishedPlatform":"OTHER","rating":4,"text":"We recently stayed in the Soho Grand Hotel when we got married in NY. We really had a good time. \n\nFirstly, the location is amazing. Unbeatable. In the middle of Soho, Tribeca, Greenwich village, the subway, it is a great location. The doormen were lovely. Check in was easy, but a little distracting s there was a party in the lobby (it was a Saturday night and we didn't expect it to be such a partying hotel), we expected a more old style lobby. \n\nWe had a suite and it was amazing. Lovely cot for our daughter, lots of towels etc. On the 16th floor, so amazing view as well. Great bathroom, really comfy bed. Really good room. \n\nThe main issue we had was the bar downstairs. Terrible service during the day. Hard to get a table, get an order in, receive the order. We stopped even considering the bar\/lobby as an area for us to venture to.\n\nOtherwise we had a lovely stay and will stay again. ","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Another wonderful stay at Soho Grand!","lang":"en","publishedDate":"2023-06-10","publishedPlatform":"MOBILE","rating":5,"text":"Awesome return trip to Soho Grand with my Cavapoo Oscar! Love staying at Soho Grand when visiting my kids and other family members in the city! Everyone is so friendly and helpful and they are amazing with my dog. He loves it there as much as I do and the dog park is the best! Truly my home away from home- I look forward to my next stay!","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Excellent Customer Service from Ian!! ","lang":"en","publishedDate":"2023-06-09","publishedPlatform":"OTHER","rating":5,"text":"I made a reservation for a Saturday night at the Soho Grand, a last minute getaway for one night in the city.   There was a glitch in my reservation but Ian, at the front desk, got right on it and he remedied  the problem right away!   He was enthusiastic and I hung up even more excited about my stay at the Grand!  Thank you Ian! \n \n","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay","lang":"en","publishedDate":"2023-06-09","publishedPlatform":"OTHER","rating":5,"text":"Great location for our first trip to NYC for a few years and our daughters first visit.  Easy to get to all the major sights.\nLovely people and we enjoyed using the hotel bar, Gilligans outside bar and the diner.\nBeds very comfortable and everything we needed in the room.\nWhen we come back to NYC this is where we will stay.","travelDate":"2023-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Great Hotel","lang":"en","publishedDate":"2023-06-05","publishedPlatform":"OTHER","rating":5,"text":"One of the best hotels and ambiences overall in NYC.  Incredible service (including the valet), great amenities, and ideal location in the heart of Soho near everything downtown.  My favorite place to stay during business trips, where you can get work done and also play.  ","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Bellissimo hotel","lang":"it","publishedDate":"2023-06-03","publishedPlatform":"MOBILE","rating":4,"text":"Bellissimo hotel. Vale la pena dormire qui. Camere silenziose, forse non pulite a dovere. Ho trovato che ci fosse un eccesso di polvere, ma nel complesso grande struttura. Il bar accanto è delizioso, in stile anni 50. Di colpo sembra di stare in una puntata di happy days","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Enjoyable Stay","lang":"en","publishedDate":"2023-06-02","publishedPlatform":"OTHER","rating":5,"text":"It was a short stay to meet up with Friends who were also staying there . The location is amazing , the staff were a delight and very helpful . The Room was very comfortable although small to my liking , but had everything that you need within reach . The best feature is the bed . It was the most comfortable bed I slept in . It was heavenly . The hotel lobby and Bar area are fun they become lively in the evening with a live DJ . \nI would definitely stay there again 😀 ","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"Just fine. Nothing special. Great location. ","lang":"en","publishedDate":"2023-06-02","publishedPlatform":"OTHER","rating":3,"text":"Super confused by the five star reviews. This hotel is fine. It’s definitely outdated and needs a revamp. Staff is lukewarm and not welcoming at all. Every interaction seems like a giant bore for them.  That goes for every person from Concierge to check-in to the restaurant staff, with the exception of Remington, the host at the restaurant - he is absolutely delightful.  The room was fine, beds were very comfy. We booked the two bedroom suite, which is not an accurate description. It’s a one bedroom suite with adjoining room, so it didn’t have the open feel that you would expect from a two bedroom suite. ","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Perfect Hotel Stay","lang":"en","publishedDate":"2023-05-31","publishedPlatform":"OTHER","rating":5,"text":"The hotel staff where welcoming and made us feel like we were VIP's \n\nThe rooms are beautiful and the beds where so comfortable that I slept better than when I am at home.\n\nReally enjoyed our stay. It's our spot now whenever we are in NYC ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Wonderful Team","lang":"en","publishedDate":"2023-05-30","publishedPlatform":"OTHER","rating":5,"text":"Every staff member I encountered on this property, was absolutely wonderful! From check in, to the bar, to the doormen, to in room dining, every interaction was positive and genuine. I am looking forward to my next visit!","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"My amazing experience at the Soho Grand Hotel","lang":"en","publishedDate":"2023-05-30","publishedPlatform":"OTHER","rating":5,"text":"I love the elegance and charm of the hotel . Very vintage and chic and provides the guests with a true NYC experience . The attention to detail in the room exceeded my expectation; well stocked supplies , cleanliness and the aesthetics i.e, bedding made the stay extremely restless . Finally , the staff , courteous prompt response to our needs , outstanding customer service and personable , warm and friendly exchanges made our stay exceptional !  . I’ve been travelling to NYC for over 20 years and always stay in Manhattan. The Soho Grand  Hotel has been my best hotel experience to date ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay - thank you Soho Grand team!","lang":"en","publishedDate":"2023-05-26","publishedPlatform":"OTHER","rating":5,"text":"Wonderful hotel that indexes on all the right things - great location, comfortable beds, relatively spacious rooms, modern amenities and a standout staff.\n\nWould 100% stay here again! I didn't get to check out the restaurants but will make sure to do so next time.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Good Hotel!","lang":"en","publishedDate":"2023-05-19","publishedPlatform":"OTHER","rating":5,"text":"Soho Grand Hotel is really beautiful, central and modern. Upon our arrival we were greeted with great kindness and professionalism. The room was angular and I see the New York skyline. Nighttime hotel is a landmark for all new yorkers. I will definitely come back.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great getaway!","lang":"en","publishedDate":"2023-05-15","publishedPlatform":"OTHER","rating":5,"text":"The SoHo Grand hotel is the best!  So many reasons - \n1. Location:  Quick and easy access to so many interesting neighborhoods - Soho, Tribeca, Greenwich Village LES, etc.....\n2. People watching: Celebrity sightings are commonplace\n3. The rooms: Our one bedroom terrace suite was one of the nicest hotel rooms we've stayed in - anywhere...\n4. The food: Not just at the hotel but the whole immediate neighborhood, an incredible variety of awesome options.\nThis wasn't our first stay here and definitely wont be our last","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Incredible Stay at the Soho Grand!","lang":"en","publishedDate":"2023-05-14","publishedPlatform":"OTHER","rating":5,"text":"I absolutely adore this hotel honestly, even as a native New Yorker. It’s chic and elevated, the drinks and atmosphere are amazing and in regards to the rooms themselves I’ve always encountered genuinely great service at the front desk and the rooms are cozy! Special shout out to Andrew, Kevin & Summer, they are top notch when it comes to efficient and attentive hospitality. I recommend this hotel to everyone I know who’s coming into town or New Yorkers looking for a staycation. 10\/10!","travelDate":"2023-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing As Always!!!","lang":"en","publishedDate":"2023-05-14","publishedPlatform":"OTHER","rating":5,"text":"My boyfriend and I stayed here for his Birthday Celebration! As always, the hotel did not disappoint!! From the moment we came upon the hotel entry door, we were graciously greeted with their trademark professional door-opening service. Check-In was a breeze and we were gifted with free breakfast coupons and a nice glass of Prosecco. The room was spectacular with a wonderful view of West Broadway, which I feel is the heart and soul of the Soho area. A huge TV and a Spacious Walk-In Shower were just few of the fantastic room amenities provided.  Upon returning to our room in the evening, we were happily greeted with a bottle of wine, wine glasses and a special birthday wish note from the hotel!!!  Check-Out was a breeze!!  Kudos to All the Staff at the Soho Grand. With a Special “Shout-Out” to Axel, Remington and Andrew!! ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Our favourite in NYC","lang":"en","publishedDate":"2023-05-13","publishedPlatform":"OTHER","rating":5,"text":"The Soho Grand is our absolute favourite. Everything about the experience is pitch-perfect, from the overall vibe to the exceptional staff and customer service. The hotel bar is perfect for drinks at the end of the night, and we always start our day with breakfast at the diner. The location can’t be beat. Highly recommend.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Must Stay Soho Grand Hotel Is The Best","lang":"en","publishedDate":"2023-05-11","publishedPlatform":"OTHER","rating":5,"text":"Overall our stay was great. Very clean, comfy yet stylish rooms, great location can walk to everything, amazing customer service, delicious food and drinks and lots of fun programming for guests to enjoy. What really stood out was Andrew and Axel at the front desk. They provided a level of customer service that was fantastic. They were so helpful, informative, funny and friendly. We can't say enough good things about Andrew, Axel and the hotel as a whole. ","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Excellent hotel.","lang":"en","publishedDate":"2023-05-11","publishedPlatform":"OTHER","rating":5,"text":"The hotel is consistently fabulous.  A great neighborhood, a lovely staff, and a warm and inviting experience - EVERY.  SINGLE.  TIME.\n\nFrom the glass of Prosecco that greets you at check-in to the kind and courteous staff as you check out, along with everything in between, it's a true gem in Manhattan.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"The Grandest!!","lang":"en","publishedDate":"2023-05-10","publishedPlatform":"OTHER","rating":5,"text":"My husband and I went for our anniversary. Our son lives in the city so we visit often. The Soho Grand is by far the grandest!  From the doorman to the staff at the diner, everyone is friendly. Soho Diner has the friendliest staff, remembering us each time we visited.  Also they make the best Old Fashioned!  The Grand Bar and Salon  is relaxing with fantastic drinks and food along with fabulous staff. Thank you to Remington for making our visit one of the best we’ve had in New York. We cannot wait to come back. The bed and pillows were the most comfortable we’ve experienced. A much need perfect night’s sleep. Thank you, again, to everyone at the Soho Grand!","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Underwhelmed","lang":"en","publishedDate":"2023-05-09","publishedPlatform":"MOBILE","rating":3,"text":"Underwhelmed. \n\nBased on reviews, was expecting a little better.  Was going for a great SOHO hotel. \n\nLots of nice touches but overpriced for what you get.  Maybe this is NYC?\n\nPros—Prosecco at check in. Great location. On-site bar but…see cons.  I’ll revise if I find more. \n\nCons:\nBellhop who wrested my luggage from me to carry it up stairs even though 1. I said I wanted to handle my own luggage, 2. There was a ramp. \nIndifferent service . Watched 4 of 5 bar staff ignore patrons for over 50 minutes while they hung out chatting amongst themselves. \nOverpriced, mediocre snacks that would be modest giveaways at other bars. \nLow lighting everywhere which may offer sift complimentary lighting but honestly is terribly dim and somewhat gaslighted. \nFor sure I am biased paying a premium.  I have had far better for less in Palm Springs\/Palm Desserr\/Indian Wells, Conrad LA, 4 Seasons Morocco, Lake Tahoe, Paris, London, Rome.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"WORSE HOSPITALITY EXPERIENCE OF MY LIFE ","lang":"en","publishedDate":"2023-05-07","publishedPlatform":"OTHER","rating":1,"text":"We honestly had the worse experience in terms of service and day-to-day operations. We stayed there for almost two weeks at their Loft South penthouse suite, and it didn't feel like a proper hotel because of the low level of concierge, sales, and front desk services. \n\nThe property is very poorly run, and it shows by the fact that it requires us to call them multiple times to get things done every day and it was exhausting! If we are paying this amount of money, the service needs to be up to speed and personalized based on our needs. Their response rate was very poor to the extent that they forgot to extend our stay, and we needed to leave the penthouse within two hours and find something else while packing to get out of the hotel for not being penalized if staying more than our contract. They never found a solution that would be reasonable for us and never apologized! The hotel's culture is based on making excuses and avoiding responsibility all the time rather than being a solution-oriented and empathetic environment. \n\nThe gym was very small, and the service team was rude overall. \n\nThe only good thing about this hotel is its location, and that's about it! \n\nI would NEVER recommend this hotel to anyone looking for a long stay and a top-tier luxury experience. \n\nYou should do better because the property has a really good potential. ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"NYC’s BEST!","lang":"en","publishedDate":"2023-05-06","publishedPlatform":"OTHER","rating":5,"text":"The Soho Grand team makes the hotel experience feel like home away from home…my favorite hotel in NYC! \n\nFrom arrival, to check in, to lounge + dining + drinks Soho Grand always exceeds expectations…looking forward to my next stay!","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Un ottimo hotel nel cuore di SoHo","lang":"it","publishedDate":"2023-05-05","publishedPlatform":"OTHER","rating":5,"text":"Ottimo hotel nel cuore di SoHo, un quartiere di New York caratterizzto da case, fabbriche e magazzini del XIX secolo, con le   facciate in mattoni rossi e ghisa, e le tipiche scale anticendio esterne. Gran parte degli edifici storici è stata ristrutturata e riconvertita in spazi pubblici o privati. Le architetture, le strade lastricate, alcune di esse anche alberate, contribuiscono a creare un'atmosfera davvero unica e originale, 100% New York City. I numerosi negozi, molti di fascia alta, i tanti bar, i ristoranti e le gallerie d'arte fanno di SoHo anche una meta ambita per lo shopping e il divertimento.\n\nIl SoHo Grand Hotel si integra perfettamente in questa atmosfera, rilassata, orignale e attenta anche alla forma.\n\nHo soggiornato al SoHo Grand per due giorni, viaggiavo sola, e ho apprezzato:\n- la cortesia e la disponibilità di tutto il personale;\n- la camera da letto pulita e ampia - per gli standard di New York - senza moquette,\nben corredata e decorata con dettagli originali, ma di buon gusto. Letto\ncomodissimo;\n- il lounge bar-ristorante, dove vengono serviti colazione, pranzo, cena, bevande e\ncocktail in un ampio e luminoso spazio, caratterizzato da grandi vetrate. Frequentato\nanche da clienti esterni, il lounge offre  un'atmosfera rilassata durante il giorno, che si fa   più vibrante alla sera;\n- il secondo ristorante all'interno dell'hotel, chiamato Club Room, aperto solo per cena \ne con ambientazione stile primi decenni del '900, dove in alcune serate è possibile\nbere o cenare ascoltando musica dal vivo. Enrambi i ristoranti offrono una carta non\ntroppo ampia ma soddisfacente, il menu si ispira alla cucina dei bistrot.\n\nL'hotel offre ai propri ospiti wifi gratuito e mette a loro disposizione anche delle biciclette, non so dire se gratuitamente o a pagamento perché non ho utilizzato questo servizio.\n\nViaggiavo sola e mi sono sentita sicura e ottimamente servita in questo hotel dal carattere originale e dallo spirito accogliente.\n","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Highly Recommend the Soho Grand!","lang":"en","publishedDate":"2023-05-04","publishedPlatform":"OTHER","rating":5,"text":"The Soho Grand is a beautiful hotel with a courteous and professional staff.  Our view from the 10th floor was spectacular.  The room was very comfortable and clean. The Soho location was perfect to experience New York!  Lovely shops all around and top notch dining!  We will be back!","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Will stay again and again","lang":"en","publishedDate":"2023-05-02","publishedPlatform":"OTHER","rating":5,"text":"Pros: \n-Location. Surrounded by our favorite parts of Manhattan and very convenient location to multiple subway lines. \n-The rooms are spacious by NYC standards and have great amenities. The beds and pillows are some of the most comfortable I've experienced at a hotel. \n-The staff is very welcoming and go out of their way to make sure you're comfortable. \n-Room service was delivered fast. \n-I appreciated the complimentary glass of prosecco upon check in. \n-Overall feel very safe staying here. \n-The complimentary umbrella in our room came in handy on a rainy day. \n\nCons: \n-Almost none except the street was very noisy in the middle of the night with lots of car horns. Recommend bringing a portable white noise machine with you if your room faces W Broadway, that helped us a great deal. ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Always an experience","lang":"en","publishedDate":"2023-05-01","publishedPlatform":"OTHER","rating":5,"text":"It'd been a year since I've been to Soho Grand but they recognized me at the front desk from a year ago, upgraded my room and have been very helpful with everything. The bar and the lounge was great as always. Spectacular views of NY from the upper floors. There's always something that makes you come back to Soho Grand.","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":93561,"title":"Our experience staying at the Soho Grand Hotel was beyond perfect! I highly recommend staying at this hotel! 5 stars!","lang":"en","publishedDate":"2023-04-28","publishedPlatform":"MOBILE","rating":5,"text":"Our experience with the Soho Grand was beyond our expectations. The rooms were great. The diner was great. The employees were amazing and very professional. I highly  recommend staying there. We are already planning our next vacation at the Soho Grand. 5 ⭐️","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Supreme Stay at Soho Grand Hotel","lang":"en","publishedDate":"2023-04-27","publishedPlatform":"OTHER","rating":5,"text":"I had an April trip planned to New York. I had a superb stay at Soho Grand Hotel.  I chose Soho Grand Hotel, because the service is impeccable, the room was impeccably clean. the staff provide excellent service in hospitality. The hotel location is ideal for shopping, dining and close to many tourist attractions. The neighborhood is extremely quiet which makes for a perfect nights sleep. \nSoho Grand Hotel offers many wonderful amenities: If you don't feel like dining out, the hotel has a lovely restaurant called the Soho Diner which has inside seating & an outside garden area, the menu has a nice variety of food selections &  great ambience. Incredibly designed . The Salon also offers a wonderful array of food choices with a hip vibe. \nTip: Inquire if a room is available facing the Soho Grand Dog park, its such a treat to observe the dogs frolicking in lovely garden setting. In addition one can also see the Empire State Building & the Chrysler Building.","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"#1 downtown Manhattan hotel","lang":"en","publishedDate":"2023-04-26","publishedPlatform":"OTHER","rating":5,"text":"Best hotel ever 😍 elegant, historic, good vibe at night, romantic ambiance in the evening. Lovely bar and fare. The downtown spot to be. Rooms take you back to another era. Definitely check out soho diner next door as well ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great Stay","lang":"en","publishedDate":"2023-04-24","publishedPlatform":"OTHER","rating":5,"text":"The hotel was beaufitul and the staff was very friendly.  I really only interacted with the check-in desk and the bartender but they were both super nice and made my stay. For being in NYC, the rooms are expected to be small, but the room was very well set-up and comfortable with nice furniture.  I would definitely stay here again.  ","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"My favorite NYC Hotel","lang":"en","publishedDate":"2023-04-20","publishedPlatform":"MOBILE","rating":5,"text":"Love this hotel,  great location, quiet, comfortable beds, wonderful amenities and fabulous customer service.\nThe Soho Hotel treats their guest with warmth, grace and elegant style.  I can hardly wait to my next visit to New York and \nThis incredible hotel.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great Hotel - understaffed","lang":"en","publishedDate":"2023-04-16","publishedPlatform":"MOBILE","rating":4,"text":"I love this hotel and have stayed here numerous times.  This visit fell a bit short sadly.  First the positives: my room was exactly as expected- clean and well appointed and ready upon arrival even tho I was 3 hours before check in; the common areas clean, gym great.  Sadly- there were some negatives this trip: 1) people staying with pets not being informed their pet MUST be leashes - some dog covered my trousers with pet hair in the elevator; 2) the hotel bar where I met my client for a drink- had one waiter for 15-20 tables- he was CLEARLY in the weeds - couldn’t get his attention for drinks or the check (the hostess had to take care of the drinks and after 15 minutes I just told the hostess to put the drinks on my room)- I was surprised to see a 20% service charge for the drinks when the service was truly sub-par.  3) i mentioned a mistake on Expedia’s website regarding “free parking” which I knew to be an error; when I mentioned it to the front desk person on checkout he was almost condescending in the way he told me “you must have been looking at a different hotel”- lol.  Not my problem pal- just being a nice person so u could mention it to someone in authority to correct the problem.  That said- CLEARLY that front desk person missed some training on the days ‘courtesy’ was taught.\n\nOverall, I still enjoy this hotel, but slipped a tad on this past visit","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Room was clean but the noise from the 2nd is not acceptable for the amount charged.","lang":"en","publishedDate":"2023-04-16","publishedPlatform":"MOBILE","rating":3,"text":"The room  is clean, the biggest is the second floor on Saturday night is used as a night club so unless you get a room 7th floor, the noise resonates. Additionally we had issues with our shower and air conditioner that were not adequately addressed","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"White glove service without exception","lang":"en","publishedDate":"2023-04-14","publishedPlatform":"OTHER","rating":5,"text":"First time staying at Soho Grand Hotel. It will not be the last. Outstanding service. White glove treatment from arrival to departure. The hotel staff made sure I did not want for anything, All requests were met with a quick response.  Concierge made wonderful suggestions for local fine dining and alike.The room was spacious and quiet.  Conversely, the lobby was upbeat with a lounge for gatherings, with a DJ!  The retro diner was  inviting with its warm color desgin and friendly staff. Morning coffee there, started my day right. SGH made my business trip into a leisurely one. The best magic trick of of all.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Poor customer service and dirty bathrooms","lang":"en","publishedDate":"2023-04-12","publishedPlatform":"OTHER","rating":1,"text":"Lauren, It is very disappointing the experience my wife and I had at your property. Here are the details:\n\n1) I asked three times to get my shower unclogged and it was never fixed. I was there for four nights and every day in the morning I would ask for someone to come up to my room and fix the shower. It was very unpleasant to take showers and have the tub get filled with dirty water as the drains were not working correctly.\n\n2) The waiter in the restaurant was extremely rude to my wife and I. We had issues with him for all four days. On the last day I had a big argument with him because he kept on asking me for a breakfast voucher and I did not have one. I do not understand why he could not simply charge what I ordered to my room or have me pay with a credit card. He was loud and very unwelcoming.\n\nI did not catch his name, but he was a short man with a heavy accent and about 220lb.\n\n3) The bell person that was at the entrance of the hotel on Wednesday April 12 at around 2 PM was extremely rude. He kept asking me how much I was paying for the ride to JFK and was trying to look at my phone. He then tells me that he has been working there for 27 years and that I should not get upset with him. How could I not get upset if he is trying to sell me some bogus JJK ride and trying to look at my phone uninvited?  \n\nHe then proceeded to take my luggage and threw it unordered in the back of the vehicle that I had reserved. It was a very intimidating situation.\n\nYou should really watch the kind of people you have serving there. There are many hotels in NY and with the service you are giving people, one would not come back. ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand…. Grand indeed…. ","lang":"en","publishedDate":"2023-04-12","publishedPlatform":"OTHER","rating":5,"text":"Ok..  so..  i think i may have found my new home away from home in NYC.  First i love to stay down in SOHO..   it allows me to get away at the end of the day and chill….  \nWhen i got there they were great..   first.. let’s start with the upgrade….  Ended up on the 14th floor….  That was lovely…. Front desk guy (sadly.. i can not remember his name…. And need to find out.. ). Went above and beyond every time i needed something \n\nGot to my room..   very comfortable..   they were able to accommodate my weird quirk of having 8 pillows..  (yeah.. don’t ask)..  \n\nDinner that first night in the Soho diner..   was fab..   (get the Mac and cheese… it is tooooo die for)…. \n\nThe next night.. after a day of meetings….  I needed a cigar - now…. This place is a prime spot for a cigar lounge…. So….  I think someone should do that….  Just saying…\n\nOnce again..  front desk guy.. (i really do need to find out his name)…. Was incredibly helpful…. Sent me over a couple blocks to the soho cigar lounge…. Was also great in helping me make reservations for the following night (went to Vestry…. Which was a slice of heaven on it’s on.. ). \n\nWas out back to the airport Wednesday (yeah..  very fast trip)..  the door guys..  off the charts helpful…. (Thanks Jose for the car situation getting taken care of)…. \n\nOn the flight back to Los Angeles already looking at the schedule for my next trip out..   looking forward to when i am able to stay in one of the terrace penthouses…. (I may never leave it that is the case…. ). \n\n","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Comfortable & Well Located Soho Stay","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":4,"text":"Fantastic location, clean and well furnished. I loved the amount of counter space in the bathroom and the option of a black out curtain.  All employees we interacted with were very helpful and friendly.  We had not realized that this is a very popular place to go out on the weekend, and as we were on the lowest floor, the loud music was not ideal on our first night.  However, we requested to switch rooms and were promptly accommodated.  They even moved our bags for us while we were out. Highly recommend!","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great hotel, location, staff, etc.","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":5,"text":"We frequent Soho and have stayed at a variety of hotels in the area.  Soho Grand will be our go to hotel from now on.  The location was great and convenient.  We had an issue with our airlines cancelling our flights on multiple days... the front desk team could not have been more helpful on helping us extend our stay.\n\nUpon arrival (we were three hours pre-check in time) we ate in the restaurant and had some of the best avocado toast ever (along with some champagne).  We had barely finished our lunch and we received a notice saying our room was ready (this made us very happy).  We also swung into the bar on a few of the nights for a nightcap... and the bartenders make a mean lemon drop martini...in addition to having some great bourbons.\n","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Love Soho Grand!","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":5,"text":"We have been staying at the Soho Grand for the last 14 years, since our daughter moved to NYC (Soho and now Noho). The Soho Grand staff is friendly and helpful, the atmosphere is fun, and the Diner is great (inside and outside). We have always enjoyed cocktails in the Grand Bar and Salon. Our accommodations are always comfortable and clean. We wouldn't stay anywhere else. ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Favorite Hotel in NYC","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":5,"text":"The service is spot on from the minute you pull up to the Soho Grand. The door men are warm and welcoming and always open the door as you enter. The concierge is most helpful, and the front desk is always so gracious at check-in. It has super cool vibes with low lighting and great music coming from the lounge. The rooms are always immaculate with all the amenities you need. The beds and bedding are simply luxurious. The location is excellent for all the shopping and dining in Soho as well as easy access to the Holland tunnel. They also offer bicycles in the summer. Truly our favorite place to stay in NYC!!","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Jazz Bar en el Soho","lang":"es","publishedDate":"2023-04-08","publishedPlatform":"MOBILE","rating":5,"text":"Llegamos de casualidad porque íbamos al restaurante que está enfrente y decidimos tomar una copa en este bar. Nos encantó la decoración y el ambiente tradicionales de jazz bar, con música de calidad en directo. Servicio excelente. Ideal para relajarse.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"One Night Bachelorette Celebration in NYC","lang":"en","publishedDate":"2023-04-06","publishedPlatform":"MOBILE","rating":5,"text":"I stayed at the Soho Grand at the end of March for one night to celebrate my best friend’s bachelorette party.  We are native New Yorkers and moms in our forties and we wanted to find a place that would make our friend feel super special for our one night out.  The Soho Grand did not disappoint! From the second we arrived every employee at the hotel was super welcoming and polite! It felt like a little vacation even though we were close to home.  The hotel has an awesome vibe and you don’t need to venture out of the hotel for entertainment.  The lobby bar is a scene during the day and night and although we didn’t go to the club in the hotel, it definitely seemed to be a fun place to party at night. The best part of it all was how well we were taken care of by Andrew Alvalles, the front office supervisor.  He ensured that we had a wonderful experience and our room was absolutely stunning!!! We had such a great experience that we have decided to visit again soon and enjoy all this hotel has to offer.  If you are traveling to NYC from another location or if you from NY and are looking to have a little “staycation” I highly suggest staying here! You won’t be disappointed!","travelDate":"2023-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great hotel","lang":"en","publishedDate":"2023-04-06","publishedPlatform":"OTHER","rating":5,"text":"The Grand Soho Hotel offers luxurious and comfortable accommodation in the heart of vibrant SoHo. The rooms are well-appointed, and the rooftop terrace provides stunning views of the city skyline. The staff is friendly and attentive, making for a memorable stay.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Love Soho Grand Hotel","lang":"en","publishedDate":"2023-04-05","publishedPlatform":"OTHER","rating":5,"text":"Fabulous vibe at this Hotel. Doorman always give you a warm welcome. Cocktails at the bar are fabulous, great club and then there's the great Diner on the street. All staff are happy to help you. Beds are comfy. The location is fantastic with the buzz of Soho at your doorstep. Restaurants and shopping all amazing.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho grand experience","lang":"en","publishedDate":"2023-04-05","publishedPlatform":"OTHER","rating":4,"text":"We arrived late due to our flight from the UK and we were first meet by Byron who guided us to reception and waiting to make sure we were seen. The receptionist Kiara and Genesis couldn’t have been more helpful checking us in and making sure we had everything before going to bed. Our room is fully equipped and very comfy bed. Loving our trip so far. ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great staff","lang":"en","publishedDate":"2023-04-04","publishedPlatform":"OTHER","rating":5,"text":"The night staff is great. Genesis and Kiara at the front desk were amazing and super helpful. I will be back to visit. The hotel was nice and  clean when i arrived late and i appreciate the service from staff.","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Enjoyable experience","lang":"en","publishedDate":"2023-04-04","publishedPlatform":"OTHER","rating":5,"text":"My time at The Grand Soho was wonderful!! We chose this hotel to celebrate our 40th anniversary, and we were greeted with a bottle of champagne in our beautiful room upon arrival. Although the room was on the smaller side, it was comfortable, clean and it had a beautiful view of the city. This marked our second visit to The Grand Soho Hotel, and it certainly won't be our last!\"","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand is truly GRAND","lang":"en","publishedDate":"2023-04-04","publishedPlatform":"OTHER","rating":5,"text":"Soho Grand is truly a GRAND experience in NYC! I loved staying in the Soho area, and the Soho Grand is a perfect location. Close to the subway and walkable to my favorite spots in town, whether you're going to Soho, Greenwhich Village, or even down to Brooklyn area. \n\nBar is 10\/10\nDecor\/Vibe is 10\/10\n\nAnd the best place to stay for a night cap because the place is popping for night life. \n\nCan't wait to come back to Soho Grand!","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Poor\/Unprofessional customer service","lang":"en","publishedDate":"2023-04-04","publishedPlatform":"OTHER","rating":1,"text":"I live a few blocks away in SOHO and I know the hotel is amazing.  I was hoping to host a family party for my sons' graduation in one of their event spaces.  I called the general event number 212 965 3500 and spoke to someone who identified herself as Nicole.  I inquired about the event space guest capacity and told her I would tailor the guest list based on the capacity of the space that was available.  I also asked which room was available on my desired date.  As the inquiries went on, Nicole grew very frustrated and hung up the phone.  I believe the hotel should not have individuals answering the phone designated for events by someone who is not equipped to answer questions, gets easily frustrated and is unprofessional.  I hope to be contacted by the General Manager to discuss my event further. ","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Great Vibes!","lang":"en","publishedDate":"2023-04-04","publishedPlatform":"OTHER","rating":5,"text":"We had an amazing stay. Friendly staff and great food! The vibe of the hotel is the best part from a sophisticated lobby bar to relax and socialize or a night club for the late night win. \n\nThank you Peter for such a warm welcome! See you in the Fall! ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Beautiful hotel with a great location","lang":"en","publishedDate":"2023-03-30","publishedPlatform":"OTHER","rating":5,"text":"Beautiful hotel with a great location. The staff was so friendly and conscientious. The rooms are well equipped and nicely styled. Loved the interiors - especially the old subway steps at the entrance.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great anniversary","lang":"en","publishedDate":"2023-03-30","publishedPlatform":"MOBILE","rating":5,"text":"Incredible staff- from the door man to the bellhop and especially the front desk. They were absolutely wonderful.  We arrived after a hectic travel day and they could not have been more welcoming. The room was clean and  well appointed. Great location. Many great restaurants within an easy walk.","travelDate":"2023-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Great hotel in great area","lang":"en","publishedDate":"2023-03-30","publishedPlatform":"MOBILE","rating":5,"text":"Great hotel , in a great location to visit New York . Near Chinatown. \nRooms are very good for NYC , very clean , bed very large and comfortable. Pets Allowed and got a park to walk them for guests . \nBreakfast wasn’t amazing and service slow . But plenty of other choice we didn’t try . So to be tried .! \nThere is a diner part of the hotel that we didn’t try . Also a great delicatessen next door. \nService at the entrance was very good . Doormen were super friendly , and reception was very nice and check in and out were very fast . \n Overall I recommend and will stay there on my next visit to NYC","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Wonderful Weekend.! ","lang":"en","publishedDate":"2023-03-29","publishedPlatform":"OTHER","rating":5,"text":"I read through the negative reviews to better understand why the 3.5 rating on Yelp... honestly our stay was exceptional- to the point where at certain moments it feels like a 5 star hotel... Prosecco upon checkin, early check in if they have enough rooms,  great doormen who get your bags and take them to your room in a super busy area... this one doorman had been working there two decades !! He was fabulous and I wish I remembered his name... \n\nFrom my first phone connection with Mark Perez asking that our Amex room upgrade please be denoted, I was impressed... he asked about our trip and I explained it was an auspicious time of year as Persian new year and we were meeting family- then also as a front line worker feeling burnt out and ready to unplug... he shared his wife is also a therapist and he understood ... upon checking in Andrew made us feel like family and Genesis was a doll with our various questions ... the room and bottle of wine with gorgeous card brought tears to our eyes- when your job is to care for others being cared for means a lot !! \n\nWe ate at all three spots (diner \/ lounge \/ jazz club) and they were all tasty and fresh flavors- drinks were excellent !!  Music from DJ in lobby bar and jazz in jazz club where fabulous!!!! No cover charge !!! Just table time limits which are fair. \n\nWe fell in love and will be back - PLUS- they allow dogs !!!","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"A Delightfully Friendly Hotel","lang":"en","publishedDate":"2023-03-29","publishedPlatform":"OTHER","rating":5,"text":"I recently stayed at the Soho Grand Hotel for a short business trip. I stayed two nights and thoroughly enjoyed my experiences with the hotel.  Check in was quick and flawless, my room was clean and inviting.  I had a view of the hotels dog park from my room and though I didn't have dogs with me, I appreciated how dog friendly this hotel is.  I ate breakfast in the Grand Bar both mornings and the food came out quickly and was delicious. The service was friendly and attentive. I ordered room service (also from the Grand Bar) for dinner on my second night and was surprised by how quickly it arrived.  One of the best French Onion Soups I've ever had!  Too soon my stay was over and check out was as efficient as check in and the men on the doors went above and beyond.  I can't wait to go back!","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Wonderful service, rooms and views. Excellent place to stay in NYC! ","lang":"en","publishedDate":"2023-03-22","publishedPlatform":"OTHER","rating":5,"text":"Absolutely stunning hotel in the heart of everything. Perfectly sized rooms and comfortable beds with incredible amenities, service and views! From the moment we arrived, we were treated incredibly well, despite having to stand around for 10 minutes while we were on hold with the bank as they froze our Visa! They were very patient with us and got us a table with some water. \n\nBonus points are that it is dog-friendly. We did not travel with our dog, but got our fill by also visiting the Best Friends Animal Shelter across the road. \n\nWe were moments from shopping, dining, drinks, and entertainment, and will definitely choose this spot as our next hotel stay when we are in NYC! ","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Excellent service and beautiful rooms","lang":"en","publishedDate":"2023-03-21","publishedPlatform":"OTHER","rating":5,"text":"The rooms were so big compared to most NYC hotels that I've stayed in. The hardware and amenities were fantastic and definitely worth the price.\n\nAlso the staff is insanely attentive and went out of their way to help me wrap a gift at the last minute. ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":93561,"title":"Beautiful hotel but some flaws","lang":"en","publishedDate":"2023-03-20","publishedPlatform":"MOBILE","rating":3,"text":"The room and building were beautiful and chic. But the walls are thin enough that I heard a dog barking next door for most of the night, a generator or something like it was humming and buzzing all night which interfered with sleep, and the free wifi was not good enough to stay steady or allow us to watch Netflix as advertised. The tv setup is clumsy and difficult to use. I got the sense the mediocre wifi was in an effort to force you to pay for the more expensive wifi package. Otherwise, it’s a physically beautiful place.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"GREEDY DOORMAN","lang":"en","publishedDate":"2023-03-16","publishedPlatform":"OTHER","rating":1,"text":"I have been to soho grand a number of times. \nFor personal outings but primarily for business functions. Having spent a lot of money on both occasions. The last few times myself and my colleagues noticed that we are being charged by the doorman $100 dollars to gain entrance! Considering  how much money people spend . I find that extremely ridiculous, he is rude and extremely arbitrarily with who he makes pay and who doesn’t!  I will be taking my business elsewhere! ","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Wonderful stay, great location","lang":"en","publishedDate":"2023-03-16","publishedPlatform":"OTHER","rating":5,"text":"We had a great stay. Decor was very cool. Our room was unique and had lots of amenities. The view on the corner unit was wonderful. The location is great for shopping and restaurants. Would definitely come back.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Stay here and look no further","lang":"en","publishedDate":"2023-03-14","publishedPlatform":"OTHER","rating":5,"text":"Let me say that I don’t normally don’t do reviews but the soho grand hotel is top notch. From the moment you walk in you feel special, and are greeted with friendly people and smiles. The rooms are impeccably clean, and the staff is professional and so nice to talk to. From the moment we sat down we were greeted by Remington in the lobby and he really made our experience that much more special and welcoming. I could not pick a better place for a bachelorette. Will definitely visit again! ","travelDate":"2023-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"The perfect spot for an anniversary celebration!","lang":"en","publishedDate":"2023-03-14","publishedPlatform":"OTHER","rating":5,"text":"My wife and I decided Soho would be the best NYC location for an anniversary weekend celebration in mid-March. The Soho Grand proved to be the best hotel in the area (maybe in all of NYC) as they delivered at the highest level on everything. \nThe prosecco and special pastry creations were a welcome surprise, and\nan upgrade to room 1110 (corner views) was excellent as well.\nOur anniversary stay was made all the more special by the staff's attentive and thoughtful gestures.\nWe are glad we stopped in at the hotel bar on 2nd fl. The bartenders are accomplished and professional, while making outstanding cocktails amidst a fabulous atmosphere.\nWe will always consider Soho Grand first whenever we plan future visits to NYC.\n5-stars all-around.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Best hotel experience in New York in a while!","lang":"en","publishedDate":"2023-03-09","publishedPlatform":"OTHER","rating":5,"text":"The soho grand definitely went above and beyond to accommodate my needs!  Such a sweet and kind and hard working staff.  The location is perfect if you wanna explore downtown NYC!  It’s within walking distance of all the soho galleries and shopping, and on plenty of subway lines.  It’s also a quick shot to Penn station.  ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"The Best In NYC","lang":"en","publishedDate":"2023-03-09","publishedPlatform":"OTHER","rating":5,"text":"Absolutely LOVE Soho Grand! This is my go to hotel in NYC.  The staff is great, the rooms are comfortable, and the overall vibe is perfect. The dog park is my pup's favorite place to be! Can't recommend enough!","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Not worth the hype - at all","lang":"en","publishedDate":"2023-03-03","publishedPlatform":"OTHER","rating":1,"text":"The room was ok, however the reservation leading up to the stay was a nightmare.\nWhen checking in, there was no information of the premises or services regarding breakfast, facilities, bar, food. No engagement from the staff. \nWe decided to have dinner one night at the hotel, however it took 27 minutes before we got to order our drinks(we were told we only had 90 mins at the table when we got there) and the staff were disengaged aswell. A perfect example of a place that lives off of former glory. If you want to pay a lot of money for a nice location with no service- this is the place for you.\nWe will not stay here again.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Perfect Home Away from Home!","lang":"en","publishedDate":"2023-03-02","publishedPlatform":"OTHER","rating":5,"text":"Cozy elegance in an ideal NYC neighborhood with staff who make you feel at home...doesn't get much better!  Great attention to detail with rooms that are clean, spacious and include thoughtful details.  The Grand Bar is the ideal place for meetings, getting work done and people watching.","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Easy and comfortable.  I feel at home staying there!","lang":"en","publishedDate":"2023-03-01","publishedPlatform":"OTHER","rating":5,"text":"Great rooms, clean and very comfortable!  Service is wonderful always.  Everyone very professional and caring!  Every time I arrive I’m greeted with a smile and an easy check in!  The bellmen go out if their way to always help me out! ","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing stay!","lang":"en","publishedDate":"2023-02-23","publishedPlatform":"OTHER","rating":5,"text":"Excellent customer service and attention to details. Friendly and helpful staff from the door men to the front desk! Incredibly helpful and ready to answer questions and make recommendations. The hotel has classic old NY vibes. The food is AMAZING! Cool neighborhood with great shops with some chains mixed in.","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Mangelhaft","lang":"de","publishedDate":"2023-02-23","publishedPlatform":"OTHER","rating":3,"text":"Das personal war sehr nett, die Zimmer auch das Bad ist auch sehr schön. \nDoch das essen war so schlecht das man es kaum essen konnte. \nDas Frühstück das Ei war gefühlt verfault. Das Brot war Stein hart. \nUnd der Honig grausam. \nEmpfehlenswert nur wenn man nichts isst.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Perfect stay at Soho Grand!","lang":"en","publishedDate":"2023-02-22","publishedPlatform":"MOBILE","rating":5,"text":"Awesome stay at Soho Grand with my puppy Oscar. From the moment we arrived the friendly staff did everything possible to make our stay memorable - and it was. Room was lovely and quiet, Soho Diner was a great meeting spot for my kids and family who live in the NYC area and the dog park was fabulous! Absolutely loved everything about my stay and can’t wait for our next visit!","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Perfect NYC Weekend","lang":"en","publishedDate":"2023-02-21","publishedPlatform":"MOBILE","rating":5,"text":"My husband and I were looking forward to a much needed couples weekend in our favorite city!   Our first time staying at the SOHO Grand.  From the moment we arrived we were greeted by the friendliest doorman who quickly unloaded our bags and took our keys to park our car, which if you know parking in NYC, is a huge luxury!\nThe hotel is understated with luxurious details, a mix of both old world and contemporary design.  Just lovely!  During the course of our stay, we had a delicious breakfast in their lobby cafe with comfy couches and great people watching.  One evening before our night out, we had martinis in their beautiful bar, quite the NY nightlife scene!\nEvery time we needed to call down for something, it was brought up within minutes.  \nTheir concierge staff is so friendly and very helpful.  On our last day, Lonnie came up to help us with our luggage.   He is the sweetest most friendliest man!   This hotel knows what they are doing in employing  first rate staff!  Post Covid, this is not the norm in most places.  What a amazing way for us to sadly end our stay.  I also want to add, that Soho is the BEST neighborhood to stay in.  Over the last 25 years, we have stayed all throughout the city.  By far, Soho checks all our boxes… great shopping and dining with a great vibe!   We can’t wait to come back!!!","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Excellent choice!","lang":"en","publishedDate":"2023-02-20","publishedPlatform":"OTHER","rating":5,"text":"We had an excellent stay at the Soho Grand - it was a perfect home base for a weekend in the city. Every staff member we encountered - at check-in, in the cocktail lounge, at the concierge desk and at check-out - was so friendly and helpful. Our room was clean, comfy and had a great shower.  We love Soho for its neighborhood feel, but great restaurants, excellent shopping and endless entertainment options are minutes away. Will definitely be back!","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Guest experience is top notch. Friendly, gracious staff!","lang":"en","publishedDate":"2023-02-20","publishedPlatform":"OTHER","rating":5,"text":"The customer service and staff attentiveness were outstanding!  Every request, from extra coffee pods or a glass of Prosecco,  to finding us a place on the sofas, was met with \"Yes!\"  , with good cheer and friendly professionalism.  The concierge was on point, and at the door, Jose not only took care of our car, but remembered us from last year, and was genuinely interested and helpful with our plans. The room is just right, clean and cozy, love the ombre window shade!","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Grand time at Soho Grand. ","lang":"en","publishedDate":"2023-02-20","publishedPlatform":"OTHER","rating":5,"text":"Excellent location. Clean room. Excellent service. Excellent Concierge. Great amenities. Great nightlife. It is easy to navigate the city from here. Great restaurants in the area. Close to the sister hotel is the ROXY where there is great jazz to be heard. ","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay!!","lang":"en","publishedDate":"2023-02-20","publishedPlatform":"OTHER","rating":5,"text":"SoHo Grand is a wonderful hotel in a great area; it's chic and the staff is so accommodating and friendly!  Whatever you need, they are there for.  It's lively and the rooms are incredibly nice and well maintained.","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Lovely stay","lang":"en","publishedDate":"2023-02-20","publishedPlatform":"OTHER","rating":5,"text":"Easy to get to location and base for moving around the city. Room was clean and cozy. Great water pressure in the shower. Comfortable mattress and bedding. Front desk staff were lovely to work with. Special thanks to Ricky for problem solving our request without a hitch!","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great rooms, dog friendly, bustling location","lang":"en","publishedDate":"2023-02-19","publishedPlatform":"OTHER","rating":4,"text":"We stayed here with our dog and were very impressed with the dog friendliness. She was very welcomed in all spaces, and enjoyed the private dog park. \nOur room was spacious and thoughtfully decorated. \nThe location is convenient for getting around downtown, though very busy and bustling.","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Winter Getaway","lang":"en","publishedDate":"2023-02-18","publishedPlatform":"OTHER","rating":5,"text":"We’ve had such an amazing stay at the Soho Grand! The hotel is decorated beautifully and the rooms have spectacular views of the city. Danny helped us switch our room when there was a mixup with our check-in. He even walked with me to the new room and showed us the view of the World Trade Center right outside our window! He has been so hospitable in helping us with anything we needed during our trip. Thank you for hosting us and being so gracious! We will definitely stay here again in the future! I highly recommend the Soho Grand when staying in Manhattan.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Perfect location and plenty of soul","lang":"en","publishedDate":"2023-02-16","publishedPlatform":"OTHER","rating":4,"text":"Having decided to stay in Soho, this hotel ticked the right boxes for us - it is very well located, being near to the shops around Broadway, the restaurants around Spring Street, Tribeca and the financial district.  \n\nThe hotel itself has lots of soul and you feel that the moment you walk in - the atmosphere is dark and nicely lit with a quirky, cool atmosphere and decor\/furnishings to match.  The staff were helpful - especially the friendly doormen - and they were happy to help with complementary essential toiletries when the airline lost our luggage which was really appreciated.\n\nWe were on a budget and so didn't eat and drink much at the hotel itself.  We had a drink at the hotel bar on Saturday night which was fantastic although expensive.  There are food and coffee places round the corner which we used a few times to keep costs down.  We like to run and it's easy to get down to the riverside by West Street for scenic runs towards or away from World Trade Center and Battery Park.\n\nWe did note that - especially in the corrodors - if the lights had been bright they would have exposed corridors that need some love from the decoarion perspective, but the room itself was nice so it didn't really matter to us.  If you're looking for a perfect finish or  modern decor this may not be your place, but if you are looking for character and a great location you'll probably like it.  Overall we really enjoyed it and would go back.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"A Grand Old Time","lang":"en","publishedDate":"2023-02-13","publishedPlatform":"OTHER","rating":5,"text":"The SOHO Grand is everything a SOHO hotel should be - super chic and a ton of fun, with fantastic service to boot. All of the staff was warm and welcoming and happy to help answer any of my questions. The room had a great view looking uptown, with luxurious amenities. There are tons of shops and restaurants within walking distance so you will have a great time even when its 10 degrees outside. I will definitely be coming back!","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"I want to go back!","lang":"en","publishedDate":"2023-02-11","publishedPlatform":"OTHER","rating":5,"text":"I booked a last minute stay at Soho grand and am so glad I did. The hotel was beautiful, clean, central to everything and the vibes were immaculate. The staff was very kind and helpful. Kiara at the front desk was an absolute pleasure and made me feel right at home. I had such a lovely experience and  can't wait to go back. ALSO if you're a foodie like I am, the food was so good!! Make sure you try the BLT from here with fries...and the chocolate treats, and the omelets, and green juice - all of it- phenomenal.","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Fantastic!","lang":"en","publishedDate":"2023-02-07","publishedPlatform":"OTHER","rating":5,"text":"The property, rooms, vibe and staff are all fantastic! The location couldn't be any better or cooler. \n\nI've stayed at the Soho Grand many times and each stay has been fantastic. It's become my \"home away from home\" while visiting NYC.","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":-1,"locationId":93561,"title":"Amazing!","lang":"en","publishedDate":"2023-02-01","publishedPlatform":"OTHER","rating":5,"text":"I absolutely love Soho Grand. I go to NYC for a week every month and it's the only place I stay. Clean, friendly staff, and great location. Stephanie and Melody have been so helpful and such a pleasure to work with. All of the door\/ front desk staff are great too! Top notch customer service- they're amazing.","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Perfect SoHo hotel","lang":"en","publishedDate":"2023-02-01","publishedPlatform":"OTHER","rating":5,"text":"Luxurious accommodations, attentive staff, stylish decor, and positive vibes conspire to make this the perfect SoHo place to stay!  I return to this hotel on every trip to NYC, and I look forward to my next stay!","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Exceeded High Expectations!","lang":"en","publishedDate":"2023-02-01","publishedPlatform":"OTHER","rating":5,"text":"I live in the NYC area and was looking for a hotel to invite my partners and clients to stay when coming to NYC for meetings and events. Though I know NYC well, having lived there for 20+ years, I hadn't the need to stay in hotels there. I can recommend hotels in many other cities around the world but not in the city I call home!  \n\nI had heard much about the Soho Grand over the years, all rave reviews, so I decided to see for myself before I endorsed it to my colleagues.\n\nMy very high expectations were exceeded the moment I pulled up to the hotel...happy that the valet parking experience (my first time in NYC) mirrored that of any other valet parking experience I had in the past and so, with the parking headache eliminated, things only got better from there. \n\nThe design of the hotel is stunning and the check-in process was flawless and the room was perfect. I particularly appreciated that even though the hotel is relatively new, it had so many classic touches such as high ceilings, plenty of light, impressive attention to detail and, best of all, an overwhelmingly upbeat and attentive staff. \n\nThough mine was a short visit, I am confident that for even longer stays, the Soho Grand will be the perfect NYC hotel for me, my colleagues and my clients.\n\nOne last thing: Ollie did not join me on this visit...but he would have been totally welcome as the Soho Grand is dog friendly and provides an adjacent dog park...which is not easy to find in that part of NYC!","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Fabulous time","lang":"en","publishedDate":"2023-01-31","publishedPlatform":"MOBILE","rating":5,"text":"The soho was absolutely breathtaking and we had such a good time. The staff was beyond helpful and so professional we will be coming back sooner than later. The room was so clean and everything you can possible need was in the room.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great weekend getaway at the Soho Grand ","lang":"en","publishedDate":"2023-01-27","publishedPlatform":"MOBILE","rating":5,"text":"We had a great weekend getaway in Manhattan at the Soho Grand; from the moment we were greeted at the entrance until check out we felt special.  Check in was easy and actually fun, great energy and everyone super friendly.  The atmosphere is very chic trendy and warm at the same time. Michael checked us in and was wonderful, we were offered complimentary prosecco, which we enjoyed very much.  During check in Michael was engaging and sincerely interested in our plans; when I mentioned we were locals celebrating a covid delayed anniversary weekend we were greeted in our room with a beautiful note and bottle of prosecco.  Our room upgrade was perfect with a lot of nice touches and beautiful northern city view; the bed was amazing and we appreciated the blackout shades.  There were plenty of options for food and drinks right in the hotel, we really enjoyed breakfast in the restaurant in the morning and cocktails in the lounge with live dj at night until the wee hours.  They have a very cool retro diner we hope to try on our next visit.  The area is perfect to visit lower Manhattan and easy to access the theater district, subway around the corner and always a cab standing by outside.  \n","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Would have been a 5 rating if it wasn't for the disappointing bar experience","lang":"en","publishedDate":"2023-01-26","publishedPlatform":"OTHER","rating":4,"text":"So... there are lots of great things about this hotel. The location in particular is superb - easy walking distance to lots of places like Ground Zero, Brooklyn Bridge, and all of the cool neighbourhoods like Little Italy, Chinatown etc. Right next door to Canal St subway to take you uptown. The rooms were a good size and the beds really comfortable. Bathrooms were very nice and spacious - although the shower did seem to take an age to get hot.  If you get a room on the north side of the hotel there are great views too. \nWe were a party of 6 - my husband and I (and our two children and their partners (all in their mid 20s), we chose the hotel because of the DJ and cool bar\/lounge of a weekend. We thought it would be great for them ( and us) to hang out after we'd been out in the evening. HOWEVER - of the four nights we were there we only managed to secure a table at the bar once. It is clearly a very popular night out for local New Yorkers and there were queues to get into the hotel on Friday and Saturday nights. When we tried to get into the Lounge area to sit down we were basically told there was no chance, and we would have to stand at the bar only. On the Saturday night we waited for 40 mins at the bar to get served and eventually gave up and went to bed. There was no priority given to hotel residents which was very disappointing. The Club Room seems to be closed in January which means there simply isn't enough room for residents and outside guests. We all loved the ambience - loud, lively, buzzing - but it just felt a little too chaotic and badly managed. And we did wonder where hotel guests who prefer a quieter drink were meant to go?\nIn summary - this is a good hotel, with a great location. But you need to think about the kind of nighttime experience you are looking for - it's loud, lively and very cool in the Bar and Lounge, but that might not be what everyone is looking for.","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Always a Great Experience!","lang":"en","publishedDate":"2023-01-25","publishedPlatform":"OTHER","rating":5,"text":"Chic! Vibrant! Friendly! Comfortable! Those are just a few of the many aspects of the Soho Grand Hotel. My boyfriend and I stayed there together for a business trip and absolutely loved the fun energy and ambiance at both the hotel bar and the diner. The staff is exceptionally welcoming and friendly, always greeting you and making sure all your needs are met. Particularly, I was assisted by Kiara to coordinate an anniversary surprise in our room for my boyfriend. I was blown away by her desire to help me and go out of her way to make it perfect! Aside from the incredibly kind hotel staff, this hotel is modern chic with an amazing shower. It is central to New York hot spots while also being a great place to work if you're on a business trip. A perfect blend of sophistication and fun. Will most definitely return again and again. Thank you all for your wonderful hospitality.\n","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Great location, will be better after Covid","lang":"en","publishedDate":"2023-01-21","publishedPlatform":"OTHER","rating":4,"text":"This is a really nice hotel and so close to some great restaurants and shops, plus super convenient to the subway just around the corner. Nice wine shop across the street. We had great views too. The lobby bar is excellent though sometimes served with a bit of attitude. Highly recommend the charcuterie plate with local cheeses, honey, and salamis. The room was small for an upgrade, but it is NYC so I don't expect \"big\" - nice desk, comfy bed. Housekeeping was excellent, really nice people. Due to Covid, the hotel's restaurant hours are not daily and there is no concierge or bell person to assist, so you're on your own there. Gilligan's restaurant on the ground floor was really wonderful but a bit intimidating having a set amount of time to order and eat. They didn't adhere to it, and we did have a hefty bill going. This happened in another restaurant as well. 90 minutes for a party of 3. Overall, I'd stay there again if the price was right. We used Amex and got $100 toward the bill.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing place to stay in SoHo","lang":"en","publishedDate":"2023-01-19","publishedPlatform":"MOBILE","rating":5,"text":"The moment i've arrived in this hotel, i already fall in love with the facade building and the neighborhood. Located in Soho, there were a good pub, good boutiques such as The Real Real, What Goes Around, Re-Bag, Bonpoint and many more within walking distance. If anyone wanted to do a shopping trip in SoHo, you can pick this hotel. \n\nI love the smooth check in process, sadly i forgot the guy who has helped me and however the lighting of the hotel was a lil bit way too dark to create the right ambience, i understand but sometimes it's kind disturbing lol. My room was impeccable, not too big and not too small, i had 2 big luggages and the room can accomodate it. Beautiful view and amazing wall tv screen. What i like the most is probable their mini bar selections very diverse and well curated. \n\nBathroom was very well designed and i love their shower gel and shampoo. (I decided to give it a go after trusting their taste in the mini bar selections). Unfortunately, i asked for a toothbrush and they said they don't provide free toothbrush in which u must buy one from the mini bar. \n\nThe breakfast was amazing, everything tastes so good. Their coffee was good too! However they need to train the staff better, my colleague told me that we can have breakfast downstair so i asked the waiter, how's the mechanism since the breakfast is ala carte and they seemed clueless. Turned out we need breakfast voucher before we order the complimentary breakfast. \n\nTheir bar and diner was amazing too, what i like about this place is this place isn't too 'touristy' but still can make a tourist like me satisfied with every details.","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Everything about the SoHo Grand was perfect!","lang":"en","publishedDate":"2023-01-17","publishedPlatform":"OTHER","rating":5,"text":"The rooms are beautiful, bedding wonderful and plush and views spectacular! We had a few requests and they were happily accomodated. Staff went above and beyond to make sure our stay was perfect. When I mentioned it was for my daughter's birthday a special treat was sent up to her room. The  lobby and bar area welcoming and comfortable. Special thank you to Andrew, the front desk manager who made this all happen.","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Another great stay !","lang":"en","publishedDate":"2023-01-11","publishedPlatform":"MOBILE","rating":5,"text":"The Soho Grand Hotel is my go to every time in NYC. \nI always enjoy my stay primarily because the staff is always fantastic.\nGilbert Aquado helped iron out my room reservation and booking.com glitch. \nWilliam and Jack at the bar are always perfect gentlemen. \nMimi the host was friendly and sweet to me. \nI enjoy the diner a lot especially the world class avocado toast with smoked salmon . I enjoyed my service from Ketsi very much. \nByron late night host was great to speak to after a few drinks as I battled insomnia.\nJose and Anthony were great to talk to as I shared my fun times of the day before. \nI also enjoyed the health club daily and the gentleman with the Sicilian Cap did a great job disinfecting the machinery. \nI could spend 365 days a year in your great environment!","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Where locals tell people - they actually like - to stay when they visit NYC","lang":"en","publishedDate":"2023-01-09","publishedPlatform":"MOBILE","rating":5,"text":"Great energy from the minute you walk in.  2 lounges \/ bars with beautiful people, great drinks and no drama. \nClean, modern rooms. Spring for terrace suite and you won’t be disappointed. \n\nSo dog friendly you will feel bad if you don’t bring your pup. \n\nPerfect location for bars and restaurants of soho, west\/east village. \n\nFriendly, helpful staff. \n\nThe spot for all my staycations, or visiting friends and family.  \n\nMarcus M is star manager; hardest working person in NYC hospitality industry I’ve come across living here 20+ years.  Always seems to be working, but brings only positive energy and solutions.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Ask for Michael! BEST SERVICE","lang":"en","publishedDate":"2023-01-08","publishedPlatform":"OTHER","rating":5,"text":"My experience was outstanding due to one person in particular working the front desk, Michael. He addressed my concerns In a considerate and efficient manner and made sure my stay exceeded my expectations in every aspect. As well as made recommendations on things to do in the area. If you plan on staying here anytime soon definitely ask for him by name and you will receive the best service possible enjoying a memorable pleasant experience.","travelDate":"2022-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"\"Es könnte alles so schön sein, wenn da nur nicht die Gäste wären, die stören“.","lang":"de","publishedDate":"2023-01-06","publishedPlatform":"OTHER","rating":1,"text":"Wir waren nach all der guten Bewertungen mehr als enttäuscht von diesem Hotel. \nDas fing schon damit an, dass es uns nicht möglich war sich mit dem Personal beim Ein-Checken zu verständigen, da am Wochenende Livemusik in der Lobby gespielt wird, die sich direkt neben dem Empfang befindet. Weiter ging es damit das wir um eine Kreditkarte zur Sicherheit gefragt wurden. Das diese Karte mit 1000,- $ Vorreserviert wird, haben wir nur durch einen Mitteilung der Bank App erfahren.  Unsere Information an das Personal, das unsere Koffer leider nicht mitgekommen sind und von der Airline ins Hotel nachgeliefert werden und wir daher gerne Tipps für den Einkauf von Unterwäsche und T-Shirt wurde geflissentlich ignoriert. Könnte auch sein, dass aufgrund der lauten Musik unsere Frage nicht gehört wurde. Nebenbei wurde uns noch nonchalant mitgeteilt, dass unsere  Reservierung für den Abend zum Essen wegen einer Privatveranstaltung nicht möglich sei, aber wir könnten ja für morgen reservieren. Wir hatten aber jetzt Hunger nach einem stundenlagen Flug nach New York. \nNachdem wir über die Koffer Tracking-App informiert wurden, dass unsere Koffer im Hotel abgegeben wurden, gingen wir an den Hotelempfang, um sie dort abzuholen. Dort wurde uns mitgeteilt die Koffer seien nicht da und es gäbe auch kleine Mitteilung in der EDV dazu. Auf unsere Bitte beim Doorman telefonisch nachzufragen, wurde uns geantwortet, wenn die Koffer nicht im System sind, sie auch nicht da seien. Wir gingen dann selbst in das EG und konnten dort im Lager unsere Koffer entdecken und mitnehmen. Einen Kofferservice der behilflich ist das Gepäck auf das Zimmer zu bringen gibt es in diesem Hotel nicht. Der Roomservice kam nur wenn wir das Schild zum Reinigen des Zimmers an die Türklinke anbrachten,  Haken für die Wintermäntel gab es keine im Zimmer und der Schrank war so klein, dass in diesen keinesfalls Kleidung für zwei Personen unterzubringen waren. Unsere Bitte nach mehr als drei Kleiderbügel kam man dann nach dreimaliger Aufforderung auch nach.\nIm Hotel-Restaurant haben wir uns das Club- Sandwich mit Hähnchen bestellt, dass so scharf war das es nicht zu essen war. Unseren Hinweis an den Keller dies vielleicht auf der Karte zukünftig auch zu vermerken, wurde mit Empörung entgegen genommen. \nDer sehr unfreundliche Service wurde noch einmal getoppt an unserem letzten Tag. Unser Flug ging erst um 22.30 Uhr und wir wollten daher vom späten Nachmittag bis 18.30 Uhr in der Lobby auf unsere Abholung warten. Nach dem uns aber aufgrund von zahlreichen Reservierungen nur einen Platz von einer Stunde angeboten wurde, platze mir der Kragen. Ich dachte immer eine Hotellobby gehört in erster Linie den Hotelgästen. Das scheint in diesem Hotel nicht der Fall zu sein.\nÜberhaupt hatte man immer den Eindruck das der Coolness-Faktor wichtiger war als das Wohl der Hotelgäste. Einmal freundlich willkommen zu werden oder ein Lächeln beim Personal schien nicht möglich, vor allem nicht von den Mitarbeitern an der Rezeption. Ich kann mich nicht erinnern wann ich das letzte Mal im Hotel mit den Worten „next“ aufgefordert wurde mein Anliegen zu äußern.  Normalerweise werde ich höfflich gefragt, wie man mir weiter helfen kann.\nWas gibt es Positives zu berichten? Die Lage des Hotels ist super, dies gilt allerdings auch für viele weitere Hotels in New York. Das dazugehörige Soho Dinner hat uns gut gefallen, nettes Personal, großartige Atmosphäre und leckere Burger.\nAlles in allem lässt sich zu diesem Hotel folgender Spruch sagen „es könnte alles so schön sein, wenn da nur nicht die  Sicherlich werden wir bei unseren nächsten New York Urlaub nicht wieder in diesem Hotel absteigen.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Beautiful Place, Cool Vibe, Amazing Staff","lang":"en","publishedDate":"2023-01-05","publishedPlatform":"MOBILE","rating":5,"text":"Have been coming to SG for years... first time back since the pandemic and so pleased to find that it's better than ever. The place continues to look beautiful,  attract a nice crowd and keep it's whole \"cool\/sumptuous vibe\". The beauty is that you get all that AND really wonderful staff. Everyone there from door to floor, front desk to bar, administration to security was warm, responsive and accommodating... so rare for a \"hot spot\". (And mind you... I was there for NYE). Also for Soho, location\/value can't be beat. Mini-bar goodies are pretty great too.","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Posh but not snooty","lang":"en","publishedDate":"2023-01-04","publishedPlatform":"OTHER","rating":5,"text":"Hands down the best hotel in soho!\nThe staff makes it even better!\nBeen coming for years and plan to keep coming back.\nFrom the minute you arrive you feel welcomed.\nThe staff is professional,helpful and friendly!","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Big thanks to Edward & Michael for a wonderful experience","lang":"en","publishedDate":"2023-01-01","publishedPlatform":"MOBILE","rating":5,"text":"When I got there at first, there were a few things amiss. Edward and Michael went above and beyond to turn everything around. Both of them truly were exceptional. They fixed things and repeatedly followed up to make sure I was okay. Also they worked together so well, I could say one thing to one of them and be certain he informed the other one, so that eg when they worked different shifts the transition was always so smooth. Edward was very kind to help me with placing a few packages from online shopping prior to arrival into my room, and he then even asked me how the shopping had worked out and if I needed assistance returning anything. Very very thoughtful. Generally the hotel is beautifully located, next to everything, & very comfy bed and showers. But if I’m coming back, it’s certainly because of Edward’s and Michael’s hospitality. Daniel at the front door was fantastic too (greeting me by name every time even though we had only met for a brief second!); and Ricky the manager was great also. Thank you all for a beautiful stay.","travelDate":"2023-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Volvería sin duda","lang":"es","publishedDate":"2022-12-30","publishedPlatform":"MOBILE","rating":5,"text":"Gran hotel, ubicación espléndida, personal profesional y amable. Cualquier cuestión fue atendida con eficacia y prontitud. Habitación de tamaño bueno. Vistas a la ciudad. Baño amplio y muy bien resuelto. El único problema es el ruido que produce la música del salón que se oye en todo el hotel y que en las habitaciones de los pisos bajos es insoportable. El servicio en el bar es muy deficiente y muy caro","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Christmas and New Years 2022 - Brrrr!","lang":"en","publishedDate":"2022-12-24","publishedPlatform":"OTHER","rating":3,"text":"We are currently at the hotel - Christmas through New Years 2022. Booked king corner room - it was freezing! Air coming into room around air conditioning unit into our room on the 10th floor. Bathroom heater also does not work. Big Thanks to Lesley, engineer for soho grand, that brought a space heater to us and also helped block some of the cold air coming into our room. ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"High End Hotel","lang":"en","publishedDate":"2022-12-23","publishedPlatform":"MOBILE","rating":5,"text":"We had a fantastic trip to New York, and loved the Soho Grand.\n\nBooked a high floor room and the view, including the Empire State, took my breath away when we walked in. \n\nHuge comfy bed, automated black out blinds, massive TV, and a great shower. \n\n20mins by Subway to most things we wanted to see and do. Liked the local neighbourhood as well. Enjoyed the in-house Diner several times, and the room service ordered from the Grand Bar was excellent. \n\nChecked in late at night, when the party atmosphere in the adjoining bar meant shouting a little to be heard over the music, but had a decent welcome experience nonetheless, including being offered champagne. \n\nWould stay again!","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Comfy beds \/ home away from home\/quiet","lang":"en","publishedDate":"2022-12-23","publishedPlatform":"OTHER","rating":5,"text":"Stayed here for a few days November and December for a work trip after not staying here since pre-pandemic. Slept well every night and felt safe. Was quiet except garbage truck sounds in early morning hours one time. Beds are comfy. Service great. Clean rooms (they have been remodeled- so feel new) consistent service. Very welcoming at front desk and at front door. Handy location. Soho Diner is fantastic- great food, service and atmosphere.","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Sleep Deprived","lang":"en","publishedDate":"2022-12-13","publishedPlatform":"OTHER","rating":2,"text":"Having stayed a week each year around Thanksgiving for 6 years pre-pandemic and after writing two rave reviews in the past, I feel sad to write this review. The staff has completely changed and the room we always had exists no more. The second year we stayed (2013), the back room manager Michael (he is no longer there) would send a personal note with two chocolates up to welcome us. He always gave us the same deluxe corner room on the 15th floor. We did get a deluxe corner room (1009) this time and its as nice as before, but the room rate has increased 22%, with less amenities. One of the things we enjoyed before was a coffee room down the hall where we can get coffee (decaf or caf), capucchino, latte, tea, etc. No more. We now have two pods, two sugars, and two creamers. Some days we get refills, some days we don't. There was no decaf option or any fancy concoction. The room was booked for two, but they had one robe and set up for one. There was no clock. Fortunately, we had our iphones for alarms.  We had to run the hot water faucet for at least 3 minutes to get the hot water up to our floor. In California, where we live, we would be fined for wasting water! We always had a connecting door, but our neighbors were always considerate and quiet. Not this time, as the woman next door had a pajama party beginning at 1 a.m. the first night. After security was called, she continued, and I was tired of complaining, so I didn't. She was so loud, as were her two girl friends, that we heard everything they said and did. They finally went to sleep at 3.30 a.m. By then, we were too irritated to go to sleep.  I was assured by the front desk that she was checking out that day. She didn't. The next night. she came back to her room alone and spoke loudly on the phone until 1 a.m. I have read on Trip Advisor that some hotels in the area provide sound machines. I suggest Soho Grand do the same for noisy neighbors. As for the restaurant, the Grand Salon exceeded expectations. We hosted a Thanksgiving meal there in 2017 and it was a disaster. This time, we hosted a luncheon and everyone agreed that the food deserved a 5 out of 5 rating, with compliments to the waiter Alex. At least that was a bright spot for this year.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Bien situé","lang":"fr","publishedDate":"2022-12-10","publishedPlatform":"MOBILE","rating":4,"text":"Hôtel très bien situé. Chambre confortable mais pas du tout insonorisée, du 14eme étage vous entendez tous les bruits de la rue très bruyante. Pas de rideaux pour obscurcir la chambre, seul un store qui tamise la lumière. Bonne literie, cafetière nespresso dans la chambre.\nÉvitez le bar, avec son personnel incompétent et à la limite de la politesse pour certains serveurs. Allez prendre votre petit déjeuner ailleurs, pour le même prix voir moins cher il sera meilleur et surtout bien servi.","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Empower the desk","lang":"en","publishedDate":"2022-12-06","publishedPlatform":"MOBILE","rating":2,"text":"Front desk unable to resolve our reservation issue. Kept checking with mysterious person  behind the door. Still unable. We checked the website and found room that they insisted was unavailable so we booked on our own to resolve issue. \nRoom was fine not exceptional.  Hotel is dated.","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Extremely disappointing.","lang":"en","publishedDate":"2022-12-04","publishedPlatform":"OTHER","rating":1,"text":"Took two rooms for 5\/6 nights in November.   The rooms themselves were fine.  The hotel staff are not warm and friendly, it almost feels as though they have done you a favour to allow you to pay to stay.  Strong smell of cannabis in the room.  Very poor internet connection especially in the communal areas.   They removed large sums of money form my bank account on check in ($1400) which they said was for future incidentals.  On the morning we were due to check out they took further sums of money from my bank account instead of using the $1400 they had taken on check in.  Almost two weeks after checking out I am still waiting for the return of the full sum meaning we've been overcharged hundreds of dollars.   Communication with the hotel is poor - they seem reluctant to engage to deal with the matter.  \nWe stayed over the weekend - they appear to prioritise their Saturday night locals over residents for a seat at the bar or the restaurant.  We were told that they couldn't't tell us if a table would take 30 minutes or three hours and we should eat in our room.  \nAll in all not what you expect from any hotel especially one in a country which prides itself on customer service.  Look elsewhere. ","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Boutique hotel che raccomando fortemente: Meravigliosa!!","lang":"en","publishedDate":"2022-11-29","publishedPlatform":"MOBILE","rating":5,"text":"We had a very good staying at the soho grand hotel. The hotel is a very cool boutique hotel with all the amenities. The room are pretty big for NY we had a king deluxe 1422 and we had an amazi \nng view of NY. The location is very convenient right in the heart of Soho with all restaurants and shops very close. The grand bar is very beautiful and it has music the atmosphere at night is very cool. All the employers at the Soho Grand are very kind ,professional and helpful . At the front desk and the guys at the doors are very kind and helpful.  I think the idea of the complimentary water is so good and convenient! I strongly raccomand Soho Grand Hotel which is so good and convenient and comfortable. The bed is very good and I have always problems on my back. The amenities for the bathroom are CO bigelows and they are very good :there is soap ,bath soap ,shampoo and conditioner. The sheets and towels are very soft and very good quality.This hotel is my hotel in NY. I love it!","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":93561,"title":"Great stay in Soho! ","lang":"en","publishedDate":"2022-11-13","publishedPlatform":"OTHER","rating":5,"text":"I have finally found my favorite hotel in Soho! I was there fora week on business.I had a corner room, and it was spacious and chicly decorated. My room attendant, Muriel on the 11th floor, was the absolute best. She made me feel so welcome! The men who work at the front door are also fabulous. I loved having a diner attached to the hotel as well.","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Great property- but really hit and miss","lang":"en","publishedDate":"2022-10-28","publishedPlatform":"OTHER","rating":3,"text":"I have stayed at the Soho Grand many times, pre pandemic and now first time post pandemic. Great location and property but overall mixed feelings. I booked the largest room category ( Grand Corner King) and the room is very large, with good views and relatively quiet, as on top floors. I arrived at 9 and they gave me the room straight away (official check in is 4pm) which I consider top notch service. The room charge now also has an amenity fee which includes stuff that was available to guests (gym, neighborhood guide etc) that has always been available, so I guess it is just a hidden post pandemic price increase. It also includes complimentary water, which puzzled me as the room only featured overpriced designer minibar water. Upon asking I was given a 236ml\/8ou bottle (this is not a joke), which made me laugh. You don’t get this in the room but you need to ask at reception and if you challenge the size of the bottle they throw a few into a plastic bag for you to carry up into the room. Housekeeping is impeccable and super friendly if you happen to meet them. The biggest challenge is the staff. Some are extremely friendly and some - especially in the lounge\/ bar - are so arrogant that it is ridiculous. Upon checking out the receptionist did not ask whether wanted to see the bill (I did, thankfully so, as it was incorrect) and whether my stay was pleasant. The housekeeper - who probably makes a lot less money - did ask though. The bellhops are very helpful and friendly. I generally like the Soho Grand but I feel they need to reconsider their price approach (amenity fee!) and consistency of service.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Outstanding Service","lang":"en","publishedDate":"2022-10-21","publishedPlatform":"OTHER","rating":5,"text":"I stayed at the Soho Grand in NY back in September and the hotel is amazing but it’s the people that work there that makes it the only hotel I stay in when I visit NYC! Marcus (manager), Kevin and Andrew (front desk) helped make my experience the best!! I’ll be back because of them next month..","travelDate":"2022-09","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":93561,"title":"Grandish","lang":"en","publishedDate":"2022-10-19","publishedPlatform":"MOBILE","rating":3,"text":"Soho Grand has a tag line that says “The hotel that made Soho Grand”.\nThat is a bold tagline and I have to say it is not quite true. \nThe hotel is nice and the location is very much if you like to stay in lower Manhattan 😀. \nThe beds are good and also the pillows. Also enjoyed the gym which is small but still good gear. \nWhat is not working is the service it varies from person to person. Further we had to call 3 times to get the remote changed and our laundry was 1 1\/2 hour late. \nWe had no noise in our room as we had a room on the 7th floor and I would recommend not to have one lower down as there is a lot of parties in the bar area - which is fun if you can close it off by go to your room. \n\nThe concierge is nice but again the service is limited meaning nobody makes a reservation for you or even suggesting to do it. \nSo all in all the hotel is only grandish","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Excellent in every way","lang":"en","publishedDate":"2022-10-19","publishedPlatform":"OTHER","rating":5,"text":"Spent a couple nights over Labor Day weekend at this beautiful  property.  The experience was wonderful from start to finish.  The staff was excellent starting with the bellmen who were so helpful with parking and directions to the front desk who gave a surprise upgrade, to the housekeeping staff who went and got ice for me when the one on our floor didn't work and finally the lovely service in the lounge.  Don't miss this gem of a place, we will be back for sure!","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Andrew is a rockstar","lang":"en","publishedDate":"2022-10-09","publishedPlatform":"OTHER","rating":5,"text":"Don't normally write reviews but had to take a second to mention how incredible Andrew and the entire Soho Grand staff is. I stayed at the hotel for a week and had a minor issue at check in and not only did they fix it right away, Andrew went above and beyond to check-in with me daily to make sure I had a great stay.  Goes without saying that the hotel is gorgeous and everything you'd expect but the staff being phenomenal is what makes this a true 5 star hotel and can't wait to stay there again soon. ","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"NY Staple","lang":"en","publishedDate":"2022-10-03","publishedPlatform":"MOBILE","rating":5,"text":"This is our go to staycation hotel and we have all of our out of town guests stay there as well. I've been frequenting this hotel for over 20 years and it is consistently great!! Highly recommend and please have the grand margarita!","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great location, unique character, friendly service.","lang":"en","publishedDate":"2022-10-01","publishedPlatform":"OTHER","rating":5,"text":"After a second stay I’m happy to say I had a great experience at the Soho Grand. \n\nMy arriving flight was canceled and the lovely front desk gentleman checked me in over the phone so that my room was ready early the next day. Help through email, phone, and in-person was fast and available when needed but unobtrusive when not. \n\nKing rooms are a great size for NY with huge window views of Tribeca. Room service was fast and tasty, but I do miss the days of real plates and silverware with tiny bottles of ketchup. In-room Nespresso with actual demitasse cups and saucers. TV can cast directly from your device with your own screening logins and internet is fast. Most importantly, the bed is comfortable and the pillows don’t deflate. \n\nI used the train from EWR and the hotel is a 2-minute walk from Canal Street where multiple trains stop. When ordering late-night food delivery you can skip walking through the very nice lobby in sweatpants by going directly to the ground floor. \n\nBottom line: This is a beautiful property with much more character than your standard luxury hotel in a great location. I would definitely stay here again.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"My amazing stay","lang":"en","publishedDate":"2022-09-29","publishedPlatform":"MOBILE","rating":5,"text":"Place is absolutely amazing. Easy to book, easy to check in. Luxury amenities. 10\/10 recommend. Don’t have one bad thing to say. Staff is top notch all around. Has an amazing lobby bar. Diner is convenient and delicious. And last but not least, the private dog park.  You’ll have no regrets.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Rude Arrogant Reception","lang":"en","publishedDate":"2022-09-25","publishedPlatform":"MOBILE","rating":2,"text":"Really great location and has a feel like a grand hotel should have. But the staff have no idea where or what they are working towards or who they are doing it for (ie the guests).\nVery disappointing - also look out for the hidden charges. Once you hand over your credit card to reception you are very much at their mercy and they don’t discuss charges I paid for my minibar purchases at the desk when I checked out in cash and still was charged on my credit card later.\n\nThey also charge illegal resort fees and then a tax on that!\n\nObviously this is illegal and is just a way for them to eke out more cash without disclosing it upfront.\n\nSo whatever you pay expect them to stick $50 on top a night!","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Cool but I'll try something else next time.","lang":"en","publishedDate":"2022-09-22","publishedPlatform":"OTHER","rating":4,"text":"Very cool hotel.  Stopped for a 2 night's stay before overseas travel. Room with an excellent view of lower Manhattan with the World Trade Center in the middle. Loved the vibe & the bar. Great location to walk to surrounding neighborhoods & drugstore.  Hallways are way too dark for my taste & made me wonder about what might be wrong with the walls & carpet. ","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":2,"locationId":93561,"title":"It's changed for the worse-terrible service","lang":"en","publishedDate":"2022-09-14","publishedPlatform":"OTHER","rating":1,"text":"I've stayed at the Soho Grand several times for work over the years and always enjoyed it.  This time, my partner and I checked in for a long weekend getaway in NY on Aug. 25th. We reserved an upgraded corner room and while it's been a while since COVID that I had been there, at first everything was fine. \n     The morning after we checked in, the room felt warm.  NY was in the 90s that weekend, so somewhat understandable.  We went out for the day and when we came back the room was 80 degrees.  Although it sounded like the AC was on, there was no cold air circulating.  We called the front desk and they sent up an engineer, who tried to get the AC to work, but told us it was unfixable and they'd need to move us to another room.  He told us that he'd get in touch with the front desk and they'd arrange to move us. \n      After about an hour, we hadn't heard anything and needed to leave to catch a show and dinner.  I called down to the front desk, and explained the situation.  The response \"I don't know anything about this\"...ok, thanks. I re-explained the engineer said he was going to reach out.  \"Well nobody told me, and i don't know anything about moving rooms.\" thanks again for the helpful attitude.  The tone was as if I was making this up.  I told him that we were going out for the night and when we got back, I'd expect that they'd straighten this out, and have another room for us.\n     We got back to the hotel around midnight on Friday night and went up to the room.  82 degrees and no AC. Back down to the desk--and when you go to the desk on Friday night, the adjacent bar has turned into a thumping nightclub and the front desk attendants stay in the office behind the desk.  After waiting for a couple of minutes, someone finally came out.  Re-explained the situation (and you have to yell over the music for them to hear you) and was greeted with \"I don't know what to tell you, we're sold out\".  I had to ask to speak to a manager, who came up to the room and immediately said, \"wow, it's hot in here\".  No kidding.  The best they could do was give us a fan, guarantee a new room at 3PM the next day and a refund of our $40 a night amenity fee.  I explained that they could have handled the situation so much better at 5PM than they were at now almost 1AM.  They couldn't even call the Roxy to see if they had rooms available-it's their sister hotel....\n     We ended up checking out immediately and walking over to 11 Howard to check in in the middle of the night  (the folks at 11 Howard were great, BTW).  We were charged for a  Friday night stay we didn't even use and were treated rudely thru out the experience.  I understand things break, but to have two service people be so unhelpful really speaks to how much this hotel doesn't live up to the Grand in the title.  Now that travel is ramping back up, it's unfortunate that this hotel is off my list for NY stays...","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Soho Grand is Unique and Interesting","lang":"en","publishedDate":"2022-09-14","publishedPlatform":"OTHER","rating":5,"text":"We were pleasantly surprised with this property. We loved the unique surroundings of the building and decor. The room was lovely, bed comfortable and bathroom perfect. The bar scene is hopping and loud but great place to people watch. Loved the area for walking a shopping and the subway stop is right around the corner. Shout out to the doorman and the front desk for friendliness and  courteousness,","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"It Feels Like Home, Only Better!","lang":"en","publishedDate":"2022-09-10","publishedPlatform":"OTHER","rating":5,"text":"When we arrived at the front door of the Soho Grand Hotel, we were greeted by the same friendly face that has welcomed us many times before. I turned to David and said, “it feels like home here.” \n\nWe checked in and were offered a complimentary glass of bubbly. We settled into an oversized comfy sofa in the lounge\/lobby and enjoyed the sights…It was fashion week. So, there was a lot of great people-watching.\n\nWe asked if it was possible to get an upgrade (I always ask), and were given a King Superior room with a beautiful view. The room and bathroom were immaculate The view was beautiful. The staff was friendly and helpful.\n\nWe can't wait to go back.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"A Mixed Bag","lang":"en","publishedDate":"2022-09-02","publishedPlatform":"OTHER","rating":3,"text":"It’s a mixed bag. This hotel is caught in a time warp.  The design aesthetic seems to be steampunk and the common spaces and hallways are very dark and unwelcoming.  The lack of a ground floor lobby makes entering and exiting  a dismal affair, more like a subway station than the entrance to a grand hotel.   Schlepping ones own bags up to the tiny 2nd floor lobby is inconvenient and makes a poor first impression. One doesn’t feel coddled here.\n\nThe terrace suite was indeed grand.  Very spacious and the terrace itself was superb with plenty of plants, comfy seating, an awning and a table for eating.  Nicely furnished rooms (I particularly liked the coffee table whose legs were stacks of the NYTimes), very comfortable bed and good quality linens.  The bathroom was enormous, the wallpaper witty and towels fluffy.   And yet there is only one hook from which to hang a towel or a bathrobe.  Style over substance.\n\nOn a silly but telling note, the very same black and white photo of Luna Park was hung both in the bedroom and in the living room.   Surely there are more images of New York to choose from.   As far as I could tell, I received nothing from the so-called “amenity” fee.  There is an overall lack of attention to the details here. Love the location but not a great value.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Pros and Cons","lang":"en","publishedDate":"2022-08-31","publishedPlatform":"OTHER","rating":3,"text":"Overall this hotel is fine. Pros include the comfortable bed, good location, good air conditioning, and a surprisingly quiet room given the location and the club in the basement. \n\nCons - the hotel is super dark and hard to see at night, the light switches in the room are super annoying to figure out, and the ironically the shades do not darken the room. They are light filtering only so when the sun comes up, the room gets brighter. \n\nIt's a decent stay, and good for the area, but I probably wouldn't stay here again.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Summer Stay at Soho Grand Hotel","lang":"en","publishedDate":"2022-08-19","publishedPlatform":"OTHER","rating":5,"text":"Spent 4 fabulous days at Soho Grand Hotel. From the moment I entered I was  happily greeted by the bellman. The front desk clerks were warm & welcoming. Helpful at sharing what types of entertainment options the hotel had that evening on my arrival. This so delightful as if one doesn't want to go out after a day of traveling, you have entertain right @ the Hotel.\nMy room was very well designed, the bed was beyond comfortable. Perfect after a long day of traveling. The room was impeccably clean . Rooms are extremely quiet.\nThis hotel has the most friendly staff. Everyone is so very kind.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"HIGHLY RECOMMEND","lang":"en","publishedDate":"2022-08-13","publishedPlatform":"OTHER","rating":5,"text":"My husband & I stayed here last weekend and what a treat!! From the door man\/security guard to the wait staff to the checkout desk all very friendly and accommodating. Our room was beautiful and comfortable. We enjoyed the esthetic of the hotel very much. We had pre dinner cocktails in the Salon, which was gorgeous and the drinks were fantastic. We returned from dinner outside of the hotel and went to the Club Room for cocktails and a live jazz band who were outstanding! We absolutely loved every minute there. The morning of checkout, which isn’t til noon, we enjoyed a boozy brunch with our family at the Soho Diner located inside the hotel. It was delicious, and our waitress was on top of every thing making sure we had what we needed. I really like the amount of security they have at the hotel. The doormen are security guards and on top of everything, your room key needs to be scanned in the elevator to get to the upper floors where the rooms are located and you can’t piggyback off another guests card, each person has to scan to get to their floor. We had a few hours before our train home so we spent that time back in the Salon and enjoyed the beautiful room and conversation with our adult kids before heading out. I was such a pleasurable experience. We usually stay at another hotel as I’m very picky about cleanliness, service & security, well, this is our new go to hotel, it was better than we could have imagined, we absolutely enjoyed our time. I HIGHLY RECOMMEND giving it a try!!!!","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Nice pleasant stay","lang":"en","publishedDate":"2022-08-09","publishedPlatform":"OTHER","rating":4,"text":"Really enjoyed staying here, the room was very small but you expect that for the price in NYC. Location was great, right in the heart of Soho. Gym was well equipped as well. Only downside is not being able to walk into the bar at night as a paying guest of the hotel.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Wonderful hotel and staff","lang":"en","publishedDate":"2022-08-05","publishedPlatform":"OTHER","rating":5,"text":"Best doormen in the city, excellent housekeeping, great selection of bar and dining options. Excellent location and close to subway lines.  Only steps from the best shopping and dining in the city.  Been staying there for 25+ years.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Sadly we had a poor experience","lang":"en","publishedDate":"2022-08-05","publishedPlatform":"OTHER","rating":2,"text":"I don’t think we fit the right demographic as everyone else who seems to have a good visit. Family of 4, 2 rooms for a week. Great location, you can walk everywhere, we had a room upgrade which was a lovely large room with a great view. However,  we found the staff generally to be rude and unfriendly and unhelpful . We had a few celebrations during the week and despite emailing numerous times pre visit, having Amex call them and telling them on check in we had no response. There is nowhere to sit and relax, despite the cost of staying there, if you dare to sit in the lounge you will be told in no uncertain terms to move for someone coming in for drinks.  We were refused late checkout, the only place to sit and wait for taxi was the empty windowless club room where we got bitten by fleas. The hotel gave us $300 refund. We won’t be back ,  hugely disappointed.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay, wonderful staff, good food, perfect location.","lang":"en","publishedDate":"2022-08-03","publishedPlatform":"OTHER","rating":5,"text":"Wonderful ambiance, very supportive and considerate staff. Crystal went the extra mile above and beyond  a few times, very nice room, great lighting, perfect location.  I have travelled quite a bit in North America and Europe, stayed in many different hotels, but this was one of my best experiences so far. Great value for money.  Hats off! Will definitely be back soon.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Dont' do it","lang":"en","publishedDate":"2022-07-29","publishedPlatform":"OTHER","rating":1,"text":"Tiny rooms with low ceilings that feel like a cave, no help with luggage or door man,  but the worst part is the air conditioning sounds like coins rattling around in a tin can, non-stop, blowing filthy air with particles so big you can see them as they shoot up your nostrils. Had to check out the same night to get any sleep.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Excllent hotel and management","lang":"en","publishedDate":"2022-07-28","publishedPlatform":"OTHER","rating":5,"text":"After years of travelling to New York, Soho Grand Hotel is the one and best choice, a guarantee of: comfort room, super great service from everyone since you arrive (Night Manager Mr. Steve Kyriakes went beyond normal duties and showed what hospitality is about. He was so charming was so happy. That is very rare these days post covid. He acknowledged me every time I came to the desk. The staff was excellent and well run by Mr. Steve Kyriakes and would stay here again,","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Excellent service by staff- night manager","lang":"en","publishedDate":"2022-07-28","publishedPlatform":"OTHER","rating":5,"text":":SOHO Grand hotel - Cleanliness, staff & service, amenities, property conditions & facilities are excellent. The night Manager Steve Kriakide  showed what hospitality  is about going beyond his normal duties. I travel a lot and his service would make me stay here again ..","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Incredible service (great stay, too)","lang":"en","publishedDate":"2022-07-26","publishedPlatform":"OTHER","rating":5,"text":"This was our first family trip to Soho Grand. The perfect launch pad for Manhattan, our stay truly couldn’t have been any better. Location was perfect, DJ accompanied our delightful dinner, view was spectacular and honestly, felt like royalty with the conscientious and above-and-beyond care from guest service agent, Kevin Barona. Down to the smallest detail, he made our stay one of the most memorable we’ve ever had in NYC. Highly recommended. Ask for Kevin!","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Feels like home","lang":"en","publishedDate":"2022-07-26","publishedPlatform":"MOBILE","rating":4,"text":"I’ve been staying here for many years so it’s become like a trusty old friend.\nAt first it was cutting edge boutique and it still has some of those qualities.\nYou can’t beat the SoHo location.  Rooms and bed are comfortable despite the noisy aircon and lack of hanging.\nIt’s still a go to location for some of the great and the good on the club nights.\nIt’s very good indeed.\n\nThe check in has always been very good here.  It must be something they really focus on\nOn this occasion the check in was off the charts good.  Young lady called Naomi was absolutely brilliant.\nFriendly, Fun and efficient!!","travelDate":"2022-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Excellent taste of New York. Fun and great service.","lang":"en","publishedDate":"2022-07-26","publishedPlatform":"OTHER","rating":5,"text":"The Soho Grand was a delight. This is my third time there and each time it gets better. Beautiful surroundings, awesome friendly service and great concierge service from Helen made the stay.  The hotel is extremely clean, the communal areas beautiful and relaxing and all employees are friendly and attentive to my needs. The hotel is in an accessible area of the city, and it is easy to get to your point of interest. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Excellent place for tourism and business","lang":"en","publishedDate":"2022-07-25","publishedPlatform":"OTHER","rating":5,"text":"After several years of travelling to New York, Soho Grand Hotel is the one and best choice, a guarantee of: comfort room, super great service from everyone since you arrive (Jose! 😍)  till you check out.  The breakfast room (that I use to fix appointments with customers) is delicious, unique in the city.  Thanks to the management and all workers for making me feel like being at home.  I will be back soon.","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Outstanding dining experience","lang":"en","publishedDate":"2022-07-24","publishedPlatform":"OTHER","rating":4,"text":"My husband and I spent last weekend at the Soho Grand. We live in northern New Jersey and wanted to get away for a quick romantic weekend. \n\nWe were absolutely blown away by the wonderful, joyful and creative service of your staff. \n\nOn Friday evening, we had dinner at Gilligan’s. We were wonderfully cared for by Marissa, Jason and John. The spectacular branzino that I had for my entree was created by Chef Dan Mackenzie who came to our table to discuss the dish that he had beautifully prepared. \n\nOn Saturday morning, we had brunch at the Grand Bar and Salon. We were waited on by Mamun Rashid who took great care of us. We could feel his concern for us. \n\nOn Saturday evening, we had dinner in the Club Room. What an exceptional experience! Cody, Ramon, Wahid, Christian, and Remington went out of their way to make us feel comfortable, taken care of, and very special. Daniel Menendez also made sure we were cared for. And, Chef Dan MacKenzie's  meal that he made special for us is something that we will always remember. Each of the four courses he designed was a true masterpiece that looks our breath away. Chef Dan and his staff made us feel as if we had won a grand prize, or were celebrities.\n\nIt also made us very glad to hear the respect and admiration that many of your staff have for Chef Dan MacKenzie\n\nWe look forward to returning to your hotel many times and for many years in the future.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Andrew, Omar, Remington and all of the employees at Soho Grand go above and beyond!","lang":"en","publishedDate":"2022-07-23","publishedPlatform":"MOBILE","rating":5,"text":"Andrew at the front desk started our stay with a HUGE smile and a HUGE welcome! He was so charming was so happy. That is very rare these days post covid. He acknowledged me by Mrs Sadler every time I came to the desk. Andrew also helped us with a problem and got it fixed for us in minutes. He went above and beyond for us!\nThe other SWEET man at the front desk with blonde hair was a pure joy every time I had to ask for another room key! ( senior moment in remembering his name)\nOmar in the lounge was the incredible! He was so personable and gave amazing service to us especially on my daughters birthday! We love Omar and can’t wait to come back and visit him!\nRemington was a delight too! He treated us like VIPs.\nIf ever you need a hotel in NYC, go straight to SoHo Grand! You won’t regret a second!\nThanks again to EVERYONE at the Soho Grand for making my daughter’s 21st birthday weekend the BEST EVER!!!","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"The Best hotel in NYC","lang":"en","publishedDate":"2022-07-20","publishedPlatform":"OTHER","rating":5,"text":"The soho grand is the must entertaining hotel in the city right now. Always something going on. The music is so much fun as well. The food is amazing and the service from the FB Director Murat Erbil is second to none. He makes everything so easy and the experience so much better.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing Experience","lang":"en","publishedDate":"2022-07-20","publishedPlatform":"OTHER","rating":5,"text":"Amazing time, new clean rooms. The service is great in the hotel. Always look out for Murat Erbil, he takes service to the next level always making the guest feel like he is at home. Really recommend the hotel enough and the food is spectacular","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Fantastic service, beautiful hotel.","lang":"en","publishedDate":"2022-07-14","publishedPlatform":"OTHER","rating":5,"text":"I love staying in Soho, especially during the week when it's a little quieter. This hotel has been a mainstay classic in Manhattan and continues to uphold high standards of beauty, service and luxury. Super reliable!! love it here.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Great hotel even better location!","lang":"en","publishedDate":"2022-07-09","publishedPlatform":"MOBILE","rating":5,"text":"Stayed here for one night and the hotel was great. Excellent customer service and the room was clean and the size was perfect for two people. They have new 65 inch TVs in the rooms and automatic blackout shades. Downstairs there are two great restaurants and a club. We could not hear any sound from the club during our stay.\n\nI would try getting drinks from Gilligan's as it is all outdoor seating and has a great ambiance with plants all around and a cool \"beachy\" vibe.\n\nRoom service was quick and the food was good but for a better food option go downstairs.\n\nA+ service and great location in Soho. If you have the chance to stay here do it.\n\n","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Bouncer acting like policeman…frustated people","lang":"en","publishedDate":"2022-07-02","publishedPlatform":"MOBILE","rating":1,"text":"Worst hotel ever guys, believe me. I won’t reserve a room in this hotel. Once we got the room…after 1.5 hrs after the check in time the first thing we saw was a huge bug on the bed. The first night we tried to go to the hotel bar and their bouncer acted like policeman…they are bouncer…maybe 18$\/hour but i understand how frustated they may be with their life. Anyway we paid for two drinks and they tried ti charge us four drinks each. When we asked for informations they said it was a mistake. We needed like 45 min of discussion to let them believe us even if we had proof. \nOnce again if you are planning to visit NY o enjoy a good cocktail avoid this place and their staff","travelDate":"2022-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Joe B","lang":"en","publishedDate":"2022-06-18","publishedPlatform":"MOBILE","rating":5,"text":"Mamu, Jack at the bar female lounge manager , Jose Bellman all were exemplary!  The know how to deliver genuine professional service. \nI always look forward to my visits to the Soho Grand Hotel. Meals at the diner are delicious. Avocado toast and Smoked Salmon are my favorite. \nSee you July 4th weekend.","travelDate":"2022-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Incredible People on your Staff.","lang":"en","publishedDate":"2022-06-17","publishedPlatform":"OTHER","rating":4,"text":"I was in New York for a work event and was incredibly impressed by some of the staff at the Soho Grand. Sekou was exceptional and made our entire team feel very welcomed from the moment we arrived to the day we left. \n\nWe had an event in the penthouse and were not sure what to expect. The event planner, I think her name was (Emily?) didn’t give us the warmest reception but we were blown away by the event captain Frank and our bartender who’s name escapes me. They made it a truly special night.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"25 years Second Home","lang":"en","publishedDate":"2022-06-14","publishedPlatform":"OTHER","rating":5,"text":"The staff is the best! I have been coming here for the last 25 years and it has become my second home when I am in NY. Now that the rooms have been updated, it's even more wonderful. It has this classic NY-cool design, great energy and with a Rock'n'roll feel. Thank you for always making me feel so at home and welcome.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"32nd Anniversary","lang":"en","publishedDate":"2022-06-13","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here  for our 32nd wedding anniversary, we felt so well cared for and celebrated by the staff! Housekeeping was over the top, the rooms are well appointed and large by New York standards. Also this location can not be beat! We will definitely be returning to the Soho Grand!","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Sleep well in Soho","lang":"en","publishedDate":"2022-06-13","publishedPlatform":"MOBILE","rating":5,"text":"The rooms have been updated which is very nice. The mattress is very comfortable and the TV quality and a good selection of channels. The lobby bar is a nice spot to relax with comfy seating. The staff are very helpful and friendly.","travelDate":"2022-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Shopping and broadway.","lang":"en","publishedDate":"2022-06-13","publishedPlatform":"MOBILE","rating":5,"text":"Every encounter, every experience was as expected.  Check-in to check-out was flawless.  Atmosphere was soothing and calm.  Music on weekend was lively for those interested but did not cause any disruption of sleep for those of us ready for a snooze.   Would recommend for couples, singles, or girls trips shopping.  Wedding on site during our stay but it did not “take over” the hotel like I have experienced in other resorts.  Rooms are NYC standard (small) but very adequately appointed. Closets, nespresso, and wonderful hot showers after time out on the town.  Close to many shopping favorites and great restaurants.  Will be back !","travelDate":"2022-06","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":93561,"title":"Excellent stay, beautiful property, amazing location with a couple of areas for improvement","lang":"en","publishedDate":"2022-06-11","publishedPlatform":"OTHER","rating":5,"text":"My first stay in this excellent hotel went very smoothly. The staff is outstanding and caters to the business traveler. Bed was comfortable, shades blocked the light, bath amenities were very high-end. Room was immaculate. Diner breakfast was pricey but very tasty. Service in the Diner was impeccable. Location near several major subway lines is a major plus. \nThree small issues: The biggest challenge was noise in the hallway. The room door blocks no noise at all. I was awoken at 5am on the first night of my stay by someone talking in a normal voice in the hallway. The person was not shouting. After that, I used noise-canceling headphones to sleep. That should not be necessary for a hotel in this price category. Sound insulation matters. \nFor $12.95, premium internet should be much stronger. 20MBps was promised; I got 15-16MBps. Service at this level should be included.\nCharging $5 for each coffee pod in the room feels like an overcharge. If you put a coffee maker in the room, at least a couple of coffee pods should be complimentary. The combination of upcharges for internet and coffee along with a $34.95 amenity fee (for what??!!) is pretty over the top, to be honest, for a hotel in this price category.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"It feels like a vacation","lang":"en","publishedDate":"2022-05-14","publishedPlatform":"MOBILE","rating":5,"text":"I have been staying at the SoHo Grand for the past couple of years.  From my first visit to my most recent it’s truly the team that simply makes this an absolute must stay hotel.  \nThey have the best recommendations - from restaurants to running routes, and everything in between.\nAlways perfect and never fussy- \n\nPs- there are always dogs- every visit 💚","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Very comfortable and Security guys are amazing","lang":"en","publishedDate":"2022-05-12","publishedPlatform":"OTHER","rating":4,"text":"I brought my two daughters into NYC to visit and we all stayed at the Soho Grand. the rooms were very comfortable, the location was great and they even got dad to \"party\" with them...oh brother. The Security guys were very nice, Jermaine and Mike were beyond attentive and my oldest daughter asked if Mike was single...lol Highly recommend","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Our Stay","lang":"en","publishedDate":"2022-05-07","publishedPlatform":"MOBILE","rating":5,"text":"My husband and I stayed at the Soho Grand this past week and our experience was exceptional. Our room attendant Muriel I could not recommend enough. She is absolutely a doll and the politest and most considerate I have ever encountered. We will be back and I WILL request Muriel while we stay.  Even if it’s  just to say a hello to her.  Thank you for a fabulous stay. \n\nThe Britt’s","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay","lang":"en","publishedDate":"2022-05-06","publishedPlatform":"OTHER","rating":5,"text":"I had a great mid-week stay at the Soho Grand and will absolutely stay here again. Overall it's a beautiful hotel, that is exceptionally appointed. The mini bar in the room is very well stocked, with snacks, drinks and even Tylenol and Advil. The bed is very comfortable, and the TV in the room is HUGE. I found the room to be quiet, and with blackout curtains sleeping in is easy. The room is also fairly large for NYC. Staff were friendly and helpful when needed. I had breakfast once at the bar, it was excellent (Omelette with bacon), I only wish I ate there more. It's also in a great location, with plenty of pubs and dining options nearby. \n\nOnly two inconveniences I can think of; the wifi in my room wasn't great, it seemed to keep booting me off - but the staff were quick to offer me a better connection. The hot water takes a few minutes to warm up in the shower.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great experience loved it!","lang":"en","publishedDate":"2022-05-01","publishedPlatform":"MOBILE","rating":5,"text":"Excellent hôtel with high level services. I really enjoyed the stay . The hotel is cozy and elegant at the same time, the staff hyper professional and at disposal. The premises so “new-yorkais “ I really enjoyed! I spent two nights in a room and 1 in another, travelling in between. The room are spacious and well equipped, a fridge  coffee machine, iron and iron board, nice Bigelow amenities in the bathroom. A cosy bar open late. The neighbor is perfect south of Soho limit to Tribeca, nice shopping area walking distance and good restaurants. I really enjoyed my stay and will be looking forward a next one.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great experience and room!","lang":"en","publishedDate":"2022-04-30","publishedPlatform":"OTHER","rating":5,"text":"Naomi, the front desk supervisor, listened to every single special request I made for my girlfriend’s 30th birthday and NAILED it. Awesome room with a great city view. The hotel’s location is top-notch. Fantastic restaurants, coffee shops and shopping right outside. Highly recommend this place!","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"5 stars!","lang":"en","publishedDate":"2022-04-06","publishedPlatform":"OTHER","rating":5,"text":"This hotel is so sexy! I loved having drinks and a night out right downstairs. \n\nThe room was beautiful and clean and the service was amazing, the guest experience manager was super helpful and made sure we had everything we needed during our stay!","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"FIVE STAR SERVICE! BRAVO SOHO GRAND!","lang":"en","publishedDate":"2022-03-30","publishedPlatform":"OTHER","rating":5,"text":"This is my favorite hotel to stay at when I visit New York.  Every time I stay here I feel welcome and cared for as a guest at the hotel. The service is impeccable.  Any time I needed information or requested something for my room, the response with swift and with a smile. \n\nWhile I was enjoying a cocktail and appetizer at the plush 2nd floor lounge, the manager who was working, named Murat, took exceptional care of me and my girlfriend.  The food being excellent was icing on the cake.  You can tell all the employees enjoy their job and take pride in their work.  Well done Murat! \n\nCan’t wait to visit the Grand again.  So glad to seeing it flourish, post-pandemic!\n\n-Michael","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Can’t wait to visit again","lang":"en","publishedDate":"2022-03-29","publishedPlatform":"OTHER","rating":5,"text":"My business partner and I recently stayed at Soho Grand on our last trip to New York and enjoyed every minute of our visits from start to finish. The hotel is beautiful and the rooms are absolutely delightful. We had a chance to dine at and lunch and were blown away every time by the level of attentive service and hospitality. Kudos to Murat Erbil and his team. They made us feel special during our entire stay and we can’t wait to return \nCherif","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Fantastic Hotel & staff in a convenient location","lang":"en","publishedDate":"2022-03-29","publishedPlatform":"OTHER","rating":5,"text":"This was my 3rd stay at the Soho Grand and I've had a wonderful experience each time.  The rooms are quiet and comfortable with a large TV and large bathroom (for NY).  The Hotel's location is close to many great restaurants and shops or if you don't want to leave the hotel there's a great bar\/lounge on the 2nd floor.  The entire staff have always been friendly, kind and helpful. I especially want to give a shout out to Murat, the bar & restaurant manager who was so welcoming and took great care of us during our entire stay. We were traveling for business and spent a lot of time working from the lounge, having a warm staff makes all the difference and the drinks aren't bad either! :)","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":93561,"title":"Roach motel experience at a premium price!","lang":"en","publishedDate":"2022-03-26","publishedPlatform":"MOBILE","rating":1,"text":"Steer clear unless you are lonely and want to go\nhome with a few creepy crawling critters.\n\nI'll keep this short since pictures are\nworth a thousand words. Checked in on March\n25th at the Soho Grand Hotel as it came highly\nrecommended. I went to bed with with one occupant in the room but woke up with 5+ additional occupants crawling around on the floor. The hotel gave me a $300 credit and moved me into another room, but I’ll certainly not be coming back!","travelDate":"2022-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Mejor ubicación imposible. Si te gusta la zona de soho este es EL hotel.","lang":"es","publishedDate":"2022-03-15","publishedPlatform":"MOBILE","rating":4,"text":"Buen servicio, buen diseño y cerca de los mejores restaurantes y tiendas. La única razón por la cual no tiene 5 estrellas es que los cuartos son bastante chicos (común en NY)  y las camas y almohadas no están tan cómodas. Pero por lo demás es un hotel limpio, con gym, buenas amenidades, cafetera nespresso y un buen desayuno. Algo de ruido del exterior pero nada grave. En general creo que es una excelente opción.","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":93561,"title":"It's a lovely hotel","lang":"en","publishedDate":"2022-03-08","publishedPlatform":"OTHER","rating":3,"text":"This is my 2nd stay at the Soho Grand, and it's a beautiful hotel, but I'm not sure I'll stay there again. The rooms are fabulous, clean, specious, shower is great although hot water takes a while. location is everything! \n\nThe one thing the was missing is that spoiled hotel feeling, the feeling that you are being taken care of, an extra touch: The reception is on the 2nd floor so no one to open the doors or help with the bags, the reception area is super packed and loud because of the bar nearby so had to shuffle my way in with 2 suitcases. When I called in the middle of the night because the room next to me was having a party it took 3 times to call since the front dest couldn't hear me over the loud music, and didn't feel super safe as a woman traveling alone to have no reception or security at the front door with a bar and club in the hotel and everyone can basically walk in. \n\nAll in all I like the hotel, decor, location but it needs that extra something","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Good place to stay when traveling with dogs","lang":"en","publishedDate":"2022-02-25","publishedPlatform":"MOBILE","rating":4,"text":"I have mixed feelings about my experience here. I got a “shades-of-yesteryear” vibe. The hotel is located at the edge of SoHo, off Canal, near Tribeca. It’s a bit gritty in this area. I used SpotHero and parked at the garage directly across the street for my two-night stay. I came in with my two dogs to visit my daughter at NYU. It’s  a 15-minute walk to Washington Square Park. It’s a quick walk to many great shops, cafes, and restaurants in SoHo, Nolita, Little Italy, and Tribeca. The very charming, hotel-owned dog park is about a 3 minute walk around the corner on Grand Street. It’s open 7-7, but, as any dog owner knows, most pups need a quick walk before bed, and there’s nowhere else close by for them to go to the bathroom. Not sure why the park can’t be accessed up until 10 or 11 pm. \n\nThe friendly hotel doormen were only there sporadically, and there are two sets of heavy doors. With two dogs on leashes and bags, door service would have been appreciated, or at least a button to automatically activate both sets of doors. On the ground floor there’s a concierge desk. You must go up one flight to the dark lobby. Check in was quick and friendly, however there was zero recognition of my dogs, and I was on a dog package. They were out of treats for the duration of my stay.  No offer of dog beds. They provided cat-size bowls for my large dogs. No offer of pet-friendly places in the area; luckily I know the area  well. \n\nI was in a king-bed room on the 6th floor. The room was a decent size, and the bathroom was large by NYC standards. (For two people with luggage, it’d be a tight squeeze).  There was a good amount of storage in the armoire. Two drawers built into the window unit area were a good size. The bed was comfortable; the huge SMART tv and high-quality stereo were nice touches. I appreciated the Nespresso machine and fridge. Solid construction meant no noise from surrounding rooms; however, ask for a room not facing West Broadway, as it was very noisy all night. The room was too hot. I put on the ac and cracked the window and it was still too warm. The hot water lasted for about 30 seconds. I called the front  desk and was told to let it run to get warm. Nothing like a freezing cold shower in February. The room was very clean. I appreciated the light dimming features. Be aware there’s no blackout shade. \n\nIt was dark everywhere in this hotel. I kept thinking I had on my sunglasses.  \n\nI wasn’t told upon check in that I had to use my room key to operate the elevator. I flagged down an employee who tried to help me “fix” the elevator. He didn’t realize I wasn’t told about the key access and he spent about 10 minutes trying to figure out what was wrong. The three elevators were always quick and readily available. \n\nTo me it seemed like people who don’t know NYC chose to stay here because they thought it would be hip. Maybe I’m too old to appreciate contemporary hip factor. \n\nI’d stay again if traveling with my dogs- the dog park was tres chic-  and for a discounted rate. If with my family, I’d stay in the many nicer-in-my-opinion properties nearby.","travelDate":"2022-02","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":93561,"title":"My new home where I used to call home!","lang":"en","publishedDate":"2022-02-09","publishedPlatform":"OTHER","rating":5,"text":"I met my bestie for a girls weekend and from start to finish our experience at The SoHo Grand was impeccable!!  Marcus Morales at the front desk started my trip off right. He was very informative and friendly and the complimentary champagne was such a nice touch. \n\nThey even have a private dog park for hotel guests and their furries. It’s just around the corner on Thompson street \n\nThe rooms are beautiful and spacious and we had an amazing view, just like last time. Jose Peña at the front door also went out of his way to help us. \n\nIt really felt like a home away from home and not a hotel. Definitely returning next time in town!!\n--","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Super Hospitality, great rooms, great location!","lang":"en","publishedDate":"2022-02-08","publishedPlatform":"OTHER","rating":5,"text":"Went for weekend with friends and the staff and amenities were amazing.  Guest services was amazing and teed up our stay before hand.  Marcus greeted us at check-in and was super friendly and helpful, housekeeping was amazing and the restaurant\/lounge was fun, hip and food and drink was tops.  Rooms were super lovely and comfy.   Great place to hang when we weren't out enjoying NYC!  Thank you Soho Grand for an amazing weekend","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":2,"locationId":93561,"title":"Not perfect, but close enough","lang":"en","publishedDate":"2022-01-31","publishedPlatform":"OTHER","rating":5,"text":"Soho Grand did enough right to be 5-stars, even though a few things weren't perfect.\n\nStarting with the good...\n1. Location - everywhere is close, subway line is good, walking is good\n2. Service - friendly, warm welcome, upgrade\n3. Room - as far as NY goes, spacious, nicely designed, amazing view from 14th floor\n4. Sleep - this is a quiet hotel, no room from surrounding rooms\n5. Hotel bar - great vibes\n\nWhat could be better?\n1. The Diner food is pretty decent but the concept doesn't really come off and was mostly empty. They also messed up our room service order.\n2. The shower drainage was slow, some maintenance around that is due\n3. Getting hot water to the shower could take 5 mins (granted we were high and the weather was cold)\n4. The sink drain plug mechanism was broken (had to adjust from under the bathroom sink)\n5. The noise from the air con was constant, even when turned off (although it did provide some white noise air cover for the street noise)\n6. Pillows too firm, kinked neck\n7. Charging for decent wifi is a bit old school (basic was free)\n8. No tea supplies in the room\n\nWill we return? Probably. Like most NY hotels, pricing will range 190-500 depending on season and capacity. This hotel is probably worth something in the middle.","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Stylish but not warm or welcoming","lang":"en","publishedDate":"2022-01-31","publishedPlatform":"MOBILE","rating":3,"text":"This place photographs well but leaves one feeling a bit cold.  The bar and nightclub were packed over the holidays, but rooms are surprisingly quiet and stylish with trendy masculine vibe, bed super comfy.  But the odd low lighting in the lobby and throughout the hallways,  plus the mostly unfriendly staff, give the hotel a cold, unwelcoming feeling. Bar was NYC cool, but don't expect to get into the nightclub on busy nights just because you're a hotel guest.","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Highly recommend.","lang":"en","publishedDate":"2022-01-28","publishedPlatform":"MOBILE","rating":5,"text":"What an amazing weekend at the soho grand, I went in on a a Friday after work when the weather in NYC was just brutal, I thank Alanzo Stewart for such a great recommendation. I was able to wind down at night with such a great view of the city over looking the Empire State Building, The staff and the service was absolutely amazing. I recommend this place to any one looking for a cool relaxed vibe with lot’s of options to venture out in the city.","travelDate":"2022-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"book it!","lang":"en","publishedDate":"2022-01-25","publishedPlatform":"OTHER","rating":5,"text":"This is now my go-to place to stay when visiting NYC. The location couldn't be more ideal, within a few walking minutes you can find anything you're looking for. Not to mention the staff is very accommodating and aesthetically, it's beautiful!","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Highly recommend.....","lang":"en","publishedDate":"2022-01-25","publishedPlatform":"OTHER","rating":5,"text":"Fantastic stay with great staff. Clean! What else could you ask for!\nThe Soho Grand was the perfect place to unwind and relax. we were greeted by an extremely attentive, professional and friendly staff.","travelDate":"2022-01","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"Grand by name, Grand by nature!","lang":"en","publishedDate":"2022-01-22","publishedPlatform":"MOBILE","rating":5,"text":"5th time in New York and the Soho Grand did not disappoint! \n\nWe visited for 7 nights over New Year and choosing to stay at the Soho Grand (on recommendation from a friend) absolutely made our trip. From the moment we walked into the hotel to the time we left, we were greeted and looked after by the most friendly and obliging staff who clearly love what they do. Service was spot on and the room was luxurious with all of the trimmings.\n\nA great location in close proximity to shopping and great dining options in Soho, Greenwich and West Village. The NYE masquerade ball was also a highlight and the hotel bars are a vibe.\n\nI really felt like a local (what a dream) living the Grand Life at the Soho Grand. I will be back!!!","travelDate":"2022-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Top 3 Hotel in NYC - No Question About It!","lang":"en","publishedDate":"2022-01-19","publishedPlatform":"OTHER","rating":5,"text":"My girlfriend, puppy and I stayed here for a few days last month and the entire experience was incredible:\n\n1) Top Notch Rooms and Service\n\n2)Incredibly fun vibe w several awesome entertainment areas in the hote to socialize including casual lounges (with music at night and fun vibes), elegant bars, a private club room on Thurs, Fri and Sat nights that’s become one of the best scenes \/ crowds in NYC and hosts great djs, and 3 restaurants (one outdoor area with a fun bar, one diner open 24\/7 and a great menu of lunch and dinner offerings in the lounge)\n\n3) Ideal location in the heart of Soho\n\n4) Very pet friendly and even offer guests access to a private dog park nearby that has a 2 year waitlist\n\n5) A+ Staff, especially food, beverage and entertainment managers\n\nI’ve stayed in dozens of NYC hotels over the years and always recommend Soho Grand to anyone considering visiting NYC. Can’t beat the combination of excellence and factors listed above","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Highly Recommend...","lang":"en","publishedDate":"2022-01-11","publishedPlatform":"OTHER","rating":5,"text":"Part of my family and some friends decided to celebrate New Year's Eve in NYC a couple of weeks ago.  We opted to stay at the Soho Grand Hotel,  where we have stayed previously.  In spite of Covid limitations imposed by the city, the Soho Grand really delivered and enabled us to enjoy a few days of fun and relaxation. \n\nThe rooms are very comfortable (it is NY, so space is a premium), bathrooms are great, and the bed\/bedding was perfect.  We liked having a minibar in the room, and housekeeping service was prompt and discreet. Literally the only \"issue\" we have with the rooms is that the closet space is tiny. Not a significant deal to us, but maybe an additional dresser in the room could solve that.\n\nThe location of the SG is great, with easy walking access to numerous restaurants, great shops, and NY sights. \n\nWe also love the lounge at the SG, and on this trip bought tickets to their NYE masquerade party.  Turned out ot be a terrific choice, and our whole party thoroughly enjoyed ringing in the new year in this setting.  A special thanks to Erbil Murat (Director of Food & Bev at the SG) for arranging all of that ! \n\nWe will definitely stay at the SG again, and would encourage others to give it a try.","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"NYE IN NYC","lang":"en","publishedDate":"2022-01-10","publishedPlatform":"OTHER","rating":5,"text":"This entire team was incredible throughout our entire stay! From the Food & Beverage team being so accommodating to our million questions about their NYE Ball which was BRILLIANT by the way! To the front of house staff everyone was incredible. Our servers in the lobby lounge were fabulous everyday and the concierge Naomi (apologies if that is misspelled) was over the top helpful, kind and truly made our stay fabulous. We adore the Soho Grand and can not wait to come back! Thank you for making our NYE week one for the books! PS book the suites, you will not be disappointed ;)","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"The best hotel experience ever!","lang":"en","publishedDate":"2022-01-08","publishedPlatform":"OTHER","rating":5,"text":"My boyfriend and I have been long time fans of The Soho Grand! We have had countless date nights, staycations and  even recently attended their masquerade New Year’s party, which was a blast! The rooms are chic, food is great, service is on point and they are super dog friendly which allows us to also enjoy the hotel with our puppy, they even have an attached private dog park! If you are looking for a place to stay, get a drink or have a birthday party, this is most definitely the place!","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"Great stay at the Soho Grand","lang":"en","publishedDate":"2022-01-08","publishedPlatform":"MOBILE","rating":5,"text":"Had a great time here in December during the holiday season! SG is an elegant hotel with beautiful rooms and excellent service. Front desk staff was friendly and very helpful. The bar and lounge area was a delight with delicious food and cocktails. The staff here really made the experience enjoyable. We can’t wait to come back for our next trip to New York! Shout out to Steve the night manager for all his help. He was great!","travelDate":"2021-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Great hotel in a great location. ","lang":"en","publishedDate":"2021-12-31","publishedPlatform":"MOBILE","rating":5,"text":"Amazing boutique hotel the trendy SOHO neighborhood.  Upon arrival at 8:30 am, I wanted to drop my luggage off so I can go sightseeing & check in late in the day but the receptionist Kevin was able to check me in early & upgraded my room at no cost! Kevin was informative about the Covid situation & other questions I had with regards to the subway & neighborhood.  \n\nThe Deluxe King Room was perfect for me as a solo traveler. I had a good view of the street below & the city backdrop.  The bathroom is chic, stylish & just my style. There were no noise issues whatsoever during my stay. \n\nThe hotel has a great bar & dining area which host music in the evenings. Perfect place for the young hip crowd along with families too.\n\nI will definitely return on my next trip to NYC. \n\nThank you, \n\nBrian","travelDate":"2021-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Outstanding  December stay.","lang":"en","publishedDate":"2021-12-20","publishedPlatform":"OTHER","rating":5,"text":"The hotel itself is in a great location of Soho, easy in and out. I haven't stayed in years, but the rooms must have had a recent refresh as they were much better than I remember. My room had plenty of space (for New York) which worked very efficiently, and was incredibly cared for. The bathroom and shower had generous space and was also well appointed. Dining was easy, whether off the lobby in the Grande Bar or at the Soho Diner. Excellent options at both. \n\nThe service and staff was very caring and prompt. It was an excellent stay.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Old World Elegance","lang":"en","publishedDate":"2021-12-19","publishedPlatform":"OTHER","rating":5,"text":"This hotel is a wonderful combination of old world elegance with updated features in the rooms.   We especially appreciated the specialized lighting in our room that could be bright or dimmed as needed, large walk-in  shower, Nespresso coffee maker with china cups and mini-bar.  We also found that every member of the Staff we encountered was helpful and personable. When asked they provided excellent recommendations on local restaurants and made us feel like we were \"special guests\"!","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Style over substance.","lang":"en","publishedDate":"2021-12-18","publishedPlatform":"MOBILE","rating":2,"text":"We stayed here 10 years ago. The hotel rooms are the same with the exception of the air conditioning is old and doesn’t cool the room. Toilet seat will not stay up but that could be just this room.\n\nUpon check in we were told we needed vouchers for the breakfast which was included in our rate. We were given vouchers for 1 day and told the remaining days would be sent up to the room (they never arrived).\n\nWe dined in the hotel restaurant the first evening and service was very poor. Very slow and uninterested. \n\nBreakfast was exactly the same service as the prior evening. Slow, uninterested and bordering rude. \n\nThe elevators are old and again slow. One was also out of service. \n\nOverall a poor stay. Mainly down to the lack of service and care to guests. It’s a shame as was once a nice property. Avoid, there are far better places worth your money.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Great Stay","lang":"en","publishedDate":"2021-12-11","publishedPlatform":"MOBILE","rating":5,"text":"Just had a great stay at the Soho Grand. The staff at the front desk Marcus & Naomi were so welcoming and super helpful as well as all the staff at the SG. Great location for strolling through Soho excellent bar and small but well appointed rooms.","travelDate":"2021-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing Experience","lang":"en","publishedDate":"2021-12-05","publishedPlatform":"OTHER","rating":5,"text":"Soho Grand - what a fantastic venue. The management and staff made sure we had everything we needed and the food and beverage service in particular was great. I've been staying there for 5+ years - whether for personal or business, it always is fantastic. Murat in particular is the best I know and I will always come back and refer folks there. Highly recommend!","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Warm, genuine care, service and class","lang":"en","publishedDate":"2021-12-03","publishedPlatform":"OTHER","rating":5,"text":"An oasis. A calm and beautiful place to step away, breathe, savor a cup of tea, meet an old friend or think through one of life’s many challenges. I am restored when I stay here. \n\nThese moments would not be possible without a caring and kind team. From the valet to the bartender, housekeeper, concierge and more, each interaction is warm, skilled and genuine - leaving the realization that this a team whole heartedly commits to doing an incredible job every single day. In any industry, this level of care and capability is rare. \n\nMany thanks to Jose, Martin, Mamoun, and to the incredible General Manager, Murat. While you sometimes may not know it, please know that your effort is noticed.  You make this hotel consistently special, beautiful and restorative even in the face of incredible change. \n\nThank you for making my moments in your space so very special. \n\nXx,\n\nEHope \nP.s. See you again soon <3","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Love Love LOVE SOHO GRAND.","lang":"en","publishedDate":"2021-12-02","publishedPlatform":"OTHER","rating":5,"text":"I starting staying at soho grand years ago because they’re extremely pet friendly and I felt so comfortable bringing my Frenchie. But I quickly found out that the excellent Bar & lounge service made it a two for one for me. As soon as you walk in it’s a vibe. The staff makes you feel at home immediately. The food is delicious and the Grand Margarita is hands down the best margarita in NYC. You will be LIT! I’d recommend SoHo Grand to anyone for boarding and just for a fun night out in the city!  Catch me at the bar 😜\n\nP.S.  the DJ keeps the party going!!","travelDate":"2021-12","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"Love this place","lang":"en","publishedDate":"2021-12-02","publishedPlatform":"OTHER","rating":5,"text":"Stay here every chance I get ! Even though my work is midtown east I still stay in soho and commute. Everything feels new and not old. Kind of a soho house vibe in the room  subway tile in the bathroom . Highly recommend","travelDate":"2021-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":93561,"title":"Great Atmosphere, Even Better Food & Beverage Staff","lang":"en","publishedDate":"2021-12-01","publishedPlatform":"OTHER","rating":5,"text":"As a new resident to New York, I have had difficulty finding a spot where I enjoy the atmosphere, as well as feel most comfortable and well treated. However, this wasn’t until I was welcomed at the Soho Grand and treated so well by Murat. Today, I have become a regular at the hotel and can always depend on Murat, William as well as the rest of the food and beverage staff to treat me with such exceptional service. I highly recommend that locals as well as travellers visit the Soho Grand for their standout food and beverage services.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Comfortable & Chic","lang":"en","publishedDate":"2021-12-01","publishedPlatform":"OTHER","rating":5,"text":"Soho Grand is one of the most hospitable and welcoming hotels in all of New York. As a native New Yorker, SGH has been a staple of mine for years, and is my hotel of choice for any friends visiting or staycations that I have. While the hotel rooms are sizable and clean, the real gem of this hotel is the Grand Bar & Lounge. The staff are always welcoming and accommodating, the food + drinks are fantastic without fail, and the atmosphere on any given night is one of the chicest in the city. Management here clearly knows how to deliver elevated experiences to their guests. I haven’t had a single regret with spending my money at Soho Grand over the years, and look forward to continued patronage.","travelDate":"2021-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"Festive Fabulous Fun Boutique Hotel","lang":"en","publishedDate":"2021-12-01","publishedPlatform":"OTHER","rating":5,"text":"Staying at Soho Grand Hotel is truly one of the best experiences in New York. Soho Grand Hotel provides a wonderful atmosphere with its hip and industrial chic design. With a zen & inspirational energy for all types of travelers. Extremely warm & inviting.\nImpeccable service from all staff member made my stay delightful and welcoming. My room was sparkling clean and the bed was super comfortable and room was very quiet. Many amenities prevail on sight: a delicious diner, and nightly vinyl music and a gorgeous garden like dog park.\nConveniently located proximity to shopping, museums and restaurants.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Good People","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"MOBILE","rating":5,"text":"I have been going to the SoHo Grand for over a decade; mainly because of the beautiful people that work there. The life of any business is found in the humans that run it. Murat, in F&B, and, Jose and Martin, who greet folks at the front door, always make my stay a real hip experience. I thank you brothers for the care that you bring to your work.\nRespect!","travelDate":"2021-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Stylish and homey in the heart of SoHo","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"OTHER","rating":5,"text":"The hotel is in an unbeatable location, surrounded by culture, food, shopping, and nightlife. The staff is all very friendly and helpful without the stuffy attitude you would find in some other luxury properties. The F&B options are all top notch. Even as busy as they usually are, the service and quality is never compromised. The club room is a fun addition with late night music programming on site (The Thursday Before\/After parties we went to were a great vibe). I stayed for a week with my wife and what we loved the most was the ambiance and decor. All refined and stylish, but still felt like a home away from home. 10\/10 would recommend.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Best hotel in NYC","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"OTHER","rating":5,"text":"I have been coming to soho grand for years - recently for thanksgiving and will be returning for Christmas . It is the only hotel I recommend to anyone coming into NYC from out of town. My sister actually once stayed for a month during a home renovation. Staff is so professional, love the atmosphere and have always had an amazing experience!","travelDate":"2021-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Best Service in NYC","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"OTHER","rating":5,"text":"Best service in NYC. Especially the F&B team, even with masks on you feel everyone is serving you with a smile. Food is great and again can't speak enough about the service. Can't speak highly enough about how good the experience was.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing location, friendly staff","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"OTHER","rating":5,"text":"It was a great pleasure to have stayed in this hotel for three days. I have really enjoyed the laid back. This hotel and  staff are everything I had wished for. Everyone and everything was absolutely perfect and exceptional. I had a great time and never had a bad meal.Very special thanks to F&B manager who made my b-day unforgettable .No to mention, all of the staff were so accommodating.","travelDate":"2021-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Whether for business or pleasure, Soho Grand Hotel is not to be missed.","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"OTHER","rating":5,"text":"As a seasoned traveler and frequent visitor of New York City, the Soho Grand Hotel is without question my destination of choice. The vibe and decor capture the \"high-end\" feel of the Soho District, and the staff understands the art of customer service.\n\nFor those interested in the social experience, look no further. The hotel lounge, restaurant, bar, and club-room are outstanding. In the past, I have made special trips for their events (Halloween ball was the most recent), and I am hosting my staff holiday party there next month. \n\nNext on my list of Soho Grand to-do's is their iconic New Year's Eve ball. \n\nIn a nutshell, I highly recommend the Soho Grand!!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Worst Hotel Service NOT a 4 star hotel (3 stars at best)","lang":"en","publishedDate":"2021-11-29","publishedPlatform":"OTHER","rating":1,"text":"The doorman directed us to the ramp and said if our room wasn't ready, to bring the luggage back down. He was standing next to a baggage carrier. The reception desk is on the 1st floor, he expected us to go up to  1st floor and then back down again with our luggage. Most of the issue with this hotel is the lobby associated with the hotel. The hotel doesn't have a lobby. The couches next to the reception area are part of a bar\/restaurant with the worst service ever. The hostess', waitstaff, bartender were rude, takes a long time to get a drink, they spilled part of the drink and didn't apologize or clean up. They spend most of the time talking in their own language ignoring the guest. They refused to make a drink with 3 ingredient drink even though they had all the ingredients (coffee, whiskey, cream).  The manager had to force the bartender to make the drink. Never have i experienced anything like this. The hotel does not take responsibility for the actions of lobby restaurant.  Which would be fine except there is NO other area to comfortable sit and have any kind of service from the hotel. There are 2 chairs by receptions and 2 chairs at the ground floor entrance. The hotel lobby bar\/restaurant appears to be foreign owned and operated and they have no idea about service and regulations in the USA. I request the hotel manager call me regarding the issues with the lobby staff, I never received a call from the manager. There were similar complaints about the bar\/lobby staff 4 months ago. They have done nothing to improve the service.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Super friendly and helpful staff at well-located, unique hotel in heart of SoHo.","lang":"en","publishedDate":"2021-11-28","publishedPlatform":"MOBILE","rating":5,"text":"Great hotel in SoHo. Great value for the money. Incredibly courteous staff makes or breaks a hotel experience. Staff here is excellent.  Rooms and hotel in general are spotless clean.  One of the best locations, easy to get to\/from Newark airport in <30 mins.","travelDate":"2021-11","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":93561,"title":"A éviter vraiment","lang":"fr","publishedDate":"2021-11-21","publishedPlatform":"MOBILE","rating":1,"text":"A éviter vraiment  - chambres extrêmement bruyantes mal isolées sur la rue - on entend les discussions des voisins \nService peu aimable ils font leur job mal et sans attention ni chaleur, au bar comme à la réception \nPas possible de boire un café avant 8h même en room service !!! Pas de bar - ils  vous répondent  d’aller acheter votre café dans la rue !!  \nImpossible de dîner ou prendre un verre si vous n’avez pas réservé - leur bar est plein et ils ne savent pas prioriser les clients de l’hôtel","travelDate":"2021-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing wedding in ICONIC NYC","lang":"en","publishedDate":"2021-11-11","publishedPlatform":"OTHER","rating":5,"text":"My husband and I got married in a very small ceremony on the terrace of our beautiful room at the SoHo Grand Hotel -- after our ceremony and day with our family, we celebrated the night away with all of our friends at The Grand Lounge and had an amazing and once in a lifetime experience. The food and beverage team were outstanding in helping us pick out foods and even create a special evening cocktail -- our service was impeccable and there was no shortage of cocktail servers and bussers making sure our mini event was perfect! Thanks go out to the SoHo Grand F&B team and the hotel group for helping make our wedding the most memorable!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Loved the Soho Grand!!!!!!!!","lang":"en","publishedDate":"2021-10-23","publishedPlatform":"MOBILE","rating":5,"text":"Came to NYC to celebrate a friends birthday. She picked the SoHo Grand and I’m so glad she did. The hotel itself has a great vibe. It’s Luxe without being pretentious. The bar and restaurant are great. Seems like a mix of business meetings during the day and a fun crowd of all ages at night. The rooms were clean,  comfortable and nicely decorated . The location is fanatic, as there are so many great restaurants in the area. Finally the service was impeccable. Everyone was warm, welcoming, and efficient. HUGE shout out to Marcus. He checked us in and was wonderful. Marcus made a great first impression and we immediately knew we were in good hands. He gave us fantastic recommendations of places to check out in the local area and was so warm and welcoming. I highly recommend this hotel.","travelDate":"2021-10","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":93561,"title":"Great hotel but a little loud at times","lang":"en","publishedDate":"2021-10-19","publishedPlatform":"OTHER","rating":5,"text":"Overall, this hotel is great. I stay here every time I come in for work but this time was a social visit. I love this hotel, its in a great location, the staff is friendly and the rooms are clean and a good size. \n\nThis time it was a little louder than normal, at night while sleeping traffic was louder than I remember. Also, there is not a lounge\/club on the lobby level so it greats crowded at night. \n\nNot a huge deal though. I would stay here again.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Great Weekend Visit","lang":"en","publishedDate":"2021-10-19","publishedPlatform":"MOBILE","rating":5,"text":"I had the pleasure of staying for a weekend.  Just found hotel on booking . Com. Masun was outstanding every morning we had great conversation and he was professional knowledgeable and friendly.  Also encountered Nyrita who was elegant and warm and a pleasure to speak with. William at the bar was a machine. Great to what him work. \nSincerely, Joseph Buonincontri","travelDate":"2021-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"Amazing in every way!","lang":"en","publishedDate":"2021-10-14","publishedPlatform":"OTHER","rating":5,"text":"We recently had our wedding weekend at the Soho Grand and everything about the experience was perfect from start to finish. Stephanie in sales patiently helped us with the rooms and Murat Erbil helped up set up our causal outdoor dinner for our 40 friends and family at Gilligan's. They were so unbelievably nice to us all and even generously sent us a bottle to celebrate our marriage (we live-streamed the ceremony from our suite and the wifi was perfect for this).\n\nThe rooms were very spacious, clean and quiet, the beds beyond comfy and the bathrooms had everything we needed and more. I wish we had time to use the enormous soaking tub.\n   \nAt Gilligan's, the food, service and ambiance were lovely and all our friends and family were going on about everything. The spicy mezcal drinks were everyone's favorite beverage.\n\nThis is our second time staying at this hotel and it won't be the last. And as we can now recognize it as the place we got married, it will always have a special meaning for us. Thanks to everyone who made it happen!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Fantastic Stay!","lang":"en","publishedDate":"2021-10-08","publishedPlatform":"OTHER","rating":5,"text":"We had a fantastic stay! The location couldn't have been more ideal, and the service was top-notch. ( Shout out to Clarissa, Hellen, Mallory, and Alexis, your smiles are contagious! Thank you for helping to make our anniversary trip so memorable! \n\nAlso, I've never seen such a stocked minibar before. They thought of everything! We're very much looking forward to coming back. :)","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Fraud","lang":"en","publishedDate":"2021-10-05","publishedPlatform":"MOBILE","rating":1,"text":"The hotel after having being paid in full from Expedia refused to check in me in at 1 am because they defaulted on their credit card merchant service. Even after confirming my stay was paid in full I was turned away from the hotel night manager. The merchant service system was in default. Do not book here it's a scam and they are stealing money.","travelDate":"2021-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":93561,"title":"A New York Rarity","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"MOBILE","rating":5,"text":"Comfortable, quiet, spacious, wonderfully located, and a good value — a combination that is basically unheard of in New York City! We booked a basic room and were stunned to find a serene, amenity-packed space with a great view of Lower Manhattan. Room service was genuinely delicious. The private dog park was one of the most delightful and unusual features I’ve ever encountered in a hotel. Excellent hotel from beginning to end. We’ll be back!","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":3,"locationId":93561,"title":"NOT a 4.5 star hotel.","lang":"en","publishedDate":"2021-08-25","publishedPlatform":"OTHER","rating":3,"text":"I was expecting so much more.  Just another typical hotel stay in the city; might as well save half by staying somewhere that does not pretend to be better.   The location was great and the room was nice, but from the start I was a little dismayed at the service \/ amenities.  We arrived in the rain and there was no valet parking.  After asking a guy in uniform on the sidewalk, we were told we had to self park in the garage across the street, which required backing up.  $82 self park that you have to walk you luggage back up the entry\/exit ramp and across the street in the rain.  Ok for 2 or 3 star hotel, but not here.  Of course when leaving early in the morning, it was dumping again and there was noody up front.  We crossed the street in the downpour.  Check in was fine.  Hotel is dark in halls and elevator areas (not sure if good or bad).  The room was very nice; it had just about everything you'd expect.  Typical size for the city.  \nOur comically bad service at the bar: We met friends (also guests at the hotel) at the mostly empty hotel bar for a drink and after talking and waiting 10+ minutes at a table next to bar, decided to ask the tender directly what draft beer there was, so we could get a drink, like most people like to do in a bar.  All the taps are not working.  According to the bartender, they had one pale ale and one pilsner in bottles.  I asked him for 2 pilsners and one pale ale.  He heard me, as did the two other guys in uniform nearby standing around doing nothing.  He directed me to them and told me they'd take my order at the table.  Dude then came over and asked what we would like as if he had never seen us before.  I even had to repeat the order with my buddy clarifying that it was 2 pilsners and not 2 pale ales. Then, and this is the funniest part, he calls out to the bartender \"two pilsners and one pale ale\".  I thought I was in a sketch comedy.  The pilsners were $14 each and the pale ale was $10.  A 3 star hotel at best.  Not worth the extra $ to stay here.   Not even close.","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Best location in Soho, kindest staff!!!!","lang":"en","publishedDate":"2021-08-23","publishedPlatform":"MOBILE","rating":5,"text":"I stayed at this hotel for one week in July and it was amazing!! You will find yourself right in soho - walking distance to all the best spots downtown. The hotel itself is beautiful and clean - with so many things to do from their grand bar on the second floor, to gilligans bar outside and soho diner! I didn’t want to leave when my week ended and will be there again next month!","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":93561,"title":"Great hotel, great location","lang":"en","publishedDate":"2021-08-07","publishedPlatform":"OTHER","rating":5,"text":"I just spent four nights there with my husband and two teenage daughters.  We had a double king suite. It was perfect.  Usually NYC hotel rooms appear larger online than they do in person - this was just the opposite. Nicely appointed rooms, great view, clean, spacious.  The location of the hotel is perfect for walking to so many spots - we easily walked to Tribeca, the West Village, the Highline, WTC, and other areas from here.  One of the staff that I do want to highlight is Marcus at the front desk.  He was incredibly helpful, professional and friendly.  To the management - he's a gem and someone you should help advance through your organization. He knows what hospitality means!","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":2,"locationId":93561,"title":"Fantastic terrace room","lang":"en","publishedDate":"2021-07-27","publishedPlatform":"OTHER","rating":5,"text":"Decided to splurge a bit for our post-pandemic trip to NYC and book a terrace room for the weekend and that was the most excellent decision ever. Have stayed at this property many times over the years for work and for fun, I have never been disappointed. The terrace room we were in had a very large very beautiful terrace facing West and we happened to have two days of perfect weather. The bedroom portion is large with a large washroom. And the living room area includes a super comfy couch and chair, as well as small round table and two chairs, so you can enjoy room service. The outdoor patio had comfortable seating, beautiful lighting and greenery, a canopy which made it all-day friendly and lots of space. Service at the hotel was lovely - as always. Great stay!","travelDate":"2021-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Fantastic, relaxing stay","lang":"en","publishedDate":"2021-07-21","publishedPlatform":"OTHER","rating":5,"text":"What a great experience overall. We will definitely return to the Soho Grand on our next visits. The hotel is very clean, very comfortable and a quiet oasis to come back to on a hot summer night. Great location right off the Canal St. ACE station. Comfortable lounge, easy check in and nice gym & restaurant if needed. Try to request a higher floor if staying over the weekend. If you are considering similar hotels like The Standard or The Roxy, the Soho Grand should be the choice! Big shoutout to Sekou and the front desk staff for being so welcoming.","travelDate":"2021-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Hype & Cosmopolitanism in the Big Apple!","lang":"en","publishedDate":"2021-07-16","publishedPlatform":"OTHER","rating":5,"text":"We really enjoyed the hotel, its location, the service and the welcoming!\nThe hotel vibes during the weekend is one of a kind, the lounge and bar are hype place to hang-out, have diner, or gather with friends for drinks, and good music and DJ sets.\nThe different dine-in options at the property makes it very versatile and cosmopolitan.\nWe would highly recommend this property for a business or leisure stay in the City!","travelDate":"2021-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":93561,"title":"Incredible Hotel, Staff is World-Class!","lang":"en","publishedDate":"2021-07-14","publishedPlatform":"OTHER","rating":5,"text":"Home away from home in Soho! I've stayed here many times over the years, but my most recent stay after COVID restrictions were lifted in NYC was especially great. The rooms have been nicely renovated, tastefully designed with comfortable bedding and great bathrooms. The staff is polite, professional and personable -- shoutout to Sekou and Marcus -- they're absolute rockstars! If you're looking for a real New York experience nestled perfectly away from the more touristy, commercialized zones of the city I highly recommend the Soho Grand.","travelDate":"2021-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":93561,"title":"Well-run hotel","lang":"en","publishedDate":"2021-07-13","publishedPlatform":"MOBILE","rating":5,"text":"This was our 2nd visit, and we decided we liked it better than pricier Soho60. Something was (not noticeably) wrong with our room upon arrival. It was fixed immediately along with a personal note from gm’s office, a woman named Mallory Matoush. We were impressed. We also enjoyed dinner in the cozy lounge. I really like this place.","travelDate":"2021-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":93561,"title":"My NYC home since I moved out of NY","lang":"en","publishedDate":"2021-07-13","publishedPlatform":"OTHER","rating":5,"text":"The Soho Grand is simply the best hotel in NYC if you are looking for an authentic NYC experience. You will feel like you are living your best NYC life. The hotel feels like a luxury apartment and the staff makes you feel right at home. And they throw a party for you every weekend with great DJs and vibes. \n\nI lived in NYC for 8 years and the only place I stay now when I visit is the Soho Grand.","travelDate":"2021-07","tripType":"NONE"}
{"helpfulVotes":1,"locationId":93561,"title":"Modern but…","lang":"en","publishedDate":"2021-07-02","publishedPlatform":"MOBILE","rating":4,"text":"The location of the hotel is exactly where we wanted to be. The hotel decor was modern and looks recently renovated.\n\nThe staff were all very friendly and courteous.\n\nOurs was a room with king bed. There was a small desk, closet and mini bar. There was a shower, no tub. The room was not large, but it’s not like we’ll spend much time in the room.\n\nSo what I had not realized I’d that there was the club (?) on the lobby floor. When we arrived late Friday night, we thought we walked into a club, not a hotel when we entered. And on floor 5, we could still hear the music, which ended around 1 am.\n\nProbably my bad for not fully researching the hotel. So I do not recommend for family, and couples looking for a quiet rest. Maybe if you stay at a higher floor? \n\nHence a star off.","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":93561,"title":"The staff made all the difference!","lang":"en","publishedDate":"2021-07-01","publishedPlatform":"OTHER","rating":5,"text":"I made two trips to the Soho Grand during the past three months and was so thrilled with the staff: from check-in to housekeeping, each individual with whom I interacted was gracious, accommodating, and genuinely interested in providing me with the home away from home experience! At check-in, I received a room upgrade, and when I asked for extra towels, pillows, and water, someone came up to my room and delivered it all immediately and with a smile. My room was kept spotless, and items, such as extra towels and toiletries were replenished without me having to ask. My bed was comfy and I was able to open my windows for fresh air, which is important for me in a hotel room!","travelDate":"2021-06","tripType":"NONE"}
