{"helpfulVotes":0,"locationId":23300953,"title":"Heerlijk ontspannen verblijf","lang":"nl","publishedDate":"2024-05-03","publishedPlatform":"MOBILE","rating":4,"text":"Een heerlijk verblijf gehad van 7 dagen. Dit kamerhotel heeft een keuken op je kamer, zodat je eventueel kan koken en je eigen eten kan klaarmaken. Voor gluten gevoelige mensen als ik ideaal. Mijn eigen ontbijt mee en ook het avondeten maakte ik een paar keer. Het fornuis heeft 2 gaspitten. Dus het is een beetje behelpen. Slim koken dus. Er is ook een oven en vaatwasser aanwezig. Beiden niet gebruikt. Dus geen ervaring mee. De kamer heeft een zithoek. Ik raad dit hotel (deze keten: Sonder) zeker aan. Er zijn meerdere plekken in de stad om uit te kiezen. Een kamer voor 2 personen is het meest ideaal. Het bed is in de breedte fijn, voor lange mensen had het bed 2,20 meter mogen zijn. Maar goed, niet alles is zoals het thuis is. Waardering: 8 uit 10.","travelDate":"2024-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Awesome experience","lang":"en","publishedDate":"2023-01-26","publishedPlatform":"MOBILE","rating":5,"text":"Room filled with light, all supplies available in the room, extremely nice and attentive staff, perfect location! We would happily come back to Sonder hotels, a good alternative for Airbnb with the advantages of a hotel","travelDate":"2023-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"NEVER AGAIN!!!!!","lang":"en","publishedDate":"2024-04-28","publishedPlatform":"OTHER","rating":1,"text":"\"Where do I even begin with my experience at Sonder City Hall Park? It feels like a nightmare that started from the moment we arrived. Firstly, the front desk staff—Matt, Jashawn, Benton, and Amaya—were utterly terrible. Their lack of professionalism and rudeness set the tone for the entire stay.\n\nBut the real kicker was arriving to a dirty room and then having the NYPD called on us. Can you imagine? FOUR officers showing up, demanding we leave at 9:30 pm on a Sunday, mere moments after checking in! It's beyond belief.\n\nAmaya initially welcomed us, and we even used the luggage storage service before heading out for dinner. However, upon our return, Matt and Brenton dropped the bombshell that we were supposedly banned from Sonder City Hall Park. No reasons provided, no proof given. When we questioned this absurdity, Matt had the audacity to threaten us with police intervention, as if we were criminals.\n\nIt wasn't until we escalated the issue to higher-ups, including CGS, that we finally got some clarity. Turns out, we had paid for our stay, and there was no record of any ban against us. The disrespect, harassment, and aggressive threats we faced during our first night were completely uncalled for.\n\nRest assured, I will be taking further action to address this appalling treatment. Nobody should have to endure such mistreatment, especially from a hospitality establishment. Sonder City Hall Park needs to be held accountable for their actions. I can honestly say we'd never return or reccomend Sonder City Hall Park to ANYONE!!!  I'll spare Sonder from further embarrassment and refrain from sharing pictures and videos of the dirty unit and interactions with staff.","travelDate":"2024-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Horrible experiences—would not recommend","lang":"en","publishedDate":"2024-04-17","publishedPlatform":"OTHER","rating":1,"text":"If I could leave a lower rating, I would. I’ve stayed here twice and both times it was impossible to check in. They have tried to automate the check in process but cannot manage the system. On this last trip, I sat in front of the hotel door while they tried troubleshooting for over 30 minutes. Worst hotel experience in the city.","travelDate":"2024-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Superbe Appart'Hotel dans Financial District Manhattan ","lang":"fr","publishedDate":"2024-04-16","publishedPlatform":"MOBILE","rating":5,"text":"Appart'hotel très pratique au cœur de Financial District à Manhattan. \nChambres vraiment bien équipées et spacieuses (2 chambres louées : 1 pour nos 2 ados et 1 pour nous avec coin salon). Très pratique pour dîner ensemble le soir ou prendre le petit déjeuner.\nStation Fulton Street à 50 m avec 8 lignes de métro (accès aisé à tour Manhattan, à Brooklyn, JFK)\nAccueil simple (tout se fait via l'application) mais personnel disponible à l'accueil jour et nuit.\nBref je conseille !","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great location and good facilities","lang":"en","publishedDate":"2024-04-09","publishedPlatform":"MOBILE","rating":4,"text":"We visited this hotel in the first two weeks of April very spacious two beds one being a fold out sofa bed the other being a normal large king size bed.\n\nLots of cooking facilities with a microwave oven, not a roasting oven a percolating machine not a pod machine , washing facilities on site and very close to Wall Street and the World Trade Centre if you are visiting.\n\nVery quiet upstairs, although you will hear traffic noise that’s inevitable in New York the windows do open a crack so you can let fresh air in ( recommended ). \n\nThe building is very close to Fulton Street subway station so you will get your share of homeless people on the street and the ever present reel of marijuana . Very close to a Wholefoods and other facilities for picking up groceries as well as Dwayne Read pharmacies..\n\nPlay some professional and there is an endless supply of coffee bags, dishwasher tablets etc to assist from the seventh floor . Sandra does have a nap that you can use to control access from the street as well as your hotel room which we recommend. Our particular had a peloton bike which we didn’t use as you needed an account.\n\nThere’s a shower only, but the water pressure was adequate and the bathroom didn’t smell.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Hard to Believe","lang":"en","publishedDate":"2024-04-05","publishedPlatform":"OTHER","rating":5,"text":"I was in NY for business, this spot was great for easy transit access.  It was an excellent stay across the board. Location, room size, service and quality, really everything were all great.  I’ll definitely stay here again when I’m back in town.","travelDate":"2024-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Mieux qu’à la maison et superficie super appréciable","lang":"fr","publishedDate":"2024-03-18","publishedPlatform":"MOBILE","rating":5,"text":"Très belle chambre avec cuisine super équipée ! Le coin repas est confortable et pratique ,. Le tout est propre et la superficie de la chambre est très appréciable ! C’est rare une telle place pour New York. !\nNous avions la chambre avec City View et c’était vraiment un plaisir .. limite nous n’avions pas envie de fermer les stores. \nNous nous y sommes super bien senties","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Pleasant stay in an excellent location","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"MOBILE","rating":5,"text":"Situated within a stone's throw of nine subway lines and within walking distance of Battery Park, Oculus, and Ground Zero.\n\nFriendly front desk staff available day and night.\n\nAccess your front door and room door with ease using the Sonder app and its unique mobile key feature.\n\nEnjoy complimentary laundry facilities; just inquire at the front desk for detergent pods.\n\nWhile the room and amenities align with the listing, note that room layouts may vary.\n\nAlthough the blackout curtains may not completely block out light, they provide sufficient coverage.\n\nThe bathroom is somewhat small and lacking any countertops for convenience. The condition of the bathroom furniture is only fair.\n\nThe communal area on the 7th floor, offering lockers, bathrooms, and laundry facilities, is incredibly convenient for guests.\n\nOverall, experience a pleasant and comfortable stay in an exceptionally convenient location.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Customer service is horrible needs improvement","lang":"en","publishedDate":"2023-12-15","publishedPlatform":"OTHER","rating":2,"text":"This review is mostly about customer service which this place lacks very rude staff never at the front desk Brandi and Angela always on their phones or away from the desks .\n\nThe hospitality manager Jashawn is rude and cocky and is never around as well we have issues from just getting towels to having issues getting into our room the list goes on  we had once came down and we heard in the back room him saying that he can’t deal with this as we was looking for someone to help\nUs in the main lobby and asked security we have witnessed other guests also having issues and asking to be moved to another room  as we waited for a cab \n\nThe area is a bit shady at night lots of homeless ppl overall the building is kept well many places to grab a bite to eat we booked for over a month and stayed with no maintance staff after hours on there end as well  \n\nUsually hotels have maintance staff not this place","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great location and space","lang":"en","publishedDate":"2023-12-09","publishedPlatform":"OTHER","rating":4,"text":"Great location and space. Rooms are spacious and super clean! We’ve stayed here 2 years in a row for the holidays. The only complaint with this room in particular (906) was the shower - it was a walk in shower and water was not contained to shower, and not able to shower easily without getting water everywhere in bathroom. It would also be nice if guests received 1 complimentary cleaning (vs having to pay additonal). Overall we love the place and will be back. ","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Wonderful stay at Sonder City Hall","lang":"en","publishedDate":"2023-11-30","publishedPlatform":"MOBILE","rating":5,"text":"Lovely clean light filled large corner room, great location right next to the subway, friendly staff. We stayed 9 days and were very sorry to leave as it had everything we needed and more. The laundry facilities were a plus for an extended stay. The rooftop garden was lovely even in the cold weather. We recommend this place highly.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Perfection!","lang":"en","publishedDate":"2023-10-08","publishedPlatform":"MOBILE","rating":5,"text":"This hotel was fantastic!  I always get sticker shock when I see prices on hotels in NYC.  This was such a great deal compared to anywhere else we have stayed.  Conveniently located, quiet, incredibly spacious by NY standards and very thoughtful in small touches such as a handwritten note to welcome us, an iron that didn’t ruin our clothes when we used it, a shower door that didn’t leak.  They truly thought of everything in my opinion.  Small kitchen area with large mini fridge, microwave and dishwasher were great.  So nice that they had a laundry room available to us.  Would absolutely not hesitate to stay here again.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great place to stay when traveling on business","lang":"en","publishedDate":"2023-09-24","publishedPlatform":"OTHER","rating":5,"text":"I was in NYC for two weeks for work.  Sonder City Hall Park was the perfect place to stay - it was literally next door to the Fulton Station.  We had a fantastic space located on the corner with huge windows.  The kitchen was the perfect size and bathroom was large.  It was nice having this larger space for two weeks.  The laundry facilities were an added bonus and the rooftop patio was a nice place to take a break.  We would definitely recommend and will stay here again.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Tutto perfetto","lang":"it","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"Nella maggior parte dei casi, la formula Sonder prevede di affittare una stanza o un appartamento in una sorta di residence\/palazzo privo di reception e di contatto diretto con qualsiasi tipologia di personale (non vedi receptionist, donne delle pulizie, portinai). Una volta pagata la prenotazione si riceve il codice d'accesso all'edificio e alla propria abitazione. Si entra in autonomia e si spera vada tutto bene. Se si ha bisogno di qualcosa si deve scrivere via chat sull'app a cui rispondono immediatamente, ma la risoluzione delle vostre necessità, non essendoci nessuno sul posto, potrebbe richiedere parecchio tempo.\nIl Sonder City Hall Park fa però eccezione perché qui c'è la reception a cui potete chiedere aiuto e un portiere notturno. Inoltre è sempre presente qualche tecnico quindi credo, anche se noi per fortuna non ne abbiamo avuto bisogno, che in caso di necessità la risoluzione sia più immediata. Poi, certo,  non è la classica reception per turisti tipica degli hotel (per esempio non hanno a disposizione una mappa della città).\nNoi abbiamo soggiornato in un appartamento di categoria alta e ci siamo trovati molto bene: spazi ampi, letto comodissimo. Cucina con lavastoviglie e microonde perfettamente funzionanti.  Buona quantità di posate, piatti e bicchieri, carente un po' nelle pentole. Erano presenti sono due padelle e nemmeno un pentolino per far bollire l'acqua. Sono presenti invece carta assorbente da cucina, the e filtri per il caffè, zucchero, sale, pepe, sapone piatti e pastiglie per lavastoviglie. \nLa pulizia era ottima per gli standard americani e, seppur non è prevista la pulizia giornaliera, è sempre possibile (via app) chiedere degli asciugamani puliti, che vi verranno lasciati in una borsa di carta davanti alla porta. \nAl 15° piano c'è un piacevole rooftop aperto ai clienti e ben tenuto. Al 7° piano ci sono: una lavanderia gratuita, un armadio contenente tutto quello che di solito cambia in camera la cameriera e che si può prendere in autonomia (carta igienica, sapone, fazzoletti, ma anche the e filtri per il caffè, zucchero, carta assorbente da cucina e sacchetti per la spazzatura, sapone piatti e pastiglie per lavastoviglie), una zona relax (ottima dopo il check out per fermarsi in attesa della partenza) con un wc e degli armadietti per il deposito bagagli. Questi purtroppo però sono un po' piccoli e in quantità insufficiente per la mole di visitatori: noi infatti li abbiamo trovati tutti occupati, ma abbiamo potuto lasciare i bagagli alla reception. \nAd ogni piano c'è lo spazio per buttare la spazzatura. Quando lasciate la stanza non dovete portarla via, ne è necessario lavare le stoviglie: è compreso nel servizio di pulizia finale. \nSu Jhon St, in direzione opposta al World Trade Center, a pochi passi a piedi, si trova un negozio di casalinghi a basso costo e con ampia scelta. Proprio di fianco c'è il ben fornito supermercato Jubilee Market. Poco più distante è presente anche un Whole food market e, vicino al World Trade Center, c'è anche Eataly. A due passi dall'edificio diverse sono le possibilità per la colazione e per una fetta di pizza. \nPraticamente sotto l'edificio c'è la fermata della metro di Fulton St e, giusto dall'altra parte della strada, la fermata di Cortlandt St: quindi i collegamenti via metro consentono di raggiungere praticamente ogni parte della città,\nA piedi si raggiungono comodamente World Trade Center, Wall Street, Seaport e, con appena qualche passo in più, anche Battery Park.\nLa zona dunque è centralissima, ma senza la ressa e il caos di Midtown. La sera è tranquillo e sicuro. \nPer noi questa soluzione è stata ideale, ci torneremo di sicuro se avremo ancora la possibilità di visitare NYC e lo consigliamo vivamente a tutti!","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Perfect Family Location","lang":"en","publishedDate":"2023-09-17","publishedPlatform":"OTHER","rating":5,"text":"Perfect location. Just 5min walk from 9\/11 Memorial and One World Trade Center. Metro station around the corner (Fulton St - Line 2, 3, 4, 5, A, C, E). WTC \/ Cortland St 5min walk. We booked the studio (approx. 42sqm) which had the perfect size for our little family (2 adults + 1 little girl). Everything was clean and staff was very friendly. For cleaning or early check in you’d have to pay an extra fee. But you can just use the laundry machines and drier on 7th floor to quickly laundry your towels and clothes. After all - all good! :) I would definitely book again with Sonder!","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Wonderful stay!","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":5,"text":"Beautiful room, lovely location, great staff! This was a great selection for a first time trip to New York City! I will definitely be booking again in the future! The app made everything very easy! Loved mobile key!","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Sonder City Park NYC","lang":"en","publishedDate":"2023-08-26","publishedPlatform":"OTHER","rating":4,"text":"The neighborhood that the hotel is in is bustling, packed with unique little spots to check out and conveniently right around the corner from my office. The room was clean, easy to get in and out of and very spacious for the cost. Having the fridge, mini oven and dishwasher was great. The shower was perfect for a relaxing post work shower and the roof top view\/hang was AWESOME. I will absolutely be staying again. ","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Sonder feels like the best kept secret in NYC.","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":5,"text":"The staff were top notch and handled my requests promptly and professionally. My 1BR apartment was spacious, clean, and bright. It looked exactly like the photos online. Super convenient to the subway too.","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Ottima scelta questo hotel!","lang":"it","publishedDate":"2023-08-14","publishedPlatform":"MOBILE","rating":5,"text":"L’appartamento é molto carino, con una bella vista ed era come da immagini e descrizione. \nLa posizione é perfetta per visitare Manhattan e Brooklyn. La stazione della metro Fulton é praticamente sotto all’hotel e passano diversi treni. \nA 5\/6 minuti a piedi trovate il supermercato Whole foods dove sí può fare la spesa e comprare anche prodotti già pronti.\nSicuramente ritornerei qui al mio prossimo viaggio a NY.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Perfect stay in FiDi NYC","lang":"en","publishedDate":"2023-08-09","publishedPlatform":"OTHER","rating":5,"text":"Great location near Fluton St subway station and World Trade Center.  Our studio was massive, especially by NYC standards.  We were comfortable and slept well each night.  Gas stove top was a huge plus!  Views from the rooftop were great!  The staff was courteous and helpful.  Luggage storage was helpful and convenient.  Will definitely return to this property!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Spacious Home Away from Home","lang":"en","publishedDate":"2023-08-06","publishedPlatform":"MOBILE","rating":4,"text":"I recently stayed in a 1BR Sonder apartment for one week with my two daughters (one was attending a week-long dance intensives a couple of blocks away). We loved our stay and would highly recommend this location especially if you plan to stay for more than a couple of nights and need extra room. \n\nPros:\n- The building was very quiet. We never heard one sound from a neighboring unit and the elevators (which ran very quickly) were mostly deserted.\n- Fantastic location one block from the 9\/11 Memorial, two blocks from Brookfield Place, a few blocks from the Seaport and on the same block as the Fulton train station. We were able to walk or take the subway everywhere throughout the city.\n- Space was key for us and we loved the layout of the 1BR apartment. The large bedroom contained a very comfortable King bed and a massive closet. The living room had a big banquette, a round table perfect for dining and hanging out, a small kitchenette and a desk area with two rolling chairs which doubled as our makeup \/ vanity area. As the bathroom is a bit dark highly recommend bringing a small freestanding mirror to use in the desk area.\n- No issue at all with requesting fresh towels \/ getting rid of old ones.\n- The rooftop garden is gorgeous and we spend much time up there both during the day and in the evenings.\n- Great shower water pressure.\n- The convenience and accessibility of the Sonder app is fantastic. You use the app to access your room, request towels, ask questions, report issues, check out, etc.\n- We were able to easily extend our checkout by 2 hours very easily via the app.\n\nCons: \n- Our AC wasn't working for the first 3 days of our trip which required constantly contacting the front desk. The issue was resolved pretty quickly each time.\n- The laundry and common area wasn't particularly appealing - overflowing garbage cans in the bathroom and a lack of AC in the middle of Summer kept us from using this space.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"A stay that makes New York feel like home","lang":"en","publishedDate":"2023-08-05","publishedPlatform":"OTHER","rating":5,"text":"Sonder City Hall provides an escape from the hectic streets of NYC. As a regular business visitor to NYC, I've stayed at a wide range of hotels and Sonder City Hall is now one of my favourites. \nThe location is great, particularly if you need access to the financial district. It's not a traditional hotel, visitors use a keypad on the street, which is quite straightforward to enter the building. However, there are friendly staff and security at the desk. \nMy room was a pleasant surprise. Very spacious with high ceilings and all the amenities that I had hoped for. Along with the basics (which are often missing from hotel rooms) i.e. iron, ironing board, safe, enough coat hangers. There is also a kitchen, which is great if you want to pick up something to eat from Wholefoods and take it back to your room for a relaxing evening. There was enough space from the kitchen area to the bed, to not feel cramped. And there is good desk space if you need to work from the room. \nYou can cast your phone to the TV easily to stream Netflix. \nThe bedding is comfortable and I had a great night's sleep with minimal noise or interruptions. \nThe shower had great pressure. And overall the decor is stylish. \nIt feels like a genuine loft experience, and is a great bolt hole if you have regular stays in NYC and want to feel more at home than hotel rooms can offer. \nI hope to stay here again in the future. ","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"My stay at Sonder City Hall Park in New York was absolutely delightful.","lang":"en","publishedDate":"2023-07-18","publishedPlatform":"OTHER","rating":5,"text":"My stay at Sonder City Hall Park in New York was absolutely delightful. The prime location near City Hall Park made exploring the city a breeze, and the check-in process was seamless. The apartment was beautifully designed, offering a cozy and stylish retreat. The stunning views from the apartment added to the overall experience. The friendly staff provided excellent customer service, making me feel right at home. Plus, I saved 20% by booking through the app, making it an even better deal. I highly recommend Sonder City Hall Park for a memorable and comfortable stay in the heart of New York City.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Perfect!","lang":"en","publishedDate":"2023-07-02","publishedPlatform":"OTHER","rating":5,"text":"Exactly as advertised, in a great location a block from the Fulton subway stop and surrounded by great restaurants. City Hall park, Brooklyn bridge, and 911 memorial are also close. Super comfortable bed, sofa bed was not so great but ok for kids. Well worth the price to have extra space to spread out and the kitchen was a nice option for quick meals to save money.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Comodissimo in zona Ponte di Brooklyn ","lang":"it","publishedDate":"2023-06-14","publishedPlatform":"MOBILE","rating":5,"text":"Vicinissimo al World Trade Center,Metro,Path e ponte di Brooklyn.Climatizzazione top.Strumenti x cucinare ok,angolo cottura 2 fuochi e frigo.Auto check in. Possibilità di spostate check in e check out.Possibilitá di parlare con reception tramite app.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great Stay!","lang":"en","publishedDate":"2023-06-14","publishedPlatform":"OTHER","rating":5,"text":"Great location and clean. Staff members always on site 24\/7. My family and I really enjoyed our trip! The big question is would we stay here again? The answer is an absolute yes! Access to the train was a big plus. ","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Exactly what was advertised","lang":"en","publishedDate":"2023-06-14","publishedPlatform":"OTHER","rating":5,"text":"It was exactly as advertised. I was hesitant to use the app but it worked perfectly. Robbie\/Robert was very friendly and responded when we made a request through the app.\n\nIt is right next to a large subway hub. \n\nWe loved all the light from the windows. There were also room darkening shades for the morning. The rooftop garden was very relaxing. It was nice to be able to wash clothes in the laundry room.\n","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Terrific place to stay","lang":"en","publishedDate":"2023-06-11","publishedPlatform":"OTHER","rating":5,"text":"Tasteful, big, spotless and quiet room with every amenity you could imagine. Clear instructions, easy access, safe building and location, and terribly nice concierges. Subway and good coffee steps away. Best stay in NYC ever and I will come back.","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Whenever I’m in NY, I will stay here again","lang":"en","publishedDate":"2023-06-11","publishedPlatform":"OTHER","rating":5,"text":"The room was more spacious than I thought. Very tidy and full kitchen utensils if you want to cook or heat up a meal. I loved the mattress (not too soft). Even though in the busy Financial District I didn’t hear a sound. I had some problems with the refrigerator door and the AC but it was swiftly attended to. Very friendly and capable staff.    All of this made my stay (1 month) very enjoyable,","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Family of 3 in NYC","lang":"en","publishedDate":"2023-06-03","publishedPlatform":"MOBILE","rating":5,"text":"Excellent facility and everything thought of. \nGreat location, clean, great use of the app and tech. We will be back and will definitely use Sonder again in NYC or another city. \nOur son is 10 so it was great we could all have our own space to relax.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"A delightful hotel\/apartment in a lovely neighborhood.","lang":"en","publishedDate":"2023-06-02","publishedPlatform":"OTHER","rating":5,"text":"The hotel\/apartment is in a very convenient location with easy access to multiple subway lines.  The apartment is clean and well stocked.  There is a lot of natural light in the room.  One can easily resupply amenities.  Will definitively stay again.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Would return.","lang":"en","publishedDate":"2023-05-29","publishedPlatform":"OTHER","rating":5,"text":"Clean, convenient, and a great view from our room. I enjoyed my stay here and would come again. It was also nice to have easy access to a washer and dryer, and the bed was comfortable. Subway station right around the corner.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great place to stay","lang":"en","publishedDate":"2023-05-26","publishedPlatform":"OTHER","rating":5,"text":"Great location.  Only a few minutes walk from WTC.  Easy access to Fulton St. station.  Friendly staff.  Rasonable price.  Quick walk to Little Italy.  Highly recommend if you don't need daily service from staff.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Best Stay in NYC yet","lang":"en","publishedDate":"2023-05-25","publishedPlatform":"OTHER","rating":5,"text":"I travel to NYC for work frequently - so thankful I stumbled upon Sonder!  Rooms are modern, spacious, and really make you feel like you're living in a studio apartment, not a hotel room.  Check in\/out was simple and fully autonomous.  I am looking forward to my next Sonder stay!","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23300953,"title":"Terrible Experience ","lang":"en","publishedDate":"2023-05-25","publishedPlatform":"OTHER","rating":2,"text":"We were unable to enjoy a single night of uninterrupted sleep due to the continuous noise from the garbage trucks between 11pm and 2am every day. Despite our complaints, the front desk informed us that there were no suitable rooms available. When we requested to meet the manager, the front desk showed no cooperation. Our stay lasted for a total of 9 nights.\nYour advertised slogan, \"Sonder | A better way to stay,\" does not hold true.\nPoor Maintenance:\nThe room entrance door cannot be locked from the inside. The water faucet in the bathroom sink is loose. The air-conditioner continues to run even when in \"Off\" mode. One of the bed lamps flickers intermittently, and another small lamp does not work at all. Although the issue was resolved, the TV remote control was initially without batteries. The power outlet near the coffee machine does not work and cannot be reset. The shower corner lacks a safety holding bar.\nThe hotel didn’t send any response to our review in the hotel internet site.\nIt would have been preferable if the reservation center informed guests in advance, during the reservation process, about the only available room facing John Street, which is subject to noise disturbances caused by garbage trucks from 11pm to 2am. I should have had the choice to decide whether or not to proceed with the reservation. This is not a situation where one should gamble on receiving a suitable room.\n","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Quiet, convenient location","lang":"en","publishedDate":"2023-05-22","publishedPlatform":"OTHER","rating":4,"text":"Spacious apt., quiet, well stocked and nicely furnished.  Very nice building and close to World Trade center and great shopping + subway access.  Very clean, newly refurbished.  Would stay again in the future.","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great stay with Sonder in NYC","lang":"en","publishedDate":"2023-05-22","publishedPlatform":"OTHER","rating":5,"text":"Great stay. Very large apartment with tons of windows, clean, close to the subway. It’s a surprisingly quiet property. Amazing front desk staff. Plenty of options for food including bodegas, bars, nice cafes.  ","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Stay here","lang":"en","publishedDate":"2023-05-12","publishedPlatform":"OTHER","rating":5,"text":"2nd stay at the Sonder Cityhall. It has everything i need and more. very conveniently located, steps from Fulton station. next door to duane reade where you can purchase all the essentials. check in & check out is done through their apps, you can chat with their customer service through their apps 24\/7. Highly recommended.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"A nice place to stay in NY","lang":"en","publishedDate":"2023-05-09","publishedPlatform":"OTHER","rating":5,"text":"Its all amazing, it would be great if daily cleaning service was included. Besides that it has it all, the location is great, rooms are fresh, everything is nicely designed. Subway is nearby, and you can go elsewhere for cheap.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Absolutely wonderful home away from home, free washer dryer! ","lang":"en","publishedDate":"2023-05-07","publishedPlatform":"MOBILE","rating":5,"text":"We cannot recommend Sonder enough. The rooms are way more spacious compared to Hilton or Marriott, and cheaper if you are staying longer. The kitchen is well appointed, with all the utensils you need. The bathroom is good sized, water pressure is great. The fantastic features include free washers and dryers, with free soap on the 7th floor, as well as a break area along with a fantastic view of NY from the top floor. The staff is very friendly, and can't beat the location. ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Good with some issues","lang":"en","publishedDate":"2023-05-06","publishedPlatform":"OTHER","rating":3,"text":"This time it was not as good as usually because we had many issues with the a\/c that lasted for several days\nAnyway we like the space and location and tge Sonder concept\nWe specially like the large studio ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Very good Manhatten family apartment","lang":"en","publishedDate":"2023-05-06","publishedPlatform":"OTHER","rating":4,"text":"Very centrally located, subway (WTC) very close. Very clean. All necessities in the kitchen were there, Bed comfortable, couch can become a bed for children, but with  metal springs that are uncomfortable. The only 2 little things that were not perfect: The pans to cook: one of them occupied almost both stoves, so the size-ratio from pan to stove was not ideal. And the toilet seat was smaller than the toilet rim.\n","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Excellent short term apartment living.","lang":"en","publishedDate":"2023-05-04","publishedPlatform":"OTHER","rating":5,"text":"Great stay loved the apartment living, reasonable prices, definitely will stay again. The area has plenty to offer from dining, to entertainment and everything in between, just be aware at night the area increases in crime potential so stay alert, but you will have a great time at this property throughout your stay. ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great stay","lang":"en","publishedDate":"2023-05-02","publishedPlatform":"OTHER","rating":5,"text":"Great location in NYC. Bed was extremely comfortable and studio very spacious. The laundry facilities which are available free of charge were super handy and also the guest lounge room and luggage storage for use before an evening flight.\n\nDisliked  · My only criticism is the shower room design, the water just goes over the entire bathroom floor instead of sloping down into the two drains. This seems like a silly design. We had to to use 5 towels to dry the floor and then wash and tumble dry them. Other days we rolled up a towel to ask as a barrier on the floor but this shouldn’t be necessary. For such a fantastic property the shower design is a let down","travelDate":"2023-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Apartamento muy bueno ","lang":"es","publishedDate":"2023-04-24","publishedPlatform":"OTHER","rating":5,"text":"Apartamento muy grande y muy limpio igual que en la fotos ,el apartamento esta muy bien situado tienes el metro a menos de 10 metros y en la zona tienes todo tipo de comida tambien cuando llegamos el personal que estaba en la recepción una persona llamada angela nos ayudo en todo momento y fue muy agradable en con nosotros sin duda volveremos con ellos ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Truly is a great place to stay!","lang":"en","publishedDate":"2023-04-19","publishedPlatform":"OTHER","rating":5,"text":"I've stayed at this Sonder several times and I've been quite happy with my stay. It's a great location, the rooms and bathrooms are large by NYC standards, the common areas, bathrooms and rooms very clean, nicely decorated, bright and airy with large windows. The bedding\/beds are very comfortable. I typically get a studio with a kitchen which has a 2 burner stove, mini fridge, microwave, small dishwasher, coffee maker and a table and two chairs. Some pots, pans and utensils are included as is dish soap etc. This is handy for a quick meal or leftovers. All Sonders are slightly different, but this one has a self-serve luggage storage area that you can use before or after check-in. There is a comfortable waiting area with a bathroom in that same room. There is also a room with washers and dryers available for use and extra toiletries if needed. There is a nice roof deck as well. Sonders do not have daily cleaning or garbage removal, you do that yourself. There is a Duane Reed right next door and the Fulton Street subway station is around the corner. I'll definitely return again!\n","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great location!","lang":"en","publishedDate":"2023-04-18","publishedPlatform":"OTHER","rating":5,"text":"We loved having the extra space of a studio.  Such a perfect location for the subway to everywhere! The fold out couch was not very comfortable but for a couple nights the teens were fine.  Very quiet and loved spending time on the rooftop.  ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"A very nice stay","lang":"en","publishedDate":"2023-04-18","publishedPlatform":"OTHER","rating":5,"text":"I had a lovely stay.  The studio room was a good size and design.  The kitchenette area was well equipped, and the bathroom was also a good size with good lighting. I felt very comfortable for the whole week I was there.  I will stay there again.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great service, spacious rooms","lang":"en","publishedDate":"2023-04-16","publishedPlatform":"OTHER","rating":5,"text":"The staff and service were incredible and the rooms were beautiful and spacious. My first room had a broken HVAC and they were attentive in assessing it quickly and then moving me to a new room. They even  upgraded me which was very nice. I loved that there was a kitchenette for my week stay and that i could use a code for entry instead of a keycard. Would definitely visit again, at this location and others. ","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Spacious & central design apartment","lang":"en","publishedDate":"2023-04-15","publishedPlatform":"MOBILE","rating":5,"text":"Perfect location, next to tube station and trains hub, also good to walk to midtown.\nVery spacious apartment with all you need for a family of four. Very carefully decorated.\nVery helpful and friendly staff at the reception. Appreciate the 7th floor lounge to leave the baggage the last day.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great stay","lang":"en","publishedDate":"2023-04-09","publishedPlatform":"OTHER","rating":5,"text":"Great staff, beautiful hotel. Really spacious rooms and they offer in building laundry which is great. The area has so many options for food. Near a large selection of transportation.  would stay again!","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Excellent for NY","lang":"en","publishedDate":"2023-04-08","publishedPlatform":"OTHER","rating":5,"text":"Excellent for NY City.  Good value (for NY) and very easy to get to using subway. Modern and clean. Some good restaurants nearby. Its a good option if you dont mind taking toe subway to get our of the financial district.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Sonder is not your regular start. It’s a superior stay","lang":"en","publishedDate":"2023-04-07","publishedPlatform":"OTHER","rating":5,"text":"Sonder is wonderful! It’s a total different experience from other competing services. They have a professional staff on premises and they’re kind and skillful. Also if you want to leave your luggage with them because your flight leaves late that day, they have alternatives to do so","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"The easy choice","lang":"en","publishedDate":"2023-03-28","publishedPlatform":"OTHER","rating":4,"text":"Super uncomplicated booking and service. The location is perfect for business downtown and\/or leisure in the downtown area. I can highly recommend Sonder and I would certainly use it again next time.  ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Will definitely come back!","lang":"en","publishedDate":"2023-03-13","publishedPlatform":"OTHER","rating":5,"text":"Loved the space! Love the location. Financial district is underrated. So much happening here now. Great restaurants and cafes nearby. Public transport literally less than half a block away. You can get to BK in 7 minutes. Luggage storage was clutch. Will definitely stay here again.","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Best housing experience","lang":"en","publishedDate":"2023-03-07","publishedPlatform":"OTHER","rating":5,"text":"Comfortable area and easy accessible to get where we needed to go. It was right by the train station and getting a Uber was very easy as well. We had a great time at the establishment. Thank you for accommodating my partner and I.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Perfect place to feel like a New Yorker for a week","lang":"en","publishedDate":"2023-03-05","publishedPlatform":"OTHER","rating":5,"text":"Lovely apartment, with lots of room for the four of us.  The kids shared the sofa bed (which I think would not be great for adults - seemed a bit saggy).  The place was so clean, and funky.  We loved all the natural light.  The TV allowed for Chrome casting.  Free and reliable Wifi.  Excellent location - right near the Fulton Subway station which meant getting uptown easy.  We walked to Battery Park, caught the Staten Island ferry, saw the Statue of Liberty easily from the apartment.  Located beside a pharmacy which also sells some snacks including milk and icecream.  We loved this place so much.  It was lovely to come back to the apartment after a full day of sight seeing.  The rooftop view is also great.  The facilities also have lockers to store your luggage if needed along with free washing machines.  We can not fault this accommodation.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Dream Home From Home","lang":"en","publishedDate":"2023-02-27","publishedPlatform":"OTHER","rating":5,"text":"A magnificent studio with all of what you require for a perfect stay and the view is just breathtaking. The staff are friendly and helpful and the heating worked well since I stayed during a cold snap in NYC. ","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Beautiful place in a great location","lang":"en","publishedDate":"2023-02-27","publishedPlatform":"MOBILE","rating":5,"text":"The apartment is beautiful, luxurious, confortable, also too quite. The building location is perfect to visit many NY attractions, with a one block away train station and many restaurants and stores. The staff is so polite and always attentive to help.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Emplacement idéal et très bon séjour chez Sonder","lang":"fr","publishedDate":"2023-02-25","publishedPlatform":"OTHER","rating":5,"text":"Nous avons passé un excellent séjour à New York avec l'hôtel Sonder. \nLes chambres sont très belles, propres, bien équipées avec arrivée autonome et le personnel à l'accueil est très gentil et aimable ! \nL'emplacement est idéal : à proximité de toutes les lignes de métros!  A deux pas du World Trade Center et à 10min du bateau pour la statue de la Liberté 🗽. \nNous sommes là bas comme à la maison, c'est top !\nSuite à une grève puis à un incendie qui a touché le terminal 1 de l'aéroport de JFK, nos vols retours ont été annulé à plusieurs reprises.. Robbie, une personne de l'accueil, a été d'une aide incroyable et nous a permis de nous reloger durant ces jours de plus alors que notre chambre n'était plus disponible..\nNous remercions encore infiniment Robbie 1000X qui a été adorable avec nous ! \nNous recommandons cet hôtel sans hésiter et  reviendrons avec plaisir !","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Working remotely in NYC ","lang":"en","publishedDate":"2023-02-24","publishedPlatform":"OTHER","rating":5,"text":"Location was great- near subway and not fed from the water Space was just the right size. Easy in and out. Great coffee maker. Would stay here again. Enjoyed the rooftop but would love to do again in warmer weather. ","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Family of four winter break","lang":"en","publishedDate":"2023-02-22","publishedPlatform":"OTHER","rating":5,"text":"The apartment was clean, quiet, nicely appointed, and well stocked. It was in an excellent location, just steps from the Fulton Center subway station and minutes from the Oculus, 9\/11 Memorial, and One World Trade Center area. We would definitely choose to stay here again.","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great stay","lang":"en","publishedDate":"2023-02-21","publishedPlatform":"OTHER","rating":5,"text":"Great appartment, great location (metro next door, and plenty of food option around), and really friendly staff working in the reception.  Definently reccomend to everyone looking for a good place to stay during their New York vacation. ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Situation idyllique...  Une adresse immanquable !","lang":"fr","publishedDate":"2023-02-20","publishedPlatform":"OTHER","rating":5,"text":"La résidence est idéalement situé pour se découvrir NYC (7 lignes de métro à moins de 450 m à pied), on se rend à Harlem, Brooklyn ou même le Bronx en moins de 25 minutes . \nLe quartier est trés animée le soir et tous les commerces sont présents à moins de 500m. \nL'appartement étai impeccable, trés grand et parfaitement équipé. La résidence est nickel et surveillé en permanence et le personnel est super attentionné. \nUn super spot à recommander.","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Perfect","lang":"fr","publishedDate":"2023-02-18","publishedPlatform":"OTHER","rating":5,"text":"Une très belle expérience dans une ville incroyable !! L’appartement est bien situé, confortable et spacieux. Le personnel est bienveillant et sympathique.En bref, une adresse que nous recommandons chaudement et que nous retenterons dans d’autres pays ","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"the perfect new york experience","lang":"en","publishedDate":"2023-02-17","publishedPlatform":"OTHER","rating":5,"text":"our suite had everything: full kitchen (with coffee we surprisingly enjoyed unlike most hotels), immaculate bathroom, super comfortable bed, a lounge area and a working station. the decor is modern, bright, clean. Sonder was very accommodating as well - they coordinated an early check-in for us and provided complimentary laundry services. I would recommend this specific location as well - within walking distance of basically everything you would need.","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Lovely stay, excellent location!","lang":"en","publishedDate":"2023-02-11","publishedPlatform":"OTHER","rating":5,"text":"Beautiful fully equipped studio apartment with 6 big dreamy windows. It had everything I needed. I stayed here for one month  whilst looking for my own apartment so it’s kinda been my first home in the city! \nGreat front desk & security team as well! Always friendly and helpful. \nOverall FiDi may not be the most exciting place to stay but it’s super convenient with Fulton St station right on the corner and being walking distance from LES and Soho. Absolutely loved it!","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Amazing experience in City Hall NY","lang":"en","publishedDate":"2023-02-08","publishedPlatform":"OTHER","rating":5,"text":"Has been a wonderful experience, better than expected!\nIf I came back to the town again,  I’d repeat the experience undoubtedly. I didn’t know Sonder before however has been a huge discovery!\nAll the staff as well as the commodities are amazing","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Fantastische plek!","lang":"nl","publishedDate":"2023-02-01","publishedPlatform":"MOBILE","rating":5,"text":"Wat een héérlijke plek. Súper ruim en schoon appartement. Voldoende ruimte voor ons vieren. Fantastische locatie met Subway, Oculus, WTC, 9\/11 museum en Memorial om  de hoek. Aardig personeel. Weinig omgevingsguid. Kortom; een top plek om te verblijven!","travelDate":"2023-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Souder John street NJ","lang":"es","publishedDate":"2023-01-30","publishedPlatform":"MOBILE","rating":5,"text":"Me encanto la habitacion todo super limpio \nLa cama comoda y los trabajadores del hotel super amables.Gracias por su amabilidad.\nNuestra habitacion no tenia lavadora y secadora pero hay una area comun de gratis con lavadora y secadora.Me encanto la experiencia.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great deal","lang":"en","publishedDate":"2023-01-22","publishedPlatform":"MOBILE","rating":5,"text":"Looks exactly like the pictures. Super classy. Great price! One of those places where it’s actually worth the price, especially in New York Cit.  Would definitely recommend and would come back to any Sonder locations ———————————————————————-","travelDate":"2023-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Excelent big and beautiful room near WTC","lang":"en","publishedDate":"2023-01-11","publishedPlatform":"OTHER","rating":5,"text":"Our stay was very nice, the location was excelent, the room was big and confortable, it was nicely decorated, the kitchen had everything we needed and more! the bed was confortable, the amenities were nice, the locker room SONDER offered was very crowded,","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Awesome!","lang":"en","publishedDate":"2023-01-10","publishedPlatform":"MOBILE","rating":5,"text":"The room was cool, cozy and clean with a wonderful view of the surrounding buildings! Check-in and check-out were easy and fast! The location is 1 minute walk to Fulton Street subway station! Not the best place for eating at nite but we loved the neighborhood thou!","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Wonderful Stay at Sonder City Hall Park NYC","lang":"en","publishedDate":"2023-01-05","publishedPlatform":"OTHER","rating":5,"text":"Very well located, perfect for subway connections.\nNice quarter, just next to the Brooklyn bridge, 20mn walking distance from China Town and Little Italy.\nNice building & room, great staff.\nWas our second stay, really liked it !","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23300953,"title":"Muy buen apart hotel de lo mejor","lang":"es","publishedDate":"2023-01-03","publishedPlatform":"MOBILE","rating":5,"text":"Uno de los mejores, es sencillamente un departamento con todas las comodidades que uno necesita, la atención buena solo le falta alguien que hable español pero igualmente son amables y predispuestos a tratar de hacer osar una buena estancia","travelDate":"2023-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great space","lang":"en","publishedDate":"2023-01-02","publishedPlatform":"OTHER","rating":5,"text":"Great location, right next to Fulton Street station which has great connections and a short walk to the shopping in the World Trade Centre.  2 adults and 2 kids (11 and 13) in a studio apartment. It was as expected from the pictures. Sofa bed comfy enough for the kids and the bed was large and super comfy. Furniture was of a really high quality.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"An amazing new way to travel","lang":"en","publishedDate":"2022-12-30","publishedPlatform":"MOBILE","rating":5,"text":"Our first time staying at Sonder at NYC downtown, one bedroom for 8 days. The room size is decent, everything was true to the marketing pictures, just a little wear and tier, but decent size. Location is great 10 mins walk to Brooklyn bridge which is what we were after. Kitchen is fully equipped can cook or order takeouts.\n\nHighly recommended and please take care of the apartment. We’d love to come back and see this business model grows.\n\nWe arrived 8am on the checkin day. Left luggage with reception spent a day exploring the city. The staff is friendly and helpful. Online chat is also instant. A business well executed.\n\nOnly attached picture for window view from 13th floor. Interior is true to their marketing.","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Brilliant place, facilities and location - amazing stay for family of 4","lang":"en","publishedDate":"2022-12-27","publishedPlatform":"MOBILE","rating":5,"text":"Excellent first Sonder experience - really enjoyed the mix of service when you needed it, but the feeling of your own place. Location and size of the studio room was outrageous given the price. Would come back in a heartbeat. \n\nNow some details:\n- we used the pull out bed for our kids, mattress is a bit thin, so best for kids, I wouldn’t recommend for adults sharing\n- there were a few niggles, but they all got sorted out quickly, except an issue with the peleton, but that was out of their control\n- the Sonder desk people were super friendly and helpful, felt they knew you individually, much more personal than a hotel\n- location of Sonder City Hall is excellent, entrance to Fulton subway is 10m away and getting to uptown was seriously straightforward (plus easy now with tap and go on the subway)\n- we stayed over Christmas and was worried the area may be quieter or places closed, but was not an issue, tons of food from cheap to expensive on your doorsteps, plus a mini mall at WTC\n- having a full (albeit small kitchen) was so good, again the value was brilliant. Note there was no oven, but microwave, 2 burner, small fridge and small dishwasher\n- the communal laundry was great but can get busy, whilst there was always extra coffee, tea, shampoo, towels, toilet paper etc to just to grab as you needed.\n\nBe wary of negative reviews if they call out check in issues, no problems for me, the key being to have the app set up for you and any guests. Save your self the hassle and do this before you arrive and you will have an amazing stay.","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Sonder at City Hall you where exceptional !!","lang":"en","publishedDate":"2022-12-15","publishedPlatform":"MOBILE","rating":5,"text":"Stayed here for 5 nights recently and would highly recommend Sonder to anyone visiting NYC. Family of 2 adults and 2 teenagers we had initially booked the radisson on William St but after reading the bad reviews we cancelled and went on the hunt for new accommodation which is when we stumbled across Sonder at City Hall. We had a one bedroom apartment with huge double bed and a pullout sofa for the teens. Apartment had a fully equipped kitchen with every utensil you could think of. Even had a built in dishwasher !!. Building itself is great really modern with 3 lifts which never seemed busy so no unnecessary waiting around. Fully stocked amenities cupboard on the 7th floor in the laundry area that had all the essentials for your apartment. Tea,coffee,sugar,cleaning products etc. Sonder sends you an email couple of days beforehand with your check in details. You get a keycode to the front door which also opens your room. Check in isnt until 4pm so when we arrived at 3pm we asked about going up to the luggage storage are on the 7th floor to store our bags but to our delight we where told our room was ready and we could go straight up. Cant say enough good things about this place and having been to NYC a total of 8 times over the years and staying in various hotels throughout the city definitely next time we will be staying in Sonder. Very convenient location in the financial district so super quiet at night time and 1 minute walk to Fulton Center for the subway.","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Excelente!!)","lang":"es","publishedDate":"2022-12-13","publishedPlatform":"MOBILE","rating":5,"text":"Excekente! La habitación es enorne. La cama extra grande y comodisimo!! El baño Perfecto, moderno, la ducha excelente con productos de higiene y secador de cabello. Tiene una cocina modernísima con todos los elementos necesarios para quienes quieran cocinar. Cuenta con escritorio y con un comedor con un sillón de diseño con una mesa redonda y dos sillas conodisimas. Les aseguro que mucho más lindo que en las fotos. La ubicación es buenísima. Fulton center a pocos metros y World Trade Center a un par de calles, así que la comunicación en Metro fue genial. Volvería decididamente!!!!","travelDate":"2022-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Fantastic stay!","lang":"en","publishedDate":"2022-12-13","publishedPlatform":"MOBILE","rating":5,"text":"Had a wonderful stay for 5 nights in December. Great location with the Fulton Centre subway next door. Clean, comfortable and easy stay with no issues. We had a couple with 2 older teenagers who used the pullout sofa but the apartment had plenty of space for all 4 of us. Would highly recommend to anyone staying in NY.","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Sonder - New York","lang":"en","publishedDate":"2022-12-13","publishedPlatform":"MOBILE","rating":5,"text":"We loved staying at Sonder! It is close by to so many subway stations & the surrounding areas are lively & fun. You have Joes pizza down the street, CVS for any last minute things you forgot, and the coolest little Irish pub right next door. We’d love having everything we needed - dishwasher, microwave, fridge, sink, & the best…coffee!!! Staff were great, helpful, and friendly. Beautiful views from the roof top & even from your room. This was our first time in New York & Sonder made it that much more enjoyable. Would HIGHLY recommend staying here!!","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Nice clean and convenient","lang":"en","publishedDate":"2022-12-11","publishedPlatform":"MOBILE","rating":5,"text":"I lived in NYC for over a decade but now travel back for work frequently. I always stay here for work. Rooms are larger than most hotel rooms, clean and very accessible. Good to have kitchen and laundry, especially in NYC. Fulton station nearby a huge plus…Always recommend to people coming to NYC. Not a full service hotel, but more amenities that make it an attractive option, especially for longer stays.","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"impecable todo, para seguir volviendo sin duda!","lang":"es","publishedDate":"2022-12-10","publishedPlatform":"OTHER","rating":5,"text":"El Sonder City Hall Park es un edificio absolutamente renovado en el corazon del Distrito Financiero de Manhatan, a un paso de todos los subtes y de emblematicos lugares. Las fotos son tal cual lo que esperabamos, ademas de ser un lugar silencioso, con excelente wifi, laundry y amenities para uso a discrecion. Los estudios son luminosos, limpios, excelente ropa de cama, buenos colchones, buena ducha, muy bien decorados, vistas abiertas y buena clilmatizacion individual. Para completar, ademas de tener terraza para uso de huespedes, hay a pocas cuadras Whole Foods y otras opciones de take away o restaurantes. La gente de recepcion muy amable y el sistema de entrada conctacless resulto perfecto. Sin duda volveriamos cada vez que visitaramos Manhattan! \nLo unico para decir, por agregar un detalle, es que la cantidad de vajilla o utensilios de cocina es limitada. Podrian tener un cuchillo de corte, o copas de vino, pero no lo pondria como una queja. Sí, no es apto para quien vaya con idea de cocinar ahi.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Comfortable and convenient","lang":"en","publishedDate":"2022-12-08","publishedPlatform":"MOBILE","rating":5,"text":"Great size room, super clean, easy access and \neverything we needed for a comfortable stay. Just needed tea bags as only herbal available. \nGreat location right next to the subway and 9\/11. \nDefinitely would use again in New York or another country if available.","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Perfect stay!","lang":"en","publishedDate":"2022-11-30","publishedPlatform":"MOBILE","rating":5,"text":"I loved this place! It was very clean and cozy, the staff was so kind and very helpful. I recommend it to anybody who looking for a nice place and wants to feel like home. I was so happy in this place. It was near (1min away) from the Fulton station which deserves a lot of station, very good for visiting NY. Close to Brooklyn, midtown it was my best experience at an hotel- apartment. \n\nI RECOMMEND THIS TO EVERYBODY!","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Best Sonder in NYC","lang":"en","publishedDate":"2022-11-28","publishedPlatform":"OTHER","rating":5,"text":"From the day I arrived the front desk staff Robbie, Delroy, Shea and Madi were all top tier! The room was cozy and clean and had great views of fidi. Couldn't hear a peep from the outside world once my door was closed and that's rare in NYC. Great views from the rooftop and also the free laundry was my favorite perk while staying at City Hall Park. Can't wait to visit again and shoutout to the team for killing it!!","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Very good bedroom and location","lang":"en","publishedDate":"2022-11-25","publishedPlatform":"OTHER","rating":5,"text":"Room was super comfortable, nice bed, kitchen, work table, restroom, etc. Location is great, really close to many fast restaurants and subway. Entry to the building and room was super easy and facilitated. Guest room in the 7th floor is good to stay right before checkin and checkout and you can leave your luggage there. Would definetly go back","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Family Thanksgiving Vacation Stop in New York City for 4 days 3 nights","lang":"en","publishedDate":"2022-11-24","publishedPlatform":"OTHER","rating":5,"text":"Hotel is in a great location, meters away from the Fulton subway station as well as the World Trade Center for ease of access to shopping, restaurants and transportation to uptown Manhattan, but being in a quite part of New York City without all the noise and busyness.  We had a corner suite room that was around 64 sq. m that had a kitchen, living room and dining room areas with a counter bar island, as well as a Peloton exercise bicycle inside the room for workouts.  The hotel also had free common laundry machines and dryers to use, and they supplied the detergent for free!  This was great for our family as we are on a 2 week Thanksgiving vacation trip.  While the hotel does not have parking, we were able to get street parking for free for 3 days in front of the hotel during our stay!  Check-in was via our mobile phone app and the front door and room had electronic password for entry which was great for us as we did not have to carry around a key or keycard.  While there was no daily room cleaning (perfect for us during these times) service, one could be ordered via the Sonder app for a fee (this is how they keep the hotel room rates low).  Front desk manager and doorman were both great, friendly and able to make recommendations for us.  At first we were not sure about Sonder as had not heard of this name before, we will stay here again for sure, and will now start to look for the Sonder hotel brand when we travel to other cities.  Overall a great experience and can highly recommend Sonder as an alternative to the major hotel chains.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Another solid Sonder!","lang":"en","publishedDate":"2022-11-15","publishedPlatform":"MOBILE","rating":5,"text":"Sonder apartments are of a consistently high standard of decor, cleanliness, comfort and service. I love how easy it is to manage everything through the app, and the extra mile that the group goes to make their accommodation feel sophisticated without charging the earth. It always feels a little like staying in my fantasy home when I stay with them!","travelDate":"2022-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Wonderful Stay!","lang":"en","publishedDate":"2022-11-14","publishedPlatform":"OTHER","rating":5,"text":"We were a little hesitant to book a Sonder, as we hadn't heard of the company prior to this trip (we were searching for an Airbnb, not realizing the limits placed on Airbnb's by the City of New York). We are so glad we decided to try it out as opposed to getting a hotel room! The condo was exactly as described\/photographed on the Sonder website. It was well-stocked and very clean, a fantastic location, and very safe! Can't say enough good things about it! The only suggestion I would give is to invest in a foam topper for the sleeper sofa. We were on a girls trip, so had to use it and it was pretty uncomfortable. Foam toppers are inexpensive and would make a world of difference :) Other than that, it was a fantastic stay and I will definitely use Sonder again in the future!","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Fantastic way to stay in NYC","lang":"en","publishedDate":"2022-11-09","publishedPlatform":"OTHER","rating":5,"text":"Really enjoyed the entire experience from start to finish. Beautiful apartment with great lighting, decor, amenities, and common areas. The location was close to many subway access points and close to the 9\/11 World Trade center memorials. Would absolutely stay here again.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"A Nice Space for Less $$","lang":"en","publishedDate":"2022-11-09","publishedPlatform":"OTHER","rating":5,"text":"Nicely appointed studio, spacious, and within walking distance to popular attractions, restaurants, and the gym. Arrival was fast and seamless! My only suggestion is to allow the front desk staff to deliver food-app orders. That would've made it stay perfect!","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great place to stay","lang":"en","publishedDate":"2022-11-06","publishedPlatform":"OTHER","rating":5,"text":"The room was exaclty as described and had everything we needed for our 1 week stay. Comfortable bed, good bathroom, great amenities in the small kitchen. Great to have a sofa and table for eating breakfast. No disturbing noices from neighbors, even though we could hear the couple next door's toddler cry when we went past their door in the corridor. Heard some noise from traffic from outside at all times, but I guess that's just part of the New York experience. :-) \n\nGreat facilities with washing machine on the 7th floor (laundry detergent included). Also great that it was possible to go to this floor to get some more coffee, soap, etc when needed.\n\nGood location ni the middle of FiDi with great access to the metro, where many different lines could be reached. There were some homeless persons sleeping here and there around the neighborhood but it didn't feel unsafe. A pharmacy was located right next door for basic groceries, and there were plenty of restaurants nearby. \n\nThe staff was friendly and helpful with our questions and needs, both via the app before our visit and at the front desk when we were there. Robbie at the front desk was a gem.\n\nDon't miss their rooftop space. A cosy place with flower beds and wooden benches. Take the elevator to floor 15, and then there's a door next to the elevators with a small stairwell. Nice to visit at night!\n\nAll in all, a great stay! Would absolutely have a look at other Sonders if I visit any other city where they're located.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Home Away From Home","lang":"en","publishedDate":"2022-11-02","publishedPlatform":"OTHER","rating":5,"text":"I’ve stayed at Sonders in other parts of the city, but the sonder at city hall park is one of a kind. This is my new found gem. Check in was easy, quick and all of their staff are very attentive to guest needs. Delroy gave us options for restaurants in the area, as there’s a multitude of eateries. The subway station is a stone’s throw away from this place and there’s a park nearby for recreation. This sonders, unlike the others I’ve stayed has an impressive view of the city and their housekeeping does a phenomenal job with the rooms.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23300953,"title":"Room was exactly as described","lang":"en","publishedDate":"2022-11-01","publishedPlatform":"OTHER","rating":5,"text":"Room was exactly as described. Stayed here for a week in October, 2022. Room was very clean, modern, and had all the amenities desired, including a french press. \n\nOnly negative - and this is no fault of Sonder's - is that since you are right by the Fulton street stop (which is very convenient), there are also a lot of homeless people on the block of the hotel. No bother at all, but is what it is.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"25th Wedding Anniversary","lang":"en","publishedDate":"2022-11-01","publishedPlatform":"MOBILE","rating":5,"text":"Travelled from Ireland to celebrate 25th Wedding Anniversary and stayed in the fantastic Sonder Hotel , John St, Lower Manhattan NY. Room was so spacious , spotless clean and well kitted out . We had a good size fridge , kettle, iron combi microwave and filter coffee machine !  . We were so comfortable on our stay which really added to our experience . Fantastic location to tour lower Manhattan  whilst there were a number of subway stations close by if you didn’t fancy the walk to midtown. Finally a word of thanks to their friendly, most helpful staff 👏🏼👏🏼. Always at hand and always keen to support ! We would highly recommend a stay at Sonder !!","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great stay, good location","lang":"en","publishedDate":"2022-10-25","publishedPlatform":"MOBILE","rating":5,"text":"It was a great experience at Sonder! I had some issues with the keycode check-in but it was fixed promptly and everyone at the front desk was nice and responsive. \n\nThe room and amenities are hard to come by in lower manhattan! Spacious (and cozy!) room with a fridge, microwave, and kitchen basics, plus a floor length mirror and a rooftop. The location was great and i didn’t feel unsafe - Id highly recommend staying here if you’ll be in the area!","travelDate":"2022-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Fantastic","lang":"en","publishedDate":"2022-10-22","publishedPlatform":"MOBILE","rating":5,"text":"Gorgeous rooms, quiet and calm. Everything fab. Small things: fancy dishwasher was broken on arrival meaning lots of handwashing.  Laundry facilities a plus but there was never enough soap and you had to ask for it!","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Simply Amazing","lang":"en","publishedDate":"2022-10-18","publishedPlatform":"OTHER","rating":5,"text":"Our trip to NYC became one of the best experiences ever staying at this location. The facility is beyond amazing and offers multiple service. The staff are all courteous. Delroy assisted us with an early check in as we got off of a red eye flight and he ensured we were well taken care throughout our stay until now. Check out their rooftop, gives a realistic view of the city . They offer free laundry and the room was sparkly clean.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Wow, what a great experience","lang":"en","publishedDate":"2022-10-18","publishedPlatform":"MOBILE","rating":5,"text":"It is exactly like every one wants, to come to a nice place, like in the pictures. To be in a nice area and everything is spotless clean and equipped with everything that you need. The best experience and we will recommend to all of our friends and family.","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Clean, spacious and fantastic location","lang":"en","publishedDate":"2022-10-17","publishedPlatform":"OTHER","rating":5,"text":"Very happy with this find and I definitely would stay again when next in NYC. Sitated right beside Fulton station and a 5 minute walk away from the World Trade centres, the location was fantasic. \nThe apartment was clean and spacious and had everything I needed. The laundry room was stocked with detergent etc and everything was easily accessible. \nThe staff in the lobby\/reception were super helpful, and I made use of the luggage store and waiting area on my last day. I really can't fault the place at all!","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Unexpectedly excellent!","lang":"en","publishedDate":"2022-10-16","publishedPlatform":"OTHER","rating":5,"text":"I was a little uncertain as to how this trip would go as I had not stayed in this kind of serviced apartment-type residence before, but the room was large, well-appointed, and quiet - the little kitchenette was usefully equipped, and the rest of the building amenities were functional but perfectly decent.   All the staff were very friendly and helpful, and all in all, my stay was excellent. I will certainly return to this location on future trips!  Would recommend to any traveller who wants a more of a self-catering experience, and definitely great value.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Impeccable","lang":"en","publishedDate":"2022-10-15","publishedPlatform":"OTHER","rating":5,"text":"Our stay was incredibly amazing. This location is at the forefront of almost everything. Train stations nearby, lots of eating options nearby  and the rooms were simply immaculate. Delroy greeted us at check in and was super helpful and pleasant. Overall, our stay was more than we could imagine. Surpassed expectations. ","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"We loved the Sonder Stay but the bed 😅","lang":"en","publishedDate":"2022-10-12","publishedPlatform":"MOBILE","rating":4,"text":"We loved this spot! We loved the location. So much to do with with the big translation hub right next door, it was easy to get all over Manhattan in roughly 25 minutes on average! It was so nice to have a fully furnished hotel room! Just wish the bed was softer. My arms would fall asleep because I’m a side sleeper. We had such a beautiful vacation, just wish the bed was more comfortable.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Will definitely stay at this Sonder again if I am in NY ","lang":"en","publishedDate":"2022-10-08","publishedPlatform":"OTHER","rating":5,"text":"Great service, professional, clean, quick, very good! Robbie, Anita, Shea, Nate, Delroy, thank you very much. Also thank you, Robbie, for your positive and  great attitude. I liked my stay very much. Thank you.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Very clean and friendly stuff","lang":"en","publishedDate":"2022-10-08","publishedPlatform":"OTHER","rating":4,"text":"surroundings are not the best - street is a bit dirty and dark\nrooms great, clean and comfortable \nstuff very helpful and friendly - 5 minutes walk to the WTC\nNearby restaurants and shops and Underground station","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Wspaniałe miejsce - godne polecenia","lang":"pl","publishedDate":"2022-09-30","publishedPlatform":"OTHER","rating":5,"text":"Wyśmienita lokalizacja – bardzo blisko metra, WTC, giełdy, mnóstwo sklepów i różnych punktów gastronomicznych w pobliżu. \nPokój był czysty, widny, łóżko bardzo wygodne. Wyposażenie pokoju w pełni zaspokaja potrzeby. \nW budynku są trzy szybkie windy, co powoduje, że nie traci się czasu na oczekiwanie. \nWszystko było bardzo dobrze zorganizowane, skorzystaliśmy z możliwości zostawienia bagażu po wymeldowaniu – ta opcja jest bardzo przydatna. \nJesteśmy bardzo zadowoleni z warunków, które zostały nam stworzone.","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Beautiful Lofty Room","lang":"en","publishedDate":"2022-09-29","publishedPlatform":"OTHER","rating":5,"text":"The Room was really spacious and had fantastic high ceilings, decor was subtle and I was very grateful for a proper desk as well as an additional dining table, the front desk people were very hospitable, well worth downloading the app to help you use your room and as a key!","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Highly recommended","lang":"en","publishedDate":"2022-09-28","publishedPlatform":"MOBILE","rating":5,"text":"Amazing experience. Everything perfect. Everybody very kind. The building and the  apartment are incredible. The amenities space it’s a detail but once you have it, it becomes fundamental. \nAnd excelent location. From now on I will first look for Sonder.","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great New York Vacation Rental","lang":"en","publishedDate":"2022-09-27","publishedPlatform":"MOBILE","rating":5,"text":"Beautiful, spacious, clean, nice views, big windows, centrally located, great value for the price! I will be staying here on my next visit back! It was perfect for our annual cousin’s trip! The 3 of us fit very comfortably! The luggage storage room was a great bonus for storing our items before check-in and after checkout and allowed us to explore even more of the city!","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"lovely space in a great location","lang":"en","publishedDate":"2022-09-26","publishedPlatform":"OTHER","rating":5,"text":"This was my first time in a Sonder and I was hugely impressed! The space is gorgeous and well-located and the staff at the front desk were friendly and helpful. I was on the 15th floor and the view was fantastic and it was even quiet - a real boon in Manhattan.I will use Sonder again for sure.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"NYC visit","lang":"en","publishedDate":"2022-09-19","publishedPlatform":"MOBILE","rating":5,"text":"The room was exactly as advertised, clean, spacious and comfortable. It’s in a great location, staff is friendly and interaction using the Sonder app was straightforward. It has a nice rooftop, with a good view of the buildings. I definitely recommend it and hope to come back.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"My favorite studio in NY","lang":"en","publishedDate":"2022-09-10","publishedPlatform":"MOBILE","rating":5,"text":"This studio was huge, bright and airy. I think we lucked out with a corner unit- not all studios in this building are.  It was sparkling clean, had a nice kitchen with utensils, pans, plates, etc (though a mini-fridge when many sonders have full size) and a big bathroom. A banquette with a table for meals and comfy chairs, a TV on a swivel mount so you can watch while cooking, from bed, or the banquette. Darkening blinds, nice bedding and a huge bed. Free laundry in the building and extra tp, soap, tissues if you need. Free locking luggage storage on the 7th floor with a comfy waiting area if you arrive before check in. A nice roof deck with great views. A great area to stay- Lots of restaurants, bars, pharmacy, grocery right down the street. Fulton street station is around the corner for subways. Highly recommend!","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Best price, location and stay","lang":"en","publishedDate":"2022-09-05","publishedPlatform":"MOBILE","rating":5,"text":"So convenient to one plaza, China town and little Italy. Moved our daughter into 182 Broadway the location was perfect!  Out studio was just the right size for a weekend stay and the roof top terrace had amazing views.  We will be back!","travelDate":"2022-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"College drop off trip","lang":"en","publishedDate":"2022-09-02","publishedPlatform":"MOBILE","rating":5,"text":"We stayed at Sonder City Hall during our Kids College drop off. The room was very spacious clean with all the amenities. Everyone at the reception was always helpful and accommodating. Highly recommended!!","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"USA holidays east coast","lang":"en","publishedDate":"2022-08-28","publishedPlatform":"MOBILE","rating":5,"text":"We had a great experiance in Sonder NYC \nI really recommend Sonder to anyone, Looking forward for another holidays at Sonder. A big thanks for the whole team at 17th John Street in NYC\nAlso the location it’s very good","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Enjoyable stay at Sonder City Hall NYC !!","lang":"en","publishedDate":"2022-08-26","publishedPlatform":"MOBILE","rating":5,"text":"I had a nice experience to stay at Sonder City Hall Park NYC, the location is great, it’s convenient to take subways to explore the city. The studio room itself is spacious and clean.  They have all the amenities I need for a week long stay with family.  I definitely will stay at Sonder for future travels.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great stay in NYC","lang":"en","publishedDate":"2022-08-10","publishedPlatform":"MOBILE","rating":5,"text":"Friendly staff, clean room, nice view, huge bed, great bathroom, everything was very good. Very nice rooftop in the building. Sonder app works amazing. Last minute we received a notification that we were staying in another Sonder building close to the one we originally stayed. This was no problem at all, everything was great eland went smooth.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Magnifique appartement très bien équipé","lang":"fr","publishedDate":"2022-08-09","publishedPlatform":"OTHER","rating":5,"text":"Quelques petits problèmes à l’arrivée très vite réglés grâce à la réactivité de l’équipe de cet établissement. Particulièrement bien situé, très près de la station Fulton st où de nombreuses lignes de métro convergent. Je recommande cet appart hotel +++","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great space, great spot, great deal 👍","lang":"en","publishedDate":"2022-07-27","publishedPlatform":"OTHER","rating":5,"text":"If you are looking for a quiet spot in pulsing Fidi\/Tribeca – this is it. The rooms are spacious, clean and easy to access. It's a safe area in the city and Fulton Subway Station is right around the corner as well as shopping opportunities. Weather you decide to walk over the Brooklyn bridge or to the Riverside Parks or if you take the subway to your highlights...you'll find the possibilities to start your personal NYC experience. And the apartment is also equipped for a cozy night in with a comfy bed, large TV screen and big enough kitchen to prepare a meal. And whenever you need help: the staff is superfriendly and always open to chat. All in all: the best experience in the Big Apple for a great price.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great place in a great location","lang":"en","publishedDate":"2022-07-21","publishedPlatform":"OTHER","rating":4,"text":"Stayed at this property for 17 days while my daughter attended a dance camp.  We appreciated that it was close to major subway hub, Fulton St, and that there were many food options around (however nothing much after 10pm).  Lobby staff were so helpful and amazing! The Sonder App gets a big + from me.  Very user friendly and had everything i needed to answer major questions during and before my stay.   \n\nReason not a 5 star is because there was not a gym on the property (but did have the option to walk a few blocks to one that partnered with), the stove was a bit small and it did not have an oven, and no washer and dryer.  Not a big deal and we made do without these extras but would have been nice for my long stay.    \n\nWould definitely stay here again.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Sonder is the most CONVENIENT “rental agency” I have ever used!","lang":"en","publishedDate":"2022-07-19","publishedPlatform":"MOBILE","rating":5,"text":"Incredibly comfortable & convenient. The location is great. Close to everything!  Huge apartment (for NYC standards). It had a 24 hour real & virtual concierge. I extended my stay for one extra day. Full kitchen with 2 gas stoves, microwave and dishwasher.   I requested a late checkout which was denied (only bummer) . I will definitely stay at this exact Sonder when I return to NYC and I will discover other Sonder properties around the world. The convenience of using the phone to book the stay, to chat with a concierge for ANYTHING, the beautiful, clean apartment, the amazing location, everything was extremely convenient. Even the use of the iPhone as a key was a great touch. As a World traveler, I highly recommend it!  BTW, I stayed in apartment 159, top floor with my 2 boys (10 & 12). It was an unforgettable stay, thanks in big part to Sonder.","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Excellent place in NYC","lang":"en","publishedDate":"2022-07-10","publishedPlatform":"MOBILE","rating":5,"text":"What a fantastic experience.  Best place to be in NYC. The subway is two doors away from the building. The staff is friendly, and the apartment is very comfortable. Close to all attractions in downtown. Plenty of restaurants and supermarkets around.","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23300953,"title":"Long Business Trip - Excellent Place","lang":"en","publishedDate":"2022-07-06","publishedPlatform":"OTHER","rating":5,"text":"The Sonder team were really helpful, friendly and attentive. The apartment was excellent for my long stay for business.  Really good kitchen, desk and enough space to feel that you were not stuck in a box.  \nThe location was close to the subway and a range of restaurants that made it really easy to get around or get a meal if I was late.\nExcellent stay.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Onder is the best kept secret","lang":"en","publishedDate":"2022-07-06","publishedPlatform":"OTHER","rating":5,"text":"Everything is done with excellence from the light fixtures to the mini dishwasher to the laundry room. Great location and couldn't be closer to every subway I needed. I was so impressed and will be back here for sure!","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Tres bon sejour au sonder!","lang":"fr","publishedDate":"2022-07-05","publishedPlatform":"MOBILE","rating":5,"text":"Super emplacement pour lower ma'hattan, visiter ground zrro et Ellis island 👍\nAppartement tres bien equippe , la clim et assez grand pour 3 personnes\nService et accueil efficace\nOn a adore notre sejour, merci !","travelDate":"2022-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great solution for extended stay business housing","lang":"en","publishedDate":"2022-07-03","publishedPlatform":"OTHER","rating":5,"text":"I spent two months in a couple of different rooms at this property as part of a corporate relocation.  Quality of furnishings, cleanliness, functionality of amenities all exceeded my expectations.  It provided a great value for money compared to other options.  I would highly recommend for anyone trying spend some time in Manhattan while avoiding astronomical cost of corporate housing providers and also the uncertainties that come with Air bnb etc...  It seemed like a big commitment to prepay in advance without having seen the rooms but Sonder really delivers, what you see on the website is in fact what you get.\nI will absolutely consider Sonder properties for family holidays or business travel in future.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Amazing Birthday Trip","lang":"en","publishedDate":"2022-06-17","publishedPlatform":"MOBILE","rating":5,"text":"The room looked exactly like the pictures and everything was clean and neat upon arrival. I had a special request to have the room decorated for my fiancé birthday, and they did just that! It was beautiful. I had no complaints! Every question and request I had it was fulfilled. I will definitely be booking with this company again.","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Fantastic","lang":"en","publishedDate":"2022-06-15","publishedPlatform":"MOBILE","rating":5,"text":"Loved it. Nate was excellent. Favorite Sonder yet. Free laundry which is helpful. Also loved the location and really enjoyed the apartment layout. Would definitely stay here again and look forward to it on my next trip.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Sonder Rules","lang":"en","publishedDate":"2022-06-13","publishedPlatform":"MOBILE","rating":5,"text":"I loved the apartment I rented in NYC this weekend it was spotless, a great location, friendly staff and a really spacious apartment. I’ll be coming back here again and would highly recommend them to everyone","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Nice view from room 1203","lang":"en","publishedDate":"2022-05-21","publishedPlatform":"MOBILE","rating":4,"text":"Very convenient Sonder.you can walk 5 steps to Duane pharmacy. 1\/2 mile away to shopping - Lululemon, Gucci, etc   Subway stop at Fulton street is 100feet away.  The rooms can range from a studio (256$ per night with a king bed and small kitchen) to nice big rooms (room 808 which has a walk in closet, a triangular dining table, and a separate kitchen room. Rooms are very clean. I like the fact that you don’t have to have your room clean every day. If you need more towels you go through the app. You use the app to launch a mobile key that will get you into the Sonder and into your room. If you happen to have an issue like we did, where the air conditioner just stopped working,  you use the app to report an issue. Or in our case, we just told the front desk.","travelDate":"2022-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great stay","lang":"en","publishedDate":"2022-05-15","publishedPlatform":"MOBILE","rating":5,"text":"Great stay ! This Sonder matched the description ! Very well located next to the metro, very big room, clean ! evrything you need in the building and already inside the room !  I recommand this place !","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23300953,"title":"Great location, fantastic setup!","lang":"en","publishedDate":"2022-05-03","publishedPlatform":"OTHER","rating":5,"text":"My wife and I were very pleased with our recent stay here. We had a large bedroom, an eating area, a small but full featured kitchen, and even a desk to work out of. The location is literally minutes from WTC, right next to the Fulton St. station, and ideal for commuting anywhere. The price was also very competitive. Overall, we'd definitely stay here again.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Cem mimaroglu","lang":"en","publishedDate":"2022-05-02","publishedPlatform":"MOBILE","rating":5,"text":"Best front and service team ever namely Robbie, Nate, Anita, Kumar, Jen, Lavon, Ava and Jose\n\nThey were very professional and responsive\n\nStayed there for 2months. Great location and value. Best sonder ever","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"NYC sonder city hall","lang":"en","publishedDate":"2022-04-24","publishedPlatform":"MOBILE","rating":5,"text":"Perfect location and great place to discover New York! Everything you need is in the appartement and shops nearby. Friendly reception and different services offered if needed like washing machine or lockers for the day of checkout. We will come back!","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23300953,"title":"Cozy environment","lang":"en","publishedDate":"2022-04-02","publishedPlatform":"MOBILE","rating":5,"text":"Nice stay and good location for public transport. The subway is two minutes away. Good space. The only problem is that the laundry has few machines - two washing machines and three dryers - and the chrome cast in my tv wasn’t working full time (dunno why). It compensates for the cozy environment and amazing staff - Cecile is worth mentioning. She is special!","travelDate":"2022-03","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23300953,"title":"Perfect stay","lang":"en","publishedDate":"2022-03-16","publishedPlatform":"MOBILE","rating":5,"text":"Insanely spacious and spotless clean apartment with all the amenities of home. The location is superb and just a few blocks from One World Trade Center. Sonder City Hall Park is my new favorite place to stay in NYC","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Excellent room condition and services","lang":"en","publishedDate":"2022-02-13","publishedPlatform":"OTHER","rating":5,"text":"Great room service, great price at the heart of Manhattan. \nImpressed by the condition of kitchen and appliances, they are all new. \n\nVery friendly room services too. The nearby parking lot is also a plus.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23300953,"title":"Well equipped corporate housing","lang":"en","publishedDate":"2022-02-13","publishedPlatform":"MOBILE","rating":5,"text":"Great for long stays with friendly staff, all the essential amenities and perfect location for anyone who wants to be in Lower Manhattan.\n\nI loved the Sonder concierge service as they can customize your stay very quickly even while they’re remote.","travelDate":"2022-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"Incredible stay - the rooms are HUGE, modern and have everything you need.","lang":"en","publishedDate":"2022-02-09","publishedPlatform":"MOBILE","rating":5,"text":"Stayed at Sonder on John St for a 6 week business trip and highly recommend the property.  The rooms are huge (for NY standards!), come with everything you need from kitchen appliances to the comforts of home, and the staff are extremely accomodating and friendly.    The rooms are super clean and modern, with beautiful finishes.   AAA+ !! \n\nThank you to Chelsea and the front desk team for a wonderful stay.  We will be back!","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Home away from home","lang":"en","publishedDate":"2022-02-09","publishedPlatform":"MOBILE","rating":5,"text":"Home away from home! We come to the city often for work and have stayed at many different apartment hotels and this is the best! Location is prime and the front desk staff (Chelsea, Cecile, Lavon, Jen and Ava) are awesome too…very friendly and helpful…They make a difference! Can’t recommend enough!","travelDate":"2022-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23300953,"title":"Great staff great stay would return anytime","lang":"en","publishedDate":"2022-02-07","publishedPlatform":"MOBILE","rating":5,"text":"This location in John street was great the building is amazing and the staff including Cecile, Lavon, Nate, Ava, Chelsea, Jennifer were all extremely helpful, knowledgeable, and polite during my stay. I would stay at Sonder City Hall Park anytime!","travelDate":"2022-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23300953,"title":"What a wonderful stay","lang":"en","publishedDate":"2022-02-06","publishedPlatform":"OTHER","rating":5,"text":"We stayed at Sonder City Hall Park for three weeks in January and we were impressed by the quality of service, overall experience and the attention to detail offered by this establishment.  \nAll staff were very very helpful, especially Nate, Chelsea, Jen, and one other girl that I couldn’t remember her name.    If you need a place to stay for more than a couple of days, this spot should be on the top of your list.   \nLocation was amazing.  It’s literarily in the middle of everything and you have half of all subway trains offered by NYC just steps away.  \nView was also amazing from our room on the 13th floor.","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"5 Star Service !","lang":"en","publishedDate":"2022-01-20","publishedPlatform":"OTHER","rating":5,"text":"Had a great time with my wife in the city and this stay made it all worth it! Very clean and request are answered with no hesitation. We were greeted by Chelsea and received a tour of the place. She also gave us recommendations to local dining which worked out great.\nWill definitely recommend to family and friends!","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Manhattan","lang":"en","publishedDate":"2022-01-19","publishedPlatform":"MOBILE","rating":5,"text":"This was our first time visiting New York, and our trip was incredible precisely because of Sonder. The check in process was super easy and secure, the staff was phenomenal making us feel right at home. Chelsea was a highlight of our trip, giving directions and suggesting to some really amazing places for us to visit which made our trip even better, she was kind and understanding, making sure we always had what we needed during our stay. We’re really glad we decided to stay at Sonder, and we decided from  now on we will be staying at Sonder when we travel.","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23300953,"title":"Huge and nicely appointed apartment","lang":"en","publishedDate":"2021-07-23","publishedPlatform":"MOBILE","rating":5,"text":"Overall a great experience. Huge studio style apartment with peloton, kitchen, multiple closets, king bed, nice bathroom. Very well done finishes. Quiet building with a 24\/7 security guard. If you are in the city for a long term stay or business trip this is a great option. I am not a fan of the financial district so if on a shorter weekend trip to nyc I would stay somewhere more neighborhood-y and centrally located.","travelDate":"2021-07","tripType":"COUPLES"}
