{"helpfulVotes":0,"locationId":15288822,"title":"Stay z New York","lang":"es","publishedDate":"2024-04-05","publishedPlatform":"MOBILE","rating":5,"text":"Perfect stay, comfortable place and very friendly.\nFarzana and Jeffrey and Leidy are very kind and friendly, personal attention and very perfect excellent treatment, the cleanliness of the hotel is very good. Breakfast is fantastic. The entire work team is great, we leave with the best memories of New York.","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Perfect Visit","lang":"en","publishedDate":"2024-04-05","publishedPlatform":"OTHER","rating":5,"text":"Our stay was wonderful, the staff was very friends and brilliant, Kevin and Leidy were very friendly. I’ll be staying at the hotel anytime I am in New York. The hotel was very clean and the housekeeping team was very friendly too. The breakfast was very good and the hotel is close to a lot of fun places","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"good hotel","lang":"es","publishedDate":"2024-04-05","publishedPlatform":"OTHER","rating":5,"text":"A good stay at the hotel, perfect location and very pleasant service! They have resolved any small inconvenience and made the stay very comfortable. Leidi has been very attentive to us 😁\nThere is a lot of atmosphere in the hotel hall.\n100% recommended","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Terrible experience not worthy of a Marriott hotel","lang":"es","publishedDate":"2024-04-04","publishedPlatform":"OTHER","rating":2,"text":"We went to this hotel because ours had flooded and they relocated us to this one.\nThe hall is terrible and always full of people, suitcases on the floor, children running and nothing pleasant.\nThe rooms are TINY, we couldn't get two people at the same time to move from the bed to the bathroom, which, by the way, is also tiny and only closes with a rickety sliding door that almost touches the foot of the bed. There is no place to store clothes and we had to avoid suitcases to move because they cannot be stored anywhere\nBut breakfast deserves a separate chapter: The worst of MY ENTIRE LIFE and I haven't stopped traveling in 50 years. Paper plates, plastic cutlery, paper cups and thousands of people fighting for a bagel. There are never free tables, but people, even without tables, can continue to enter, resulting in real masses of people with breakfast in hand trying to find a place, sitting in the hall or even on the floor. If you are lucky enough to find a place to have your breakfast you will have several people with their plastic plates full, standing close to you and your table looking at you and waiting for you when you get up.\nThe food is scarce and extremely bad. There is no bread, no toast, just hard bagels and no hot milk.\nThe elevators are always full and take forever...\nI had booked a much better hotel and ended up, against my will, relocating to this one. On my anniversary and with the hope of having prepared this trip for months...\nThey block a deposit and tell you that it will take a few days to be returned, but it's been almost two weeks and we don't know anything about the refund of the money... there are other clients who have been waiting for months.\nI will never stay in this hotel again.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"🔝","lang":"it","publishedDate":"2024-03-29","publishedPlatform":"OTHER","rating":5,"text":"Everything was exceptional, from the courtesy and professionalism of the staff, to the room, new, tastefully furnished and equipped with all comforts, ending with the breakfast, rich, varied, plentiful and of high quality... Sixth time in New York, first time satisfied from all points of view... I will definitely return","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Great location with minor drawbacks","lang":"de","publishedDate":"2024-03-04","publishedPlatform":"OTHER","rating":3,"text":"The hotel is in a great location for a city trip in New York\/Manhattan.\nIt only takes 5-10 minutes to walk to Penn Station\/Madison Square Garden. As is usual in Manhattan, you can get something to eat\/drink every few meters (e.g. Taco Bell etc.)\n\nThe room is bigger than I thought. We had enough space for 5 nights. There is also plenty of storage space in the bathroom.\n\nThere is shampoo etc. in the shower, everything is clean.\n\nThe bed is comfortable.\n\nA big MINUS point is the very loud ventilation. Regardless of whether the air conditioning\/heating is on - the ventilation does not turn off and is very loud. You can even hear it through earplugs. I find that very annoying.\n\nAs often mentioned in the reviews, another problem is the elevators. There are only 2 for 14 floors. Sometimes you wait 10-15 minutes for one to come and then sometimes it stops at almost every floor and takes forever for the door to open completely and close again.\n\nThe breakfast is edible but that's it. It's not tasty. There's far too little space and it's completely overcrowded. We traveled in the off-season and still had to eat standing up. The selection is OK - typically American. The scrambled eggs tasted like unseasoned liquid plastic. And as is (unfortunately also usual) all cutlery\/crockery is disposable. Breakfast was included, so it wasn't that bad. If we had paid extra for it, though, I would have asked for it back. \n\nAll the staff are very nice. \n\nThere are two WiFi options - the free (\"slow\") one is completely sufficient and it loads everything without any problems. Videos etc. too. \n\nAll in all: a hotel that is great to book for a city trip if you're a deep sleeper and like to eat breakfast outside :-)","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Just not worth the money. At best this is 2 star","lang":"en","publishedDate":"2024-02-24","publishedPlatform":"OTHER","rating":1,"text":"I had to make a point of writing this review after just one night stay here. \n\nThe rooms are small. Way smaller than advertised. The TV in the room faces the wrong way to everything else. Don't know who designed it.\n\nThe worst parts. Up all night as the rooms are not sound proofed. Gaps around doors means you hear EVERYONE who comes through the hotel.\n\nWent down for breakfast (,not enough elevators for the volume of people so be prepared to take the stairs)\n\nBreakfast. We had no where to sit so had to take breakfast back to our room and eat it on the bed, using the paper plates provided by the hotel and plastic cutlery. \n\nOverall. Worst hotel I've stayed in for a long time, and it's just been one night. Moving to a different one from today!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Not a bad wee spot","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"MOBILE","rating":5,"text":"We travelled over from Ireland for a few days in New York.  One of our party had wheelchair access and we found it quite easy to get into the lobby and to the rooms. It is quite local with plenty of bars and restaurants close by. 10 minutes walk to the main times square areas and 5 minutes walk to Madison Square garden.  The breakfast was quite good. Scrambled eggs and sausages available. With plenty of crumpets and bagels which were refilled regularly. Nuts , fruit and cereals also available. Lobby staff and security at night were very friendly always greeting people and wishing them a good day. There is also a shop in the lobby for snacks and drinks. The hotel looks very modern and the beds were comfortable. There is a large TV in the room with lots of channels. There is safe and a fridge which came in handy. There is a coffee machine also. The price is very reasonable for the location. My only qualm is that the bar staff did not interact at all with the guests. We sat at the bar and were charged double for our drinks although this was later put back on my card when I complained although it took a few days. This led us to go elsewhere for more drinks as we felt we could better service elsewhere. Which we did. Apart from that it was great. I would definitely return which and plan to do in the future.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great experience","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"MOBILE","rating":5,"text":"This is a great hotel in a good, safe location. Some of the negatives in prior reviews were not issues we experienced. The room was good, bed comfortable, staff wonderful, lobby was friendly and fun. The breakfast, 6-11 am, had many choices, including nuts, fruits, dried fruit, oatmeal, bagels, muffins & potatoes for my vegans. The only downside is the elevator floor button sometimes did not work properly.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Fantastic location in NYC","lang":"en","publishedDate":"2024-02-11","publishedPlatform":"OTHER","rating":5,"text":"Stayed for three nights prior to taking a cruise from Manhattan. It’s an excellent location off 8th Avenue and minutes from Penn station making it easy to take the train from JFK. Friendly and informative checkin just in time for the nightly drinks reception which was very welcome. New York room sizes are rarely big but our room was more than big enough, very clean and a good bathroom. Breakfast was included and there was plenty on offer from an early hour meaning we could get out exploring as soon as possible. We never had any issues with the lifts nor did we see any less fortunate people hanging around the street. \n\nIt’s handy for everywhere and with the traffic as bad as it is in NYC is a great base for walking which is the best way to see the city. Easy walk to Circle line for the boat tours and if you don’t have masses of luggage the Manhattan Cruise terminal is walkable and probably quicker than by taxi. Subway close by and plenty places to eat and drink nearby - The Tailor Pub is good and only two minutes away. Highly recommended","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Never again","lang":"it","publishedDate":"2024-01-28","publishedPlatform":"MOBILE","rating":2,"text":"Camera piccolissima anche per gli standard di NYC, climatizzatore talmente rumoroso da sembrare un trattore, letto comodo più o meno, colazione dozzinale con camerieri che ti tolgono tutto dal tavolo appena ti alzi per prendere qualcosa dal buffet. Per non parlare poi degli ascensori … ore di fila per salire o scendere. Insomma per me è un no, mai più","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15288822,"title":"Ultra quiet","lang":"en","publishedDate":"2024-01-14","publishedPlatform":"MOBILE","rating":5,"text":"This was probably the quietest Manhattan hotel I’ve ever stayed at. For two straight nights, I didn’t hear a single horn or siren, and the HVAC operated in total silence. Would definitely stay here again just for that. Rooms were small, of course, but spotless and comfortable.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15288822,"title":"Reservation but no room for us!! ","lang":"en","publishedDate":"2024-01-09","publishedPlatform":"MOBILE","rating":2,"text":"Booked to stay in this hotel. 1st timers in NYC celebrating our 15 year anniversary. Arrived at hotel after a long journey only to be told casually they had no room for us and they booked us into a different hotel across the street. Very inconvenient and not a great start to our trip! \nThe lobby area was extremely busy.. we did get to experience breakfast at the hotel, it was OK for free. Hot items were cold and it was too busy. Disappointed,  but thankfully we stayed in the Voco across the street and ended up liking it better. ","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Theft","lang":"en","publishedDate":"2024-01-03","publishedPlatform":"OTHER","rating":1,"text":"The hotel receptionist asked for a $100 deposit. We paid by card, they assured us that this is a normal procedure and after the stay the money will be returned within 2-4 weeks. 4 months have passed. We did not get the money back. So disappointing, don't recommend.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Enjoyable stay in a good location","lang":"en","publishedDate":"2023-12-26","publishedPlatform":"MOBILE","rating":5,"text":"I really liked this one. Walkable to a ton of stuff, including Hudson Yards, Penn Station. Clean, quiet room with a comfortable bed. Helpful staff in midtown. I plan to use this location again. The free breakfast had a lot of decent options. This is a good choice for the area.","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15288822,"title":"Treated badly","lang":"en","publishedDate":"2023-12-24","publishedPlatform":"OTHER","rating":2,"text":"On the day of my check in I received an email at around 7am from an Anthony Li from the hotel saying my credit card wasn't working.  The email said I had to update it by 6pm or the reservation would be canceled and to please reply all to confirm.  Just one hour later at 8am I updated my CC in my account via the Bonvoy app.  I emailed back at 8am (10hrs ahead of the deadline!) saying I had updated it and asking if there was anything else I needed to do.   No one replied.  I landed at JFK that evening and logged in to the Bonvoy app only to find the booking had been canceled.  I called reservations and they offered no sympathy or help to the situation.  They said there was nothing I could do and I needed to book a new room.  So I did.  Then I got to hotel, checked in and then when I got to my room I see it's a tiny room with a double bed even though i'd booked a King Studio.  The check in person knew he was downgrading me but did not say anything.  I called the front desk and they said \"it's because of availability\".  I said \"but why wasn't I told that at check in, I booked a King\".  They realized they had screwed up when they looked up my Marriott status I think so they offered me some points to make up for it.\n\nWhat a terrible experience. \n\nOn top of this, the hotel is fine, but it is way too crowded with not enough elevators. If you stay here be prepared to wait 5-10 minutes on weekends just to get in an elevator.  \n\nI won't be staying here again after this experience.  The front desk team need to shape up.\n\n","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15288822,"title":"NYC trip with friends","lang":"en","publishedDate":"2023-12-10","publishedPlatform":"OTHER","rating":4,"text":"The rooms are small but extremely clean. Breakfast was good  and  included and although I'm not a fan of the disposable cutlery\/plates the coffee was probably the best I ever had in NYC. The location is central and just 2 blocks away from Penn station. I stayed in that neighborhood before the pandemic and you see a lot more homeless and pot smokers in that area. Would stay again. ","travelDate":"2023-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15288822,"title":"Non andateci","lang":"it","publishedDate":"2023-12-05","publishedPlatform":"MOBILE","rating":1,"text":"All’arrivo abbiamo pagato 300 dollari a titolo di cauzione. Quando abbiamo lasciato la stanza ci hanno detto che la somma sarebbe stata restituita entro pochi giorni. È passato più di un mese e non abbiamo ricevuto nulla, nonostante numerose mail e solleciti che abbiamo mandato alla struttura, che non ha mai risposto, e a Booking. Comportamento inqualificabile. Sconsiglio vivamente questo albergo.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Good except for the elevators","lang":"en","publishedDate":"2023-11-29","publishedPlatform":"OTHER","rating":4,"text":"Overall, this was a really good hotel for sightseeing in NYC. The beds were comfortable. The room was quiet. The free breakfast wasn't great but adequate. Our family of 4 enjoyed having 2 queen beds as opposed to 2 doubles that many NYC hotels have.\n\nUnfortunately, there is one major issue in this hotel: the elevators. There simply aren't enough elevators to service the whole hotel. After waiting an inordinate amount of time in the lobby, you just hope to get a spot going up to your room. We were fortunate being on the 2nd to top floor because it made getting a spot on the elevator easier. We stopped at at least 3 floors after there was no more room to cram even one more person. If you need to catch a show or a flight or be anywhere on time, allow at least 30 mins to get from your room to the lobby. Or just plan on walking down the steps.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Amei a experiência, quero voltar!","lang":"pt","publishedDate":"2023-11-27","publishedPlatform":"OTHER","rating":5,"text":"Hotel maravilhoso, bom atendimento, limpo, confortável e em ótima localização. Tinha um funcionário que falava português então foi tudo bem tranquilo. Ficamos uma semana por lá, tinha café e um chocolate quente delicioso free na recepção.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Great experience","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"OTHER","rating":5,"text":"The Hotel is well located, close to many attractions but not in a extremely crowded area. The Vessel, the High Line and Times Square are few minutes walking from the Hotel. The metro station is also one block away. Although the Hotel is well located, it does not seem to be located in the safest street, and during the night we did not few really safe. Bare in mind this is not the safest NY area, but the Hotel street is particularly empty during the night.\nThe rooms were clean and well maintained, the service was really good, including the reception which was always helpful. Congratulations to Pedro, which was making the tables ready for breakfast and was always friendly.\nThe breakfast was good but it was the same every singles day and there were not many options.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"buena estancia, mal servicio","lang":"es","publishedDate":"2023-11-07","publishedPlatform":"OTHER","rating":1,"text":"La estancia estuvo fenomenal, el hotel bien en rasgos generales, desayuno variado, buena atención...\nEl problema vino al salir. Nos envían una factura con nuestra estancia y un balance a 0. Horas mas tarde, nos envían una segunda factura incluyendo una botella de agua de la habitacion, la cual no hemos consumido.\nContactamos con el departamento de atencion al cliente de MARRIOT para pedir solucion y nos dicen que contactaran con nosotros en un plazo de 3 a 5 dias. Esto fue el 15 de Octubre!!!! a dia de hoy no hemos recibido noticia alguna, el dinero tampoco ha sido reembolsado y por mas correos electronicos que enviamos no responden! \nUna pena ensuciar asi nuestra estancia","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Gutes Hotel in Manhattan!","lang":"de","publishedDate":"2023-10-26","publishedPlatform":"OTHER","rating":5,"text":"Das Hotel hat uns gut gefallen. Sauberes Zimmer, nettes Personal, gute Lage, leckeres Frühstuck. Zwischen 17 u. 18 Uhr gibt es die Bierstunde. Das Hotel kann mit dem Transfer zum Flughafen helfen. Gerne kommen wir wieder!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"An oasis of customer service ","lang":"en","publishedDate":"2023-10-07","publishedPlatform":"MOBILE","rating":5,"text":"Great experience at this really conveniently located hotel. Upon check in we were invited to 'Happy hour' at 5pm with free drinks and snacks....they had live music, beer, wine, cheese,  cold cuts, etc. Wasn't loads but really set the tone of a customer focused hotel and to get anything in Manhattan untaxed, never mind for free is nothing short of extraordinary! The rooms are small but perfectly formed and have all you need and large rooms in manhattan are as rare as free drinks! Best thing though was the staff from the receptionist on check in (who later served me my free drinks) the breakfast team and the lovely porter with the mohican who quickly and efficiently stored our luggage after check out, they're all an asset to the hotel....they seem to really enjoy their jobs and I'm guessing there's some good managers here who know how to look after their team! ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"🔝","lang":"it","publishedDate":"2023-09-23","publishedPlatform":"OTHER","rating":5,"text":"Tutto eccezionale, dalla cortesia e professionalità dello staff, alla camera, nuova, arredata con gusto e dotata di tutti i comfort, per finire con la colazione, ricca, varia, abbondante e di qualità... Sesta volta a New York, prima volta soddisfatta sotto tutti i punti di vista... ci ritornerò sicuramente\n","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great hotel in Hell’s Kitchen","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"MOBILE","rating":5,"text":"This hotel was a great stay despite being in the middle of DT NY. The room is small and basic, but clean and comfortable. Ask for an inside room facing courtyard for a quieter stay. Would recommend and will stay again. Free beer and wine nightly at the bar during certain hours.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Prezzo eccessivo per quanto offerto ","lang":"it","publishedDate":"2023-08-31","publishedPlatform":"MOBILE","rating":3,"text":"Camera minuscola e insufficiente per posizionare le valigie. Letti comodi e camera abbastanza silenziosa. Colazione delirante: posti a sedere insufficienti per il numero di persone che speso sono costrette a portare  cibo in camera. A seguito di questo anche il traffico nei 2 unici ascensori presenti (usati anche dal personale di pulizia) durante il periodo della colazione porta a lunghe attese. Posizione comoda a pochi passi dalla metropolitana e dal Madiaon Squarr Garden. Personale cordiale e disponibile\n","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Good hotel for tourists, would recommend ","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"MOBILE","rating":4,"text":"The hotel is ideally located for tourists in New York City, less than a 15 minute walk from Times Square, The Empire State Building, Hudson Yards and Broadway, and only 5-10 minutes from major subway lines that will take you to other attractions. Penn Station (and Maddison Square Gardens) is literally around the corner, which is also very convenient.\n\nThe hotel staff are extremely friendly, from the front desk through to the porters and housekeeping. The lobby has a nice modern feeling and the rooms are clean and modern, and reasonable in size for Manhattan.\n\nBreakfast food is ok, however the range of cooked options in the buffet is pretty limited (scrambled eggs, turkey or spicy sausage, and a potato option) and some more fresh fruit would be good.\n\nIn conclusion, I would definitely recommend for a tourist visit to the city (and it would probably be suitable for business too). You could get breakfast out very easily but would end up paying much more.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Non andate non adatto ai standard Marriott","lang":"it","publishedDate":"2023-08-16","publishedPlatform":"MOBILE","rating":1,"text":"Hotel in strada non molto bella come posizione con mokti homeless fuori. L' entrata dell hotel è anonima e sotto il livello strada. Camere piccole e anguste con pochissimo spazio per i vestiti. Colazione caotica con ressa e pochissima scelta, ascensori da incubo!!! Sconsigli l'hotel alla clientela europea. \nNon capisco come sia possibile che sia nella catena Marriott, sinceramente è un livello 3 stelle non 4.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"a 5 min de Times Square","lang":"es","publishedDate":"2023-08-13","publishedPlatform":"OTHER","rating":3,"text":"La ubicación es buena aunque está en una zona con mucha gente durmiendo en la calle. A poca distancia está la Penn Station, que conecta con gran parte de la ciudad. El desayuno poco variado y la habitación muy pequeña pero bien insonorizada. La limpeza fue correcta aunque mejorable. \nLa habitación tenía el inodoro junto con la ducha dentro del baño pero la pica estaba dentro de la habitación. \nEn general, bastante caro para lo que es el hotel. \n","travelDate":"2023-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Good  Experience","lang":"en","publishedDate":"2023-08-04","publishedPlatform":"OTHER","rating":5,"text":"The hotel was clean, quiet at night,  staff was friendly and the breakfast was fresh and good.  It is centrally located and was average priced for the area. We met friendly people at breakfast from different countries which was a plus. We had no issues and would stay again. ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"A convenient way to visit NYC","lang":"en","publishedDate":"2023-07-15","publishedPlatform":"MOBILE","rating":4,"text":"Overall a very good hotel, matching the expectations for this price range. Good service and friendly staff. The room we had (double queen beds and a sofa) was of a good size and with all the expected amenities. The only issue we had was with the noise in the room, probably due to a very loud AC which we had to keep on given the high temps in NYC during our stay.\nBreakfast was good and with decent choices, but ideally you want to be there relatively early on to avoid the big rush!\nThe location is perfect, at walking distance from Times Square and many big attractions, and with very easy access to public transport. \nOverall this hotel is highly recommended if you envisage a touristic visit of New York at a decent price and with good quality).","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Credit Card still blocked after 2 Weeks","lang":"en","publishedDate":"2023-07-15","publishedPlatform":"OTHER","rating":2,"text":"Overall i liked the stay there. But finally i wouldnt come back because they took my money from the credit card which is ok, but they still block this amount of 1700 USD for 2 weeks now, for no reasons. This is the worst customer service ever and its a deep disapointment. I travel a lot but never happened to me like this. For them its maybe not much money but for me it is.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Bad experience! ","lang":"en","publishedDate":"2023-07-05","publishedPlatform":"MOBILE","rating":1,"text":"The breakfast is very very bad. Very few choices and very crowded. You have to wait for some good minutes to find a place to sit...it ruined our mornings... the services were also bad. It is very poor value for money. I do not recommend! The location is good and the room it's ok, but overall I wouldn't come back","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Cuba confirm at Manhattan prices","lang":"en","publishedDate":"2023-07-05","publishedPlatform":"OTHER","rating":1,"text":"You get the comfort of a 3 star hotel from Cuba for about 200$ a night. Customer service is no existing except when you are locked out of the room. The AC was broken in our room (612) an for 3 days we heard only promises that woul be fix. The last night we had to call the front desk to send somebody up to turn it off and then to run it on","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Not Great","lang":"en","publishedDate":"2023-07-01","publishedPlatform":"OTHER","rating":2,"text":"I really average accommodations, which I could look past, but the check in process was a NIGHTMARE. Waited over four hours after repeated concerns that the room would be ready “soon”. I understand they don’t need to honor early check in requests but don’t make us wait, hoping, when clearly it will be a WAIT and they’re nowhere near ready. We wasted half a day in their lobby, and watched nearly every other guest who came in after get checked in ahead of us. No explanation why their rooms were ready but ours took 4 hours. Plenty of other options in the area at this price point. ","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Pour jeunes actifs","lang":"fr","publishedDate":"2023-06-24","publishedPlatform":"OTHER","rating":4,"text":"Hôtel agréable situé près du Madison Square Garden, de Macy's et Penn Station. Très pratique pour rayonner sur New York et sa région, mais aussi arriver de l'aéroport.\n\nL'hôtel est propre, confortable, mais les chambres sont mal isolées au niveau sonore. J'entendais mes voisins et les ascenseurs!\n\nLe staff est sympathique mais pas toujours très professionnel.\n\nLa salle de gym est bien équipée, mais malheureusement en sous-sol. En revanche elle a l'avantage d'être ouverte 24h\/24.\n\nAttention, depuis la crise Covid le quartier est devenu un peu dangereux. Je suis tombé sur des gens se piquant dans une rue parallèle.\n\nEn résumé bien pour des gens jeunes et actifs, moyen pour des personnes mûres souhaitant de la tranquillité.","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15288822,"title":"Great breakfast and quiet rooms","lang":"en","publishedDate":"2023-06-17","publishedPlatform":"OTHER","rating":5,"text":"We arrived at 3pm..the room wasn't read but we sat in the lobby on some nice couches with some fresh lemon water. They didn't tell us our rooms were ready so we had to go ask which was annoying.  They made sure our rooms were on the same floor and just  a few doors apart.   The room was not huge but it is NYC but plenty of space. I wish the bathroom had a regular door not a barn door but it was fine.  Never heard a sound from outside which was a very busy street so that was great!!\nBreakfast was great, such a big area with plenty of seats inside and outside.  They had eggs every day with a different meat and potato each day. I love how long you have to get breakfast it is served until 11!!  I also love how they have a cold or hot water machine. great for filling up my water bottles for the day. In the evening you can get a glass or wine or beer for free from 5-6pm.  They have out some veggies, dip, cheese and fruit.  It was a nice little snack.\nThe hotel was about a 10-15 minute walk to Times Square, Just FYI I would avoid going down 36th to get to 7th Ave, that street was a bit creepier then 37th, or 38th or 40th.  Great stay!!!!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Rooms are very tiny worst then a dorm room. No drawers to put your clothes in, your living out of your suitcase. Worst","lang":"en","publishedDate":"2023-06-04","publishedPlatform":"MOBILE","rating":1,"text":"Worst hotel I ever stayed at\nDon't stay here\nRooms are tiny no drawers to put your clothes away \nYour living out of a suitcase worse then a dorm room \nElevators are very slow\nBreakfast is awful go out for breakfast \nSo disappointed in a MARRIOT hotel","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Nos cobraram 2 vezes pelas diárias no débito!","lang":"pt","publishedDate":"2023-06-03","publishedPlatform":"MOBILE","rating":1,"text":"nos cobraram 2 vezes pelas diárias no débito! era o dinheiro da minha viagem! ( não estou falando do depósito) ! precisei fazer um empréstimo para comprar mais dólares! irei resolver na justiça! e o hotel não vale nem 50 dólares por dia! péssimo, estragou minha viagem","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Très bon hôtel remarquablement bien situé!","lang":"fr","publishedDate":"2023-05-23","publishedPlatform":"OTHER","rating":4,"text":"Cet établissement est situé à 2 pas de Time Square et permet de circuler dans Manhattan avec beaucoup de facilité. Le personnel est attentif dans l'ensemble mais les différentes Concierges manquent souvent de connaissances précises et donnent parfois des réponses surprenantes! La chambre était confortable bien que petite et la propreté irréprochable chaque jour (6 nuits); la salle de bains était bien équipée, un peu étroite. Happy hour de 17h à 18h au bar de l'hôtel. Service de demande de taxi rapide et efficace. Navette très intéressante pour JFK (85USD forfaitaire).\nLe paiement se fait à l'arrivée avec une caution de garantie de 300USD mais en fait on est débité qu'après le départ de la somme prévue pour le séjour.\nUn grand buffet de petit-déjeuner...un peu chargé entre 8h et 9h!\nUn hotel plutôt sympathique et remarquablement bien situé.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Assistenza 0, esperienza da dimenticare","lang":"it","publishedDate":"2023-05-16","publishedPlatform":"OTHER","rating":1,"text":"Esperienza da dimenticare, capitati in questa struttura per caso, abbiamo trascorso io e mia moglie due notti, e non siamo mai riuscito a dormire, il condizionatore era rotto e faceva molto rumore, abbiamo segnalato la cosa e il tecnico è uscito 4 volte in 2 notti, sistemava la cosa è dopo poche ore ancora rumore. Al momento della partenza lo abbiamo segnalato e ci hanno garantito un rimborso di 65$ entro 10gg, soldi mai visti, ridicoli!!!! Abbiamo anche lasciato una cauzione di 100$ anche questa mai rivista dopo un mese, e dopo aver mandato 2 mail a cui non hanno mai risposto RIDATECI I NOSTRI SOLDI!!!\n\nExperience to forget, happened upon this property by chance, my wife and I spent two nights, and we never managed to sleep, the air conditioner was broken and made a lot of noise, we reported it and the technician came out 4 times in 2 nights, fixing the thing is after a few hours still noise. Upon departure we reported it and they guaranteed us a refund of $65 within 10 days, money never seen before, ridiculous!!!! We also left a $100 deposit also never reviewed after a month, and after sending 2 emails that were never answered GIVE US OUR MONEY BACK!!!","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Decent","lang":"en","publishedDate":"2023-05-09","publishedPlatform":"OTHER","rating":4,"text":"Nice clean hotel centrally located in Manhattan, close Times square, Broadway, Hudson Yards, The Highline and very close to 34th Penn metro\/train station so easy to get around. We got there from Newark by NJ transit for $15 and walked 2 blocks, went back to Newark in the early hours so got an Uber for $65, took less than 30 minutes at that time.\n\nRooms are small but this is central Manhattan and adequate for 2 with room for cases. Clean, pretty new fixtures and fittings.\n\nOnly complaint is the breakfast, just hopelessly too small. We ended up going when it opened to save the stress of findiung an table. But can't complain otherwise and would recommend it to anyone! ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Horreur à Fuire","lang":"fr","publishedDate":"2023-05-08","publishedPlatform":"MOBILE","rating":1,"text":"Une honte pour un établissement de ce type, nous sommes restés 6 nuits et le ménage a été fait une seule le lendemain de notre arrivée. Malgré mes demandes quotidiennes, nous n’avons pas eu le ménage de fait. C’est une honte. Hôtel à fuire impérativement. Un manque d’organisation flagrant.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great staff with flare and smiles. Small rooms in Manhattan but a good visit.","lang":"en","publishedDate":"2023-04-25","publishedPlatform":"OTHER","rating":3,"text":"All my reviews use the same format, so it isn't just a general review, but breaks out each area and then a total score. Any questions, please let me know.\n\nThis was a business trip for a single traveler. \n\nARRIVAL:\nArrived at the hotel from LGA. This hotel is a great location in Manhattan in the Garment District and a 12 minute walk to Times Square. My Uber from the airport took about 40 minutes which is not bad seeing as it was mid-afternoon. \n\nCHECK-IN:\nI was quickly checked in by a friendly and smiling front desk. They provided me a high-level overview of the hotel layout, including the bank of elevators that had a gremlin in it (wasn’t working right), and the complimentary happy hour (wine and beer tasting) as well as the breakfast. Super easy process took about 4ish minutes. \n\nPROPERTY:\nThe hotel shares with another Marriott property, so it CAN be crowded, especially in the morning for breakfast. The lobby, floors and elevators all were clean and managed. My room rate was $297 per night for three nights, which is not bad at all in Manhattan. The reason why I chose this was a meeting we held with a customer. They had already booked here, so to make it easier, we did as well. Normally I stay at the now closed Midtown Marriott. I have no complaints about the overall property in general\n\nROOM\/ACCOMODATIONS:\nIf you have been to NYC, you know that many rooms are small. I will say that the rooms here are the smallest I have encountered. Just over 248 sq\/ft was my corner room 521. There is a couch with a desk area facing the window once you enter, a VERY small closet, fridge and microwave, coffee maker, you know the standard. There is NO place to put your suitcase away and only two drawers on each side of the bed to put clothes away. I always unpack. Doesn’t matter how many or few days. \n\nThe bed is low to the ground, more so than other hotel beds, unless you are in Asia. It was a king and it was comfortable. \n\nBathroom is super small, which was to be expected given the overall room size. Nice shower and a clean bright white. \n\nThe overall lighting in the room, from the fixtures could be improved in the couch\/desk area. It is a little bleak. \n\nSTAFF\/SERVICE:\nAs I said before, the staff was always super friendly and helpful. From the bartenders to the meeting room staff, EVERYONE was great. Other high-end properties in Manhattan need to take a visit and see how they do it. \n\nFOOD:\/BAR:\nI visited the bar once late at night after coming back from a dinner. Drinks were good. Ordered an old fashioned and a vodka-soda with cran. All were done well. \n\nThere is a grab and go area to the side of the check-in counter with the basic snacks, water, etc. \n\nBreakfast is a tad crazy with ALL the people from both hotels converging on it. One morning I grabbed some eggs, sausage and potatoes. All items were very salty and I could not eat it so I grabbed a banana and a muffin. Blueberry was good!\n\nSUMMARY:\nFor the price the hotel was nice. Rooms were on the small to tiny side, so not fitting for more than one person, but you can make it work in a king if you don’t mind using the couch for your suitcases. \nI loved the staff. That made this review easier for me. Would I come back? Yes, if I needed to be right in this area. I would not turn people away. \n\nScoring:\nCHECK-IN: 10\/10\nPROPERTY: 7.0\/10\nROOM: 6.5\/10\nSTAFF\/SERVICE: 10\/10\nFOOD\/BAR: 7.5\/10\nOVERALL WEIGHTED: 8.2\/10\n","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Navigating Confined Quarters: A Frustrated Review of SpringHill Suites in NYC","lang":"en","publishedDate":"2023-04-02","publishedPlatform":"OTHER","rating":1,"text":"As a distinguished traveler with a discerning taste for luxury accommodations, it is with great reluctance that I must concede that my recent stay at The SpringHill Suites in NYC was not my first choice, as the local lodging options were unfortunately limited.\n\nDespite my initial reservations, I found the hotel staff to be exemplary, providing a level of service that was both hospitable and efficient. The check-in and checkout process was a breeze, and the staff went out of their way to ensure that my needs were met throughout my stay.\n\nHowever, my experience with the facilities left something to be desired. The elevators were an endless source of frustration, with long wait times and a constant crush of fellow guests that made it difficult to move between floors in a timely manner.\n\nThe rooms themselves were also a point of concern, as the lack of space made it difficult to navigate without feeling cramped and confined. Moving the small chair in the room was a logistical nightmare, as it effectively blocked the exit and made it impossible to leave without first rearranging the furniture.\n\nTo add insult to injury, the bathroom door was a flimsy sliding barn door that provided little to no privacy, compounding the overall sense of claustrophobia that permeated the room.\n\nDespite these shortcomings, I must concede that the limited breakfast selection was passable, if not entirely satisfying.\n\nIn conclusion, while The SpringHill Suites in NYC may not be the ideal choice for discerning travelers, its top-notch staff and reasonable amenities make it a viable option for those willing to overlook its shortcomings.","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Mixed Bag","lang":"en","publishedDate":"2023-03-28","publishedPlatform":"OTHER","rating":3,"text":"I don't like to be totally negative so let's start with the positive.  We found the front desk staff to be warm, inviting, and accommodating upon our arrival and departure.  The lobby was spacious and clean.  We were in town for 4 days and the hotel location was convenient to all of our predetermined destinations.  The breakfast was a bonus and satisfactory as we are both not huge breakfast eaters.\n\nNow to the reason we will not return.  How small can a room be to qualify as a hotel room?  Our hotel room could best be described as a micro-room.  We had NO space for our luggage (2 small carry-ons) and did not have room enough for 2 people to change clothes at the same time.  Our room was so small that we had to open the room door to set up the ironing board.  Shame on Marriott for offering this to their clientele.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"They do not return deposit. No devuelven depósito.","lang":"en","publishedDate":"2023-03-28","publishedPlatform":"OTHER","rating":1,"text":"I stayed at the hotel in January.  It's almost April and they haven't returned my $300 deposit.  I communicated by email asking for the OPERATION NUMBER and they did not send it to me.  I need my money.  When they send me the operation number that shows that they have returned my money, I will change my rating. \n\nme hospede en el hotel en enero. ya casi estamos en abril y no me han devuelto el depósito de $300 dólares. Me comuniqué por email pidiendo el NÚMERO DE OPERACIÓN y no me lo envían. necesito mi dinero. cuando me envíen el número de operación que demuestre que han devuelto mi dinero cambiaré mi calificación.","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15288822,"title":"Friendly Professional Staff","lang":"en","publishedDate":"2023-03-25","publishedPlatform":"OTHER","rating":5,"text":"We traveled to the Fairfield Inn & Suites 36th St with a large group. Staff was amazing & accommodating. I watched Jeffrey at the front desk engage guests cheerfully night after night; and Omar at the bar was friendly, engaging, and professional. I rarely thank hotel staff for their courtesy and professionalism, but this team was top notch. Can't say enough about them.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Reasonably priced good hotel","lang":"en","publishedDate":"2023-03-24","publishedPlatform":"MOBILE","rating":4,"text":"Excellent stay. We stayed four nights in King room with terrace. The room had lovely comfortable bed, small sofa, safe, wardrobe with ironing board and steam iron. Fridge and coffee machine and desk and chair. As the room was small it meant one side of bed was close to glazed terrace door and the door to bathroom at the foot of bed so it was quite difficult to move round at night. The bathroom had lovely hot shower and large toiletries and towels and hairdryer.  We had booked room with terrace but as it was cold weather we did not use it and the cold came through the glass so we had to keep the blind down to keep the room warm. That said if the weather was warmer the terrace would be a bonus. The room was clean and housekeeping came everyday. Sheets changed on the third day. There was huge TV and provided you had own subscriptions easy to access Netflix etc. Good free wifi. \nI agree the lift is slow but we were only on 2nd floor so could walk down stairs. The breakfast had a good choice so long as you got there before 9. It was always busy and 7.30 seemed the best time. They also do a happy hour at the bar 5-6pm where you can get small glasses of wine or beer and nibbles. Very nice. We only did it once as we were normally out till later. \nOn our last day we booked transfer to JFK with the lady in the hotel. We had minibus that went to another hotel to collect more passengers, we had been advised of this when we booked. It was 75$ and took 1hr 45 but we were travelling at 5pm and had been told this was busy time. We were happy with this. We had got to the hotel by yellow cab from JFK and that was $96 incl tip. \nThe hotel staff were ALL happy & helpful. \nThe hotel is conveniently located to Times Sq etc and to Penn St subway to travel further.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Average","lang":"en","publishedDate":"2023-02-19","publishedPlatform":"MOBILE","rating":3,"text":"I’ll start with the positives with the hotel, Firstly, i thought the staff were great, always happy to answer any questions we had and were generally helpful. The rooms were an adequate size and well equipped. \n\nNow for the negatives… The elevators at times take an AGE. There was some evenings we waited over 10 minutes to get one. The breakfast each morning was rather chaotic, there was not enough seats for guests, to the point that guests were having to either stand with their breakfast or take it back to their room. Lastly, there was an airport transfer stall in reception. I enquired and booked a transfer to Newark airport. I was told by the lady that this was a car that would pick us up direct to go to the airport. When we were picked up it was actually a bus which then stopped at another 3 hotels then went to the airport. I felt ripped off as a taxi would have actually been cheaper. \n\nI’m returning to NYC in October this year but based on this experience, i’ll opt to stay at another hotel.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Crowded, chaotic and hot!","lang":"en","publishedDate":"2023-02-17","publishedPlatform":"MOBILE","rating":3,"text":"While the hotel staff are nice and accommodating, it does not make up for the negatives at this hotel. \nAs other reviewers have mentioned, the breakfast is crowded and I was never able to get a seat. The elevators take forever. \n\nMy room was clean but it is oddly arranged so it feels super crowded. Housekeeping brought new towels but didn’t empty the trash. \n\nThe worst part of this place is it is so hot!!! Stuffy everywhere you go and my room is unbearably hot. I opened the window but it reeks of weed outside. The conference room is either freezing or stifling. No in between. On my last morning here there was an issue with the hot water but I didn’t care because a cold shower was the only refreshing part of this very stuffy room. \n\nIt’s close to Penn Station and Newark airport but the Crown Plaza on this block is a much better choice!!!!","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great place to stay in Manhattan ","lang":"en","publishedDate":"2023-02-16","publishedPlatform":"OTHER","rating":5,"text":"So, I finally had the opportunity to spend a couple of days in NYC, and then set about choosing a hotel. I knew I wanted to be near Times Square; wanted something clean and comfortable, at a fair price, with no hidden charges (curiously, Pres Biden addressed such monkey business in his recent address).\n\nI found it here! Clean, with courteous service, good location, very fair price by NYC standards.\n\nThe room was tiny—but hey—it’s Manhattan. I was solo; it would have been cozy for a couple. No problem at all.\n\nMy only negative was the elevators—only two for a 12-story (or so) building. Coming down at ‘morning rush’ was a challenge. Fortunately, I was on the second floor, so frequently walked down rather than waiting.\n\nBreakfast was an expansive continental—plenty to eat, fresh and constantly replenished. I didn’t really need lunch!\n\nHighly recommended!","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15288822,"title":"Better than expected!","lang":"en","publishedDate":"2023-02-15","publishedPlatform":"OTHER","rating":5,"text":"I visited Springhill Suites with my Mum during February half term. Having read some of the reviews, I was worried about this place but honestly, I needn’t have been! From the moment we checked in, to the moment we checked out, we had everything we needed. The staff are extremely friendly and there is a lovely atmosphere around the hotel. Everything was smooth and efficient. The room was cleaned everyday and we were given fresh towels, which after a long day of exploring was so wonderful. The breakfast has lots of choice (but it is very busy) and was replenished regularly. People have made complaints about the street it’s located on but we never encountered any problems, even very late at night. Unfortunately, no matter where you go in the world, there will always be things you dislike but this was never an issue nearby to the hotel. It was extremely quiet at night when sleeping. It’s in a great location - we walked to everything! Absolutely perfect for what we needed. Thank you so much for making our stay so easy and stress free! ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Grata surpresa!","lang":"pt","publishedDate":"2023-02-12","publishedPlatform":"MOBILE","rating":5,"text":"Chegamos ao hotel sem muita expectativa, pois não achamos muitas avaliações e fotos. Mas, o hotel nos atendeu perfeitamente bem! Fica muito bem localizado (36 com 8), perto de diversos pontos turísticos e da estação de metrô (Penn Station), sendo assim, até o trajeto do aeroporto JFK até o hotel foi feito de metrô (com o air train).\nO quarto é muito confortável, cama e lençóis macios, TV grande com acesso aos canais locais e Netflix e Amazon prime. O ambiente era bem limpo e possuía serviço de camareira todos os dias. O banheiro tem uma boa ducha. O único ponto de ônibus observação é o barulho do ar\/aquecedor.\nO staff do hotel também foi ótimo! Sempre solícitos e prontos para atender.\nO café da manhã é bem farto e com bastantes opções, um diferencial em NYC.\nO hotel também conta com academia e com um lounge, que possui programação com música ao vivo e bar.\nComo nosso voo partia de madrugada, fizemos o checkout e deixamos as malas guardadas até a saída para o aeroporto.\nGostamos muito e desejamos voltar!","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excelente energia e muito atenciosos","lang":"pt","publishedDate":"2023-01-29","publishedPlatform":"MOBILE","rating":4,"text":"Estivemos hospedados em trânsito por uma noite, pois chegamos em NYC em 26\/01\/23  e tínhamos reserva no The Manhattan Club. Funcionários muito atenciosos e prestativos,muito alegres. Gostamos do café da manhã incluso e fazem um \"happy hour\"toda tarde.  Com certeza retornaremos.","travelDate":"2023-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Pleasant stay!","lang":"en","publishedDate":"2023-01-29","publishedPlatform":"OTHER","rating":5,"text":"I just completed a weekend stay at the SH Suites Times Square South and had a pleasant experience. From check-in to check-out, the staff were courteous and helpful. The hotel is in a great location - a few blocks from Penn Station\/Moynihan Train Hall which is ideal for Amtrak, NJ, and LIRR rail services. Rooms are cozy with modern amenities. Breakfast is served daily until 11:00 and offers a decent selection of pastries and select hot items. I would stay here again.","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Would stay here again!","lang":"en","publishedDate":"2023-01-18","publishedPlatform":"OTHER","rating":5,"text":"By no means the most glamorous of hotels but I enjoyed my stay here and I thought was good value for money. Bed was comfy, room and showers were clean, all the staff were very friendly, wifi worked well the whole time and had a bar downstairs which people actually used. The breakfast was ok, pastries, cereal and fruit were good but the limited selection in terms of hot breakfast.","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":3,"locationId":15288822,"title":"Family vacation to NYC","lang":"en","publishedDate":"2023-01-01","publishedPlatform":"MOBILE","rating":5,"text":"My family (wife, 10 and 8 y.o. sons, and I) stayed here whilst visiting New York. We stayed there for five night.\nFirst of all logistically the vote was really in a good location; central to most tourist attractions, although relative distances still apply! After landing at JFK my family and I got the subway to Penn Station, we were then about 3 blocks away from the hotel! We easily managed to carry our luggage the required distance.\nI had read online about the homeless problem in the neighbourhood. There were a few homeless people on the street but I have seen far worse in most cities in the world and no one even looked in our direction. The street is pretty busy and I didn’t feel unsafe at any point. \nIf you plan to go to Madison Sq Gardens it’s an ideal location. I went to watch the Knicks and it was a 7 minute walk to the entrance we had to use.\nThe staff at the hotel are fantastic; exceptionally friendly, helpful and courteous throughout. The hotel will store your luggage if arriving early or leaving late. The foyer of the hotel is very modern, has a good vibe and is a nice place to have a coffee or drink at the bar. The foyer also acts as an overflow area at breakfast which does get exceptionally busy. If you are happy to wait and stalk a table then it’s nothing to worry about. The breakfast was plentiful and varied and was replenished very quickly. \nThere are two lifts for guests at this part of the hotel to use, which can be a bit of a wait but it was never more than a couple of minutes. Returning from breakfast to your room from the lifts there can be a big line but we went straight out after breakfast so was not an issue.\nThe gym is bigger than expected and well equipped.\nThe rooms are as to be expected for Manhattan. They are small but well equipped. The usual amenities can be found, including a massive TV compared to the the size of the room! Admittedly if you have a lot of luggage like my family did it can become very tight but we spent hardly anytime in the room. Rooms were very clean and tidied every day.\nWithout any doubt I would use this hotel again!","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Convenient","lang":"en","publishedDate":"2022-12-27","publishedPlatform":"OTHER","rating":4,"text":"Great hotel in a good location. Super close to everything. Walked to most places, the big station isn’t far. Team was nice, room was spacious. Breakfast was alright, but enough to get you going. Would stay again","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15288822,"title":"Would definitely recommend.","lang":"en","publishedDate":"2022-12-16","publishedPlatform":"OTHER","rating":5,"text":"Super clean.  The bed was comfortable. Room had blackout shade which was really nice. The street was quiet in the AM, also a plus in NYC. The shower was good. Friendly and helpful staff. Great location. Super awesome free breakfast.  Eggs, sausage, toast, waffles, bagels, hash browns, and muffins. Juice and coffee. Really great way to start you day. Subway close by. Starbucks close by. Would definitely recommend.  10\/10. ","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Great location for easy access to all attractions","lang":"en","publishedDate":"2022-12-08","publishedPlatform":"MOBILE","rating":4,"text":"Stayed for 4 nights . Family of 4.  Rooms are compact but adequate . Staff were really lovely and friendly at all times . Breakfast was crowded but could grab and go so was handy to get something into you before heading out for the day . Penn station and port authority bus station within a short walking distance , perfect for easy access to go sight seeing . This hotel is not on Times Square it’s 15 min walk away . Street where hotel was has homeless people sleeping under an area lined with scaffolding. At first they are intimidating but they actually never bothered us during our trip and there is a huge police presence all over the city so felt very safe at all times . \n\nI would stay here again it’s a very clean and modern hotel for NYC .","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Plues and minues","lang":"en","publishedDate":"2022-11-28","publishedPlatform":"OTHER","rating":3,"text":"Actually more in the Garment District than Times Square but within walking distance, there is reasonable and easy access to Penn Station and Madison Square Garden, Bryant Park, etc.  Small rooms, good bathrooms, but what's a big drawback are that there are no dressers\/drawers in the room. If you are staying for more than a day or so, you will be living out of your suitcase and hardly room for more than one in the room to begin with.  Generally long wait for elevators, and most rooms have an unappealing view.  Breakfast can be crowded but they have a generally good assortment of hot and cold products and a nice amenity.  The bar is quite small, but at least there is one, and free wine and beer from 5-6 p.m.  Generally a safe-feeling neighborhood.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Lovely, Reasonably Priced Hotel","lang":"en","publishedDate":"2022-11-24","publishedPlatform":"MOBILE","rating":5,"text":"Easy shuttle from airports, convenient for Times Square, Theater District and Macy’s parade. Nice, hot buffet breakfast. \nVERY nice and helpful staff!\nSuites are quite small, but this is NYC!\n\nEasy 3 block walk to Bryant Park.\n\nAs I also must write at least 200 characters I am continuing to babble on. Enough?","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Poor -  Not worthy of Marriott Brand Name","lang":"en","publishedDate":"2022-11-22","publishedPlatform":"OTHER","rating":2,"text":"I am an experienced solo traveler and i am also a long term platinum Marriott member. I chose this Marriott based on location, reviews and price. unfortunately the experience has been very poor.  \n\nNegatives - too many \n1) Communication - I reserved through Booking site and communicated my arrival time and a week in advance provided details that parcels would arrive for me could you accept and would an upgrade be available as a platinum member.  Confirmation received from hotel CS that of course we will look to upgrade you and will accept your parcels. What actually happened upon arrival. No upgrade available and no record of my platinum membership.  Parcels which arrived was told we have to charge you for accepting your parcels $10 per parcel , which was never communicated by CS agent in comms after stating this the front desk then said $40. I refused as one of the parcels had been opened and items were missing. No investigation was launched even though i made a formal email complaint to the head of hotel manager.  \n2) Infrastructure - 5 elevators but only 2 work for the \"springhill suites\" 20 rooms per floor and only 2 elevators, just does not work and you stand around for 10-15 minutes waiting for an elevator, Not acceptable.  Room if it was an upgrade or downgrade was small extremely by NY standards and quality of working items such as lightbulb and fittings in shower were broken and had not been replaced. Should be part of the normal cleaning check process after a guest leaves.\n3) Customer service levels : I do expect better knowledge and attention to details of a customer request.  if i choose a Marriott branded hotel it must reflect the brand value and it has now devalued my view as a platinum member and what message does this reflect to others who are non members.  \n\nPositives :  None   ","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15288822,"title":"November 2022 Stay","lang":"en","publishedDate":"2022-11-22","publishedPlatform":"OTHER","rating":5,"text":"My friend and I stayed at the SpringHill Suites New York Manhattan\/Times Square South in November 2022. The hotel is very close to Penn Station, which was perfect since I had an early train. The lobby is inviting and the room with the queen bed was well-designed and contemporary, with all the amenities I needed for this stay. I wish the room had a better view and there was a little bit of a wait at the elevators during check-out, but neither of those things detracted from the stay. The best part - the front desk staff. I wish I remembered their names but they were so kind and fun, complimenting the outfits we wore to the Beyonce-themed party we went to and providing excellent hospitality! I would stay here again.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Thank You Tirza!!!!","lang":"en","publishedDate":"2022-11-19","publishedPlatform":"OTHER","rating":5,"text":"New York City was my dream trip and the Springhill hotel in Manhattan was also a dream! All the staff was great. \nI want to specifically thank Tirza, she was the nicest person to me everyday, super kind, nice and available at breakfast! I was really well impressed!! \nAll the best wishes for her and everyone at the Hotel.\nThank you for turning my visit to NY even more special!\n","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great Customer Service and Location","lang":"en","publishedDate":"2022-11-16","publishedPlatform":"MOBILE","rating":5,"text":"Our stay at Spring Hill Suites was fantastic! The location was perfect to walk to our activities at the Javits Center and the Manhattan Center. Plenty of Deli’s and markets near by to pick up supplies. Also the Break Bar is just around the corner where you can smash your glasses\/bottles when u are done. Our King room had a balcony on the 2nd floor, which made it easy to come and go and not wait for elevator. And the room was quite large. There was plenty of room to maneuver around bed, had a sitting area with sofa, also had Coffee machine and mini refrigerator. We booked the “Pizza Package” and got coupons for a free Cheese Pizza each day we were there. \nThe staff were so friendly and helpful. Bellman staff was great: Jonathan was a lifesaver and carried my bags upstairs when my room was ready and got me ice. Jessina was always cheerful and had answers to all my questions. Christian was always cheerful and entertaining. The bartenders were fun. Annery was very attentive and kept me company while I was waiting for my friend. Omar was also very friendly and enjoyed hearing about our fun at Bravocon.  I HIGHLY RECOMMEND THIS HOTEL!!!","travelDate":"2022-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15288822,"title":"Great location. Shady Street","lang":"en","publishedDate":"2022-11-11","publishedPlatform":"OTHER","rating":3,"text":"The location of the hotel was great. 2 blocks from Penn station and MSG. The homeless people at the corner of 36th & 8th wasn’t a great first impression for my parents who were enjoying their first trip to NYC.\n\nMy main gripe was the bill. We booked 3 double rooms through booking.com. When we arrived we checked in and 2\/3 rooms were upgraded for free at no fee according to the concierge. When we checked out we got our 3 identical bills. When we got back to the UK, the 2 bills that were upgraded for free were more expensive on the exchange. I’ve tried to contact the hotel with no luck. It’s ridiculous to be not get any contact when they’ve taken £4000 from us. Such a shame…","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"So nice","lang":"en","publishedDate":"2022-11-09","publishedPlatform":"MOBILE","rating":4,"text":"The room was very clean and the bed comfortable. So thankful for it during NYC marathon weekend. It was an exhausting and fun time but i needed to rest in the evening. The air could have been cooler, but everything else was perfect. I picked the wrong side of the building for views. My view from the top floor was a building under construction across the street. I just didnt know. Info on the website didnt say that.","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":15288822,"title":"Great location and comfortable rooms","lang":"en","publishedDate":"2022-11-07","publishedPlatform":"MOBILE","rating":5,"text":"Excellent location and comfortable rooms\n\nThe customer service in the check in was exceeding expectation; if I not forget, Jeffrey was the one who assist us with the check-in. \n\nThe rooms are very comfortable. The blackouts of the windows ere awesome. \n\nThe location was perfect; two blocks from Penn station. Excellent restaurants close the hotel. The breakfast is including with the rate and is very good. \n\nWe definetely consider this hotel in next visit to,NY.","travelDate":"2022-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":15288822,"title":"Don't stay here. Awful worn out mattress + awful service by hotel and Marriott Group.","lang":"en","publishedDate":"2022-11-06","publishedPlatform":"OTHER","rating":1,"text":"Don't stay here. We had an awful worn out mattress and ongoing terrible customer service. We're still fighting for a refund two month later.\n\nWe had such bad sleep the whole trip. My husband was sore every night\/morning from the mattress as well. I cried the first two mornings of our trip because of the pain from the mattress.\n\nThe staff put notes on our file about the issue for the housekeeping manager to see and work out some solution. Nothing was done to fix the issue. The night manager said all the mattresses are the same in every room, so no point trying to move rooms.\n\nWe've been trying to get a partial refund on our stay. The hotel says they have no record of our  issue in their system and deny we ever had an issue. We have photos of the mattress. \n\nMarriott Group customer service keep ghosting me when I ask to talk to a manager or someone higher up. The main hotel manager never responded to my emails. Another manager has been difficult to deal with. She forgot about a phone appointment with my husband. She gave me the run around on refund process and refund request. She led me to believe we were getting a refund. When my husband talked to her on the one she told my husband she would have just left the hotel if our situation happened to her. We did try to move to their Fairfield Inn & Suites which is in the same building but they wouldn't move us. We couldn't move hotels as we paid in full.\n\nThe manager says she checked the mattress (I doubt this) and sees no issue with it and feels nothing warrants a refund (we asked for 50%). The photos we took show the issues. We had to sleep on bunched up comforters to minimize the pain from the hard lumpy, saggy mattress.\n\nThe hotel denies any issue was brought up by us even though they put a note on our file. We're fighting for a full refund now. \n\nOn top of that, they \"upgraded\" us to the room we had originally booked and paid for so they had us in a smaller cheaper room than what we actually booked and paid for. I was excited to see the upgrade only to walk into the room we originally booked.\n\nAvoid this hotel. Once they have your money they don't care if you have issues and they won't compensate you for anything no matter how bad it is.","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Nettes Touristenhotel, zentral gelegen in New York","lang":"de","publishedDate":"2022-11-05","publishedPlatform":"OTHER","rating":4,"text":"Das Hotel liegt super zentral zwischen Times Square und Hudson Yards. Wir konnten unsere Ziele entweder zu Fuß oder mit einer kurzen Subway Fahrt erreichen. Das Hotel ist schön gepflegt und sauber. Die Zimmer sind ansprechend und gut ausgestattet. Das Personal im großen und ganzen freundlich (bis auf die Rezeptionsmitarbeiter, die wirkten bei unserer Anfrage sehr lustlos sie zu bearbeiten). Das Frühstücksbuffet bietet eine typische amerikanische Auswahl. Leider wird das Essen auf Plastikteller und -besteck serviert, was im Jahr 2022 nicht mehr nachhaltig ist und den Geschmack des Essens beinträchtig. Der Frühstücksraum ist eigentlich riesig, aber zu klein für die vielen Hotelgäste. Somit war es angebracht gleich zur Öffnung am Buffet zu stehen, um einen Platz und Essen zu bekommen. ","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"SCARY STREET \/ DRUG ADDICTS AT BOTH CORNERS","lang":"en","publishedDate":"2022-10-26","publishedPlatform":"OTHER","rating":3,"text":"Rooms are nice and clean. The staff is good, very attentive. However, if you walk to either 8th Avenue or 9th Avenue, be prepared to step over drug addicts and homeless people. It is NOT safe. There's a Police Dept next to the hotel but its CLOSED permanently. \n\nStay away. Your safety should come before a cheap price.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Busy area, quiet room","lang":"en","publishedDate":"2022-10-23","publishedPlatform":"MOBILE","rating":4,"text":"Definitely get a king room. The queen room I stayed in night 1 was really small, but the second night I got a king room and it was much better. Staff is great (especially Jeffrey at the front desk!), and though this hotel is in a busier area of Manhattan, walkable to many sites, it was quiet and I got a great night’s sleep.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Quick visit to New York","lang":"en","publishedDate":"2022-10-15","publishedPlatform":"MOBILE","rating":5,"text":"What a fantastic staff! They are friendly, helpful and welcoming. The rooms are clean with updated features. The housekeeping service is efficient. It’s a convenient location for walking around Manhattan and the most frequented sites.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Bem localizafo, café da manhã muito bom!","lang":"pt","publishedDate":"2022-10-01","publishedPlatform":"MOBILE","rating":4,"text":"O hotel tem funcionários atenciosos, decorações modernas e o quarto para padrão NYC tem tamanho OK (não dá pra deixar mala no chão pois impede passagem). Possui cofre, secador de cabelo, tábua e ferro de passar, frigobar e até microondas. O café da manhã é realmente ótimo e tem muitaaas opções boas. Ele é super bem localizado e várias coisas se faz a pé, ou pelo metro Penn Station que fica há 1 quadra. Mas infelizmente o chuveiro do nosso quarto era horrível!!!! Vazava água para fora do box, tinha a dispersão de água toda errada fazendo com que até lavar o cabelo fosse tarefa dificil já que não vinha pressão. Eu reservei pelo booking e quando chegamos lá fomos avisados que por qualquer site de reserva não constava as taxas municipais e estaduais, então o custo da diária ficou 35% mais cara, fazendo 3 diárias saírem por quase 6mil reais na conversão atual de dólar... o que até para NYC é muito caro!!! E com o chuveiro ruim como estava, nos fez ficar chateados, teríamos pedido para trocar de quarto com certeza se soubessemos antes que ia ficar tão caro.","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"DA EVITARE!! E state attenti agli addebiti in più che fanno “””erroneamente””” sui vostri mezzi di pagamento!!!","lang":"it","publishedDate":"2022-09-16","publishedPlatform":"OTHER","rating":1,"text":"Io e la mia fidanzata siamo stati in questo hotel 11 giorni a settembre e posso dire quanto segue:\n- Allarmi antincendio che scattano erroneamente di notte,\n- il servizio di pulizie che dimentica le porte delle stanze aperte dopo aver finito di riordinarle,\n- lo staff che addebita importi in più sulle carte di credito fornite per pagare le camere al nostro arrivo e poi non fa nulla per sistemare subito le cose..questa la cosa più grave!!!! Tra l’altro stiamo leggendo sia tra le recensioni di booking che di Google non esser la prima volta che capita a quanto pare…,\n- cattivi odori nella hall dell'hotel probabilmente derivanti dal fatto che cucinano a pochi passi da lì senza aver un buon sistema di areazione (?),\n- tossicodipendenti che si bucano in vena fuori dalle porte dell'hotel (questa non è colpa loro ma tant’è….)\nQuindi per concludere….oh mio dio. DA EVITARE! MAI PIÙ!\n\n\/\n\nFire alarms that mistakenly sound at night, housekeeping forgetting room doors open after finishing, staff mistakenly charging credit cards provided to pay for rooms, bad smells in the hotel lobby, drug addicts piercing their veins outside the doors hotel, oh my god. .. AVOID! NEVER AGAIN!","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Gran Hotel","lang":"es","publishedDate":"2022-09-13","publishedPlatform":"MOBILE","rating":4,"text":"El hotel es muy lindo por dentro, cuenta con lavandería, las habitaciones son cómodas y el servicio de limpieza es excelente. Tuvimos un inconveniente en donde nos quedamos atrapadas en el ascensor, sin embargo el hotel se portó muy bien y lograron sacarnos rápidamente a su vez que nos compensaron por el incidente. \nEl desayuno es muy bueno, tiene bastante variedad y es de buena calidad \nEl hotel se encuentra central a manhattan, a pocos minutos de Times Square y cerca de una estación de subway. \nVolvería 100%","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Nice Hotel - Not Nice Location","lang":"en","publishedDate":"2022-08-24","publishedPlatform":"OTHER","rating":3,"text":"We stayed for 4 night recently and have some plus and negatives:\n\nPLUS\n\nStaff were lovely and attentive always smiling \nRoom was nice, not very big but ok for us\nBreakfast was included and whilst chaotic was nice choices and the food was fresh\n\nNEGATIVES\n\nLocation  - Its Hells Kitchen not Times Square and the area is covered in Homeless People and Mentally unwell people - To the point you have to walk round people lying in the middle of the pavement, Its not well lit and certainly not clean which is awful to see \n\nThe breakfast whilst nice was so chaotic some people struggled to get seats whilst others put bags on tables to stop people sitting on empty seats and no staff to say otherwise\n\nThe bar whilst nice to look at is super expensive along with the onsite shop it looks really lovely but is pricey so bring in your snacks or water etc \n\nHousekeeping only came twice during our stay even tho it said daily and the second time only replaced towels - didnt empty bins or make the bed which i found strange but not a big deal\n\nOverall a nice hotel but not in a nice area - as two women travelling together i didnt feel 100% safe walking back to the hotel after dark","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"The squeaky wheel gets the oil!","lang":"en","publishedDate":"2022-08-18","publishedPlatform":"OTHER","rating":5,"text":"Excellent location, close to many tourist attractions including the subway, Penn Station, Times Square, Empire State Building, Macys and more!\nYes, the rooms are small - this is NYC, folks.  ALL hotel rooms are small here, unless you're paying a small fortune.  The elevators are busy at peak times (did I mention, this is NYC, folks, you're not in Kansas anymore) but we never had to wait excessively long.  Yes, the breakfast room is crowded (this is NYC...), but we were always able to find a table (for 4) and they kept the food well stocked.  \nThere's an in-room safe and, contrary to the hotel's website, it's free.  You also have a mini-fridge and microwave in each room.  The fitness room is very well stocked with high quality equipment.  We had the pizza package, and the pizza was huge and delicious - they deliver it to the hotel.  Only thing is, you have to pay $5 each if you want any toppings!  \nNow...about the air conditioning.  In our first room, it didn't work.  The engineer came up, said he reset something, blah, blah, and it still didn't work.  We kept hounding them, and on the second day they moved us to another room.  It worked completely fine with no problems for the remaining 5 days.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Dejligt hotel med rigtig søde om servicemindet personale","lang":"da","publishedDate":"2022-08-11","publishedPlatform":"OTHER","rating":4,"text":"Vi boede 3 nætter på dette hotel. Af et 3-stjernet hotel at være,  er hotellet virkelig godt. Fine store værelser som var pæne, rene og velholdt. Pænt badeværelse med kar og brus. Gode madrasser i sengene. Pænt og rene på fællesarealerne. \n\nMeget alsidig og dejlig morgenmad - med bl.a. mulighed for kaffe to go.\n\nPersonalet i receptionen er meget imødekommende og hjælpsom m.v. Deres to unge fyrer som står for transport\/taxi service er også super effektive :-)","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Not sure it was the most cost-effective option","lang":"en","publishedDate":"2022-08-11","publishedPlatform":"MOBILE","rating":3,"text":"I would not reccomended it. Rooms are clean but definitively too small. The location, although in middle town, is not  reccomendedable since its road is periferical and badly attended. \nThis was my fourth time in New York City, therefore I think I know manathan quite well to say that for the same price (335 Usd per night) you would most probably get better options. \nOur Room was  so small that we had several injuries hurting against everything. \nMy personal preference remain downtown in the financial district since it can offer a better contest with higher standards.  This might be subjective and probably others do not like communiting from downtown. In any case, even if you would like to stay in middle town, I would take a deeper look into the options available to see if you can find something more competitive. Positive note the breakfast which had many options for all and a good choice of milks also for lactose intolletants or vegan.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"OK. Great location ","lang":"en","publishedDate":"2022-08-02","publishedPlatform":"MOBILE","rating":4,"text":"Confortable bedroom. 2 King size beds. The room is small for 4 guests with suitcases but clean, modern and well equiped.\nTiny bathroom makes problem for a family.\nNo real door between bathroom and bedroom.    \nBreakfast ok. \nPeople at the front desk are nice.  ","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Uncomfortable neighborhood","lang":"en","publishedDate":"2022-07-09","publishedPlatform":"OTHER","rating":3,"text":"I stay in NYC a lot, always at Marriotts, and this is the first place I've stayed where I deliberately didn't walk at night because the neighborhood was so skeezy.  Many homeless now line 36th street.  I saw two arrests and I saw a guy peeing on the sidewalk -- FACING the sidewalk, not peeing into a corner.  I myself live in a city and am comfortable with urban life; I have stayed in San Francisco, Portland, OR, Santa Monica and many places with a lot of homeless and I am not a \"Karen\" about city life.  However, this area did not a good feeling.  Just too many people with too much unpredictable behavior \n\nThe hotel staff was incredibly nice, the breakfast buffet incredibly generous,  the rooms were perfectly adequate (after I got moved to the second room because of inadequate cleaning of the first), the AC, while noisy as a jet engine, worked great and I appreciated the open-able windows.  Unfortunately, as a solo woman I will not be staying here again.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Super location and service!","lang":"en","publishedDate":"2022-07-02","publishedPlatform":"OTHER","rating":5,"text":"Super location and service!  We had a wonderful stay here.  We arrived by train at Penn Station and had an easy walk to the hotel.  ALL the staff were helpful, friendly, and clearly working hard to make our stay nice.  Felt very \"safe\" too with the surging omicron variant.  The property was clean, bed is comfortable, bathroom layout is great, and the lobby is inviting.  The refrigerator and microwave in the room was handy.  We especially love hotels that provide breakfast, but this hotel is big (serving a lot of people for breakfast), so try to come early if you can.  It was an easy walk to great restaurants and Broadway shows and also an easy location to be picked up by Lyft or Uber.  We would definitely stay here again.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"AC not working, service unresponsive- took days to look at it and let me move rooms.","lang":"en","publishedDate":"2022-06-26","publishedPlatform":"OTHER","rating":2,"text":"Terrible night's sleep. AC was broken. Told front desk on first night and they said it was too late (~10pm) and there were no alternative rooms. \n\nI told them the next morning and asked if they could fix. They said they would. I'm on a work trip, so I'm getting back around 10 every night after team dinners etc. I come back, AC still not working and they didn't look at it even tho they said they would. They said they'd send someone up- I waited until midnight before finally just turning off the light.\n\nSame thing the 3rd night- I've talked to the front desk many times, always promising someone would come, no one ever did. Finally someone did, but the AC still didn't work and they moved me to another room.\n\nBTW, as others have said- the elevators are excruciatingly slow- mostly because there's only 1 elevator servicing a huge chunk of floors, but also partly because you're required to badge into your floor using your key- and the badge reader seems really finicky so you have people trying to figure it out whilst other people are waiting to get on\/off. Given there's a doorman greeting people in and out, it seems like they could relax the elevator badging as a way to speed things up.\n\nAlso, the AC in the gym seemed broken, as was several things in the breakfast room- so seems like the hotel is in disrepair.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":15288822,"title":"Teeny room, air con didn’t work however I would still recommend!","lang":"en","publishedDate":"2022-06-13","publishedPlatform":"OTHER","rating":4,"text":"We arrived for 2 nights; our room was not ready which was fine as we were early; the baggage staff were fantastic; very friendly, informative about the city while putting them away while we headed out for the day.\nWhen we came back; checking in was quick and pleasant. \nThe room was a bit of a shock; absolutely teeny for 2 adults and a teenager. Understandable for New York but having just come from a Marriott in Boston it felt very confined. We had to stack our bags behind the door which made me a tad nervous in the event of a fire and fast evacuation!\nThe AC didn’t work but we rang the reception and they sent someone up within minutes. They provided a fan which was great but a tad noisy.\nThe breakfast was perfect for us. Good orange juice; good coffee; cereals, bagels - no toaster; pastries; eggs, bacon, yoghurt, waffle’s. Something for everyone in our group.\nWe were out all day but with kids you have no choice but to be back in the hotel early which means you can either hang out in the reception area which is doable; or come up to the very small room. The reception area is great; spacious; they accept food deliveries and they have a bar area. \nWe stayed on the 12th floor so street noise levels were less of an issue but we did hear people complain about the noise from lower floors.\nOverall I would stay here again; good location; great staff; good price; good breakfast.","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Good option for a budget traveller ","lang":"en","publishedDate":"2022-06-07","publishedPlatform":"MOBILE","rating":4,"text":"Just returned after a 5 night stay family of 4, 2 children 6 and 14. Couldn't fault anything about the hotel. Hotel was bright, clean and staff were very helpful. Rooms are on the small side but who comes to NY to stay on your room. We had no AC the first night. Staff tried the best to accommodate us but because of how busy the hotel was were not able to be moved until the next morning. Staff gave us fans, bottled water and refunded the night's stay. This wasn't asked for and think this was a fare offer on the hotels part. Breakfast is very good, plenty of options and if like us having a complementry breakfast saves a good couple of hundred dollars during your stay. Overall a bery hood central hotel and wouldnt hesitate to returnif we vidit the big apple again. ","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Short Stay","lang":"en","publishedDate":"2022-06-02","publishedPlatform":"MOBILE","rating":4,"text":"Good short stay hotel NYC\nHad room with 2 queen's but very tight squeeze if 4 of you in room ( which there was for us ). No room for bags \/ emptying luggage\nWould not personally recommend for longer stay unless you had x 2 rooms \nStaff lovely\nHad a problem with air con but this was rectified quickly\nBreakfast was ok but don't go down at 9:55 as food will be taken away by 10!\nBeware of the bed frames, corners very sharp, hardwood","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Good stay and reasonable: All you would want for the price","lang":"en","publishedDate":"2022-06-01","publishedPlatform":"OTHER","rating":5,"text":"We travelled in February to see Elton John at Madison Square Garden and this was a perfect place within walking distance. The room and bathroom was small, not atypical for NY,  but modern and clean. Comfortable beds and free breakfast. At that time we had to show proof of vaccination to go to the breakfast are.  Very accommodating front desk staff. \nAre staying again this weekend to see a Broadway show.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Wrong room, air conditioning didn't work","lang":"en","publishedDate":"2022-05-25","publishedPlatform":"OTHER","rating":3,"text":"We were placed in a tiny room (not a suite) even though I paid for a suite and called the desk to inquire and asked to be moved to the correct room.  The room was very hot and we were told it was normal.  They gave us an oscillating fan.  So, we slept in a room so small we had to close the door and stack the suitcases behind it, sweating, hot and uncomfortable.  I placed a complaint with the company and have not heard back.  I'm also a Marriot member.   Very dissapointed.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Reservas canceladas indevidamente!","lang":"pt","publishedDate":"2022-05-14","publishedPlatform":"OTHER","rating":1,"text":"Ao chegar no Hotel Springhill by Marriot Manhattan fomos informados pela recepcionista que nossas 2 reservas haviam sido canceladas pois não comparecemos em tempo hábil, no dia 02 de maio.\n\nOcorre que dias antes entramos em contato via email com uma funcionária Marriot chamada Telma e a mesma garantiu ter deixado uma nota em nossa reserva: \"Deixei uma nota em cada reserva a indicar que irão chegar ao hotel no dia 3 de Maio por volta das 10 da manhã\".\n\nPagamos uma diária a mais exatamente para podermos entrar no quarto mais cedo e ao chegar no hotel nos deparamos com essa desagradável surpresa.\n\nDepois de muita \"luta\" fomos realocados para quartos diferentes e inferiores do reservado no site hoteis.com além de termos que pagar por um valor maior que o contratado. Nunca mais reservo um hotel da rede Marriot.\n\nQuase ficamos na rua em New York!","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Promedio","lang":"es","publishedDate":"2022-05-12","publishedPlatform":"MOBILE","rating":3,"text":"El desayuno no es bueno, lleno de gente y la calidad de los productos deja mucho que desear, todo es empacado y nada es fresco, las habitaciones aunque pequeñas son limpias y las camas SÚPER CÓMODAS, la ubicación,aunque cerca de todo, no me gusto mucho pues hay unas calles cercanas en las que siempre hay personas vendiendo droga no se siente seguro","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"A éviter","lang":"fr","publishedDate":"2022-05-06","publishedPlatform":"MOBILE","rating":3,"text":"Hôtel bien situé mais pour tout le reste je vous le déconseille. Chambres étroites pour 4 personnes. Salle de bain minuscule 2 m2. Pas de bouteille d eau dans la chambre. Baignoire fissurée, mobilier de la salle de bains cassés. Air conditionné extrêmement bruyant ( j’ai dû la coupe et rester dans une chaleur étouffante)\nPetit déjeuner peu varié et répétitif.\nDommage pour un hôtel situé au cœur de la Manathan.\nUne chose est sur c est que nous n’y remettons plus les pieds.","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Petit déjeuner plus que moyen","lang":"fr","publishedDate":"2022-04-29","publishedPlatform":"MOBILE","rating":3,"text":"Hôtel bien situé notamment pour aller sur Times Square, chambres petites et vite encombrée avec les valises. Ménage effectué chaque jour. Mais le point négatif : le petit-déjeuner : difficulté pour trouver une place assise même a partir de 8h00 le service se fait avec assiette et gobelet en carton et des couverts en plastique !! Heureusement qu’il s’agit d’un 3 étoiles !! Et les offres en plats sont tout aussi pitoyables : pain bagel rassis pas de réassort régulier et le peu de choses proposées sont de mauvais qualité voire immangeable !!","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Bon rapport qualité prix","lang":"fr","publishedDate":"2022-04-28","publishedPlatform":"OTHER","rating":4,"text":"Hôtel très propre,\nNotre chambre était un peu petite mais correctement équipée.\nPetit déjeuner bof dans une ambiance un peu cantine ….\nBien situé. Personnel sympathique.\nDans l’ensemble, très correct !","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"bon rapport qualité prix","lang":"fr","publishedDate":"2022-04-15","publishedPlatform":"OTHER","rating":4,"text":"les chambres sont propres et la décoration est moderne .\nPetit déjeuner répetitif mais complet ! Le personnel est très agréable.\n\nAttention à la barmaid qui est super désagréable si vous oubliez les tips ! Habitude à prendre pour nous français , et à priori la bienveillance ce n'est pas son truc. Au lieu de nous expliquer gentiment le fonctionnement, elle m'a littéralement envoyé bouler devant tout le monde lorsque je suis revenue.  Je suis allée boire mon verre ailleurs :) ","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Good value in Manhattan","lang":"en","publishedDate":"2022-04-14","publishedPlatform":"MOBILE","rating":4,"text":"Two night stay during Spring Break to see two Broadway Shows. Basic rooms (we had two). Small but very typical for Manhattan. Comfortable bed and very quiet.\nNo view. Slow elevators during rush hour. Breakfast was fine. Better then most Marriott breakfasts post pandemic. Saved us a bunch of $ vs eating out. Nice neighborhood. Easy to get to Macys and also up to Times Square-bring your walking shoes!","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Fantastic - Next Stay in July Booked","lang":"en","publishedDate":"2022-04-12","publishedPlatform":"OTHER","rating":5,"text":"My stay was from 4\/09 - 4\/11, it was an amazing stay.  Arriving on 4\/9\/22 from Vegas on an overnight trip I knew I would need to wait a while for a room to become available so I could check-in early.  I did wait a few hours and a room did open up and was on my way up.\n\nThe room is small, yet functional.  I have stayed at Margaritaville in Times Square and those rooms are super small.  I only need a room to sleep, eat a snack, shower, etc...  I don't spend a lot of time in the room, functional at a great rate is the check box that needs to be hit.  The room was on the 8th floor with a terrible view, I don't care, it was quiet.  The bed was comfortable, the shower hot, and there was a free breakfast.\n\nThe hotel is a combo of Springhill Suites and Fairfield Inn.  I'm not sure how it it split up, there is a cost difference at the same address.  The breakfast was typical Springhill Suites\/Fairfield Inn, nothing amazing, it is free, what to expect.  I think the lobby is kind of cool, open and airy.  There breakfast is served on the 1st floor, and there is also a bar area, and a small snack area for purchase.  The location was safe, I'm a native New Yorker, and a deli was within a short walking distance in either 36th or 34th street and 9th avenue.  I did find the partner parking garage a bit odd.  I did validate both nights, and the rate noted on the website says $60 a night.  I paid $80 the first night, and $40 the second night, I had to pay for each out privileges'.  Not sure why the difference between days.\n\nEveryone was super friendly, I think the Manager of the Property spent a little extra time with guests also.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"1Just an overall great stay","lang":"en","publishedDate":"2022-02-27","publishedPlatform":"OTHER","rating":5,"text":"It was so cold in Manhattan  I just landed at 7 AM January 8 from San Francisco.  I got to the hotel about 10 AM and Tian,allowed me to check in early.  He acknowledge, I am a Marriott Gold member and was extremely helpful and friendly during check in.  He was there all morning as well as other staff to answer all my questions every time I passed by the front desk.  The only issue I had was there were not enough elevators for the amount of guest.  I was lucky enough to be able to use the stairs.  The room was NY small but was very clean and had everything I needed.  It was walking distance to places I was meeting family members.  I like the closeness to Penn Station, I usually fly into Newark so it was very convenient.  The breakfast provided was very good for being free.  Even the pizza that was provided with the room was good. Thank you Marriott and thank you Tian.","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Worst hotel EVER!!!","lang":"en","publishedDate":"2022-02-24","publishedPlatform":"MOBILE","rating":1,"text":"First the elevator was broke and we was force to walk up and down the stairs to the 14th floor.  Second our heat was broke in our room and it was 29 degrees outside. We where offered extra blankets for the night.  Third, the rudest most unprofessional staff member  cursed at me and no one did anything about it! I will NEVER stay here again and STRONGLY recommend on one else does neither","travelDate":"2022-02","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Não recebi de volta o valor do meu caução\/After 15 business days, still haven't  received my deposit back.","lang":"pt","publishedDate":"2022-02-12","publishedPlatform":"OTHER","rating":4,"text":"Check-in foi rápido, sem queixas. \nOs quartos (reservei dois, pois éramos em 6 pessoas) possuem duas camas muito confortáveis, porém somente em um deles possuía cofre.  \nCafé da manhã bom. \nLocalização excelente, fizemos tudo a pé. \nA única questão é com relação ao valor do caução: foram 150,00 dólares de caução por cada quarto, totalizando o valor de 300,00 dólares, que foi passado no cartão de débito, e que após o check-out, o valor seria reembolsado entre 7 e 12dias úteis. Hoje, 15 dias úteis após o meu check-out, não recebi o valor de volta. Procuro por email de contato, porém não existe, somente um número de contato, que infelizmente não tenho como ligar pois já estou no Brasil. \nGostaria que essa questão fosse resolvida, e que alguém da rede Marriott\/Springhill Suites entrasse em contato comigo. Obrigado.","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Parfait","lang":"fr","publishedDate":"2022-02-10","publishedPlatform":"MOBILE","rating":5,"text":"Nous avons passé 7 nuits dans cet hôtel très bien situé et nous le recommandons vivement.\nTout était parfait:\nLe personnel est agréable et disponible. Les chambres sont modernes, propres et très bien équipées. \nLe ménage est fait tous les jours. \nLe petit déjeuner est répétitif mais très utile pour commencer la journée. \nNous reviendrons!\n","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Shocking Service","lang":"en","publishedDate":"2022-01-11","publishedPlatform":"MOBILE","rating":1,"text":"We stayed at this hotel from the 20th to 23rd December. We paid for our reservation on arrival and paid for a bar bill at the end of our stay. Then was charged again for the reservation after numerous emails calls to the hotel manager To O’Neill Justin we have had no response whatsoever to sorting this issue out","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Full","lang":"es","publishedDate":"2022-01-01","publishedPlatform":"MOBILE","rating":3,"text":"Estuvimos dos noches , nos recomendaron un restaurante cercado de una lista que tienen , nos fue pésimo ( Diana ) , se llama el lugar \n\nEl ascensor es súper lento , no da a basto para tantas personas \n\nEl desayuno es aceptable pero estaba demasiado lleno \n\nLa habitación no tiene vista , es pequeña , el baño muy incómodo , la luz terrible","travelDate":"2021-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Went beyond my expectations","lang":"en","publishedDate":"2021-12-27","publishedPlatform":"MOBILE","rating":4,"text":"Great location in the flower district and very centralized\nHotel was brand new so it seemed new furnishings and a well equipped gym.\nStaff was helpful and courteous as the hotel had just opened.\nRooms were nicely appointed. The Resturant was quick and easy for breakfast.\nWould go back for sure.","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Siempre cumple las expectativas","lang":"es","publishedDate":"2021-12-12","publishedPlatform":"MOBILE","rating":5,"text":"Es la segunda vez que nos alojamos en este hotel, la primera fue antes del COVID y ahora hemos vuelto en cuanto nos han dejado viajar a EEUU.\nLa única diferencia entre antes y después de la pandemia que hemos notado es que ahora las habitaciones las limpian un día sí y otro no, porque el resto es igual que la primera vez que fuimos.\nEl único defecto que le veo es que las habitaciones son bastante pequeñas, no hay sitio para guardar las cosas y la luz es muy, muy, muy escasa, apenas logras ver incluso de día, le falta iluminación a las habitaciones claramente y creo que, si bien el tamaño de las habitaciones está en la media de Nueva York, la iluminación sí la pueden corregir y sería necesario hacerlo.\nEl hecho de disponer de microondas y nevera en las habitaciones da mucho juego en una ciudad como NYC, pero no lo es menos el hecho de poder hacer la colada con lavadoras y secadoras, que por cierto han puesto nuevas, porque las antiguas iban bastante peor, y éstas son más modernas y tienen más capacidad.\nEl gimnasio es una pasada, es el mejor de todos los que he visto en hoteles de NYC, y eso que he ido a unos cuantos.\nPero lo mejor del Springhill Suites Manhattan de Times Square South es el desayuno, un restaurante enorme, súper agradable, con música ambiente, donde hay un desayuno buffet muy completo y dónde reponen de todo continuamente, nunca ha faltado nada, es sin duda el sello de identidad del hotel.\nEl personal, amable y agradable, con ganas de ayudar y hacer la estancia placentera.\n¿Cuál es la razón de que volvamos? Su emplazamiento, ya que se encuentra cerca de todo y más ahora con Hudson Yards al lado, donde puedes ir a Whole Foods (supermercado de Amazon) a comprar comida e incluso consumirla en su restaurante, pero también puedes ir a cualquier restaurante, y sobre todo el Subway, que está literalmente al lado y desde ahí te mueves por todo Manhattan y sus distritos.\nPara más datos sobre el servicio del hotel, se rompió uno de los ascensores en plena festividad de Thanksgiving, y estuvimos cuatro días del fin de semana y festivos con un solo ascensor, y en cuanto tuvieron la pieza el lunes por la mañana, lo repararon, y eso no sucede en cualquier otro hotel de NYC, lo digo con conocimiento de causa, porque ya me ha sucedido en otro hotel de la cadena Hampton Inn (a la que no pienso volver, por cierto). Nos tocó subir y bajar escaleras nueve pisos durante cuatro días seguidos, pero se entiende que algo así pueda suceder.\nVolveremos...","travelDate":"2021-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Fun night in NYC","lang":"en","publishedDate":"2021-12-07","publishedPlatform":"OTHER","rating":5,"text":"My wife and I were catching a concert in NYC and found this great hotel just south of Times Square. The location was perfect and was an easy walk to the concert venue. The staff was friendly, helpful  and went over and above to help make our stay enjoyable. The room was comfortable, clean and had a great layout. We only stayed one night but wish we spent the entire weekend.  I highly recommend this hotel for anyone visiting the Times Square area.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Not bad, but be prepared for a lack of space","lang":"en","publishedDate":"2021-11-02","publishedPlatform":"OTHER","rating":3,"text":"Great location, but with a very tiny room. I guess that’s to be expected in a major city hotel – you get what you pay for. Had everything we needed for a one-night stopover, but the size of the room left quite a lot to be desired. Very helpful front desk agent (Daniel).","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Best location and service for for its price","lang":"en","publishedDate":"2021-10-25","publishedPlatform":"OTHER","rating":5,"text":"The hotel's location, staff, and rooms are just the best you can get for the relatively cheap price they charge. I had a blast staying there and their breakfasts are really good. On my last day, I was helped to print some documents for my work, leave my bags for a couple of hours after check out and get a taxi service to JFK for a cheaper price than Uber. And what is best I got contacted by the hotel's Complex Assistant Front Office Manager, Daniel Arizmendi about me leaving my passport in the room almost right after I checked out. He CC'ed all the necessary staff members to make sure I get my passport when I would come back to pick up my bags. It all just felt really well and positive at this hotel.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Cramped and crazy - stay elsewhere","lang":"en","publishedDate":"2021-10-07","publishedPlatform":"OTHER","rating":2,"text":"This hotel shares its facilities with a Fairfield in.  I landed late and arrived at the hotel at 1am. To my surprise the lobby was still fairly busy.  When I approached the front desk, the agent did not even \"hello\".  After providing my last name, the agent could not find my reservation (which was odd, since the Bonvoy app even showed me my room number).  Needless to say, after a long flight this wasn't what I wanted to hear.  After some confusion and cross-checking my confirmation number from the Bonvoy app, the agent found my reservation and the key associated with my room - since I had used mobile checkin, the key had already been made.  I was told the hours of the breakfast and sent along my way.  \n\nWhen I got to my room, I was pretty shocked - there is literally nothing \"suite\" about the set up.  It is a really cramped room and cramped bathroom, and there was no shampoo in the room but it was so late, I didn't have the energy to deal with the front desk so I used the provided conditioner for my shower and went to bed.  Unfortunately there were all kinds of noises throughout the night - high pitched squeals, banging, and other mechanical noises (i.e. from the AC or other building equipment).  I woke up with a terrible headache.\n\nEvery time I went through the lobby it was packed with people, luggage, and complete chaos.\n\nFortunately I only stayed here for two nights.  Skip this place and stay elsewhere.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"If only I could give it Zero Stars","lang":"en","publishedDate":"2021-09-27","publishedPlatform":"OTHER","rating":1,"text":"This has been one of the worst hotel experiences in my adult life. A lot of things were wrong and very little effort was done from the hotel staff to make it better. \nWe initially booked the new \"SpringHill Suites by Marriott New York Manhattan Chelsea @ 140 West 28th Street\", however, the opening of this location was pushed back so we were switched to this sister location.\n\nThis \"sister\" location was horrible and it should not be able to carry on using the Marriott brand unless things dramatically change. \nWhen we arrived at the hotel after a long cab drive from LGA (with our 6 month old son) we were attended by a very rude front office staff member who gave us a room with no Air Conditioning, I then came back down and instead of switching us right away, they sent us an engineer who couldn't figure it out so then we had to come back down (a third time) and finally get another room. In the new room the TV didn't work, we were told the cable box was broken and we could ask for a room the NEXT day, I wasn't planning to unpack all the baby stuff and then repack the day after to get another (a third) room. So we stayed in the room with no TV, and up to now, we haven't been compensated for this inconvenience.\nAlso, at time of check-in we were never told about the housekeeping policies and the fact that you don't get service until the 3rd day. So, obviously, the 2nd day we were expecting at least clean towels, but nothing, finally when we came back from sightseeing I had to request new towels and I was then explained about this policy. \nThe breakfast is OK but nothing to write about.\nThen, the location, I know this is not the hotel's fault but the area surrounding this hotel has gotten very shady and sketchy. There are several sketchy looking people in the surrounding streets which is not ideal when traveling with your family.\nLastly, the time of checkout is noon, and we were being bothered by the housekeeper on the last day (while putting the baby to sleep) at 1000 AM asking when we were planning to leave! come on! very rude.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"Beware!","lang":"en","publishedDate":"2021-09-27","publishedPlatform":"OTHER","rating":1,"text":"I have stayed in Marriott hotels in multiple locations in midtown Manhattan.  This is by far the worst and I will never stay again.  Very subpar for Marriott.  To begin with, the check-in associate (N***i) did not even acknowledge us, or the line forming behind us, because she was too busy chatting with a man (not a hotel guest) who was begging her to go out with him.  She should have told him to leave because she had customers, but she didn't.  Very unprofessional for Marriott.  No hair dryer in the room and it took two phone calls and 40 minutes with wet hair to get a hair dryer delivered to the room.  Stains on the carpet.  Tiniest bathroom ever with about 3 inches of counter space next to the sink.  I bruised my shin more than once on the toilet because you have to clear it sticking into the space you have to stand in the bathroom.  Also, hit my elbow more than once on the wall trying to dry my hair once I did get aforementioned hair dryer.  I know NYC hotel rooms are notoriously small, but this one takes the cake.  No hook in the bathroom to hang a robe or an item you might need to steam while in the shower.  No overhead lighting in the room except at the door.  Probably my #1 complaint is the mattress.  The reason I stay in Marriott hotels is for their mattress.  This hotel definitely did not have a Marriott-quality mattress.  Very, very uncomfortable.  And to reiterate other reviews, very shady street.  If I were not with my husband, I would not stay here as a woman travelling alone.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":15288822,"title":"It's Your Call","lang":"en","publishedDate":"2021-09-21","publishedPlatform":"OTHER","rating":3,"text":"I stayed two nights at the SpringHill Suites by Marriott, in NYC, September 18-19, 2021…in two different rooms; the first one the engineer could not get the air conditioning to work, plus the room had too much street noise…so they moved me.\nThere’s a lot to like about this hotel, it’s conveniently located, especially if you arrived by train…Penn Station is close by.  It’s clean and modern, but built inside the façade of an old church adding some character.  Additionally, the staff is friendly and accommodating, the room has microwave and mini fridge and breakfast and wi-fi are included.\nBut there are some issues: the room is not a suite, half the very small room is carpeted and the other half has faux wood flooring, creating two ‘spaces’. The bathroom only has a shower and toilet, the vanity sink is in the living space, much like a roadside motel, and there is only one chair.  The small desk\/work space is hogged by the microwave.  The room has an iron, but no hair dryer, you have to request one, there is no light switch by the bed, you have to turn out the lights, then find your way to bed.  The cold breakfast is also of the roadside motel variety; like much of this property, below what you expect from a Marriott, at any price point.  But the deal breaker, for me, was the air conditioning couldn’t be made to work in the second room either…neither room ever got a cool as the outside temperature.  One of the engineers confided that he spends most of his time trying to coax the air conditioning to work.\nLastly, the hotel is on a pretty seedy side street…not a criticism, in NYC you build where you can obtain a building site…there are three other hotels on the block.  I didn’t feel at risk, but it will intimidate some.\nAs the title says, it’s your call…you’ll have to decide if the pros outweigh the cons.  At the right price, this could be a very good option, with precautions.  Request a hair dryer, when you check in, if you need one, and check out your room before you unpack…if the air-conditioning doesn’t work or you’re uncomfortable with the location of the bathroom vanity…it was less intrusive in my first room, request a new room…the staff is accommodating.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"First time I haven’t felt safe in NYC!","lang":"en","publishedDate":"2021-09-18","publishedPlatform":"MOBILE","rating":3,"text":"Went to NYC for reopening of Broadway! Stayed in garment district as I have before. I was shocked at the streets. Homeless\/drug addicts shooting up and passed out on the street in broad daylight! One guy was bent over with 3 needles beside him.  Lord of street people at all times. This was on corner of 36th street and 8th avenue. Very sketchy! We were not at ease except in while in Little Italy and while in the show and in the hotel! Outside of hotel was a bit scary!  Stay east of 7th Avenue if you go to NYC anytime soon!","travelDate":"2021-09","tripType":"SOLO"}
{"helpfulVotes":4,"locationId":15288822,"title":"BED BUGS! STAY AWAY!","lang":"en","publishedDate":"2021-09-09","publishedPlatform":"OTHER","rating":1,"text":"I had BED BUGS the first night of my stay. I received no assistance, containment protocols were not followed as I requested. It was very irresponsibly handled. I had to leave the hotel immediately and they did not help me relocate. I have 100+ bites all over my body.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Easy convenient spot in Manhattan.","lang":"en","publishedDate":"2021-08-29","publishedPlatform":"MOBILE","rating":4,"text":"Easy to get to from Penn Station and subway access.  Close to Times Square.   Good grab and go breakfast. Friendly staff.   Small room but just what we needed for a three night stay.  Wonderful cleaning staff left us extra towels and toiletries.   Only one elevator working on our departure day but the staff was working on it.","travelDate":"2021-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":15288822,"title":"Doble cargo indebido por una estancia inexistente","lang":"es","publishedDate":"2021-08-19","publishedPlatform":"OTHER","rating":1,"text":"Necesito que me faciliten urgentemente un correo eléctronico del hotel para contactar con ustedes. El señor Anthony Canna no atiende hasta el día 23 de agosto.  He llamado varias veces al hotel, pero me dicen que no hay ningún empleado en recepción que hable español, para explicarle pormenorizadamente el cobro indebido.","travelDate":"2021-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":15288822,"title":"Bug issue!","lang":"en","publishedDate":"2021-08-15","publishedPlatform":"OTHER","rating":1,"text":"I normally do not ever write reviews, nor do I tell people not to stay at a Marriott property since I have always had good\/great experiences (platinum member), but this was by far the WORST experience I've ever had. We checked in for one night and when we returned to the room after a night out we saw bugs on the bed and headboard by the pillows! \n\nWhen I reported this to the Assistant Manager, Nykia, she acted as if this was a common occurrence and that there was nothing in the room. Cleanliness standards and customer service here are well below subpar, even coming out of a global pandemic. Do what you will, but here is a picture of who your roommate will be if you stay here.","travelDate":"2021-07","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great Stay!","lang":"en","publishedDate":"2021-08-09","publishedPlatform":"OTHER","rating":5,"text":"The hotel was in a great location and the staff was amazing. I had a couple of hiccups with my check-in (not the hotel’s fault) and Victor, the maintenance engineer was great! Very polite, friendly and so helpful. I would definitely stay here again. The room was very clean and comfy. Wifi was fast (I worked from the hotel for two days). It was nice to have a fridge and microwave in the room, as well.","travelDate":"2021-08","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Conveniently Located Hotel – Good for a Short Stay","lang":"en","publishedDate":"2021-07-18","publishedPlatform":"OTHER","rating":3,"text":"To start with the positives, location was great. Easy access to Transport and Some of the attractions. Very quiet and calm. Room was very well cleaned and arranged for the arrival. Bed is very comfortable. Bathroom is almost new. Supply of toiletries was good quality. Enough towels available. Big flat screen TV with good choice of entertainment and news channels. Speed and reliability of free Wi-Fi was very good. Lobby area is nice and spacious. \n\nOn the other hand, trust the hotel can do better in following areas. I arrived at midnight and found no drinking water in the room or any other area. Happened to go out looking for water; not a nice experience after nearly 24 hours of traveling (flights+ layover). \n\nLaundry is not free and the machines work only with quarters (25 cents coins). Fine if there was a way to secure the coins. I have seen in other places a dispenser exchanging bills to coins. Here it was not. Front desk too could not help. They managed to give just 4 coins which was not at all sufficient. So walked out again to nearby shops to look for quarters. Trust any foreign traveler will not carry coins. \n\nRequested an adopter to charge my laptop as wall sockets are not the same. Straight answer; not available with us. Go and look at a shop. Not very pleasing.\n\nTo conclude, I did not feel like a guest. staff at all levels very efficiently attended to the basics but did not see will \/effort to do that little extra which could have made a big difference. It is a Marriott hotel so I had reasonable expectations due to previous good experience with the brand. Regrettably, staff at this property did not meet the expectations.","travelDate":"2021-07","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Air conditioners are broken","lang":"en","publishedDate":"2021-07-16","publishedPlatform":"MOBILE","rating":1,"text":"I’m currently here in the 4th floor.  I called twice for assistance with the AC as it is not working and there has been no resolution.  The AC still does not work and no one called to ask if the temperature improved. The male at the front desk answered the phone each time.  The first time he stated he would contact the engineer.  The second time he stated perhaps the engineer can come Inside  and take a look at the AC.  That never occurred.\nI d never had such an experience with a Marriott hotel.","travelDate":"2021-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Average hotel","lang":"en","publishedDate":"2021-07-14","publishedPlatform":"OTHER","rating":3,"text":"Read the reviews before booking this hotel! They are almost all accurate. Be sure to have your confirmation number readily available at check in. They attempted to check my husband and I in for a 4-night stay versus the 7-night resevration I booked.  As described in a review online, there are only two elevators for this hotel. There are two more elevators available in the hotel lobby, but they are actually allocated for the Fairfield hotel which happens to be in the same building, but in higher floors (14 and up).  One of the elevators was out of service for a portion of our stay, leaving us with long waits up and down.\n\nOur room was a king \"suite\", but this studio was small, just comfortable enough for two people. Unfortunately our A\/C was inoperable and, while visiting in NYC in July, this was truly a nightmare.  We called the front desk and were told that they would have someone check it on the outside... Hardly slept that night. The following morning we brought it up in person to the front desk and were told someone would come by our room while we were out... Nothing. My husband attempted to contact Marriot directly, by email and by telephone, but never heard back.  Another hot night. The following day my husband demanded a new room, which they provided, thankfully, but never any offer for a discount for the two nights we spent in a terribly hot room.\n\nOther than those problems, the room was average. The towels shed. The continental breakfast was tolerable. The temperature of the water in the shower worked. The surrounding area has been described as \"sketchy\" online, but it was typical New York in our eyes. Safe enough to walk, even alone as night. My husband and I never had any issue with any of the locals. While there is a lot of seemingly homeless persons around the area, they keep to themselves.  The location was great for subway access, for which we were happiest about.\n\nWe probably won't stay at this hotel again.","travelDate":"2021-07","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Florida family trip been terrible because of this hotel","lang":"en","publishedDate":"2021-07-07","publishedPlatform":"OTHER","rating":1,"text":"Very dirty hotel room very small with disgusting smell homeless and trash everywhere breakfast is nothing just some cheap cupcakes  even no coffee at the lobby my kids was very scared from the sketchy people this hotel not related to marriott standards by anyway everyone there fighting with the reception staff because dirty rooms and problems on room types  even if they gave you the wrong room they keep laying on you and promised they will fixed then shift changed and nothing happened and we have to go through over and over again with no change  very much disappointed never will book this hotel again we had the worst experience ever","travelDate":"2021-07","tripType":"FAMILY"}
{"helpfulVotes":6,"locationId":15288822,"title":"Homeless staying at Springhill Suites Times Square","lang":"en","publishedDate":"2021-04-17","publishedPlatform":"OTHER","rating":1,"text":"The hotel participated in the homeless program offered by New York city to shelter homeless people in hotel rooms during COVID. Unfortunately, the homeless made the hotel very difficult to live in. Lots of noise, some drug use. Especially awful was the stench of urine throughout the hotel. It looked like some of the homeless urinated in the hallways. Even outside it was the same. Public urination on the sidewalks, unbearable stay.","travelDate":"2021-04","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15288822,"title":"It's okay","lang":"en","publishedDate":"2021-03-09","publishedPlatform":"OTHER","rating":3,"text":"Stayed this past weekend March 6-8th. I always carefully check every details What's in the room? How big the room? ..  the room was less than 200 SQ feet The website said  265 sq feet. oh no way! The room was much more smaller than 200 square feet. \n Food & Drink - Refrigerator, microwave, and coffee\/tea maker There was no microwave , so I've asked it , they did bring it us. Over all it was okay but the room was not big enough . I thought was over 265 sq feet that's why I've booked it but the room was much smaller . They should not have lie to us on the website. No bathtub but the website showed us \" - Grab bar in bathtub, \" I was not happy but we made it . I didn't want to hustle changing rooms .\n\nIt's clean nice room .\nThe receptionist was bit unfriendly .. but I can understand that too due to this COVD19 situations .. but they could have said \"Hello welcome!\" :):)\nThat's the most important greetings!","travelDate":"2021-03","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15288822,"title":"Drug addict\/dealers paradise ","lang":"en","publishedDate":"2021-01-30","publishedPlatform":"MOBILE","rating":2,"text":"First off I’ll say, the service desk reps and hotel staff were awesome! The outside pics advertised not sure how long ago they were from but I took a more recent pic. It’s so striking I actually walked right pass it. Thanks to someone before passing out kinda showed me where to go. I’m not entirely sure if this place is attached to a shelter or not, but it’s sketchy AF! The people on the street don’t bother you, in fact I was there for a few days so some would greet me but it’s awful to have to walk through nonetheless. I had 2 rooms that smelled like smoke, one I just couldn’t take and had to move. The second, same thing but I gave up. Amenities were nice, cleanliness good. Sad location , it’s a common prob. In the area but this street is the worst. ","travelDate":"2021-01","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Boa localização e limpeza","lang":"pt","publishedDate":"2020-06-19","publishedPlatform":"OTHER","rating":5,"text":"Me hospedei por 3 dias. Café da manhã estilo americano, com bastante variedade. Hotel limpo, cama confortável. Não mexeram em nada meu e ainda me permitiram fazer o checkin antes do horário sem nenhum acréscimo.\nA localização é excelente, à poucos metros estação de metrô, Mc Donald's, Taco Bell, Dunkin Donuts, etc. À 1 km aproximadamente da Times Square.\nCom certeza me hospedaria novamente.","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Quarantined while serving the lovely people of New York.","lang":"en","publishedDate":"2020-04-29","publishedPlatform":"OTHER","rating":5,"text":"My Army unit was sent to assist the city of New York with this horrific pandemic that was reaping habit upon the World. The excitement and the unknowing that lay ahead was somewhat nerve racking. I was anxious to say the least. We packed our gear as though we would be setting our sleeping quarters out on a dock near the Hudson River or maybe Central Park- rumors flourished.\n We were all surprised and ecstatic to find out that we were headed straight to a fixed facility that would be our makeshift Medical Station (Javits Convention Center). The other glorious twist was we were getting to stay in our own hotel room to accommodate the whole social distancing rule. I loved everything about this idea. Thankfully the bus pulled up between the Double Tree and the SpringHill Marriott that would serve has our residence for a unbeknown length of stay.\nOf course I headed straight for the Marriott to ground my gear, because they’re family to me; without second guessing that my name would not be on that guest roster.\n I am so grateful to have gotten to stay at such a beautiful and family friendly facility. Location and quality are two important keys to a successful business, but the people factor is priceless.\nV\/r,\nJames E. Ryals","travelDate":"2020-03","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great stay!","lang":"en","publishedDate":"2020-04-08","publishedPlatform":"OTHER","rating":4,"text":"We made a very last minute decision to take a long weekend trip to NYC Feb 28-Mar 2. We booked this hotel off Trivago based off price, reviews, location and the fact that they offered free breakfast every day, something we unfortunately didn't wake up for on time once. \n\nWe landed at Newark Airport and were delighted with the quick and easy 30 minute train ride to Penn Station. Within a 4 minute walk we were at the hotel!\n\nCheck in was simple and the staff were lovely. The room was comfortable and well equipped, our only complaint (and reason for 4 stars instead of 5) was the layout of the room. We were constantly tripping over everything. I've never tripped or bumped into things before like that in my life. We've been to NYC multiple times, we know they don't have a lot of room to work with, but it just seemed like the layout could have been better.\n\nAsides from that, the bed was comfortable, the room was quiet, the location was great and it was exactly what we needed. I wouldn't hesitate to recommend this hotel to anyone headed to NYC for a getaway!","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Amazing place to stay in nyc!!","lang":"en","publishedDate":"2020-03-22","publishedPlatform":"OTHER","rating":5,"text":"This hotel is amazing. From the moment I walked in, they greeted me with such grace and catered to my every need. One of the best hotels I have ever stayed in. Amazing staff, clean rooms, just overall great atmosphere.","travelDate":"2020-03","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15288822,"title":"PESIMO PERSONAL","lang":"es","publishedDate":"2020-03-19","publishedPlatform":"OTHER","rating":1,"text":"VERGÜENZA es cierto que nos toco vivir ahí el inicio del COVID19 pero ante estas situaciones la atención al cliente es cuando debe ser excelente, no dejaron sin desayuno cuando estaba pagado sin devolver nada, ante la petición de atención en español (que la había) el trato aun fue peor con racismo  y denigrante. nos sentimos totalmente desamparados e impotentes y ayudaron a que el problema y la incomodidad fuese aun mayor. no vayan","travelDate":"2020-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Business Stay","lang":"en","publishedDate":"2020-03-18","publishedPlatform":"OTHER","rating":5,"text":"Great hotel in a great location. The staff, ALL OF THE STAFF, were great and so friendly, always taking time to say Hi or exchange small talk. Also gave great advise on where to eat and how to navigate to our meetings. ","travelDate":"2020-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Big East Conference Tournament that wasnt","lang":"en","publishedDate":"2020-03-15","publishedPlatform":"OTHER","rating":5,"text":"This hotel was fabulous!  Everyone we came into contact with was really nice and helpful.  The breakfast that was included in the price was plentiful and everything was very good.  The location is great, you can walk many places from here.  We will definitely stay here again.","travelDate":"2020-03","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great location, great service","lang":"en","publishedDate":"2020-03-13","publishedPlatform":"OTHER","rating":5,"text":"My family and I booked s Spring Break Trip to New York and we chose this property for our stay.  We were first-time visitors to New York and we chose this property based upon it's proximity to Times Square, the subway, amenities, and price.  We had four people in our group.  \n\nWe were able to schedule Airlink to the hotel from JFK.  We arrived late (10:30 PM EDT).  We were greeted warmly by Front Desk Staff.  They promptly checked us in, provided some key advice after we informed them it was our first visit to the city.  We stayed in a room with two queen beds.  The room was small but knew this because it is New York City.  Not a problem.  The room was nicely decorated and clean.  Beds were comfortable.  We stayed for five days.  The location was great and we could easily get to public transportation or walk to our destination.  We repeatedly asked staff for help, directions and advice and all staff were professional, helpful and friendly.  The free breakfast every morning had a very good selection and was freshly prepared and service staff was professional.\n\nWe had a great stay at this property and will return.","travelDate":"2020-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Bene","lang":"it","publishedDate":"2020-03-08","publishedPlatform":"MOBILE","rating":4,"text":"Albergo nelle aspettative. Colazione confusionaria, ma abbondante. Camere piccole, come solito a NY, ma vivibile in 2. Come al solito a NY, a colte bisogna aspettare un Po per gli ascensori. Staff gentile e premuroso. Atmosfera rilassante.","travelDate":"2020-03","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Pleasant stay","lang":"en","publishedDate":"2020-03-06","publishedPlatform":"OTHER","rating":5,"text":"Very pleased with quality of hotel stay: clean, staff was very helpful and polite; lots of access to nearby restaurants, shops, etc. \nStreet and sidewalks were junky and nasty, but in no way did the hotel reflect such.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great location hotel","lang":"en","publishedDate":"2020-03-04","publishedPlatform":"OTHER","rating":4,"text":"The hotel has a great location, close to many of the sights and is easily accesible. The staff are very friendly and helpful. The rooms are very nicely decorated and modern. Downfall was the room view (inside) and heat (could not heat more than 21C).\nBreakfast was available but not very good (packed bread, tastless omlette and watery oats etc.).","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Amazing!","lang":"en","publishedDate":"2020-03-02","publishedPlatform":"OTHER","rating":5,"text":"Was able to get a room here last minute after another hotel we booked was disgusting. Spring Hill Suites is SO clean. Literally no dirtiness whatsoever. Staff was nice and willing to help as much as possible. She even informed us that they had complimentary breakfast. Amazing stay and an amazing price!! ","travelDate":"2020-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great stay in the city","lang":"en","publishedDate":"2020-03-02","publishedPlatform":"OTHER","rating":4,"text":"Great location - close to subway, Broadway for a show.  Great value - the rooms are super clean and space efficient.  The breakfast was a bit too hectic and the elevators are busy but it’s nyc.  Staff are friendly - we asked for more pillows and they were there next time we went back to the room. Overall a great stay.  ","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great service","lang":"en","publishedDate":"2020-02-26","publishedPlatform":"OTHER","rating":5,"text":"I never know how much to rely on reviews as people have different expectations.  I believe I have pretty high expectations but I am also realistic in my expectations. SpringHill is reasonably priced with updated and very comfortable rooms. I did request a quieter room and found the room to be quiet with double glazed windows. I was only on the 4th floor and did not notice any excessive noise. The bed was comfortable, great bathroom with quality toiletries, safe and coffee machine. The room is tight but that is expected in New York at a certain budget. For me as a solo traveller it was adequate. The staff were all very helpful, friendly and efficient. I could not fault the staff - all lovely people.  The breakfast spread was generous and varied, albeit very busy but that can be avoided by getting there early.  The room was very clean and refreshed daily. The location is great for people who want to be close to Time square and super close to Penn station to get around. I caught the train from the airport and then subway to Penn and it was an easy walk from Penn Station with my suitcase on wheels. All up a good choice of for my first visit to New York. ","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Recommend!","lang":"en","publishedDate":"2020-02-26","publishedPlatform":"OTHER","rating":5,"text":"Great value for NYC . The staff could not have been more welcoming.  They were very attentive and accommodating to our needs.  For example, held our luggage after checkout until flight departure and let us borrow an umbrella :)","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15288822,"title":"A unique service upon check in that deserves recognition and thank you! Keep this up! ","lang":"en","publishedDate":"2020-02-22","publishedPlatform":"MOBILE","rating":4,"text":"I’ve stayed here before and it’s always been very nice. This time I noticed a new feature that improves guest services and communication tremendously. This is something I’ve not experienced here or at any hotel before and thought it should be praised, highlighted, and potentially an idea other hotels can adopt to help improve guests stay! \nAfter checking into my room all was great but I could not adjust the temperature to make it cooler and as it had been after midnight I thought I’d wait till the morning to ask for their help. However, I received an email inquiring how my check in had been-asked me to simply rate from 1-10 and then a space to add any personal comments or requests. I rated highly (8)  but noted that I could not adjust the thermostat in the room and would appreciate when available someone help to adjust that. \nWithin one hour of my filling out this email I received a text message from a person named Amanda at the hotel who greeted me and asked if I’d like to have the engineer come to my room right away to fix thermostat. I was so pleasantly surprised that there was someone on the other end reading personal notes-having actual correspondence with each guest really highlights individual attention to each guest. I texted back and thanked Amanda for reaching out and asked if the engineers were available that it would be great if they could come to the room and adjust thermostat . Amanda thanked me and told me the engineers would be up in about 5-10 minutes. Just as Amanda promised two very kind respectful men, engineers, showed up at my door as I showed the thermostat reading-Immediately the engineers  knew what needed to be done (The engineers Went to flip a switch in main control panel just outside the room) The two engineers were so happy to be able to help, not bothered at all by the call or the fact that it was nearly 2am! They waited with me to reassure me and show me the thermostat would now be working and Within a minute or two the temperature was adjusting to cooler and everything was working perfectly! I thanked them both for their help and they told me I did the right thing by calling and made sure I knew they were happy to help. Thank you very much to all! \n\nAs far as the hotel itself it is a new property, very clean lobby, friendly and engaging people at the front desk, I was greeted kindly by Danae and Ivana upon check in and the front desk staff available for any other questions during stay. \n\nI was pleasantly  surprised at the size and layout of the king studio. The bed is comfortable, both hanging space and drawers to keep items, a couch and two small tables, a refrigerator and a microwave in the room as well. There is a large flatscreen TV with regular channels as well as, streaming apps including amazon, Netflix and Bluetooth audio for streaming music. \nThe large window in the room brought in a nice amount of light and also has black out shades and curtains option for evening time. As stated above EXCELLENT guest services, attention to detail, guest request, and maintenance. \n\nThis hotel offers a very generous breakfast each day-they go above and beyond offering fresh fruits, fruit juices, baked goods, yogurts, breads, spreads, cereals, and hot oatmeal-in addition to an entire other table of hot cooked items (I thought the fresh fruit cereals, yogurts and bread were more than generous!) I did not partake in the hot meals but noticed there was another table lined with hot items like scrambled eggs, fresh cheeses to add to eggs, waffles, and other hot items. During the week breakfast is available 6:30-9:30am and on weekends from 7-10am so to accommodate early risers as well as those who choose to sleep a bit later . \nIf one has time to sit for breakfast there are plenty of tables, chairs and couches to sit at comfortably. Take your time dining or If you are on the go it’s easy to choose items and be on your way quickly. \n\nThis generous breakfast feature seems like something that would be very beneficial to those traveling with family and  kids as there are plenty of options to choose from to make sure even pickiest child finds a few favorite choice items for breakfast and also allows time for family to sit together comfortably and enjoy breakfast before a day out in NYC! \nThank you for everything! \nJill ","travelDate":"2020-02","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excellent","lang":"en","publishedDate":"2020-02-18","publishedPlatform":"OTHER","rating":5,"text":"The springhill suites New York Manhattan Times Square south is very excellent établissements \nThank you very much \nIs nice établissements \nExcellent restaurant \nExcellent excellent excellent excellent excellent \nNew York is very beautiful ville excellent people ","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15288822,"title":"Lovely hotel","lang":"en","publishedDate":"2020-02-18","publishedPlatform":"OTHER","rating":5,"text":"I was in New York for business and I stayed at this amazing property.  Close to Times Square and most important for me, close to the Javits Center. The staff was very nice and helpful. Even if I arrived before the check-in time, they accommodate me in a king bed size bedroom. The room has a decent size and even if the bathroom is small, it has everything you need.  Breakfast was excellent with many options for cold and hot plates.","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Très bon hôtel bien situé","lang":"fr","publishedDate":"2020-02-18","publishedPlatform":"OTHER","rating":4,"text":"Très bon hôtel bien situé à 2 pas de Times Square, bon accueil. Chambre très propre, bonne literie, vue agréable sur d'autres immeubles typiquement newyorkais. Excellent petit déjeuner très varié avec des bons produits. Mais il faut arriver dès l'ouverture car il y a vite beaucoup de monde. Petit bémol, notre chambre était proche de l'ascenseur et nous entendions la machinerie. La climatisation est aussi difficile à gérer et est un peu bruyante mais rien qui ne nous empêche de dormir. Donc globalement je recommande cet hôtel.","travelDate":"2020-02","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Excellent Experience - A Must Stay Hotel","lang":"en","publishedDate":"2020-02-17","publishedPlatform":"OTHER","rating":5,"text":"Had an upscale feel for a great price. Staff was friendly and rooms were clean and looked exactly how pictured online. Will now be my new go to for a hotel in the city. The location was perfect for getting to explore the city, waking distance from clubs, bars, and restaurants. ","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":4,"locationId":15288822,"title":"Prepaid but no room available. Stay away","lang":"en","publishedDate":"2020-02-15","publishedPlatform":"OTHER","rating":1,"text":"Reserved a room that with two queen beds. Prepaid for two nights for two bed room. When I arrived at the hotel they put me in one queen bed and room that was not clean (trash was not picked up and sheets were stained). Came down to the reception and spoke to Manager Amanda who said she didn't have any other rooms. At 11.50 pm, with two little children, I had to scramble to get to another hotel paying $300 additional per night. Bait and switch at a Mariott who knew?!. I'm in the hospitality industry , extremely unprofessional. This place is ok for single travellers, not for families with little children. (didn't even have roll away beds). Horrible is the only word I can think of. On top the reservation the manager Amanda had the audacity to ask if we were canceling the reservation (@ 12.00 Am) without even considering that we would left in the cold with Children (18 degree Fahrenheit).","travelDate":"2020-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Micro miniature rooms at a great location and friendly staff","lang":"en","publishedDate":"2020-02-15","publishedPlatform":"OTHER","rating":3,"text":"Staff is very friendly. Rooms are microscopic even for NYC. You can jump from the toilet seat to the bed and from the bed to the door - if that helps :).  For people 6 ft and more in height it feels extremely claustrophobic and you tend to hit your body or hand in all the furniture all the time !","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"très bien placé","lang":"fr","publishedDate":"2020-02-11","publishedPlatform":"OTHER","rating":4,"text":"Hôtel idéalement placé entre Time Square, l'Empire state building et Hells Kitchen, accueil agréable, petit déjeuner copieux, chambres très propres. Le seul bémol c'est la taille ou la configuration de certaines chambres.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Brilliant hotel, brilliant location","lang":"en","publishedDate":"2020-02-10","publishedPlatform":"OTHER","rating":5,"text":"The hotel itself is lovely and modern. Great central location with easy subway access. Breakfast was great, albeit a bit busy at peak times which was to be expected! The room was clean and tidy, with the bed being huge and comfy! Would definitely recommend and come here again if ever to return to NYC!","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Angenehmer Aufenthalt in sehr guter Lage","lang":"de","publishedDate":"2020-02-05","publishedPlatform":"MOBILE","rating":4,"text":"Die Zimmer sind klein, aber gut ausgestattet. Das Fitnessstudio ist 24\/7 geöffnet und ebenfalls recht gut ausgestattet. Das Frühstück sollte man in jedem Fall vor acht Uhr besuchen; es ist sonst sehr voll und das Management scheint überfordert zu sein. Sehr wenig Personal und es wird nicht regelmäßig „aufgefüllt“. Ein großer Nachteil des Frühstücks ist, dass alles auf Papptellern und Plastik stattfindet - es bleibt ein riesiger Müllberg zurück!!! Das Hotel ist stets gut gebucht. Schade, aber diese Müllberge sind nicht mehr zeitgemäß!","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excellent","lang":"en","publishedDate":"2020-02-05","publishedPlatform":"OTHER","rating":5,"text":"Super staff right from entry to exit . Great breakfast. Staff treats you like family as if they know you since long . Highly recommended to all . Best location !free coffee avaliable in lobby releaves stress .","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great","lang":"en","publishedDate":"2020-02-04","publishedPlatform":"OTHER","rating":5,"text":"Small, but very comfortable. it has everything you need for your stay. Location is very convenient, excellent. Room was just right. I stayed in bigger ones, but this one served me much more. everything new and well designed. Organized environment, very helpful lobby service. only caveat is about breakfast in the final 30 minutes. everything started to end, there was no replacement and the employees were in a very bad mood","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Really enjoyed my stay!","lang":"en","publishedDate":"2020-02-04","publishedPlatform":"OTHER","rating":5,"text":"I really enjoyed my recent stay at this property.  Staff was amazingly friendly and helpful and that included everyone from the house cleaning, front desk, bellman stand to breakfast staff.  Very responsive.  The room was small but typical for NYC and this style of hotel.  It was also clean and had a really comfortable bed\/bedding.  Breakfast was plentiful but extremely crowded unless you went early....say around 6:30 am!  There is a nice exercise room in the basement but the downside on this was the \"smell\".  I know a gym is probably going to have some type of odor but this was really offensive each morning when I went down to exercise.  The only other negative is that the air system in my room would sometime vibrate so loudly that it awaken me at night.  Earplugs helped with that.  I would certainly stay at this property again.  My \"complaints\" should not keep you from staying at this property.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great experience","lang":"en","publishedDate":"2020-02-03","publishedPlatform":"OTHER","rating":5,"text":"Bathrooms and bedding was very clean! room was quite spacious . The breakfast was great and the staff is extremely nice . The location is very convenient.  Will choose this hotel for upcoming vacation. ","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Friendly staff, safe, clean, great breakfast in heart of mid-town","lang":"en","publishedDate":"2020-02-03","publishedPlatform":"OTHER","rating":4,"text":"We loved this hotel. The bellman and front desk staff were warm and helpful. The breakfast was abundant and delicious. The decor was modern and fun. The room was clean and bright. It was a great value for the $$ and we would definitely choose to stay here again. ","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excellent location, friendly staff","lang":"en","publishedDate":"2020-01-30","publishedPlatform":"OTHER","rating":5,"text":"This hotel was just far enough from the touristy area but convenient to time square, broadway shows, penn station, and the subway.  Although the walls are thin, who stays inside while in NYC?  \nThe havoc was a bit too loud so we turned it off most of the time. ","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15288822,"title":"Localização central ","lang":"pt","publishedDate":"2020-01-29","publishedPlatform":"MOBILE","rating":4,"text":"Hotel com localização central, próximo à Times Square (eu prefiro me hospedar nas regiões um pouco mais afastadas da bagunça do centro, mas pra quegm não curte pegar metrô e gosta do turismo de compras, Times Square, Rockefeller Center etc, a localização é ótima). Estrutura boa. Quarto pequeno, mas confortável e bem decorado, chuveiro ótimo, secador de cabelo muito bom. Os elevadores demoram. O café da manhã é ok, poucas opções de frutas. Mas tinham vários pães, bagels, bacon, ovo, iogurte e granola, típico americano (não sei quanto custa à parte, pois o meu estava incluído na diária, se for até uns 11 dólares, eu acho que vale a pena comer no hotel, pq eu como bastante no café, além de achar mais confortável tomar café antes de sair para passear). Tinha café e chá à vontade na recepção, ótimo pra esquentar quando se chega da rua. Bom atendimento. ","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Top!","lang":"nl","publishedDate":"2020-01-28","publishedPlatform":"OTHER","rating":4,"text":" Kamer 515. Nette kamer met koelkastje, magnetron, haardroger, strijkijzer+plank, kluis enz. Alles tip top. Goed bed en ruime douche. Uitzicht was niets maar dat stoorde ons niet. Grote TV op de kamer met toegang tot Netflix (op uw eigen account uiteraard), Youtube enz. Gym 24\/24 open. Kamers elke dag schoongemaakt en bij fooi kregen we telkens een handgeschreven note van de poetsvrouw :)\nOntbijt was zeer ruim en dik in orde met in het weekend wafels (zelf te bakken). Wel zéér druk en best om 7u al aanwezig zijn. Wij vonden het niet erg om in de lobby te zitten tijdens het ontbijt want daar zat je lekker rustig. Je zit hier in New York en voor de mensen die daar al geweest zijn weten dat de New Yorkers nu niet bepaald de meest hoffelijke mensen zijn (nog zacht uitgedrukt) en al helemaal nooit tijd hebben :-))","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Honey moon","lang":"en","publishedDate":"2020-01-28","publishedPlatform":"OTHER","rating":3,"text":"We requested to find room in the last floors or with view and we did not found it and the breakfast during weekend very poor and the hot drink always cold and some times not available, the place for breakfast very small to cover all guests.","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Muito bom!","lang":"pt","publishedDate":"2020-01-26","publishedPlatform":"MOBILE","rating":4,"text":"Excelente localização, bem próximo a estação do metrô, do Empire States e do Madison Square Garden. O café da manhã é bom, no estilo americano, nas com bastante opções. É bom ir cedo porque mais tarde costuma ficar bem lotado e as mesas não são suficientes para todos os hóspedes. Na recepção sempre disponível água saborizada e máquina de café e creme disponível. O quarto é ótimo e silencioso pois as janelas ai que parece são abti ruído e o banheiro tem box com ótimo tamanho tb. A única coisa é que a porta do banheiro é de correr então ouve-se do quarto bastante o barulho do chuveiro e descarga, mas de resto tudo bem. Próximo a Macy's e outros comércios e alguns restaurantes  e bares próximos também. O atendimento da recepção e dos funcionários muito bom. Todos muito prestativos.","travelDate":"2019-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Solid for quick weekend trip","lang":"en","publishedDate":"2020-01-26","publishedPlatform":"MOBILE","rating":4,"text":"Ideal location for traveling in and out of penn station and going to broadway. Rooms are very small, but clean and comfortable bed. Lobby and breakfast area are a zoo. Good value compared to other equivalent options. ","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excelente experiencia ","lang":"es","publishedDate":"2020-01-26","publishedPlatform":"MOBILE","rating":5,"text":"Un excelente servicio, habitaciones muy aseadas, desayunos deliciosos y muy variado. El personal en recepción es muy atento y servicial. Siempre atentos a lo que necesitáramos. Y además cuenta con una excelente ubicación ","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":3,"locationId":15288822,"title":"I had decided never to stay there again before I even was allowed into my room","lang":"en","publishedDate":"2020-01-20","publishedPlatform":"OTHER","rating":1,"text":"Asked in advance for early check-in (ETA ~3 PM), arrived 3:15, front desk said \"I guarantee room will be ready by 4\" (an hour after our requested time), was not given key until 4:15. I did hotel housekeeping when I was younger and could have made up 4 rooms in that time single-handed. Roommate went downstairs for breakfast, dining area was over-crowed, so we returned 10 minutes before breakfast time was to end, but we were locked out. I don't remember what else they did to anger me at check-in but I remember deciding never to stay there again before we even got a key to our room.","travelDate":"2020-01","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Hotel Bacana Bem Localizado.","lang":"pt","publishedDate":"2020-01-19","publishedPlatform":"OTHER","rating":5,"text":"Hotel muito bom, novo, bem localizado, bom cafe da manha, porem como fui no réveillon hotel estava LOTADO, era muito difícil sentar para tomar cafe da manha,era literalmente uma guerra tomar cafe nesse hotel,kkkkkkkk.\nOutra coisa chata era os elevadores, não suportam o volume de hospedes em alta temporada, chegamos a ficar 25 a 30 minutos esperando elevador.No mais hotel é bem bacana, voltaria a me hospedar nele, mas se querem um dica. FUJA DE ALTA TEMPORADA.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great Stay","lang":"en","publishedDate":"2020-01-19","publishedPlatform":"OTHER","rating":5,"text":"I am in NYC every month for work.  I am a Marriott Elite member and always enjoy their service.  This property was clean, well staffed and a great location.  Loved the size of the TV and found the room layout to be very comfortable.  I will stay there again.","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great Service and Value","lang":"en","publishedDate":"2020-01-16","publishedPlatform":"OTHER","rating":5,"text":"Service and staff attitude stood out the most. Everyone was very helpful and friendly. \nNatasha at the front desk stood out - I came down at 1AM after realizing that I forgot to pack an item, she helped me find a replacement, going all the way to their supply room and back to make sure that I had what I need it. More than that - she had a smile and compassionate approach that made all the difference - thank you, Natasha!\n\nThe young man at the concierge desk was also very friendly and cheerful, even early in the morning!\n\nRooms were clean and efficient - everything I needed in a reasonable space for Times Square. Modern and organized feel. It was also very quiet in the rooms, I was able to get great rest in the city that never sleeps! \n\nBreakfast was a little simpler than I expected, especially on Sunday morning but everyone in our group could find something to eat. ","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Perfect hotel, perfect location, perfect service!","lang":"en","publishedDate":"2020-01-14","publishedPlatform":"OTHER","rating":5,"text":"The Breakfast was very tasty and varied, the room was cleaned every day. The hotel is located in a very good area, all within walking distance! \n   I forgot the car keys in the room, very helpful and sent by mail to another country!\n Very happy, I hope to return here again!\n\nP.S. Special thanks to Roxanne for helping with the keys!!! She did everything to help me!","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Don’t hold your breath for Room service","lang":"en","publishedDate":"2020-01-12","publishedPlatform":"OTHER","rating":4,"text":"Stayed 5 nights here great location, rooms were good but small compared to luxury we are used to in Aussie land. Asked a few times for towels or room to be cleaned, just did not happen, got so bad had to front the desk staff to get it myself, even then told to go back upstairs and wait🤣 As it was 9pm and wanted to sleep, demanded manager or point me in direction of laundry room to get them now, they finally relented and got what was asked for! Breakfast was so busy and security was non existent even had homeless filling up plastic bags for their mates? Not sure if intentional but was little disconcerting, but food was good and staff were helpful even when a bit overwhelmed for the waffles!!","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Absolutely fantastic!","lang":"en","publishedDate":"2020-01-11","publishedPlatform":"OTHER","rating":5,"text":"The hotel was fantastic. The location, adjacent to time square, worked very well with the agenda for New Year’s Eve! The staff was courteous, the hotel is spotless, the facilities worked very well! I would absolutely recommend this place and will surely stay here on future trips. A hidden gem in plain sight.","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Can not expect anything else","lang":"en","publishedDate":"2020-01-10","publishedPlatform":"OTHER","rating":5,"text":"Prime location in NYC, I have stayed at other Marriott properties in NYC. I have noticed this property truly held to Marriott standards. Very Clean. Bed was comfortable. I would recommend this property to anyone. ","travelDate":"2020-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excellent location and service. Good quality breakfast. Good value for money.","lang":"en","publishedDate":"2020-01-07","publishedPlatform":"OTHER","rating":4,"text":"Excellent location (close to major New York hotspots and subway stations) and service. Good quality breakfast with a lot of choices in fresh products. Always fresh coffee available. Good value for money. ","travelDate":"2020-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Nice Location","lang":"en","publishedDate":"2020-01-07","publishedPlatform":"MOBILE","rating":5,"text":"Just stayed for 3 nights on a friends trip to the city. We were able to walk to a lot of the main highlights of the city. It was also convenient to the subway which was only a couple streets down. The staff was friendly and helpful. Although check in wasn’t until 3:00 technically, we arrived at the hotel around 10am, and they were happy to hold our luggage so that we could start exploring the city and told us to enjoy the free breakfast that morning. They even placed a phone call to me around noon to let me know they had our room ready. The free breakfast is also a plus. I would stay here again if I ever return to NYC.   ","travelDate":"2020-01","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Small rooms and crowded elevators","lang":"en","publishedDate":"2020-01-04","publishedPlatform":"OTHER","rating":2,"text":"A good deal if you are into exercise. Elevator went out for several hours one day and when it did work, only 2 elevators for 12 floors of rooms. Breakfast was good variety but understaffed and overwhelmed by 2 properties worth of diners","travelDate":"2020-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excelente Hotel","lang":"es","publishedDate":"2020-01-02","publishedPlatform":"OTHER","rating":5,"text":"Nos encantó todo, fue una excelente experiencia.\nDesayuno muy bueno, con buenas opciones\nHabitación cómoda y limpia\nPersonal muy atento ante consultas\nUbicación excelente, cerca de todo para llegar caminando\nservicio en el hall muy bueno, hay disponible para tomar café, té, etc","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Poor service let down the whole experience.","lang":"en","publishedDate":"2020-01-01","publishedPlatform":"OTHER","rating":1,"text":"- Floors were dirty, requested cleaning 3 days in a dow but none were cleaned. Specifically asked for floor vacuum for there are large dusts.\n- Items were left on the floor after cleaning, hairdryer hanging onto the floor.\n- Tea bag in the toilet while first getting into the room.\n- Tissues not refilled, then late arrival when called for a box tissue. Had to call a second time 45mins later, then a security came to deliver it.\n- HVAC was noisy, please get a consultant on the noise level.","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excelente hotel de ciudad","lang":"es","publishedDate":"2020-01-01","publishedPlatform":"MOBILE","rating":5,"text":"Hotel bastante nuevo y muy bien ubicado, en la calle 36, entre la 8ª y 9ª avenida, a 10 minutos de Times Square y menos del Empire State y de cualquier punto en el centro de Manhattan. Tanto las instalaciones como las habitaciones están muy nuevas, cama grande y muy cómoda y limpieza excelente. El personal bastante agradable, algunos hablan español, sobre todo el personal de restaurante. El desayuno buffet está bien, tienes café americano y zumos de máquina, algo de fruta, bollos, fiambre, cereales, yogures, etc. Lo único extraño es la leche, que es como de máquina o crema (por lo visto la leche en este país no se lleva). También tienes bebidas y refrescos en el lobby para poder coger, así como para prepararte infusiones o cafés a cualquier hora. \nLos precios son caros en comparación con cualquier otro destino, pero para ser Nueva York el precio es razonable para lo bien que está el hotel y su ubicación. Lo recomendaría y volvería sin ninguna duda.","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Amazing staff","lang":"en","publishedDate":"2020-01-01","publishedPlatform":"OTHER","rating":5,"text":"The rooms are a little tight but the hotel staff — from the valet\/doorman\/front desk\/housekeeping\/bartenders\/kitchen are crazy friendly and nice. Like wow, especially since the place was fully booked. Location is great and will stay again if in the area! Also, the place is extremely clean. Kudos to housekeeping.","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Noisy Hotel with Very Long Elevator Waits!","lang":"en","publishedDate":"2019-12-30","publishedPlatform":"OTHER","rating":2,"text":"In our room, trying to sleep you can hear every door on your floor shut loud and clear! Wait time at the elevators during our 5 day stay was never less than 3 minutes and many times up to 8 - 10 minutes. Another elevator or two would help a lot. There is not enough places to sit in the breakfast area and they run out of a lot of foods and coffee and cream frequently. The food they did offer that they kept up with was good. They do provide gluten free, if you ask. They definitely need more workers for breakfast as each morning their workers could not keep up with the crowds! They serviced our rooms twice and were very thorough. The air conditioner and heater were very loud so we had to turn it off at night to be able to sleep.","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"LADRONES","lang":"es","publishedDate":"2019-12-26","publishedPlatform":"OTHER","rating":1,"text":"Estuve en este hotel la primera semana de diciembre, y además de que la calefacción de la habitación no funcionaba, al comprobar mi cuenta, me encuentro que tengo un cargo en mi tarjeta de crédito de 168,17€, con fecha del 19 de diciembre. Ni ese día, que ni siquiera estaba en EEUU, ni durante la semana que pasé en en hotel, realicé ninguna compra, o gasto que justifique dicho cargo. Les he escrito varios correos, pero ni siquiera se han tomado la molestia de contestar. Al menos he leído otra opinión en la que pasaba lo mismo, por lo que les aconsejo que si van a NY, no reserven en este hotel, son unos LADRONES. ","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"To many rooms for the facilities. Airports are less packed and better service.","lang":"en","publishedDate":"2019-12-26","publishedPlatform":"OTHER","rating":1,"text":"The hotels facilities can obviously not handle the hotel capacity.\n\nBreakfast (if you do not want to adhere to their schedule and be there at 06:30AM) is a catastrophe! People are sitting on floors, long lines at the buffet and once you get there, everything is empty. There is not even water or juice in the lobby. So a \"breakfast included\"-booking basically comes without a breakfast.\n\nThere is two elevators for the whole 14 stories of the hotel. Whenever you need them they are most probably full, once they arrive after a five minute wait. So be sure you can take the stairs!\n\nThe staff and management are nice but completely overwhelmed by this and are not at all able to help.\n\nThe rooms are solid. We got rooms that are very small with no space to store luggage. Also the only window faces the inside of the building and basically 10 other rooms can look inside your room. However the rooms are pretty new and look nice at first glance. Unfortunately they tend to be a little dirty\/dusty around the edges and corners.\n\nThis is so far the worst experience that I ever encountered in any Marriott Bonvoy hotel. Can't recommend unfortunately. The rooms themself would qualify for a 3- to 4-star review but again the overall situation is just a mess.\n\nAnd be sure to mention that you want to get Marriott Bonvoy-points, because they will not ask you for your membership.","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excelente ","lang":"es","publishedDate":"2019-12-25","publishedPlatform":"MOBILE","rating":5,"text":"Muy buen hotel, excelentes instalaciones. Habitación amplia con cama King size súper cómoda. Con heladera y microondas en la habitación. Baño con todo lo necesario. Buena limpieza. El desayuno excelente, más de lo que uno acostumbra a comer. ","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Modernes Hotel mit toller Lage","lang":"de","publishedDate":"2019-12-24","publishedPlatform":"MOBILE","rating":4,"text":"Das SpringHill Hotel ist modern eingerichtet und in unmittelbarer Nähe der 34 Street Penn (Metro-)Station. Auch der Times Square & das Empire State Building lassen sich problemlos zu Fuß zu erreichen. Unser Zimmer war ebenfalls komfortabel eingerichtet und wir haben uns in den sechs Nächten sehr wohl gefühlt. Etwas nervig war der für die Besucheranzahl zu kleine Frühstücksraum und lediglich zwei zur Verfügung stehende Fahrstühle. Gerade in den Morgenstunden mussten wir regelmäßig 10-15 Minuten auf einen freien Aufzug warten.","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Fantástico hotel para visitar NY","lang":"es","publishedDate":"2019-12-24","publishedPlatform":"MOBILE","rating":4,"text":"Hemos estado en familia durante 6 noches alojados en este hotel.\nPuntos positivos:\n- Buena ubicación\n- Buena limpieza\n- Agua, café sin coste en recepción\n- Habitación no muy grande pero confortable y limpia\n- Camas muy cómodas\n- Servicio desayuno muy completo y renuevan constantemente los alimentos\n- Personal muy amable y atento, tanto en recepción como en el salón comedor\nPuntos a mejorar:\n- Al ser un hotel muy grande, falta espacio para el desayuno. Sin embargo, tampoco no es un gran problema porque se acaba encontrando mesa\nEs un hotel muy recomendable para alojarse en NY","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Weekend in the City","lang":"en","publishedDate":"2019-12-24","publishedPlatform":"OTHER","rating":4,"text":"I had requested early check in about a month and a half prior to our stay on Dec 21st. We were only able to get into our room around 3 pm. I understand it was the weekend before Christmas so the hotel was booked and the lobby was overflowing with guests. No issues they were kind enough to hold our bags while we went out to get something to eat. The room was big enough for two people, king bed was comfortable and very clean. Shower was wonderful. The breakfast was plentiful and had many different options. The staff was kind and the location was in walking distance to some great restaurants. Its about a half mile walk to Times Square. I would recommend this hotel to those staying in the city.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great Hotel","lang":"en","publishedDate":"2019-12-23","publishedPlatform":"OTHER","rating":5,"text":"The hotel is located around many restaurants, stores and train stations. The staff is always very courteous and helpful. Rooms are very neat and clean.  Bathrooms are a little smaller than usual but still are fully equipped with toiletries and fresh towels. ","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Decent","lang":"en","publishedDate":"2019-12-22","publishedPlatform":"OTHER","rating":3,"text":"First, be prepared to wait for elevators. Whose idea was it to install only 2 elevators per hotel?\nHousekeeping: had to ask more than once for replacement coffee service and new shampoos after a room cleaning. One of those times I went to the front desk myself to ask for replacements, I was told they would send it up and it never arrived.  \nOne of three elliptical machines in gym is broken. Water in fitness center frequently had no cups. \n\nDesign is nice. Central location. Staff is friendly. Two requests for different shower issues were handled very quickly.  ","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Perfect Hotel for our holiday !","lang":"en","publishedDate":"2019-12-21","publishedPlatform":"MOBILE","rating":5,"text":"Booked this hotel late trying to save some money on accommodation and we was very happy that we decided to opt for this hotel ,Friendly staff and very good options for breakfast .Room was small but we knew this when booked but bed was very comfortable and good shower also !\nOnly one complaint was sometimes difficult to get a lift this didn’t bother us as could do the stairs but wouldn’t want to be much higher then the 6th floor !","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Surprised Amzingly","lang":"en","publishedDate":"2019-12-20","publishedPlatform":"OTHER","rating":5,"text":"IN NY ManHattan area, to get such a big room was surprisingly positive. Ambience, welcoming reception, open space all appreciated.  Only area of improvement was breakfast spcae & some more veggie option at Breakfast needed.","travelDate":"2019-12","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Un acierto!!!! 100%","lang":"es","publishedDate":"2019-12-19","publishedPlatform":"MOBILE","rating":5,"text":"Acabamos de volver de alojarnos en este hotel 5 noches y tengo q decir que es un hotel estupendo en todos los sentidos!!! Está muy cerca de times square, del metro Pen station, del empire state, y de muchas otras zonas turísticas. Como he leído en otros comentarios las habitaciones no son especialmente grandes pero nosotros éramos tres y teníamos espacio suficiente para las dos camas dobles un sofá y el armario, y el baño...en realidad no vas a Nueva York para estar en la habitación, solo la usas para dormir, así q en mi opinión hay espacio más que suficiente. Un detalle q nos ha gustado, es q tienen enchufes USB en la habitación, y eso es muy comodo, y no hemos tenido q usar adaptadores. \nEl desayuno está bastante bien, los fines de semana puedes hacer tus propios gofres, y, eso sí, es mejor bajar pronto, para que puedas coger mesa con más facilidad, aunque realmente es bastante ágil. Las camas son de las más cómodas q he probado en un hotel, y os aseguro que soy bastante especial para este tema. \nEl personal de recepción son amables, pero tengo que destacar la atención de Harold, quien nos ayudó mucho con el tema de la empresa de traslado, ya que habla español...muy amable por su parte. \nPor lo demás, es un hotel muy nuevo y limpio, bien situado y que nos ha gustado mucho. Lo recomiendo 100%!!!","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great hotel with a perfect location","lang":"en","publishedDate":"2019-12-18","publishedPlatform":"OTHER","rating":5,"text":"Just spent 2 days at this great hotel. The rooms are small, but immaculate and very well designed. The breakfast was wonderful. We loved the location and plan to stay here again soon! We highly recommend this Spring Hills Suites,","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Must have been a bad day","lang":"en","publishedDate":"2019-12-17","publishedPlatform":"OTHER","rating":4,"text":"New York City at Christmas time. What could be better? I planned a fun filled holiday weekend with family and friends. I called a month ahead of time to reserve any two rooms adjacent to each other for my loved ones. Marriott said, “No problem”. I get an email a couple days before my arrival asking for any requests. I try to confirm the rooms near each other. Nope. They make it happen and email me confirmation. I arrive to find. Nope. Sorry. You now have to wait an hour and a half for us to find you the second room. I had reservations for dinner and the Rockettes. I was not pleased. We had to rush to dinner and the show. Everyone was cranky after that. They offered me some points back only after I complained in writing. I like the location and the property but service was lacking. ","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great location","lang":"en","publishedDate":"2019-12-13","publishedPlatform":"OTHER","rating":5,"text":"In town for the Jimmy V Classic at MSG. Staff was amazing. Front Desk and Bell Staff great with directions and recommendations. Will look to stay again when I'm back. Transportation service was great. Got me to my meeting, waited for me, and got me back to the Hotel. Very much needed during the busy morning traffic! ","travelDate":"2019-12","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Fantástico hotel","lang":"es","publishedDate":"2019-12-12","publishedPlatform":"MOBILE","rating":5,"text":"Acabamos de volver y ha sido maravilloso, el hotel tiene muy buena ubicación, instalaciones nuevas, el trato al cliente es exquisito, te ayudan muchísimo. El desayuno muy bueno, variado y abundante, de 16.00 a 22.00 h, en el Hall tienes bebidas gratis. En la habitación microondas, nevera, tabla de planchar y plancha. El armario si es escaso, pero bueno, éramos 3 y nos apañamos muy bien. Muy limpio y lo dicho, recepcionistas muy dispuestos y todo el personal en general muy simpático.","travelDate":"2019-12","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Excellent staff, but overwhelmed property","lang":"en","publishedDate":"2019-12-10","publishedPlatform":"OTHER","rating":4,"text":"This hotel does not fit the brand promise - the rooms are not suites and they are super small.  How Marriott distinguishes this product from the Fairfield Inn (which occupies the top floors of the same building) is a mystery. Also, if you're noise sensitive, don't stay on the 36th Street side.  In fact, if you're noise sensitive, stay at the Fairfield on the upper floors facing away from the street.  The public space is way undersized for the number of guests - you've got to fight to get your breakfast, fight for a table to sit to eat that breakfast.  Long wait to speak to a person at the front desk or to answer the phone. Housekeeping is overwhelmed as well - you may or may not get regular housekeeping.  However, several at the front desk have the hospitality gene- including Coleen, Roxanne, and Amanda.  Avoid the others if possible.  On the very positive side, this is a new hotel and the guest rooms are well appointed, beds are comfortable, TVs large, lighting good, etc.","travelDate":"2019-11","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"First time here","lang":"en","publishedDate":"2019-12-10","publishedPlatform":"OTHER","rating":5,"text":"Girls trip, \n\nFirst time in New York and the service of this hotel was incredible. The staff really went above and beyond for us nothing was too big an ask for them\n\nWill definitely recommend to others and a second trip for myself ","travelDate":"2019-12","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Nice hotel, good location","lang":"en","publishedDate":"2019-12-10","publishedPlatform":"OTHER","rating":4,"text":"The hotel was reasonably priced for the great location. Rooms are not huge, but good sized for NYC. Everything was clean and well maintained. When contacting the front desk, they were quick and responsive to our needs. Breakfast was good. The last day of our stay, one of the elevators broke, making it difficult to get around, but other than that, I'd stay here again. ","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Convenient Location","lang":"en","publishedDate":"2019-12-09","publishedPlatform":"OTHER","rating":4,"text":"This is a new property and very well located.  Room is comfortable,  but very small.  The ironing board takes up most of the closet space, and safe is located under closet, so you need to lie on the floor with your own flashlight to use it.  Small bar and lounge not separated from reception area\/waiting room, and at Happy Hour most seats are taken by families with huge luggage.  It would be wonderful if they could separate areas and remove bright lights.  Happy Hour 4-7 with good prices, but bar food cannot be purchased until 6 pm.  Nice to meet for cocktail and conversation before dinner res.  Elevators are shared with work\nStaff and sometimes one is taken out of service to be used for food service only.  The breakfast is complimentary and very good, a step above.  All in all it is a great value, comfortable and would be great if they improve the few negatives I mentioned.  ","travelDate":"2019-12","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":15288822,"title":"False Advertising","lang":"en","publishedDate":"2019-12-09","publishedPlatform":"OTHER","rating":1,"text":"A 9' x 15' room with a microwave on a shelf does not make a SpringHill Suites!  This is blatant false advertising.  This hotel should be rebranded as it does not fit the brand profile.  I could not sit in the chair at the so-called desk, as it was wedged in between the so-called desk and a small couch.  In the bathroom, there was nowhere to place a toiletry kit -- I had to leave it on the bed while using it.  The HVAC sounded like a jet engine, and kept going on and off.  The temperature control had two settings -- too cold and too hot.  Avoid this property.","travelDate":"2019-12","tripType":"BUSINESS"}
{"helpfulVotes":3,"locationId":15288822,"title":"First time in New York, hotel perfect","lang":"en","publishedDate":"2019-12-07","publishedPlatform":"OTHER","rating":5,"text":"I came to New York expecting our room to be small as apparently that's very common here. The room was small and compact, especially as 4 of us were staying in one room (2 couples) but we managed perfectly. We were only there for 3 nights so just lived from our suitcases. \n\nThe room was modern and clean, the shower room was also spotless. I'm very fussy when it comes to cleanliness and this hotel didn't disappoint. \n\nThe complimentary breakfast that was included with our trip was fantastic considering it was free. It might not please some that you eat from paper plates and plastic cutlery but i guess that's how they stay on top of keeping on top of demand as breakfast was always busy with people coming and going. We didn't struggle with queues at all though and to be honest i don't mind eating from paper plates, it's only a quick breakfast before heading out for the day. Breakfast included English breakfast selection, waffles (only on the one morning, the other 2 mornings the waffle machine disappeared), a selection of fruit, cereals, yogurts, toast machines, drink machines... What more could you need!\n\nI've read a review since coming home about the heating in the rooms being noisy - on my first night when my sister in law put the heating i was like \"are we sleeping with that on!?\" - but once i got into bed and got used to it it didn't affect me at all during our stay. \n\nThe location is perfect - i'd definitely stay here again and have recommended the hotel to my Sister who would like to come to New York one day.","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Sin calefacción en la habitación, con temperaturas bajo 0°","lang":"es","publishedDate":"2019-12-06","publishedPlatform":"OTHER","rating":1,"text":"Mi opinión sobre el hotel no puede ser peor, en los 7 días que he pasado en el hotel la calefacción de mi habitación no ha funcionado correctamente. Tras funcionar durante unas horas, está se apagaba y no había forma de encenderla. Llamaba al tecnico, este la encendía, se volvía a apagar al cabo de unas horas, y otra vez a empezar. Esto ha se ha producido cuando en NY las temperaturas durante estos siete días en ningún momento han superado los 0C. La solución que me propusieron el 4° día, era cambiar de habitación, eso sí, perdiendo toda una mañana de mis vacaciones, ya que además se tener que hacer las maletas, tenía que esperar durante hasta las más tarde de las 12 a que me dieran la nueva habitación. Por todo ello NO recomiendo elegir este hotel cuando sea necesaria la calefacción o el AC.Má","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Poorly thought-through property w\/tiny rooms and bathrooms....","lang":"en","publishedDate":"2019-12-06","publishedPlatform":"OTHER","rating":2,"text":"We have gold status at Marriott hotels—but this place stuck us in what looked like one of the smallest rooms on the 16th floor where we grew old just waiting for the elevators.   The room was clean—and the bed was okay, but the air handling system boomed on and off all night long.  There is a tiny armoire closet—but absolutely no shelf-space. Our bathroom was slightly larger than a phone booth (remember those?) with the toilet facing the bed.  \nWe were there for three nights—and the trash that was on the hall-floor outside our door the first night we arrived was still there when we checked out.\nSomeone who strutted around in the lobby for about five minutes looking like a manager picked up a stray cup and then disappeared. \nGratis coffee in the lobby is a nice touch—but only if there is actually coffee in the pot.  The concierge told us she wasn't authorized to notify anyone that it was empty—that was the job of the desk clerks...but the desk clerks had long lines of people to check in and out. \nThe breakfast buffet was above standard, in a nice room that the staff worked hard to keep clean and picked up, and well-managed.  \nStill, Marriott has some real work to do if this property is to be palpable.  Better general management might be a good place to start.\nIf you are traveling solo and not in a big rush, this hotel is okay and close to The Javits' Center. Beyond that, meh.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"December in New York","lang":"en","publishedDate":"2019-12-06","publishedPlatform":"OTHER","rating":5,"text":"Excellent location, quiet room , wonderful bed and great high definition television- within walking distance to Penn station- large eating area for breakfast included. Staff was very helpful and courteous.","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Appena sufficiente","lang":"it","publishedDate":"2019-12-05","publishedPlatform":"MOBILE","rating":2,"text":"Ho soggiornato in questo hotel 1 settimana con 2 amiche, la camera era carina e pulita ma piccolissima per 3 persone ,c’era un armadietto minuscolo dove a malapena stava un piumino quindi avevamo le valigie per terra e sopra la scrivania di fronte ai letti. La colazione punto dolente dell’hotel:va bene che fosse compresa però era un disastro, i prodotti come croissant e pane in cassetta cattivissimi marmellate idem disordine ovunque bidoni della spazzatura ovunque che venivano svuotati quando ormai erano  stracolmi da maleducatissimi inservienti che usavano guanti di protezione sia per togliere le brioche dal sacchettone di plastica dove erano contenute sia per svuotare i sacchi della spazzatura. I tavoli per la colazione insufficienti per l’afflusso di persone e perennemente sporchi e da sbarazzare. Quindi non date la colazione compresa nel prezzo se questo è il risultato.  Un’altra cosa inconcepibile era lo stazionamento di cassoni di biancheria a volte sporca a volte lavata davanti all’hotel e immondizia a giorni alterni... \nUna cosa positiva era la vicinanza della subway.\n","travelDate":"2019-11","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great value, great location","lang":"en","publishedDate":"2019-12-04","publishedPlatform":"OTHER","rating":5,"text":"We came for a college hockey game at MSG and a Broadway show.  The location was great for both.  The staff was very friendly, even when the lobby was crazy busy, and they stored our luggage until our room was ready.  Our room was small, not much view, but fine (big TV, good WiFi, and lots of outlets -- yeay!).  The hot buffet breakfast food was standard but plenty of it.  The lobby was modest, but at night, the lobby coffee was still hot --- yeay again!  It's not a fancy place, but it had everything we wanted, and [with our senior discount] a fantastic value.","travelDate":"2019-11","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":15288822,"title":"Excelente estancia, pero mucho cuidado con los cargos extra","lang":"es","publishedDate":"2019-12-04","publishedPlatform":"MOBILE","rating":5,"text":"Nos hemos alojado en este hotel con motivo de nuestras vacaciones. Es la octava vez consecutiva que vamos a Nueva York porque nos entusiasma la ciudad, y de hoteles americanos entendemos bastante debido a nuestra experiencia. En primer lugar hay que entender que estamos en Nueva York y por ende, las habitaciones son pequeñas. He leído opiniones negativas de este hotel alegando lo reducido que es el espacio y he entendido dichas opiniones cuando he visto la tipología de huésped que se alojaba. Entiendo que el hotel acaba de abrir y lo están promocionando a base de grupos numerosos de turistas, los cuales han estado muy poquito en tierras americanas. Vamos a ver, si estamos habituados a ir de \"excursión\" a Benidorm, Tenerife y similares, donde por el mismo precio o incluso menos, nos alojamos en habitaciones que tienen su salón, dormitorio, terraza, etc, pues claro, venimos a Nueva York y queremos una suite presidencial en el Plaza, pero no señores, estamos en Nueva York, y eso se paga. Dicho esto y basándome en mi experiencia tras haber pasado por esta ciudad ocho veces, además de por Washington, Philadelphia, Chicago, Delaware, Boston y New Hampsire, la habitación del Springhill Suites es grande, y por el precio que tiene, lo es aún más. Hemos estado muy a gusto, la limpieza, la atención, el desayuno, la calefacción (que les aseguro que no es ruidosa, y lo digo por experiencia), el gimnasio, la lavandería, la recogida de paquetes en recepción, y en general todo, ha sido sobresaliente, y nunca he tenido esta experiencia en un hotel de Nueva York. Ni un solo problema durante toda la estancia....y cuando todo parecía ser perfecto, en el último minuto (literalmente), al hacer el check out, lo arruinan todo, intentando cobrar cuatro míseros dólares por una supuesta conexión a la red wifi de alta velocidad. En mi caso se han escudado en que un día me he conectado, y hay que decir que el acceso a la red es complejo, enrevesado más bien, y para alguien que no esté acostumbrado, difícil, porque intentas entrar y no lo consigues hasta que terminas dando vete a saber tú dónde y accedes, ¿se puede hacer de otra forma? Por supuesto, cambiando la forma de acceder, pero eso no les interesa, por supuesto....había leído una opinión que advertía de la cautela que había que tener con los cargos extra, y estoy en la obligación de decir que es totalmente cierto, y me parece un abuso que se intente sacar dinero de confusiones y malos entendidos. Tras mucho protestar y porque caía por su propio peso, nos \"quitaron\" el cargo, pero precisamente por haberme hecho pasar ése último minuto, y para evitar que futuros huéspedes lo tengan que pasar, aviso de ello aquí. Por lo demás, el hotel es de diez, pero lo de los cargos encubiertos....","travelDate":"2019-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"overnight in NYC","lang":"en","publishedDate":"2019-12-03","publishedPlatform":"OTHER","rating":5,"text":"walking distance to Penn Station. Great hotel. Clean, nice staff. Rooms were TINY, but well worth the price! Full complimentary breakfast was amazing. We had such a nice stay and we will definitely book this hotel again.","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":15288822,"title":"Beware of this hotel !","lang":"en","publishedDate":"2019-11-27","publishedPlatform":"OTHER","rating":1,"text":"Where do I start ?\nI’ve stayed at 29 different Marriott hotels this year. I booked SPRINGHILL Studio, 2 queen with Terrace for 2 nights. The sole reason I booked this hotel was for the terrace. \n1. Upon check-in my loyalty was acknowledged :-) . \n2. Post checkin I stopped at the refreshment stand to grab some water but the water station was empty.\n3. Upon arrival to the elevator I had a 27 minute way and approximately 50 people waiting for the elevator (photo attached).\n4. Upon arrival to my room I noticed they put me at FAIRFIELD not SpringHill as I had originally booked. I also noticed no terrace (the sole reason I booked this hotel at the HIGHER COST).\n5. Human blood stains found on bed #1 photos attached .\n6. Old food found in the fridge (photos attached). \n7. The room was saturated in a chemical smell (not good for an individual as myself who is sensitive\/carries 3 epi pens with me)\n8. sleep was nearly impossibly as you could hear every person leaving\/entering the elevator, room doors slamming, some noise above that sounded like a cannon going off every 12 minutes throughout the night . \n9. No matter what I changed the thermostat to, the heat did not waiver in temperature(photo attached). I set the thermostat to 65 and the room NEVER got below 78. Due to the extreme heat in the room I had to jeopardize my privacy and safety by keeping my hotel room door propped open with a trash can. \n10. 5:05am I was awoken by doors slamming\/people showering . PERFECT. Who needs sleep right ? \n11. 6am I proceeded downstairs for coffee\/ talk with hotel management. 16 minutes to get to the lobby via elevator due to the mass influx of people. \n12. 620 arrive to front doors of the breakfast room (that opens at 630am). I politely poke my head in & ask the wait staff where might I be able to obtain a cup of coffee. I was then scorned at by the staff screaming at me “we are not open yet”. \n13. 625am I speak with the hotel front desk. I inquire into why I was placed into Fairfield when I had booked SpringHill 2 weeks prior. The Ladie stated it was because there rooms are full. As a gold member I booked my hotel 2 weeks in advance and did  Mobile checkin 24hours prior to my arrival. Isn’t this something you should inform your guests on? Furthermore, I booked AND PAID MORE FOR a room with a terrace, but I didn’t receive such; in fact, I didn’t even get the correct hotel I booked with. The Ladie stated she would speak with the hotel manager. I asked her to please inform the manager that my room also has a fridge full of old moldy food\/blood on bed sheets. Few minutes later she returned in which she stated the manager would be calling booking.com to see what happened . Well, I didn’t book on booking.com. All she could offer me was 10,000 points on Marriott account. To me, this was an insult. I then asked if they have terrace rooms in which she replied “no”. I booked a suite with a terrace at a higher cost , but no rooms at said hotel have a terrace? - this is false advertising and representation!!! No refund for the higher cost of my non existent “terrace room” was provided or offered . Switching rooms also unavailable . The front desk ladie could offer me no more. I then asked her “well could I AT THE VERY LEAST get my moldy fridge cleaned and the BLOOD off my bed?” In which she stated, “yes I will send someone up right away”. I kindly thanked her. \n14. 645am breakfast has a Good selection of food. Go early. Already about 100 people in breakfast area (photos attached) . \n15. After breakfast proceeded to my room . 24 minutes to get up to my floor . Finally got on an elevator and I was scrunched in between about 50 people. By the time I made it to my floor (25) I had 2 people cough in my face, 1 man pressed up directly on top of my buttocks, and 3 different individuals hair in my coffee . So much for my morning coffee I was so desperate for. \n16. 10am, I have now cleaned the fridge myself but still have human blood on my bed . No housekeeping as of yet .\n17. 4:30pm housekeeping knocks on my door asking if I need anything. I explain my requests put in at 6am. Housekeeper was not knowledgeable of this & apologized . Housekeeper stated the new linens are downstairs and some one will bring them right up. She also stated she informed the manager and I should expect a call from the manager within 15 minutes . I kindly thanked her .\n18. 4:45pm new housekeeper shows up . Hands me a new set of linen\/blankets & walks away. I guess the $500 I paid for my “terrace” room includes me making my own bed and removing blood stained sheets myself ?! Good thing I have medical gloves with me . \n19. Bartender downstairs was INCREDIBLE , I thank you !\n20. Next morning I check out. Never heard from a manager . \n21. This is my first and last time staying at a Fairfield Inn. \n22. I’ve stayed at 29 different Marriott locations this year, I travel weekly for business , and I always attempt to book a Marriott before any other hotel. This stay has now made me re-consider my loyalty to this company !","travelDate":"2019-11","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"ペンステーションから2ブロックの便利な立地居心地のいい部屋","lang":"ja","publishedDate":"2019-11-25","publishedPlatform":"MOBILE","rating":5,"text":"ニューワークとJFKどちらの空港へのゲートウェーになるペンステーションへ2ブロックというのは非常に便利な立地です。\n\nNYのホテルはベッドが事実上の唯一の家具場所も多いですが、ここのお気に入りはコンパクトながらもテーブルと一体となったソファがある事。このおかげで居心地が非常に良く感じました。\n\nまたベッドも非常に寝心地が良く、また泊まりたいと思うホテルでした。難点は朝食時のスペースが混み合っていることくらいですかね。","travelDate":"2019-11","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15288822,"title":"Amazing hotel","lang":"en","publishedDate":"2019-11-23","publishedPlatform":"OTHER","rating":5,"text":"Great hotel in a great location in NYC. The associates were very friendly and helpful and the rooms\/property were spotless!  Great breakfast assortment in the morning and a nice happy hour in the evening. ","travelDate":"2019-11","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great location and amenities","lang":"en","publishedDate":"2019-11-19","publishedPlatform":"OTHER","rating":5,"text":"I was pleasantly surprised by my stay at this hotel. It is a newer hotel, so it has the amenities (keyed elevator access, room safe, USD inputs by bed) a business traveler expects. The breakfast selection is extensive and the seating area is well thought out. Check in was a breeze and the staff was very pleasant. The hotel is a block away from subway lines. I'll stay here again.","travelDate":"2019-11","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Très bonne situation et petit déjeuner","lang":"fr","publishedDate":"2019-11-19","publishedPlatform":"OTHER","rating":4,"text":"L'hotel et très bien situé pas très loin de Times Square. Nous sommes partis en fammille avec deux enfants et l'espace dans la chambre était suffisant. Le petit-dejeuner est vraiment un plus bien qu'à partir d'une certaine heure, il faut attendre pour avoir une place assise.\nNotre chambre était nettoyée chaque jour. Un hôtel à conseiller pour un séjour à NY","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great location, clean & modern","lang":"en","publishedDate":"2019-11-15","publishedPlatform":"OTHER","rating":5,"text":"Great location. Modern, tasteful decor. Everything appeared to be in brand new condition.  Rooms were clean.  Breakfast is included and it has a wide variety of food to choose from. There were no issues encountered.","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great Place","lang":"en","publishedDate":"2019-11-14","publishedPlatform":"OTHER","rating":5,"text":"Stayed here for the first time...stayed three nights.  The room was clean, updated, and overall very acceptable.  It's a smaller room but then that is often the case with NY!  It is a newly updated hotel, however, and has nice accommodations.  Stays include a free breakfast that doesn't disappoint since it offers many choices.  There is also a bar on site and a very comfortable atmosphere.","travelDate":"2019-11","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Not Springhill.   Rooms and housekeeping need improvement.  Great location & service","lang":"en","publishedDate":"2019-11-12","publishedPlatform":"OTHER","rating":3,"text":"Marriott regulars should know that this is NOT CONSISTENT with Springhill Suites.   The rooms are not suites and are certainly not like any other Springhill.  You get an email heads up on this a few days before arrival (usually too late to change at that point).  The public areas are very nice.  Service was courteyous and helpful.   Great modern gym.  Good fast internet.   My room was very quiet, which I really like.  Good breakfast.\n\nThe rooms are TINY, which is typical for NY but not what a Springhill Suites customer would reasonably expect.   As a solo business traveler I was ok with this.  If I had a family, it would have been a disaster.    The carpet felt dirty and had dark mystery stains.  So did the fabric chair.  Furniture was nicked in places so looked dated.  Desk was occupied by a cheap microwave.\n\nHousekeeping made mistakes each day.  One day they did not replace the cups.  The next, they did not replace the coffee packets.  Every day they did did not clean the coffee maker.\n\nElevators take a while, which is not atypical in NYC.   The location is excelllent for the Javits and Penn Station.  Not too far from TS if that's your thing.\n\nI might stay again if it's cheap, but I've got other hotels in similar price categories that I like better such as the Fairfield Inn near the bus terminal.  It's about the same as the DT across the street but better service and worse rooms.","travelDate":"2019-11","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Good hotel with a few glitches","lang":"en","publishedDate":"2019-11-03","publishedPlatform":"OTHER","rating":4,"text":"We were in NYC pre-cruise Columbus Day weekend.  The hotel is new and trendy, but the rooms are just a little bigger than a cruise ship cabin.  It was fine for two nights, but to stay for any amount of time would have been cramped.  The safe is on the floor of the tiny closet, you have to literally get on your hands and knees to use it, very awkward.  We were a few doors down from the elevator, and I heard it ding all night long.  The HVAC system was also pretty noisy for light sleepers, but the bed\/pillows were nice and comfy.  Staff was young and could have used a little more customer service training.  Breakfast was good and well stocked and staffed, a nice bonus.  We usually stay closer to Grand Central Station, but the rates for the holiday weekend were pretty high.  This hotel is in the garment district, easy to get around but a little gritty.  We never felt unsafe, but there were homeless people sleeping on the streets. Was it a bad hotel?  No, not at all.  But I don't think I'd stay there again, just based on room size and location.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Hotel propre calme très bien situé","lang":"fr","publishedDate":"2019-11-01","publishedPlatform":"OTHER","rating":4,"text":"Chambre très propre, silencieuse, ce qui a mon avis est rare à New York. Un peu petite toutefois (nous étions 4 et avions pris en chambre avec deux lits)\nIl y a un micro onde et un frigo, ce qui peut être bien pratique pour un diner rapide dans la chambre. La salle de petit dej est prise d'assaut et il faut attendre parfois un peu pour pouvoir s'y installer (mais nous étions 4) \nLe personnel était très très agréable, souriant et accueillant. \nJe recommande vraiment cet hotel, nous y avons passé un très bon séjour.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Stay away unless you want to be robbed by the hotel.","lang":"en","publishedDate":"2019-10-31","publishedPlatform":"OTHER","rating":1,"text":"Stay as far away as possible from this establishment unless you want to be robbed! \n\nI made the reservation through booking.com on 23rd June 2019 for our 2 night stay on 25th October and 26th October. I picked did the pre-payment option and they charged the card on 25th June 2019. Everything looks fine until the night before we checked in. I called ahead the day before our check-in date to make sure things were good to go and they told me they couldn't find our reservation and has not charged our card yet.. Admittedly, it has been a couple of months between june and october so i don't remember if they had charge my card. I had told them it was a prepayment option we picked and should have been charged by now. They went ahead and charged the card again. (I should have realized the red flag. How do they have the card information if they don't have my reservation given that it was my first time in the establishment.) \n\n2nd Red Flag, they gave us a smaller room than the one we had reserved yet they had the audacity to charged me for the price of the bigger room. I had to go down to tell them at the lobby that is not the one we reserved.\n\nFast forward to today, I had checked my credit card statement after my trip in new york to find out I had been double charged one in june and one when i checked in. I try to give them the benefit of the doubt and called the hotel to tell them they had double charged me. Basically, front desk told me they weren't able to help and transferred me to accounting... and its nothing but always voicemail. So they basically robbed me blind for my stay here.\n\n*DO NOT STAY HERE EVER*","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Decent hotel but BAD customer service!","lang":"en","publishedDate":"2019-10-30","publishedPlatform":"OTHER","rating":3,"text":"We were on business to New York staying at SpringHill Suites for 6 nights. As titanium member, we requested for an upgrade upon check-in on a Thursday. The staff told us that the hotel was full and told us to come back the next day as most people left on the weekend.\n\nSo my husband did go back the next day. Again, we were told that it's full and was told to come back on Saturday. We totally understand that upgrade is not guaranteed and is based on availability. But we knew for sure that the hotel was far from full as half of the breakfast area was closed off in the weekend. At this point, we didn't even care about getting upgrade as it's too much work to pack things up to move to another room. All we wanted was to test the front desk and see how far they can lie to their customers. Lo and behold, we were told to go back on Sunday. We found it absolutely hilarious at this point. \n\nThis hotel is actually not bad for its location and decor but really lacks in customer service. We are proven loyal Marriott customers but don't feel that the hotel even tried the slightest to reciprocate our loyalty. We'll definitely not return to this hotel as there are other good options around the area.","travelDate":"2019-08","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"úžasný pobyt ve skvělé lokalitě","lang":"cs","publishedDate":"2019-10-24","publishedPlatform":"OTHER","rating":5,"text":"Hotel byl naprosto fantastický, ve skvělé lokalitě, v blízkosti metra a známých budov\/památek. Personál byl velice milý a ochotný a se vším poradil. Kafe\/čaj\/voda k dispozici celý den. Wifi fungovala skvěle. K snídani podávali vajíčka, šunku\/sýr, bagel, marmeládu, vafle atd. Dalo se v pohodě vybrat.\nPokoje útulné, čisté, pohodlné postele. Plus za usb připojení. Denně úklid.\n\nJediné co by se dalo vylepšit je omezit plastové příbory u snídaně.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":3,"locationId":15288822,"title":"I would not recommend a stay here","lang":"en","publishedDate":"2019-10-18","publishedPlatform":"MOBILE","rating":2,"text":"Hmm where do I start. It's not the worst hotel I have ever stayed in but definitely in the low end. If you have very low expectations to your hotel you will probably be fine hence the 2 stars.\n\nA bit about the hotel itself. It says \"new\", but it's actually just renovated which you can clearly tell on the inside. Rooms are VERY small, some of them can barely fit the king size bed. Most bathrooms have a sliding door facing the bed which is a bit uncomfortable. The rooms have a ventilation system besides the AC unit which is quite noisy and cannot be turned off. If you are on the top floor it will sound like a hurricane just outside your door (I brought one of the front desk guys up there and he was even shocked).\nElevators are a chapter for themselves, they are very slow and in some rooms you will hear them operate with banging and buzzing sounds. \nBreakfast is free and decent but basically quantity over quality. Staff are friendly but don't seem to have the power to properly handle and compensate issues. \n\nBut let's dig into why it was an unpleasant experience for me. I stayed for 5 nights and basically spent the first 24 hours switching rooms until I found one that was tolerable. They kept saying that they were fully booked but somehow found rooms once I insisted. As compensation for my trouble I was given a free drink at the bar which turned out to be only valid for some pre-made punch. Sigh.\n\nIn summary, the hotel has a good location but is severely lacking in quality. And the  high price is in no way justifiable. I would not recommend a stay in this hotel. ","travelDate":"2019-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great stay","lang":"en","publishedDate":"2019-10-12","publishedPlatform":"OTHER","rating":5,"text":"I enjoyed my stay at this hotel very much. The staff are very friendly and helpful and the hotel is very accommodating (I asked for a room on a high floor and away from the elevators, which I got). The rooms are comfortable and clean but fairly small but were big enough for two and three suitcases (when you put suitcases on the furniture, but hey, you're not going to New York to sit in your room). Breakfast is fine, we usually got down at around 8:30 - 8:40 and, while busy, we always had room to sit and there was plenty of food (hotel does warn that 8:30 - 10:00 is busiest period). The hotel is ideally located near Times Square and near Penn Station and the subway, so very easy to get around the city.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great place and good location","lang":"en","publishedDate":"2019-10-10","publishedPlatform":"OTHER","rating":5,"text":"Enjoyed our stay here.  Check in was very fast.  Stayed in a room with 2 queen beds.  The hotel is very modern.  Bathroom was decent size for NYC.  There were plenty of outlets to plug in devices.  There is a small fridge, safe, and even a small couch area.  Everything seemed pretty new.  We were far from the elevators and it was quiet.  The hotel has a surprising large hotel lobby and the seating area for the including breakfast was big enough to find a spot each morning even around the 8 am busy period.  The breakfast itself was fine.  Internet worked well.  I would stay here around!","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Nice Hotel but TINY rooms- not for a family!","lang":"en","publishedDate":"2019-10-09","publishedPlatform":"MOBILE","rating":4,"text":"Beautiful exterior and nicely done, updated and pretty lobby. Rooms have hard floors (no carpet), new and modern. Bathroom has walk in shower but small. The entire room is just really really small. Fine for 1-2 people but wouldn’t recommend for a family of 4. Close quarters!  HVAC was also loud and woke us up a few times through the night. Would stay here again if I’m in the area but probably only if I’m by myself for a business trip. ","travelDate":"2019-09","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"BEWARE this place cancels your accomodation so your stranded.","lang":"en","publishedDate":"2019-10-07","publishedPlatform":"OTHER","rating":1,"text":"Our travel agent booked and paid for our accomodation and we received a confirmation printout from Springhill NY Times Square for 5 nights on 23 Sep 2019. Turning up at 11.30pm with 2 children and having had no dinner the manager on duty said there was no room for us. They cancelled our booking. She lied by saying they called our travel agent on the Friday yet the booking was made on the Saturday. She didnt offer to help us find accomodation. She didnt offer us food or water for the kids. She was prepared for a tourist family from Australia to walk the New York streets. Such a shameful act.\nShe also refused to speak to our travel agent to help sort it out.\nNever never trust Springhill Suites NYC Times Square.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Loved everything about this hotel","lang":"en","publishedDate":"2019-10-01","publishedPlatform":"MOBILE","rating":5,"text":"The girls who checked us in were so friendly. The room was immaculate and you can’t beat the location. I’ve been wanting to check out Hudson yards and the high line and it was just a few blocks away and a pleasant walk to Chelsea and Meatpacking and in the other direction a quick walk to all the Broadway shows\/Central Park, not to mention PENN Station on 34th. They have a wonderful complimentary breakfast and leave an amazing little brownie in your room that was to die for. I really can’t wait to go back everything about the SpringHill Suites on 36th Ave was PERFECT.  Really CLEAN rooms too. ","travelDate":"2019-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great Stay at a Convenient Location","lang":"en","publishedDate":"2019-09-30","publishedPlatform":"OTHER","rating":5,"text":"Awesome weekend spent at the SpringHill Suites. Clean, convenient and super friendly staff. Ian was extremely friendly upon check-in. Breakfast opens early & stays open until 11am. Gym facilities were actually in great shape too! It's a convenient location from all mass transit options & from Penn Station. (Oh - and Paul Mitchell products!!) Will definitely be back.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"AVOID!  A mess: cramped, loud, cleaners banging doors constantly all day long, no  facilities.","lang":"en","publishedDate":"2019-09-26","publishedPlatform":"OTHER","rating":2,"text":"You will not rest here, which was the most important aspect for me. \n\nYes, the location is convenient for the Javits center and Penn Station. There is free decent breakfast by cheap hotel standards and a little fitness room.   And a pretty crappy bar. That's where the goodness ends.\n\nThe place is so over-crowded with tiny common areas that make you step over people left and right.  Lines are long, staff is short. The cleaning staff spent the entire day BANGING DOORS every 10 seconds (as they cleaned rooms and went in and out they just let doors slam).  You can easily hear people in the halls from your room. My room looked straight at a wall.  Coffee maker but no tea and just powdered creamer.  They shut off the main entrance for hours in the morning as \n\nSmall rooms which is fine in NYC but then why call it \"Suites\"?   Only thing resembling a suite was a microwave. \n\nBed was OK.\n\nBasically you find yourself wanting to get out of the hotel as soon as possible as its designed to completely stress you out and feels like an upgraded prison cell with nowhere to escape anywhere else in the hotel.  \n\nOh, and it's $500 a night.\n\nIf you're fine with that and just want Marriot points, stay here.  But in my 20+ years with Marriot this was one of the worst.  Its basically just so cramped eveyrwhere that it puts the guests and the staff in an unhappy situation.","travelDate":"2019-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great Location","lang":"en","publishedDate":"2019-09-24","publishedPlatform":"OTHER","rating":4,"text":"The location is great. Room is big enough for two people. Room and bathroom were very cleaned and the carpet still looks new.  \n\nWalls are very thin and you can hear everything so I would ask for a corner room and away from the elevator. The AC in our room was very loud that we had to do a room change. Ask for a room with a couch that one was bigger than the one we changed to even though it was the same type of room.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Loved it","lang":"en","publishedDate":"2019-09-23","publishedPlatform":"OTHER","rating":4,"text":"great stay, i highly recommend this hotel! i've given it four stars just due some things that i felt could be fixed(i've talked to the manager about this already). the hotel is large and rooms are smaller than other cities, but it's NYC thats totally expected. if you are looking for a huge room this is not that place for you, sorry.  location is everything in NYC and this hotel meets all expectations on location. if you arent a fan of the subway(me) then this property will work for you. everything you need is walking distance, everything you want to see is walking distance, its great!  Staff was great from the moment i checked in at 11pm to when i left 3 days later. breakfast was standard, very fresh too.\n\noverall, i'd stay there again.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Overall, a good experience, but stay away from the bar!","lang":"en","publishedDate":"2019-09-23","publishedPlatform":"OTHER","rating":4,"text":"We just got back from a weekend in NYC. We stayed in a room with 2 queen beds on the 12th floor. The room was tiny, but comfortable and clean. The front desk personnell were very nice, and they even stored our luggage for us since the room was so small. The breakfast buffet is amazing, and has everything you could want for breakfast. The only complaint we have is the bar. We went to the bar multiple times during our stay, and it was never busy. At most, we saw a dozen people sitting in that area having drinks. Lucky them!  The bartenders would ignore us every time we went to the bar. It was the strangest thing. On our last night, we called down to the front desk and asked when the bar closed. It wasn't that time yet, so my friend ran down to get a drink to bring back to the room. The bartender would not sell her a drink, even though the front desk said they were open. So, good hotel, horrible bar.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"A VERY UNCOMFORTABLE STAY","lang":"en","publishedDate":"2019-09-19","publishedPlatform":"OTHER","rating":1,"text":"It is important to know that Marriott's  SPRINGHILL SUITES brand is marketed as an all suite property throught the U.S.   I am very familiar with the brand asd have stayed at 12 diffeent properties of this brand around the U.S.\n\n(Below is a copy of an email sent to a member of the hotel's management team after my stay)\n\nThe following letter will serve as my review.\n\nDear Erin,\nForgive me for I must be blunt.\n\nI do not know if this email is standard to all guests or specifically to me as a Lifetime Titanium Elite.\n\nIn any event my stay at the hotel was one of the most uncomfortable I have experienced in memory.  \n\nAt the outset, let me say the only \"saving grace\" at the property(ies') was the staff - they were pleasant, helpful and kept you at ease at all times.\n\nSpringHill is a great brand - one of my favorites (of the Marriott offerings).  Placing this label on your property is an insult to the brand.  Not only an insult, but could be construed to be misleading and an injustice to those expecting even a slight resemblance to the standard SpringHill property.\n\nFurthermore, to combine this brand with a brand which is recognized as a lower level than SH is further evidence of misleading the public expecting a SH experience.  (This by both brands offering the same product under the same roof).\n\nMy room (two beds) was impossible to negotiate moving from the bed to the bathroom without hitting walls and banging your legs on the base of the beds.  One bed was impossible to get to without damage to a person's body.  The ultimate \"crime\" was the proximity of the bathroom to the beds made you feel you were sleeping in the bathroom.\n\nI don't think it necessary to describe any further.  As a member of the property's management team no one is more familiar with the problems.\n\nIn the least the SH brand name should be removed from the property as it damages Marriott's image as is DEFINITELY misleading.\n\nI ask your forgiveness in advance as I feel obligated to advise fellow Titanium  Elite members on  sites where I am a member.\n\nI am hopeful that some good will come from this communication so future guests one day will not be disappointed.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Be cautious on deposits and fees","lang":"en","publishedDate":"2019-09-18","publishedPlatform":"OTHER","rating":2,"text":"When I booked into the hotel earlier this September I was told I would have to pay an incidental deposit this didn't bother me as I know it to be procedure for hotels. I paid for this on a different card to the card that made the booking due to errors with my original card working stateside. The lady at the check in and no issue. All was going well, however during my stay I notice a $30 charge taken from my account under the hotel's name. Knowing I had not used any room service I was curious as to what this charge was for so I asked the staff at the main reception who weren't very happy to help with my query. They approached me like I was an idiot for not knowing the charge and the female staff member had an attitude who to me traveling alone for the first time I thought this was unprofessional and rude. They then said this additional charge 2 days after booking in was state tax . However this seemed odd I would be charged state tax half way through my stay and that it was no explained or mentioned to me whilst checking in. Having felt like I was annoying them I walked away unimpressed. A week after checking out I noticed I hadn't had my $60 deposit returned. I contacted the hotel and was told to forward certain details and they would investigate. I am still yet to hear back from them and it had been 10 since I checked out of this hotel and was told within two days my deposit was returned. I feel as though noone wants to help me out with chasing where my money has gone. The room was left how I found it and I like everyone else have bills to pay and every penny helps with doing so. I am disappointed I am being treated as though the company doesn't not care. I stayed at a hotel from the same company but in Dallas and had no issues. Unfortunately I can't recommend this hotel due to the way they respond to financial concerns.","travelDate":"2019-09","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15288822,"title":"PAY A LITTLE MORE AND STAY AT ANOTHER HOTEL.","lang":"en","publishedDate":"2019-09-12","publishedPlatform":"OTHER","rating":1,"text":"When planning a trip to NYC, its a dream come true for many people. It's a one in a lifetime trip and the hotel can make or break such a trip, so picking the right hotel is very important. My suggestion for anyone reading this, is to spend a few dollars more and stay at another hotel.  Don't gamble with your dream trip by staying here because it just might not be worth it.\n\nHISTORY:  I booked 3 rooms for 4 nights prior to this hotel opening.\n\nBecause we are limited to how much we can write here I will just provide readers with a list of issues we ran in too during our stay.  \n- asked for early check in for one of the 3 rooms. Did not happen\n\n- Toilet in one room had to be plunged out multiple times each day\n\n- Rooms were never made up while we were out for the day - had to call when we returned late afternoon and then sit in lobby while they were made up\n\n- Breakfast was a disaster each morning. Multiple stations running out of food and one morning no milk for the rest of the morning.  Crowded. Tables not cleaned. Staff having to cut lines in order to replenish food. Poor design\n\n- Slow elevators.  Hotel is actually 2 hotels, one on top of the other. This hotel occupied bottom 14 floors and other hotel floor 15 and up.  2 elevators per hotel except top hotel walked down to floor 14 to take elevators as there elevators also slow.\n\n- I wrote e-mail while staying there about issues. - no reply\n\nI wrote to Marriott to complain and they forward to hotel my issues. No reply\n\nWhy chance it?\n","travelDate":"2019-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Brand new, great location, beautiful complimentary breakfast buffet","lang":"en","publishedDate":"2019-09-12","publishedPlatform":"OTHER","rating":5,"text":"This dual branded Springhill and Fairfield really has it all for corporate travelers AND families.   Rooms are small, but that's just NYC - I had the quietest room I have ever stayed in in the city!   Great complimentary breakfast - full hot with lots of options!   Huge breakfast room and lobby.  GREAT value and staff was wonderful!","travelDate":"2019-09","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Good Value in an Expensive City","lang":"en","publishedDate":"2019-09-05","publishedPlatform":"OTHER","rating":4,"text":"The location is great – just a few blocks from Penn Station so it is very easy to go just about anywhere in New York or beyond. There are also many restaurants and other shops nearby. The facilities are pretty good and what you'd expect from a mid-range type of hotel chain. We had no problem getting a good rest. Breakfast is simple and nothing spectacular, but it's included. The price is significantly more expensive than mid-range hotels in other smaller cities, but considering how expensive hotels are in NYC in general, this hotel provides a really good value. The only annoyance we had was that it took too long to go up and down the elevator between the ground floor and our room's floor – it was always a good 10 minutes or so including waiting for the elevator and then the ride itself.","travelDate":"2019-08","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"nice and new hotel, services to be improved","lang":"en","publishedDate":"2019-09-02","publishedPlatform":"OTHER","rating":4,"text":"The hotel is new and clean. The room is much better than the NY city standard for this category. Good position, few minutes from Penn station subway, walking distance from several attractions in midtown. Breakfast service is very chaotic and not adequate for the number of guests. The reception staff is very nice but unfortunately, for the most part, very unprepared, only one receptionist was able to help us and to give an indication regarding how to reach the airport with public transportation.","travelDate":"2019-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"great room for the price! great staff!","lang":"en","publishedDate":"2019-08-29","publishedPlatform":"OTHER","rating":5,"text":"i have nothing negative to say so let me address some of the complaints other reviewers had. the rooms are kind of small but if you looked at the pictures, you’d know what to expect! for me and my buddy staying only 2 nights, and for less than 150 a night, it was a perfect size. it was in the 90s out when we were there 2 weeks ago, but the a\/c was so good i needed the comforter on at night. the staff were great! Ivana, in particular, really helped us out by letting us check in early and upgrading us to a room with a bigger bed. i would definitely stay here again.","travelDate":"2019-08","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Mai più in un loro hotel","lang":"it","publishedDate":"2019-08-26","publishedPlatform":"MOBILE","rating":1,"text":"Abbiamo prenotato 2 camere in questo hotel vedendo il buon giudizio degli utenti. Quando veniamo a New York utilizziamo di solito la catena Hilton Garden\/double Three, ma questa volta ci siamo fatti convincere da link pubblicitari durante la ricerca.\nL'hotel si trova in una posizione comunque buona ed è recente.  Il personale cordiale come tutti gli americani ma impreparato, improvvisato, non professionale.\nLe nostre camere queen erano talmente piccole che, senza armadio, non c'era posto neanche per una valigia. Il rotolo della carta igienica appoggiato su wc, senza appiggi, e salviette appoggiate senza possibilità di appenderle. Dietro rimostranze ci hanno dato 2 camere con letto king dove un mini armadio conteneva nulla e le valigie appena si potevano aprire.\nLa colazione dalle 8.30 è una guerra per trovare pisto e cibo, continuamente mancante, per incapacità organizzativa.\nLa stanza si dimenticavano di pulirla e la sera, dopo aver appurato ciò e chiesto teli x doccia, abbiamo dovuto attendere 40 minuti e fare 4 telefonate per ottenerli.\nSe avete problemi con le scale, non prenotate qui...l'ascensore è praticamente inutilizzabile nelle ore della colazione,  salvo attendere 15 minuti per scendere e 15 per salire.\nIl prezzo trovato era in linea con altri hotel della zona pertanto nulla giustifica tutto ciò. \nLa camera veniva pulita frettolosamente, abbiamo lasciato a terra un'etichetta di un vestito acquistato ed è rimasta a terra per 5 giorni. Lo specchio del bagno mai pulito in 5 giorni. Voto 1 per tutto questo contestualizzando prezzo e nome catena. Chiaro che non é una bettola o sporco o schifoso, ma questi disservizi in nessun altro hotel in 30 di giramondo li ho mai incontrati.","travelDate":"2019-08","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Nice , clean, new hotel","lang":"en","publishedDate":"2019-08-25","publishedPlatform":"OTHER","rating":5,"text":"Really enjoyed our stay here. The guy who checked us in was very nice and it was quick. Liked our room. It had a refrigerator and microwave. A lot of the reviews complained about a\/c not working...luckily ours kept the room cold. Free breakfast was nice, but it was so crowded...people were eating in the lobby. There is a laundry room downstairs which came in handy. Washed clothes before heading on our cruise.","travelDate":"2019-08","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Small room, photos are deceiving!","lang":"en","publishedDate":"2019-08-24","publishedPlatform":"OTHER","rating":3,"text":"I travel to NYC every month for work and usually stay at another hotel, but the rates there were prohibitive, so I was happy to see this new hotel in Midtown.  SpringHill Suites shares a lobby and check-in area with the also new Fairfield Inn and Suites.  T\n\nPROS: The lobby is beautiful, so, after a long day of working, I was looking forward to getting to my room (king bed) and this was a good start.  The front desk staff is great and very friendly.  The bathroom has a walk-in shower with a shelf that holds everything (one of pet peeves is a shower shelf that only holds a bar of soap and tiny shampoo and conditioners).\n\nCONS: Well, the room was small and dark.  My room did not face the street but rather faced an inside air shaft, so even in the morning, I had to turn on all the lights because it was too dark.  The bed stands are tiny; one only had enough room for the phone and the other for the alarm clock, so I had to put the phone on the floor to have room for my CPAP.  There is barely enough room to walk around the bed.  The TV is huge, but you can't adjust it to watch it from the sofa.  The bathroom is small, but there is a wall-mounted shelf that holds your products.   The breakfast is your typical hotel free buffet, but the breakfast area isn't big enough to hold everyone from both hotels.","travelDate":"2019-08","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Good things come in small packages","lang":"en","publishedDate":"2019-08-21","publishedPlatform":"OTHER","rating":5,"text":"Great location, great service, clean comfy room.\nFrom the moment i spoke with Colleen, Director of Front office, i knew i was at the right place. SO helpful, and great energy.\nAnswered my questions, and took the time to care. The rooms are not big, but if Clean, comfy, GREAT location, and GREAT service are for you, Springhill is for you.","travelDate":"2019-08","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Perfect Weekend Away","lang":"en","publishedDate":"2019-08-19","publishedPlatform":"OTHER","rating":5,"text":"The hotel is very nice, updated and clean. The breakfast is OUTSTANDING. I have never seen a free breakfast buffet as nice as this one. Yes, the hotel room is small, but it's perfect. We were only there to sleep, not to hang out in the room. This hotel is an excellent value for a trip to NYC.","travelDate":"2019-07","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great Clean Hotel in Good Location","lang":"en","publishedDate":"2019-08-12","publishedPlatform":"OTHER","rating":4,"text":"This hotel is centrally located in Manhattan, close to the Empire State Bldg, Times Square, Broadway shows, etc.  The rooms were a good size, with two beds, small couch, small table, and closet.  Bathroom was ample size in square footage but had a small sink area.  Hotel was clean and beds were comfortable.  Breakfast was average, with hot and cold options available.  Overall hotel stay was very pleasant for a quick weekend trip, would stay again.","travelDate":"2019-07","tripType":"NONE"}
{"helpfulVotes":2,"locationId":15288822,"title":"Good Location; Small Room but Well Appointed; Courteous Staff; Good Breakfast","lang":"en","publishedDate":"2019-08-09","publishedPlatform":"OTHER","rating":5,"text":"We just returned from a 3-night stay at this hotel and we had a great time! There were 4 of us - mom + 3 teenagers.  I had some concerns going in after reading the reviews that mentioned that the rooms were very, very small and that the air conditioning was faulty.   Although I will agree that the room was small, I was very pleased that our room had 2 queen-sized beds (unusual for NY where many rooms had full-sized beds) and that the design of the room made good use of the available space.  If you have ever traveled in Europe, the room size is comparable to many of the European hotels that I have stayed in ..not much extra room aside from the beds.  That said, there was a small closet and a small desk.  We ended up using both to the hilt to unpack and store our things - I ended commandeering the ironing board which I put alongside one of the beds to put one of our suitcases on.  Another was placed on the small desk.  I unpacked and used the closet, which really left only one suitcase that was still \"floating\" in the room, so we were fine overall.\n\nOne nice feature were the generous outlets in the room -very helpful for teens with electronic devices!  There were USB-enabled outlets on each side of each bed, along with individual spotlights on each side of each bed.    \n\nThe bathroom was small but new and very clean.  One issue I did have was with respect to storage in the bathroom - there was only a single hook on the glass door to hang towels - not a towel bar anywhere, which made hanging wet towels difficult (especially since there were 4 of us and we were trying to be eco-conscious and re-use towels),  It would have been very helpful if there had been at least 2 more hooks to hang additional towels.  We ended up hanging towels over the desk chair and using one of our suitcases.  Not ideal, but not the end of the world either - we made it work. \n\nThe location was really great for exploring all of Manhattan - easy walking distance to Penn Station (where I had taken the train from Newark airport). Also nearby to 5th Avenue shopping, Empire State Bldg, Broadway theaters, and Rockefeller Center - all within a mile or so (and walkable).  \n\nHot breakfast was a nice start to our day each day and when you are traveling with 3 teens, having it included was a nice perk!  Ample seating in the breakfast area and surrounding lobby made it such that we never lacked a place to sit -even in the later morning when the breakfast was more crowded.\n\nOne other (probably less talked about) perk was the coin-op guest laundry in the basement.  It was very handy to be able to throw in a couple of loads of laundry while having our breakfast one morning.  Front desk provided quarters for change.  My teenage sons also appreciated the new and very well-appointed 24-hour gym, also located on the lower level near the laundry.   Also a shout-out to the small business center with guest-available computers with internet access and a printer - super handy for checking into our flights and printing our boarding passes.\n\nOverall, I would not hesitate to stay at this hotel again, and would recommend it for anyone traveling in NYC.","travelDate":"2019-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":15288822,"title":"Family weekend ","lang":"en","publishedDate":"2019-08-05","publishedPlatform":"MOBILE","rating":5,"text":"This hotel was great... super clean! The  breakfast was more than enough considering there were 7 of us . It was a perfect start to the day of much walking . The beds  were very comfortable . After a busy day of waking around it was nice to sit in the lobby and chat with family.  The location was excellent! I would definitely stay here again ! ","travelDate":"2019-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Tiny","lang":"en","publishedDate":"2019-07-30","publishedPlatform":"MOBILE","rating":3,"text":"As a family of four, the room was very small (yes, I know we are in NYC). The beds were fine, bathroom was clean, and overall the room was nice. We were not able to use the couch\/desk area because there was nowhere else to put our luggage due to the size of the room. \n\nThe lobby was nice and the staff was friendly at every turn. Complimentary breakfast was a bonus with plenty to choose from. \n\nThe location was very convenient and within walking distance to the Theater district, subway stations, and plenty of food options. ","travelDate":"2019-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Hotel centrale e buoni servizi","lang":"it","publishedDate":"2019-07-30","publishedPlatform":"OTHER","rating":4,"text":"L'hotel é in posizione centralissima a soli 10 minuti da Times Square. La struttura sembra nuova, camere e spazi comuni moderni, si potrebbe migliorare la pulizia.\nCamera molto confortevole con smart TV e accesso a Netflix. \nColazione mediocre e personale abbastanza gentile. Nel complesso consigliato!","travelDate":"2019-07","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15288822,"title":"3 rooms in 24 hrs and I would still go back","lang":"en","publishedDate":"2019-07-29","publishedPlatform":"MOBILE","rating":4,"text":"Here’s the thing - check in was bad. We checked in on the app and were 1.5 hours late due to flight delays. Our room wasn’t ready for an hour or two and we rushed to get a room at 7:15 and get to an 8:00 that was 15 blocks away! The room was at the Springhill and SMALL. I was surprised, even for NYC. Although technically it would sleep 4 people, their bags wouldn’t fit as well (especially if they were all standing.) Wouldn’t work for 3 people for 8 nights. Ian suggested we touch base Sunday morning about alternate options. Melissa got us something Sunday and when we came back Ian got us into #2, at the Fairfield. We got up there after being out all day in 100 degree heat, took cold showers and ran off to our meeting. The AC wasn’t working and after a tech visit and several additional calls, they moved us again. 3rd room was a charm and we enjoyed a wonderful stay. \nThings to note: the elevator is slow, at best. And very crowded in the morning and late afternoon. Add some extra time into your schedule if you’re going down to breakfast. We had to give up on it a few days in because it was too much! Ice is only available on the 8th floor (so if you’re at the Fairfield - levels 15-27, be prepared for some stairs and elevator change.) Housekeeping - oh boy. Basically, the staff doesn’t have what they need on the floor so they have to travel to the basement to get supplies (toiletries, toilet paper, tissue, etc.) They are happy to do it - but don’t wait until you need it to ask for it. Be proactive!","travelDate":"2019-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Disappointed","lang":"en","publishedDate":"2019-07-28","publishedPlatform":"OTHER","rating":3,"text":"In general, I really like SpringHill Suites.  Given that, I will not be going back to this one.\nGood points: beautiful lobby, large area for breakfast, really great and friendly doormen.\nBad points: person who checked me in acted like he wanted to be somewhere\/anywhere else than here - not really friendly and provided no information on items such as breakfast and wi-fi, refrigerator did not work properly and appeared to have never been fixed even after two requests to the front desk, no wash cloths.\nNet - I will go back to the SpringHill Suites on 37th Street in the future.","travelDate":"2019-07","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":15288822,"title":"Quaint, yet comfortable","lang":"en","publishedDate":"2019-07-16","publishedPlatform":"OTHER","rating":3,"text":"This place feels brand new and is clean enough. There were a few scuffs and wine marks on the walls, but just a few. No big deal really. The bed was super comfortable, sheets were clean and lobby was also looking fairly new. The room was tiny, but it fit all the essentials - a king size bed, full bathroom, desk for working, chair, loveseat, closest, refrigerator, microwave and two end tables. It was efficiently laid out. \n\nOne complaint I do have is, the loveset was FULL OF CRUMBS! If it weren't for the crumbs, this would have been a 4 star review. I literally had to remove the cushions and get all the crumbs off, then under cushions was like full of crumbs too! Wowzers! We ended up not sitting on it and placed our luggage on it. Oh well, can't be perfect.\n\nThe location is pretty good, down the street and a block from the subway stop. It is easy for Uber drivers to find and there is a lot of food available in walking distance.","travelDate":"2019-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Puny Rooms","lang":"en","publishedDate":"2019-07-13","publishedPlatform":"OTHER","rating":2,"text":"The staff was nice, the gym was good and the breakfast buffet was well stocked, but the rooms were the smallest we have ever had in NYC! The bathroom vanity was non-existent, the desk and closet were tiny. We were so grateful that we didn't have to stay there for more than two nights and we will never go back again! This is a brand new hotel--there is no reason that they could not have made these rooms a little bigger! As Gold Members, we are so disappointed in Marriott these days. Hilton, here we come!","travelDate":"2019-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Tiny, Tiny Room","lang":"en","publishedDate":"2019-07-13","publishedPlatform":"OTHER","rating":3,"text":"Our family of four (my husband, me, and our two boys age 9 & 10) stayed here in July 2019. The hotel is new and very clean, with modern furniture and pretty finishes. The staff is very accommodating and friendly. The complimentary breakfast is a major perk. However, our room was ridiculously tiny. We were tripping all over one another during our three-day stay. No room for suitcases, no closet (just a tiny wardrobe) and no dressers. No counter space in the bathroom...I had to put all of my toiletries on the floor space under the sink and basically knelt on the bathroom floor to get ready each morning. Kind of inconvenient, considering we spent nearly $300 each night to stay here. I wasn't in love with the area but it is very close to Times Square, Madison Square Garden, and multiple subway stations. I appreciated the nicely appointed gym, but wish that the televisions had been in working order. Running on a treadmill is mind-numbingly dull without the distraction of a television. All in all, I'm not sure I would recommend staying here, especially if you are traveling with a larger group or a lot of luggage.","travelDate":"2019-07","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"1007","lang":"en","publishedDate":"2019-07-13","publishedPlatform":"MOBILE","rating":5,"text":"Great hotel, in a really nice building. Looks like the building might have previously been a school. The lobby area and room furniture is all brand new. Very Conveniently located to Times Square and penn station. ","travelDate":"2019-07","tripType":"SOLO"}
{"helpfulVotes":4,"locationId":15288822,"title":"Great location clean rooms","lang":"en","publishedDate":"2019-07-04","publishedPlatform":"MOBILE","rating":4,"text":"We stayed end of June 2019 for a weekend getaway with our 6 month baby. The bell boy was very sweet and always ran to open the door when we'd walk in and out of the hotel with baby in carrier or stroller. The staff was very helpfull and we had a king size bed for sharing (not sure how other rooms have the beds set up) The room is small, but we barely stayed in, c'mon this is nyc! Shower and sleep and just wanted it to be uber clean, which it was! The bed was fresh and clean at arrival and the bathroom also was very clean. Not much counter space in bathroom but we just had our products on the desk by the big mirror. Microwave and fridge in room. Ac working great (too great for the size of the room! Lol) The location is amazing! Walking around midtown, to central park, on 5th avenue everything is very close. Grab a water taxi by 42nd and 12th av and head to brooklyn. Was pleasantly surprised by the breakfast, hot cheese omelets, sceambled eggs, sausage\/ham different breads\/scones\/muffins\/croissants, waffles (the wait is barely like a minute and a half by person so people need to either wake up earlier (no line up at 7-8am) or be patient. Coffee was fresh and available all day at the lobby and iced citrus water. Breakfast also had packaged yogurts and fruits, alot of great options for snacks during the day and in the room. We booked last minute and got an amazing deal and were very pleasantly surprised. The hotel is fast access from the highway to the island by lincoln tunnel and out. No lurking around town in traffic to get to the hotel. Parking deal with an icon parking two blocks away to save some money. Great hotel, amazing location, will recommand and visit again for sure!! ","travelDate":"2019-06","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Clean, modern and quiet - good location","lang":"en","publishedDate":"2019-07-04","publishedPlatform":"OTHER","rating":4,"text":"I was looking for a hotel for a mother\/daughter weekend. It is so hard when there are \"too many choices\" like in NYC! I settled on this one because it was walking distance from Penn Station, and we had a positive experience. I was put off by some reviews of other hotels which talked about mold, mildew, etc. so I wanted to find a hotel that did not have that problem - I picked this one because it was recently modernized.\n\nFirst off, the hotel is not easy to spot - it is on 36th between 8th and 9th, directly across from a DoubleTree which has a large sign\/portico. So look for the DoubleTree, then look across the street. Although the location is Times Square South, it is not directly on Times Square (several blocks away) so the street was quiet.\n\nThe elevators are a bit slow, and there are 2 separate banks of them, but we didn't experience any super long waits. It says in the elevator that you need to use your key, but we did not find this to be the case - however, I would have preferred if we had to use our key because I would have felt more secure.\n\nWe stayed in room 1012 - I am putting this room number down because we had no problems with the air conditioning or anything else in the room. There was a small desk, couch and table which we just used to put our stuff on.  It wasn't a huge room but we didn't feel overly cramped - it is NYC so I wasn't expecting a large hotel room like somewhere in the Midwest.  The shower was nice and modern with porcelain tiles up the shower walls - the bathroom was a bit small but clean - I would have appreciated more counter space around the sink, but could work around it because we had that extra space of the desk in the room. \n\nIf I were staying here for business and had to do some work the desk would have been just adequate, but since this was a personal trip it was fine. The wifi also worked and was not too slow.\n\nThe free breakfast was OK - there was a line each morning for the waffle machine, but we weren't using that so that didn't bother us. The scrambled eggs were very good, but the \"croissants\" were just bread in a croissant shape. The fruit was overripe (particularly the strawberries one day), but it was nice having fresh fruit available. There isn't any cold cereal that isn't sweetened - I would have preferred plain cornflakes or Cheerios instead of frosted flakes and Honey Nut Cheerios. And my daughter has a nut allergy so anything \"Nut\" is a problem.  They have Starbucks coffee. The milk machine is super slow so a lot of people were using the milk that was intended for the coffee on their cereal, so that meant the milk carafes ran out frequently. They also have water and coffee in the lobby. So all in all, breakfast is adequate and you can have better food later on in the day. If you want a bagel, there is a good bagel place less than a 5 min walk away (next to a \"Subway\" sandwich shop - I think it was Best Bagels on 35th - will look up and post the exact name later).\n\nThe bellhop who held our luggage was very friendly. I also got extra shampoo from a housekeeper who was also very friendly.\n\nOverall I would recommend it if you want to be in this part of the city.","travelDate":"2019-06","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Air Conditioning Doesn’t Work ","lang":"en","publishedDate":"2019-06-26","publishedPlatform":"MOBILE","rating":1,"text":"I had to call the front desk 3 times about my AC unit not working and had engineers in the room for over an hour total. Considering I paid nearly $1000 total for 3 nights, this shouldn’t be an issue. This is one of the worst Marriott properties I’ve ever stayed at. ","travelDate":"2019-06","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Perfetto per noi!","lang":"it","publishedDate":"2019-06-20","publishedPlatform":"OTHER","rating":4,"text":"Dopo una notte trascorsa in un appartamento, che non rispecchiava quello che ci aspettavamo, ci siamo trovati costretti a fissare al volo una nuova sistemazione e abbiamo trovato FORTUNATAMENTE questo super Hotel, il giorno stesso del nostro arrivo! Prenotiamo la mattina alle 8,00, arriviamo alle 8,30 e alle 8,40 eravamo già nella nostra camera! Buona pulizia. Staff giovane, educato e molto gentile. La nostra stanza aveva un letto matrimoniale molto comodo, tutte le mattine veniva rifatto e cambiata la biancheria. Siamo riusciti a riposare benissimo, nonostante la vicinanza a Times Square non si sentiva volare una mosca! Ogni camera dispone di uno smart tv dove è possibile vedere Netflix con il proprio account. A disposizione una macchina del caffè con 4 cialde che veniva rifornita giornalmente. Frigorifero e bottiglie di acqua di benvenuto. La palestra è accessibile a tutti e in qualsiasi orario. Il pezzo forte la colazione!! Ovviamente continentale, dolce e salata e super abbondante! Non mi dimenticherò mai i Waffel!! L'orario è ottimo perchè viene servita dal lun-ven dalle 6,30 alle 10,00 e sab e dome dalle 7,00 alle 11,00. La hall è molto grande, ed è possibile mangiarci cibo da asporto senza alcun problema. E' presente anche un bar dove è possibile sorseggiare cocktail. Per tutti gli ospiti caramelle o leccalecca sempre offerti, presenti sui banconi della reception. La Posizione è ottima per girare tutta NY! Le metro sono vicinissime e di facile raggiungimento! La più comoda girato l'angolo davanti il Madison Square! Fantastico in tutto! Ci ha reso la vacanza indimenticabile! Lo consigliamo vivamente!","travelDate":"2019-06","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Don’t be fooled","lang":"en","publishedDate":"2019-06-18","publishedPlatform":"MOBILE","rating":3,"text":"We’re NewYorkers from earlier days who love to return annually to experience our fabulous city. But we have one huge question: Why do visitors expect hotel rooms in NYC to be small or tiny because, well, it’s New York? This new Springhill Marriott is a brand new building incorporating elements of a former church. This hotel is uncomfortable in many ways. Everyone we met in the insufficient number of elevators openly shared how small the rooms are. But of course, “that’s New York” as we say. Millennials we beg you not to believe this myth. Don’t accept a room that you can’t turn around in even if it’s new and clean and in NYC. Also, the air conditioning is not sufficient, maybe on purpose? Can’t turn around in a room with two beds? Need to remove the ironing board from the tiny closet to make room for a few clothes? Why put up with this? Act up. Don’t stay here and demand more from the huge hotel monopolies. Thanks!","travelDate":"2019-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"So much wasted potential......","lang":"en","publishedDate":"2019-06-12","publishedPlatform":"OTHER","rating":3,"text":"For Christmas each year, we gift a vacation to our grown kids and grandkids. This is a beautiful new (renovated) building in an awesome location! We booked Springhill because of the location, and made it very clear that we needed two rooms and wanted them to be side by side, or at least close, and was assured that could be accommodated. Mind you, we made reservations more than two months prior to our stay. Upon arrival, a couple of hours early for check in, we were told, \"we'll do the best we can, but we had a full house last night\". I somewhat understand, but what did \"last night\" have to do with a reservation made over two months ago??? Anyway, a very courteous bellhop took our bags to secure while we went out for a walk before checking in. Upon our return, rooms still not ready...at 4pm (check in time). We hang out in the lobby for awhile. It's 5pm or a little later before we are finally told our rooms are ready....one on each end of the building!!!!!!!!!! I guess we were expected to be happy they were on the same floor??? Cut to the chase, the A\/C units in this new facility flat sucks, and they know it! We were told three different times in the first 36 hours of our stay, that the one room having the problems was \"at the top of the list\" to be fixed. Never any follow up, and apparently what one staff person told us, never was told to anyone else, so they had no clue! After changing rooms 3 times we finally ended up with rooms on the same end of the building, for the final 4 nights of our stay. I rate this place a 3 because of it's location, very congenial staff, and nice \"looking\" facility. The line of communication among that nice staff, and the complete junk HVAC system deserves a 1 at best.  \nHopefully, they can get it together soon. If my wife and I return to NYC, and only need a single room for ourselves, we will likely give them another chance, but won't consider them again for a family vacation.","travelDate":"2019-06","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Everything was the worst experience at any of the Marriott group hotels I have stayedz","lang":"en","publishedDate":"2019-06-08","publishedPlatform":"MOBILE","rating":1,"text":"Service = Horrible\nNo one picks up a call when you use the phone in the room.\nIf someone ever picks up, you would probably have to wait for quite a while. \n\nEven if you make a house keeping request, you would still have to go find a housekeeping lady to get what you need.\n\nElevators are the slowest thing you would ever experience.\n\nThe room is definitely not clean. The floor is definitely not well cleaned and it feels old considering it’s listed as new on Marriott.\n\nWorst of all, I requested the laundry to be picked up by 9am for the same day service, so they were supposed to deliver it by 7pm. 7pm comes, nothing is delivered, called the front desk  and they tell me nothing isn’t delivered to the hotel. \n\nThis is absolutely the most unpleasant experience I had with the $250+\/night hotel.","travelDate":"2019-06","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Tiny and Hot","lang":"en","publishedDate":"2019-06-07","publishedPlatform":"OTHER","rating":3,"text":"We booked this hotel for a seven night stay while working a convention at the Javits. The location is good, the hotel is new with a very nice lobby and attractive furnishings. A bellman helped us to our room and apologized about how small the room was. We have stayed in many NYC rooms and this was by far the smallest I have ever seen. As another reviewer wrote, we could not walk between the beds and the wall to the bathroom or the door out without bumping the tv. We are both small women and I cannot imagine how a large man would do. It is interesting to see that photos show some larger rooms, even though we were told by the desk staff that there were not. We tried to settle into the room, but there is virtually no place to put anything away and absolutely nowhere to put anything in the bathroom. We were considering finding another hotel the next morning. The air conditioner fan blew nonstop and that night it became clear the A\/C was not working. I called the desk after a mostly sleepless night and was asked if they could send someone to fix it. We went out and on our return, the engineer was in the room saying that we could not stay there because he could not fix it. He volunteered that there was a problem and that we should never have been put in that room. Trying to make a very long story short, we were moved to a Fairfield room in the building with no mention of the fact that those rooms are cheaper.  I also asked if any rooms were larger and was told that only handicap accessible would be, but in traveler photos it does look like there is some variation in room sizes. The  breakfast is fine,  but the staff seemed to be having problems and could not get the waffle machines working right. If you were one person in a single bedded room, this hotel might work out ok. For a couple in one bed, it would be ok for a short trip. The room was clean.","travelDate":"2019-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Very good, brand new midtown hotel with a few minor wrinkles to iron out","lang":"en","publishedDate":"2019-06-07","publishedPlatform":"MOBILE","rating":4,"text":"The only reason I don’t give this 5 stars is because Springhill Suites are not 5-star-level hotels. But I like this hotel a lot and will definitely stay here again for the following reasons:\n- very clean (my #1 criteria for hotels)\n- close to Penn Station but away from the tourist crush\n- comfortable room\n- nice, helpful employees\n\nSome items to note:\n- as a brand new hotel, there are still some wrinkles to iron out. The most pressing one is that the AC doesn’t yet reliably work in all the rooms. If you get to your room and it’s not cool, check the vents to see if cold air is coming out. If not, go down and politely request another room if possible (or at least a maintenance fix). \n- it’s a NYC hotel so don’t expect a large room even though it’s called a “suite”. I’d guess ~150 sqft. But it has everything you need - bed, sofa, desk, chair, bathroom, fridge, microwave. The only drawers are in the side tables so my only real complaint is the lack of dresser drawers. No extra space in the room, but it’s NYC so get out and enjoy the city!","travelDate":"2019-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Amazing Service and Location","lang":"en","publishedDate":"2019-06-03","publishedPlatform":"MOBILE","rating":5,"text":"I stayed at this hotel with guests visiting NYC for the first time.  Every staff member greeted us and were exceedingly kind and helpful.  The location was perfect! The hotel is in Midtown but very close to Chelsea with many gorgeous parks and fun bars! We are definitely coming back!","travelDate":"2019-04","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Nice rooms but no housekeeping","lang":"en","publishedDate":"2019-06-02","publishedPlatform":"OTHER","rating":4,"text":"We stayed here for 6 nights and unfortunately, housekeeping only managed to come on one occasion. On that one occasion, soaps and teas and bottled water were not replenished too, unsure if this is the norm. \n\nCheck in: Check in was efficient and fast, staff was friendly. We were given a small bag of snacks too.\n\nRoom: As per NYC standards, rooms were small but functional. There was a sofa in the corner but the room seemed much smaller than the advertised 23-26sq m2. Beds were nice and comfortable. A small refrigerator and microwave oven were provided, with some sets of disposable cutlery and cups which came in handy. The toilet is small but very clean and spotless but this is probably due to the hotel being new. As housekeeping does not come everyday, I wonder if they will be able to maintain the cleanliness of the rooms in the long term. \n\nBreakfast: Breakfast was better than expected but the items repeated everyday. Chobani yogurt is provided and the scrambled eggs bowl was delicious. Extra points for the coffee bar which had different types of milk and syrups available. A good variety of pastries were available too. \n\nLocation: Conveniently located near to Penn Station (take 35 Street 8 Ave exits), about 6mins walk away. Also about 8mins walk from Port Authority Bus Station. Hudsons Yard  is within walking distance too. Feels safe at night too.","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Nice hotel but tiny rooms","lang":"en","publishedDate":"2019-06-01","publishedPlatform":"OTHER","rating":4,"text":"Really nice and clean new hotel.  \nThe 2 queen bed room we had was tiny.  Not much space between the end of the bed and the wall and with the tv on the wall made it difficult to get around and it resulted in several bruises from the bed frame.   Also - there was 2 of us in the room for 6 nights and really not much space to store clothes and toiletries and make up and no space to but our luggage.   We didn't have a sofa as most pictures showed (no room for it).\nHowever, we were grateful to get a room with a huge terrace (it actually looked almost as big as the room) but there was no chairs to sit on the terrace. We asked at reception and was told there were none. Kinda wonder what the point of the terrace is if no chairs to sit on it.   We went to Target on the night we arrived and bought 2 fold away chairs at $20 each and have left them in the room so others can use them too.\nI was concerned about the previous comments about the a\/c.  Our didn't go below 65 but wasn't as bad as I was expecting but then again we were able to open the terrace door to get some air.\nApart from that - loved the hotel.  \nLocation great, breakfast options were great too and friendly staff and the coin laundry was useful too.","travelDate":"2019-05","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Weekend getaway","lang":"en","publishedDate":"2019-05-27","publishedPlatform":"MOBILE","rating":5,"text":"We really enjoyed staying here. In fact we returned the very next month. The hotel is brand new, great breakfast, conveniently located, friendly staff, reasonably priced! Definitely will be staying again in the future!","travelDate":"2019-05","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Great Location! Friendly Staff! Excellent Breakfast!","lang":"en","publishedDate":"2019-05-25","publishedPlatform":"OTHER","rating":5,"text":"LOCATION:\n\nOne of the key selling features for me was that it's located within short walking distance from Port Authority, Times Squares and the Bella Abzug Park (Hudson Yards).  \n\nBREAKFAST:\n\nOur stay included a breakfast buffet that was excellent with lots of selection of both hot and cold items, pastries, waffles and fruits.\n\nROOM:\n\nRooms was great and larger than most in this price range! Everything was clean and brand new. Quiet room and comfortable beds!\n\nSERVICE:\n\nThe staff was professional, friendly and service-oriented. You can tell they are well-trained to take care of guests. Cleaning staff also did a great job maintaining our room.","travelDate":"2019-04","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":15288822,"title":"Lots of work to do still ","lang":"en","publishedDate":"2019-05-25","publishedPlatform":"MOBILE","rating":3,"text":"When coming in we were surprised to see how pretty the hotel looks. Everything is new and fresh. Also the bell men were friendly and welcoming. Front desk staff was kind, however very robotic. Everything seemed scripted. The suite is just a room really, even for European standards. We had the tiniest bathroom ever seen in a hotel. However, it is all super functional. Two things which were really negative were NOISE.. from the hallway and adjacent rooms. Such a new hotel, but sound insulation is zero to none... The second point is housekeeping service. It lacked. Trash was left in room, bathroom not cleaned, iron was left in room, bed not properly made. They need to work on that drastically. The buffet breakfast however is amazing. They maintain the buffet very well and the restaurant is clean. A big plus is the outside patio where you can have breakfast. All in all I think they need to invest in training still which can make the hotel a better place.","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Fantastic Hotel!","lang":"en","publishedDate":"2019-05-24","publishedPlatform":"MOBILE","rating":5,"text":"Brand new hotel in a great location.  The staff was friendly and inviting, clearly very proud to show off their new hotel.  The lobby is beautiful and expansive! I learned from the staff that a church occupied the site previously and the architect included the original facade and beautiful ceiling in the construction of the hotel.  The guest room was well appointed.  I particularly liked the oversized chair with desk stand - it was a comfortable space in which to work.  The WiFi speed was fast.  The bed was dreamy. The breakfast room is huge with an incredible selection of hot and cold items; very satisfying.  There is a lounge in the lobby at which we enjoyed light bites and drinks.  This hotel offered us everything we needed for a comfortable and convenient stay.  The location is great.  From the hotel, we walked to the Javits Center, Hudson Yards, Broadway theater district and the Highline Park.    Subway lines are one block away.  Also, there are many dining options in the neighborhood.  I look forward to my next trip to NYC; I will definitely stay here again.","travelDate":"2019-04","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Functional rooms but no upkeep","lang":"en","publishedDate":"2019-05-22","publishedPlatform":"OTHER","rating":3,"text":"We rented 2 rooms for 3 nights.  They are small but functional, with adequate amenities. The problem arose when neither room was cleaned after the first day. We mentioned it at the reception desk; one room still didn't get cleaned; the other's bed was made and shower cleaned, but the trash cans were left full, coffee wasn't replenished and neither was toilet paper.  We mentioned it again and they sent a cleaning crew at 7pm just as everyone was getting ready for the evening (so we sent them away). The excuse was \"the hotel was full\" and it's our job to remind them... Reception desk staff ranged from wonderful and friendly to completely clueless.  It's too bad because the hotel has potential and the rooms, while really small, would've been adequate (as long as you don't want to spend a lot of time in them...).","travelDate":"2019-05","tripType":"FAMILY"}
{"helpfulVotes":4,"locationId":15288822,"title":"READ THIS BEFORE YOU RESERVE AND STAY AT THIS HOTEL","lang":"en","publishedDate":"2019-05-21","publishedPlatform":"OTHER","rating":1,"text":"If you decide to stay here, READ THIS!!!! DO NO STAY IF THEY HAVE NOT FIX THE AC DURING SUMMER. MOST ROOMS HAVE THE SAME ISSUES AND THEY KNOW IT. OUR STAY: MAY 19, 2019\n\nWe stayed one night at Courtyard hotel Herald Square the first night and it was amazing. We decided to reserve the second night at this hotel because its location near Penn Station for us to easily go to Metlife Stadium for Concert and Newark Airport the day after our stay. I was a Titanium Elite and had a late check-out at 4PM on the first hotel. However, I received a notification that my key was ready at this hotel around 11AM. Therefore, we decided to move to this hotel so we can go to Metlife Stadium for BTS concert earlier. This was the start of all the TROUBLES.\n\nWhen we got to this hotel, Karina was check us in. Of course, no status recognition or thank you being a loyal customers which was okay for me because they allowed us to check-in early. She cannot find my reservation and said it was cancelled. It was crazy because I even received the mobile key. I then gave her my confirmation\/reservation number and she found it. We were given room 1406. (The hotel itself was both Fairfield Floor 15 and above & Springhill Suites Floor 2 -14 combined at the same building). I was given the high floor as I was requested before check-in. The room was very small with 2 queens and no complimentary bottle waters which was fine for us. The room itself was clean. However, the AC was off and it was very hot like 74F same as outside temperature. We then turn on the AC and set it to 65F. After 30 minutes, the AC did not have any cool air flow instead it was a hot air flow. The temperature reach 79F and we have to open the door as we are sweating and too hot inside the room. I called the receptionist and she said that she will send technician to fix it now. We wait one hour in a hot room and sweating. We saw the Director of Front Office, Colllin Carroll while she was checking on other rooms and tolh her our concern. She then radio to send to have technician come to look at. After 30 minutes, still no technician. I decided to go downstairs and bring the technician with me. Sal, the technician look at the AC and decided that we need to move to another room as the AC is not working right and have to be pull out. He called the receptionist but no rooms available until 4PM. He let us know that the hotel should compensate us. We hauled our luggage back to lobby to store as we need to get ready to go to MetLife Stadium. We waste so much time just to wait for technician to look at the AC.\n\nI talked to Melissa, another receptionist and ask for compensation. She was agree and offer 5000 points. As we are about to leave, there is another girl who had the same concern and was offered full refund as she talked to the Director of Front Office, Collin Carroll. I then told her about our room too and she also gave us full refund (free stay) which was weird. She then check to see if there was a room available with 2 queens which was not. We told her that we had to leave now and we will get our room when we were back from the concert. She was okay and will get the key ready when we were back.\n\nWhen we were back around 11:30PM, Nema, the receptionist did not have the key and our room still 1406. I requested to talk to Joey, the overnight Manager. He helped us to get our room ready which is located at 1417. He also helped us with our luggage which was very nice of him. The room was located in the corner and have bigger room than 1406. Also, have two complimentary bottle waters. However, the room temperature was 75F and it was very hot. We then set the AC to 65. After couple hours, the room was not getting cold and the temperature raise to 78F again. At this times, it was 1:30AM already and we were sweating like crazy and not be able to sleep. We called receptionist and offer technician to look at the AC. We refused as this was the second time and request for another room. However, they were no longer have two queens. I requested to move to King room better than inside this hot room. The receptionist went up to our room 1417 and gave us the key. She also mentioned that their hotel had been had the A\/C issues.We were moved to Room 520. The room was spacious and have two complimentary waters also. When we entered the room, it was cool like 70F. It was better than previous two. However, as we slept, the temperature raise to 79F again and we cannot sleep and sweating all night. This stay was the worst stay ever in my life. Even it is free but it is a waste of your time and I needed to file a complaint thru Marriott Customer Service. We waste our vacation in New York. We did not even enjoy the breakfast as we finally fell asleep in the morning for two hours before we were leaving to Newark Airport. We finally can sleep for two hours because I kept playing with the thermostat. I finally figured out if we set to 65F, it will give hot air instead of cool air. However, if we set to 77F, the AC will start and blow cool air. I assume they connected it the wrong way. However, this did not solve the problems because all the AC was locked in AUTO mode. If I set it to 77F, the temperature will drop from 79F to 75F. As the set point was at 77F, the AC will stop and no longer blowing until we adjust the set point again. This is totally ridiculuos.","travelDate":"2019-05","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Just ok","lang":"en","publishedDate":"2019-05-21","publishedPlatform":"MOBILE","rating":3,"text":"This is a new property with many problems. In my first room there was a ticking noise from the aircon. In my second room one could here the water flow from the whole building. Hey just to be clear I am normally not bothered about some noise level. \nOn the 6th floor the elevators were wrongly wired so one had to press up to go down. The fitness is great with brand new Lifefitness equipments and a TRX. The location is actually much better then I thought. It is walking distance to Hudson Yard, the High Line and to the Penn station. ","travelDate":"2019-05","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Melhor experiência que tive em Manhattan","lang":"pt","publishedDate":"2019-05-21","publishedPlatform":"OTHER","rating":5,"text":"Fomos recebido pelo recepcionista Caique, que além de ser brasileiro, muito gentil e nos deu muitas dicas de NY. Os demais funcionários também foram muito atenciosos\nNosso quarto apesar de ser médio para pequeno, tinha uma cama king, frigobar, microondas e uma tv enorme em 4k. O café da manhã era maravilhoso, muitas opções de comida e servidor em um enorme espaço. O hotel tem 3 semanas que abriu e está tudo lindo e novinho. Localização fica há 5min da Times square.","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Brand New, Great location, Free breakfast, but TINY rooms","lang":"en","publishedDate":"2019-05-21","publishedPlatform":"OTHER","rating":4,"text":"I recently stayed 1 night at the brand new Springhill Suites Times Square South.  This hotel has only been open for about a month, and shares the lobby and facilities with a Fairfield Inn.  The Springhill rooms are on the lower floors and the Fairfield rooms are on the upper floors. \nFirst on the location, the hotel calls itself \"Times Square South\" but be aware the hotel is on West 36th Street, between 8th and 9th.  It's a bit of a walk to the heart of Times Square.  But the hotel is 2 blocks from Penn Station, MSG, and major subway lines like the A-C-E and 1-2-3 lines. \nCheck in was fast and friendly and I was quickly on my way to my room on the 6th floor.  Be aware that this is actually a good size hotel, and there can be LONG waits for the elevator to come, especially to the individual floors.  I was given a room directly across from the elevator doors even though I have in my profile to be far from the elevators. I didn't love hearing people chatting outside my door late at night and early in the morning.\nMy room was perfect for a solo business traveler for one night.  It would have been great for multiple nights.  But the room is SMALL.  I mean typical NYC small, but still it would be tight for 2 or 3 people.  The room has the layout of a typical Springhill Suite room just crammed in.  This actually made it hard to work at the desk, as I couldn't pull the desk chair out far enough to sit in it easily because it bumped against the couch!!  The room has a small closet with ironing board, iron, safe, and there were a couple of bottles of free water.  \nThere were plenty of outlets and USB charging spots everywhere, which was great, and the WiFi was free and very fast.  The TV was HUGE and had Marriott's internet TV with access to YouTube, Hulu, Netflix, etc....\nThe bed was clean, super comfortable, and the AC in the room worked great.  IN the morning the shower was hot and powerful and the bathroom had great lighting.  \nA great bonus for NYC is the free breakfast in the lobby. It's typical Springhill\/Fairfield breakfast, meaning simple eggs, bacon, cereals, yogurt, coffee, fruit, etc... Perfect to start the day and there were two main stations of food to help handle the crowds.  the breakfast staff was very friendly as well. \nOverall I really like this hotel.  I like the Springhill Brand for its business layout rooms and good value, and this hotel did not disappoint, even in NYC!","travelDate":"2019-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Very, nice clean room & Attentive Staff","lang":"en","publishedDate":"2019-05-19","publishedPlatform":"OTHER","rating":4,"text":"I just spent  my first night at this new property at such a great, quiet location. I was on the 12th floor (Springhill Suites are on the bottom half \/  Fairfield Inn on the top half) and heard no noise whatsoever. Though I had checked in with the mobile app, I thought there would be a separate Bonvoy Elite lane to pickup your keys. Instead, it was long line of guests and only one  staff was working  Saturday night. The breakfast room was huge, serving both Springhill & Fairfield guests. It was a very nice breakfast buffet — open till 11am, that’s a first to me. Also a first was offering agave syrup and Chobani Greek yogurts, where I have not seen before at Springhill, Fairfield or even Residence Inns. Ivana, who assisted me the next day late check-out, was so professional and very understanding. I mentioned to her that I was supposed to receive a free drink voucher for the hotel bar, per the promotion stated when using mobile check-in. She understood the promotion and offered me the beverage, even though she said the hotel doesn’t honor it. She said she will bring this promo up to management, as she has been approached by this promo before by other guests. Again, perhaps the hotel is still new. Nevertheless, I enjoyed my stay. Next time returning, I will book for the Fairfield Inn room above to test it out. ","travelDate":"2019-05","tripType":"NONE"}
{"helpfulVotes":4,"locationId":15288822,"title":"No Air Condition","lang":"en","publishedDate":"2019-05-19","publishedPlatform":"MOBILE","rating":1,"text":"Dont stay here in warm weather. The rooms are equipped with brand new failing a\/c units. The service engineer is well aware of issue. The hotel chain itself does not care. If you stay here and have a\/c issues demand extra points or free rooms. This hotel is brand new and has numerous units that DO NOT WORK. Avoid staying here. We switched rooms numerous times, contacted front desk numerous times & spoke with service tech. ","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Fantastic!!","lang":"en","publishedDate":"2019-05-17","publishedPlatform":"MOBILE","rating":5,"text":"Moved here for a couple nights as a last minute booking because our last hotel was terrible and thank god we moved. This hotel is fantastic! Location is a short walk to times sq. The rooms are brand new, small as all NY rooms but feels a lot bigger because they are set out and planned in a spacious way. Had a fridge, microwave, coffee brewer, water. Bedding is so comfy, and a large king bed. bathroom clean and spacious with proper shower. big tv.\nbreakfast buffet is amazing, eggs bacon waffles yoghurt etc. \nAlthough we were given a room outside the elevator, noise is minimal outside.\nlove this hotel.\n\nLawrance & Heidi","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great service","lang":"en","publishedDate":"2019-05-16","publishedPlatform":"OTHER","rating":5,"text":"The hotel is very nice- be aware you're not staying in a \"suite.\"  It's a hotel room, and it's relatively small (not tiny).  Everything was spotless and stylish and comfortable, though. \n\nThe staff deserves a specific shoutout- they are fantastic.  The doormen won't let you touch the door and I had an employee actually run ahead of me to open a door to the basement for me.  I also saw staff walking around the lobby offering free bottles of water to people who were sitting there.  Excellent location, great employees, and a nice looking hotel at a decent price.  Will stay here again next time I am in the area.","travelDate":"2019-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":15288822,"title":"Not so much","lang":"en","publishedDate":"2019-05-15","publishedPlatform":"MOBILE","rating":2,"text":"A Marriott property mid changeover from a Fairfield to a Springhill. Fairly nice newish property targeting 20-30 something travelers. A bit millennial  too cool. Great beds. Announced today that the water would be turned off for  the whole block at 8AM tomorrow . It was posted  on paper in the elevators ( 2  elevators for 26 floors, one wasn’t working) , in a  “valued guest” memo. We are in fact so valued that....nothing. We asked about the breakfast supposed to  run until 10 :  “ Well , I dunno.” The are customer friendly ways to handle unexpected disruptions. Fair hill hasn’t got them.","travelDate":"2019-05","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":15288822,"title":"Great Stay","lang":"en","publishedDate":"2019-05-03","publishedPlatform":"OTHER","rating":5,"text":"Spent a Friday night into Sat morning in this beautiful brand new hotel. Staff and service was excellent, so friendly and knowledgeable of local restaurants and fun spots in walking distance to hotel. The place was very clean and accommodating and the stay was so comfortable. Complimentary breakfast next day was amazing. Highly recommend this hotel and will definitely stay again, hopefully longer than just one night.","travelDate":"2019-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":15288822,"title":"Weekend vacation","lang":"en","publishedDate":"2019-05-03","publishedPlatform":"MOBILE","rating":5,"text":"This is one of my favourite hotels to stay at in Manhattan. Rooms are very comfortable and clean. I was very happy that it is also pet friendly because I hate being away from my dogs. THEY HAD FUN TOO.\nBreakfast was great!!! With a little of everything.\nThe staff was very courteous, friendly and helpful. \nThis hotel is in the middle of all the great places to visit in NYC, Including Hudson Yards.  Nearby train stations gives easy access to The wonderful Central Park and Museums.Cannot wait for my next exciting Weekend in NYC. I now have the RIGHT HOTEL IN THE RIGHT PLACE.","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":15288822,"title":"Great 3 nights in Manhattan","lang":"en","publishedDate":"2019-05-01","publishedPlatform":"OTHER","rating":5,"text":"We recently stayed at this brand new hotel on a recent trip to NYC. Not only was this hotel so centrally located (steps away from Penn Station and the new Hudson Yards) but it's brand new and absolutely beautiful. The lobby is spacious and modern with a great bar\/cocktail area. There is also a very large breakfast room that includes outdoor seating in the warmer weather. Just beautiful. Our room was well appointed with a very comfortable bed and modern bathroom and sitting\/desk area. The room was also very quiet which is not easy in midtown Manhattan. The breakfast was included and was wonderful. I have never had scrambled eggs that were this good at any other breakfast buffet. I had them every morning. The best part, though, was the extremely friendly and accommodating staff. They made us feel welcomed and comfortable from the moment we stepped in the hotel. I highly recommend this for business or leisure. We will definitely be back!","travelDate":"2019-04","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":15288822,"title":"Great location, great rooms, awesome breakfast, and excellent staff!","lang":"en","publishedDate":"2019-05-01","publishedPlatform":"OTHER","rating":4,"text":"Great location near Times Square and short walk to trains.  Rooms are tight but functional and comfortable.  There has been a recent renovation and the place looks modern and great!  \n\nThe gym is brand new and well equipped - my only complaint is the lack of natural light in the gym, but you are in the basement!!\n\nThe free breakfast was awesome - not your typical continental breakfast, included a variety of hot foods (bacon, sausage, eggs) and make your own waffles!  And breakfast ended at 11 instead of 930 like most places!!\n\nWhat stood out the most, was the amazing staff who were friendly and helpful.  I was particularly impressed by the doormen and wait staff!  Always helpful and attentive!  Definitely recommend!","travelDate":"2019-05","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":15288822,"title":"Really nice place","lang":"en","publishedDate":"2019-04-30","publishedPlatform":"MOBILE","rating":5,"text":"Stayed there for Friday and Saturday night.  We love the place because of how clean and great the service was.  The staffs were very helpful and accommodating . The complimentary breakfast was excellent and we were surprised of how many Healthy options they have.  Can’t complain about anything and we definitely will stay there again! \n\nM Nguyen","travelDate":"2019-04","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":15288822,"title":"Great Location and Beautiful Hotel","lang":"en","publishedDate":"2019-04-29","publishedPlatform":"OTHER","rating":5,"text":"I stayed at the Springhill with my husband and my 3 year old in a double queen room and I thought it was a decent size room with a great view of Manhattan\nLocation is great! 3 blocks away from Penn Station, 4 blocks away from Port Authority and close by the Subways.\nBreakfast was amazing, they serve hot breakfast, waffles and Starbucks coffee which is always a plus!\nI'll definitely return :)","travelDate":"2019-04","tripType":"FAMILY"}
{"helpfulVotes":5,"locationId":15288822,"title":"Family city trip","lang":"en","publishedDate":"2019-04-27","publishedPlatform":"MOBILE","rating":5,"text":"We stayed Friday night at springhill suites with my 2 kids. We had a great time, the double queen bedroom was a decently size for family in nyc area,it even had a small couch area. loved the decor and location. It was 5 blocks from hudson yards which we got to eat lunch and enjoy the new mall area. \n\nWe loved the bedroom\/bathroom decor and front lobby had touch screen for the kids to draw on while we got drinks at the Bar1905. The kids love having complementary lollipops as usual. Staff and especially bell service was super nice and patience with me going in and out of the hotel with my kids and giant stroller. Valet is available at this location, big plus for us.","travelDate":"2019-04","tripType":"FAMILY"}
