{"helpfulVotes":0,"locationId":25364031,"title":"Doorman","lang":"en","publishedDate":"2024-04-09","publishedPlatform":"OTHER","rating":5,"text":"Dino = excellent doorman! Very helpful with luggage and rides to EWR. Rooms were nice I was expecting a little more, also $9.80 for a Lemonade in the lobby is crazy. Luckily it’s self checkout so I only paid for one. But otherwise a great trip and this closes out my 200 characters.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"A lovely stay - thank you!","lang":"en","publishedDate":"2024-04-08","publishedPlatform":"MOBILE","rating":5,"text":"We had a fantastic stay! The hotel is new and in perfect condition. Rooms are beautiful, the bathrooms are big! Staff is very nice and helpful, especially Minhaj helped kindly and swiftly whenever needed. Also Shai was very kind and helpful, thank you!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"AMAZING","lang":"en","publishedDate":"2024-04-07","publishedPlatform":"OTHER","rating":5,"text":"AMAZING! Wonderful staff from lobby security to maid service.LOVED our bartender Karina. Bell men Deano, Van and Migual were fabulous. We will definitely be back! Thank you for a great stay my first time in New York!! Sarah from Montana Thank you","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Excellent hotel, highly recommend","lang":"en","publishedDate":"2024-04-06","publishedPlatform":"MOBILE","rating":5,"text":"Everything here was top notch. Right in times square but has been built to muffle the sound so I didn't have any trouble sleeping. The room has excellent controls for lights and curtains, the shower had excellent water pressure and everything was spotless. The room was very well laid out and not missing anything. The staff were all kind and pleasant especially housekeeping, bellmen, and doormen. I hate times square but have to be there for work so will definitely be staying here again. ","travelDate":"2024-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Average hotel but in prime location","lang":"en","publishedDate":"2024-04-06","publishedPlatform":"MOBILE","rating":3,"text":"An average hotel in the heart of times square. I was expecting more from a Hilton 4* hotel but it fell short in a few areas that could be easily rectified. \n\nPositives: check in was quick and easy, central times square, transport links nearby (subway), friendly staff, modern hotel, nice bar (but expensive), towels changed daily (although I don't mind reusing to be eco-friendly - this didn't seem to be an option even when towels were hung they were changed regardless), room was clean and well presented\n\nNegatives: 19th floor - very noisy even at night, no water provided - can drink tap water but there were no glasses\/cups even in bathroom, no mini bar, light switches\/ blinds didn't always work first time, room was a lot smaller than I imagined it to be, there was a massive gap between the wall and the curtains shutting - bright lights constantly coming through at night\nBe aware that there is a daily surcharge at this hotel that adds up very quickly. \n","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best time ever","lang":"en","publishedDate":"2024-04-05","publishedPlatform":"OTHER","rating":5,"text":"This has been the best place ever. All staff is wonderful! The bellmen were very helpful. It has been amazing. We especially like Karina the bartender. She is amazing and friendly. I will definitely stay here again when I come back to NY. Thank you! Thank you!! Thank you!!!","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Awesome experience!","lang":"en","publishedDate":"2024-04-04","publishedPlatform":"OTHER","rating":5,"text":"Amazing location, service, and quality! We were very pleased with our stay and the staff assisted us in every way possible! Very nice rooms! Lots of restaurants close, and within walking distance of many NYC attractions. Right in the heart of Time Square!","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Excellent hotel","lang":"en","publishedDate":"2024-04-03","publishedPlatform":"OTHER","rating":5,"text":"The hotel is well located, good service, clean and a cozy atmosphere. \nYou saw her from the full room to Time Square. The hotel is completely clean and the employees are very attentive like Yassin. He always greets us with a smile and always answers our questions.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Family friendly Times Square stay","lang":"en","publishedDate":"2024-04-03","publishedPlatform":"OTHER","rating":5,"text":"From check in to check out the experience at Tempo by Hilton was absolutely amazing. The view from the 42nd floor was amazing the room was clean and beds super comfortable. The bathroom was aesthetically pleasing and the housekeeping crew kept it all in check throughout our stay. My family and I were very pleased , we were actually booked at another hotel and had to change hotels immediately and I found Tempo which I am so happy I did. The staff is so attentive and helpful they make sure your stay is a breeze and help in any way that they can. Bo at check in as such great customer service she ensured we were good every step of the way, checking in and out was quick and easy. I was super impressed with the security team also they are attentive to the guests and pay keen attention to who is coming in and out , they also help out with any need whether it be transportation or simply somewhere good to grab a bite to eat. The hotel has a restaurant but food options were limited , entrees aren’t served with sides and the food items are a bit pricey with lack of side options to be added. You have a better bet of getting food off property. Big up to Yassin on the security team , he was so helpful also Miguel and Juan who arranged transportation. We really enjoyed our stay, felt like home and we will definitely be back soon.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"We look forward to returning","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":5,"text":"5\/5 for location, comfort and staff. We spent a long weekend there and were surprised at the room size for a Times Square hotel. It was fairly spacious, had 2 incredibly comfy beds and a wonderful bathroom - but with a sliding bathroom door that didn't stay closed and couldn't be locked. The staff was warm, friendly and very helpful. We loved the number of elevators and how quickly they operated. The hotel is immediately across the street from a big Hersey's store and an easy walk to Broadway shows and shopping and the subway staircase is immediately outside the hotel. We stayed on the 36th floor. With the window closed, we could not hear any of the Times Square chaos and we loved that we had a choice of blinds to use including blackout for a great sleep.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"All perfect","lang":"it","publishedDate":"2024-04-02","publishedPlatform":"MOBILE","rating":5,"text":"Modern hotel in the center of Time Square. Structure equipped with every comfort. Spacious and spotlessly clean rooms equipped with a coffee machine, safe and numerous sockets everywhere, including USB ones, so as not to require travel adapters.\nThe hairdryer available is professional and not the usual hotel hairdryers.\nWi-Fi with excellent signal in every area\nStaff really friendly and helpful\nHighly recommended!","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364031,"title":"Just outstanding! Prime location! A team that goes above and beyond!","lang":"en","publishedDate":"2024-04-01","publishedPlatform":"OTHER","rating":5,"text":"Definelty a must stay! Excellent team, Tajmaly, Jose, Dino, Eartskin, Shaeena {Kipsu attendant}, the entire bar tending staff! Everyone I encountered was awesome. The doormen welcomed you at the entrance, Tajmaly really took care of us our entire stay! Everyone made you feel welcomed! I did not want to look strange asking people for their names! But even the handsome security guards that appeared so professional were guest driven!  Prime Location!- Right across from the Time Square Steps- Live Entertainment- Hershey Store- M & M Store, Krispy Kreme Flagship!  Beautiful property! Very upscale, tech savvy and modern. Super clean. State of the art gym. The restaurant\/ bar was upscale with great prices, live music! The full band with a wonderful singer kept us entertained! - Sidenote, my niece left her iPad in the bed, the Lost and Found team lead by Jose, who took sole ownership of returning it in the fastest way- high regard of a keen sense of urgency! Just honesty and efficiency with a well-rounded team! Valet Parking available.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best Hotel in Times Square NY","lang":"en","publishedDate":"2024-04-01","publishedPlatform":"OTHER","rating":5,"text":"Gorgeous hotel with a comfy bed, beautiful shower (Mirror has Bluetooth feature which is a plus) great view from 42nd floor. Recommend using the Hilton app for fast response from staff and special requests. \n\nGreeted at the door by security when entering and leaving to tour the city. We felt safe knowing staff was alert and observing all movement. Yassin was exceptionally attentive during every interaction. Thank you again!","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great staff, modern rooms, some issues","lang":"en","publishedDate":"2024-03-31","publishedPlatform":"OTHER","rating":4,"text":"Hotel is convenient location. Rooms are clean and modern. Staff was very friendly and helpful.  Especially a gentlemen by the name of Yassin.  We did run into two problems in the room we reserved which was two queens so they gave us a king with a view but it was a smaller room.  And although we complained of a drape not working in the room, it was never repaired which made for some very \nbright nights and made it harder to sleep.  We’d stay again if we knew that wouldn’t a problem.  I mentioned it at check out and wasn’t offered any compensation","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Convenient, but that's it","lang":"en","publishedDate":"2024-03-30","publishedPlatform":"OTHER","rating":2,"text":"If you're just looking for a place with a bed and a shower near Times Square but with reasonable acoustic isolation, this might be the place for you. Also if you like whizzy hi-tech: the elevator system is impressive, and you get effective aircon, a Nespresso machine, and an oversized TV. But if you want normal hotel facilities, avoid. At check-in, the small reception area was chaotic, and a request for rooms near each other - made 3 months earlier and acknowledged - was not met. My room had no drawers or cupboards,  so apparently they expect guests to live out of a suitcase.  We walked out of the breakfast room as the breakfast offering was one of the worst I've ever come across. There's nothing in the bathroom except soap squeeze bottles - not even a paper cup. Everything is run by electronics, so don't bother looking for light switches.  You get the feeling you're in the hotel equivalent of an automated airport check-in with about as much character. Actually, the lobby differs from an airport in one respect: airports provide seating, but this hotel has virtually none. I've stayed in a 4-star Hilton near Times Square in the past, but the only 4-star aspect of this new Hilton is the price.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great place to stay in Times Square","lang":"en","publishedDate":"2024-03-29","publishedPlatform":"OTHER","rating":5,"text":"Great accommodations with all the perks expected from a Hilton family hotel. All the hotel staff were exceptionally courteous and helpful. 17th floor was very quiet for being in the middle of manhattan. My only complaint is that this review has to be at least 200 characters when 150 would suffice.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Excellent service from Yassin","lang":"en","publishedDate":"2024-03-28","publishedPlatform":"OTHER","rating":5,"text":"Great service from Yassin, excellent employee and always checked on us to make sure our stay was great, will be returning. Nice hotel and great location within walking distance to a lot of restaurants and different activities. Enjoyed our stay","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"The oasis of relaxation immersed in the chaos of Times Square","lang":"it","publishedDate":"2024-03-27","publishedPlatform":"MOBILE","rating":5,"text":"I stayed at this hotel for a week for my first visit to New York and I was really fully satisfied.\nThe location is unique, it is literally located in front of the Broadway steps in Times Square and from the rooms it is possible to admire all the screens and all the vitality of the beating heart of Manhattan. The entrance has a constantly manned concierge from which, with very comfortable elevators (never and I mean never late - also because there are 7 different ones to reach the floors without having to queue) you reach the hall with the reception. Here there is the restaurant and the lounge bar as well as a small shop where you can stock up on supplies for the minibar. From here you take the lift and reach the rooms. Every time an employee is present to provide assistance when calling the lifts, this demonstrates a truly appreciable attention to the customer's well-being. The rooms are large and spacious, fully soundproofed, with modern, quality furnishings. The tidy bathroom, equipped with Bluetooth mirrors to which you can connect your smartphone. Excellent cleaning with change of towels every day and great professionalism from the staff in charge. Highly recommended!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364031,"title":"Comfy rooms and wonderful service. Too dependent on electronics!","lang":"en","publishedDate":"2024-03-27","publishedPlatform":"OTHER","rating":4,"text":"Rooms very clean and beds very comfy - but no instructions on anything unless via an App and of course the internet.  Towels hardly used were  washed every day. It really necessary. Fabulous  staff all round: at Reception, at main entrance, and in the Highball restaurant. The food there was really good. Good size  but not excessive portions. Staff worked hard to get things as we wanted. Amin was a bit of a star, but so too were his colleagues!  Would recommend this hotel….","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Perfect Stay!","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"OTHER","rating":5,"text":"Perfect location and the staff was great.  They always remembered us and greeted us all with a smile.  Security was even fabulous!  Thank you Yassin!! We definitely recommend Tempo for a great stay, attentive staff in a lively location. We will be back!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Trip to New York","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"MOBILE","rating":2,"text":"Stayed here with family for 7 nights. \nLocation: cannot fault the location. Amazing spot local to the huddle and bustle. \n\nHotel decor:  lovely modern decor. Room wasn’t very big but I suppose it’s the norm for a city hotel.  \nRooms: Blinds did not work in the room which was frustrating. \nCoffee pods not refilled all week. \nThe room bins were emptied daily and towels changed.\nRoom not swept in 7 days.  \nBedding not changed  7 in days\nNo water bottles in the room\nNo slippers in the room\n\nReception: \nstaff were very nice however we had a packed week and didn’t really speak to them. \nDoor staff were very personable and friendly esp Hassain. \n\nThe restaurant is pricey. \n\nWe were surprised at the daily GC amount which was nearly $40 per room per night.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Perfect !","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"MOBILE","rating":5,"text":"Absolutely loved this hotel, special birthday trip with my Mum. Hotel is clean, modern, amazing location, right in the middle of it all. Perfect ! Staff were excellent, helpful and friendly. Would definitely visit again. Thank you :-) highball restaurant within the hotel fab too !","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Not worth your $ go somewhere else!!","lang":"en","publishedDate":"2024-03-22","publishedPlatform":"OTHER","rating":2,"text":"We are checking out today and wanted to tell you the pros and cons of this hotel. We are in a top floor two bedroom corner sweet!\n\nPros: \nLocation\nViews\n\nCons:\nPhones don’t work in the suite\nBlinds don’t work (we’ve had to call to have maintenance come in daily to allow the curtains to close)\nNo microwave in suite\nNo coffee in unit - they have a gross espresso \nConstruction starts before 730a somewhere near our room. Lots of noise!!\nSprinkler covers have fallen several times one hit me! \nAsked for a blanket they brought us a sheet \nScreaming kids nearby our room went on for hours \nWe had to have maintenance in our room every single day to fix something and they still couldn’t fix the phones or window coverings\nThe temp in the room if you set to say 70, at 69 the ac comes in till it’s about 63 then the heat kicks on till about 75 good luck being comfortable! \n\nHotel didn’t offer us one thing - not even a free drink for our issues! Talk about high cost low customer service and maintaining their rooms!\n\nFar cry from luxurious even paying $$$$!!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Gorgeous !","lang":"fr","publishedDate":"2024-03-21","publishedPlatform":"MOBILE","rating":5,"text":"Magnificent hotel, very beautiful room with exceptional bedding! Spacious, comfortable and modern bathroom. Bay window in the bedroom with breathtaking views of Times Square! Housekeeping done every day, Nespresso coffee machine with 3 pods\/day, small fridge, safe.\nTop hotel bar and restaurant\nI recommend 300%\nMany elevators with a very good system to avoid waiting.\nThank you for this wonderful week in New York","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great location and friendly service","lang":"en","publishedDate":"2024-03-20","publishedPlatform":"OTHER","rating":5,"text":"We got a really good deal for this hotel as it had just opened.  Trip was on Oct 8 2023 with my family of teenagers. The room was sufficient but tight, had 2 queen beds and a spacious bathroom.\nThe reception area is above building so you take the elevators up to check in.  It is a spacious area where guests mingled, the bar was also on the same floor as reception so it was busy.  The view from the check in area was great, looking down to the street.  Unfortunately when we arrived, there were scaffolding and still some construction being done on the building.\nAll the staff were just so friendly, including the doors people who greet you as you go up or come out of the elevators.  \nI loved that it was just across the Hershey's Store (so did my girls) and it's steps away from the heart of NYC.  We walked everywhere from the hotel, lots of restaurants, stores and shows around.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Above & Beyond Property & Guest Service.","lang":"en","publishedDate":"2024-03-20","publishedPlatform":"OTHER","rating":5,"text":"We came in for a short visit to do shows and dining. I hadn’t previously heard of Tempo, as it is only 6 months old,  but it looked intriguing on the website. It did not disappoint! I love everything about it. From the moment we checked in with Taj at the front desk, who was very accommodating, through the moment we left,  was a great experience. Taj was more than helpful, and sincerely engaging. She even got us into it room early, which we appreciated after a long journey in. \n\nThe staff is super friendly and helpful, especially Yassin! Every time we saw him, he had the most infectious smile and spirit. I wanted to scoop him up and take him with me. \n\nThe whole experience was such a delight. Special nod to Taj at the front desk in Yassin, who are such an asset to tempo! \n\nWe will be back!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Love this new hotel","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"MOBILE","rating":5,"text":"This new hotel is in a great location!  Clean, staff is very friendly, bar is great. We loved our overnight at Tempo.  All the team members were very helpful\nFrom checking in, storing luggage etc. I felt very safe. Front doorman Yasmin was super friendly!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Excellent Staff","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"OTHER","rating":5,"text":"The service support staff was wonderful particularly Amin. Staff were always eager to go above the call of duty and requests. \nThe Hilton could hire additional staff to answer phones and service customers from the hours of 8-1am. Otherwise, Hilton is still #1!","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Favorite Hilton property in the city","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"OTHER","rating":5,"text":"Everything at this hotel was truly incredible. The staff was so kind + helpful, loved the bar\/restaurant in the lobby, BEAUTIFUL room and bathroom, great view and perfect location for those that want to be in Times Square\/Midtown! I’ve stayed at a lot of Hilton hotels in nyc and this is by far my favorite going forward!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Très bien mais…","lang":"fr","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":4,"text":"Nous sommes actuellement au Tempo sur Times square et je vous donne déjà mes premières impressions. Personnel très sympathique et souriant. L'hôtel est très beau très moderne. Rien à dire sur la propreté de la chambre top, salle de bains superbe, miroir Bluetooth . Seul petit bémol pas beaucoup de rangements dans la chambre. Vue sur Times Square  on ne peut mieux le hic c’est que cela s’entend….en effet un peu trop bruyant pour nous malgré les 23 étages…il y avait des étages beaucoup plus haut mais il fallait rajouter 100 $ par nuit soit 700 $ de plus donc non. Dommage je pense que cela aurait changer notre séjour….Je complèterai mon commentaire à la fin de notre séjour mais je tenais à donner mes impressions à chaud.’","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Perfect for us including: location, cleanliness and kindness","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":5,"text":"Everything about this hotel was perfect for us!  The room had a greta view of Times Square steps from the 38th floor. We could see but not hear the noise! Also it was right around the corner from everything including the subway with Rockefeller Center, Bryant Park, NYC Public Library and all the Broadway shows in walkable distance. The room had plenty of usb ports, a clean bathroom and bedroom and perfect beds and pillows. The evening elevator man was always friendly although all the staff was extremely helpful and friendly.  Loved the safety and quiet and respite despite being in the center of things.  We purchased some snacks and water from the market which was easy to use. We purchased early check in for an additional $75 but it was worth it for us so we didn't have to worry about anything. We loved the controls at both sides of the bed- so easy. Thank you for a great stay for my teen daughter and I.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Brilliant stay. Thank you","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"MOBILE","rating":5,"text":"We’ve just returned home today. Fabulous hotel, staff were very helpful if we needed anything. There were petals under the chair that must have been from Valentine’s Day so I would say things need to be moved and cleaned underneath but overall this wasn’t an issue and would definitely stay again.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"First trip to New York, Broadway shows","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":5,"text":"This was such a great hotel! The amenities were wonderful, rooms were clean and very modern, beds very comfy and the people were so friendly and helpful. The location was perfect to have access to any of the theaters, shops and food. Dino was especially wonderful. He gave wonderful food suggestions to us each day. Whether we were walking or taking the subway, he always made sure we were headed in the right direction. I'd recommend this hotel to anyone headed to the Times Square area of New York.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Stay at the Tempo by Hilton Times Square!","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":4,"text":"The hotel is in a stunning location with views of Times Square from your windows with easy access to everything! The decor and layout is lovely with great rooms that have everything you need. The bar\/restaurant has beautiful views with great food and coffee too! The staff are fabulous, in particular Yassin who supports in reception and making sure you get the elevators to the right floor! He’s super friendly and bubbly, adding to a great experience in New York. A definite MUST stay!! This is a new hotel so the only feedback I would give is that sometimes the rooms could be cleaned to a slightly better standard but either way, it was a great stay!!!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Hotel  highly recommended","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":5,"text":"The hotel was very nice. The room had an excellent city view!  It was clean and quiet. Great location right in Times Square with easy access to the subway and lots of touristy stuff. The staff was friendly and super helpful especially Dino. He made our departure so easy by assisting us with our Uber.  Highly recommend this hotel!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Brilliant Hotel","lang":"en","publishedDate":"2024-03-14","publishedPlatform":"OTHER","rating":5,"text":"One of the nicest city hotels ive stayed it. \n\nRooms were small but i expected that given the location. The rooms were very clean and looked after. Staff were friendly and lovely. \n\nCould have done with more coffee in the room but as soon as we started leaving more and more tips they added more pods! :) \n\nThe hotel itself is literally in times square, you couldn't get any closer and so close to other places like the empire state building (20 min walk), central park, the theatres etc.\n\nDespite being in a very busy area we were affected by any noise at all despite having a city view. \n\nWould absolutely recommend and would stay again!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364031,"title":"The team at Tempo made our NYC stay even better!","lang":"en","publishedDate":"2024-03-14","publishedPlatform":"OTHER","rating":5,"text":"We were welcomed by the nicest doormen and then gentlemen who checked us in (forgot his name but black guy with round framed glasses) was awesome! He was super friendly and made an early check in happened. We did have to wait for a little bit but we did have an early flight into the city so that was expected. We did some exploring and then hung out at Highball while our room was getting ready. Their team working the cafe were great and their coffee is even better! I wish I bought a bag! Everyone we encountered was so pleasant and greeted us so warmly. The room which I expected to be tiny was bigger than anticipated and the view was so awesome! We had a great little cut out where the chair sat and was a great overview of Times Square! It was my husband and son’s first trip to NYC and the team at Tempo made our trip the best! Thank you for amazing stay! I will be sure to tell everyone where to stay when wanting to visit NYC!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great customer service.","lang":"en","publishedDate":"2024-03-13","publishedPlatform":"OTHER","rating":5,"text":"Everything and everyone was fantastic. \n\nKarina, Jen and Justin at the bar showed the best customer service. They worked well together. They went above and beyond for their customers. Very helpful. Answered everyone's questions. Just fantastic teamwork.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"TV does not work. No water bottle in room.","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":3,"text":"The TV failed to get CNN or Fox News- just gave a spinning circle suggesting I try later. I tried many times. No water bottles in room, instead a cost saving \"hydration center'\" in lobby. I'm perfectly happy with faucet water but only small coffee cups. They only give 2 coffee capsules and one decaffeinated capsule. They try to force you to eat in their restaurant by giving a $35 credit. Good view as I was upgraded.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Style over substance, staff could learn to have better manners.","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"MOBILE","rating":2,"text":"Initial impression, lovely room, but they weren’t cleaned daily, only towels replaced and bin emptied. Used our $10 toon credit in the bar, staff insistent we take a seat, 2 beers and a 20% gratuity added to put 2 beers down, we did pay but feel it’s too much for 2 drinks put on a table.\nWent for a drink another night, sat at the bar this time, served, then spent forever asking for the bill, whilst all the staff, spent there time chatting to a group of people at the bar. Was then charged for 4 drinks and had to correct them, they really did not want to bother with us. Eventually hill corrected.\nOn check out, asked about the bill ( we were in a rush to get car to airport) told don’t worry, all taken care of, assumed final bill would be emailed, still don’t know what they’ve taken from my card, tried live chat, said they couldn’t help and to call hotel, I asked for an email address or could they call on my behalf as very expensive from UK…chat was ended, tried again….chat was ended. It’s 2024, surely customers should be able to email a query?","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Perfect one night stay","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"MOBILE","rating":5,"text":"This hotel exceeded our expectations for a one night stay. This hotel is new, modern and chic. The front desk was courteous and friendly. Our room was on the 23rd floor. Although small, it had all the amenities we like at a hotel. The views of time square were great and the automatic lighting and shades were great. The room had a frig, Nespresso machine, a comfortable king bed, luggage space, and the bathroom was large with a great shower. We would absolutely recommend Tempo by Hilton to anyone looking for a place in NYC with a prime location central to Times Square!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"A GEM in Times Square","lang":"en","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":5,"text":"Another great stay at the newly opened Tempo. Marta at the Front Desk was so amazing and welcoming upon my arrival and big thank you to Cary in the sales team for taking care of us. The rooms are beautiful and great views of the city and the midtown skyline. An excellent option for Times Square and Highball Restaurant offers a great selection of cocktails and food.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best Customer Service","lang":"en","publishedDate":"2024-03-04","publishedPlatform":"OTHER","rating":5,"text":"Absolutely loved this hotels hospitality and the view from the 23rd floor was amazing. The restaurant on the 11th floor served as a meeting place for business meetings and the servers were great. Also the greeter Yassin was always so helpful no matter what time the day or night.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing staff","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"OTHER","rating":5,"text":"We had an amazing stay. The bar staff (Justin and Jennifer) were great- along with all their co-workers that night. Yassin helped us find great places to eat and even showed us how to get there. He was helpful and pleasant the whole trip. Great staff at this hotel!","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Anniversary trip","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"OTHER","rating":5,"text":"Great  hotel and  very friendly staff.  Right in the middle of all the action of Times Square but still has a nice quite relaxing feel somehow.  The room was very clean and comfortable.  The front door man Yassin was super friendly and gave us great tips on places to visit.  We will definitely be back soon .","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best hotel in time square .","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"OTHER","rating":5,"text":"I love this hotel , the design , the attention to detail for the guest and the staff are just amazing . The view of time square is unlike any other view I’ve had here in the city . Yassin and Tahj are the best . So professional , so friendly . Really made the trip so enjoyable.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"This is the place to stay in Times Square","lang":"en","publishedDate":"2024-03-02","publishedPlatform":"OTHER","rating":5,"text":"Alright, my friends! Buckle up because this place is freaking fantastic. It's exactly what you need for a business or family trip in the heart of the city.  For me it was a combined trip and we left quite happy.  I had read reviews about the staff going above and beyond.  It's smart. Set's the hotel apart.  Right away I experienced it on arrival. Everyone gives a #### about you.  Even the team at the door is welcoming and super helpful.  You ride the initial elevator up to the 11th floor and you'll be greeted by a great team.  Shoutout to Yassin.  I had read reviews about him being awesome- guess what? He is! I feel like I met a TripAdvisor super hero from all the positive reviews.  They are not lying, the guy is freaking awesome. Have an obscure question? (Like where to buy water bottles- you should get one, $10, it builds a well and there are fill-ups everywhere.) Yassin figured out who would know and have the bottles and made it happen.  Super positive energy. Really makes the place shine.  The rooms were great. Incredible showers.  Clean rooms.  It is expensive but worth the Hilton Points or dollars (or both!).  The restaurant\/lounge is *stupid* expensive.  $19 avocado toast? hahahahahaha.  $40 for a cocktail and a soda? Yup. Welcome to the big time at the big city.  It also closes pretty early at night. So the restaurant isn't the place for all your eats but the location is absolutely the best spot in town.  This has become our new go-to for city trips, personal or business. Looking forward to my next trip just so I can stay here again.  My last impression? Damn these guys are good.  Shoutout to Dino out front.  When he heard we had an uber incoming on our departure- he went a several hundred yards down the street to let our uber know he could pull into the valet \/ hotel parking zone to pick us up.  This done in the pouring rain.  He certainly didn't need to do that.  But he did and loaded up our luggage.  What a cool guy!  Thank you Tempo! Can't wait to come back!","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Fantastic stay in Times Square","lang":"en","publishedDate":"2024-02-28","publishedPlatform":"OTHER","rating":5,"text":"Stayed for 3 night at this lovely new tempo by Hilton! We were given room 3405 a king corner room on the 34th floor, what a view! Immaculate room, beautiful bathroom and very comfortable bed. Couldn’t fault the room at all. \n\nAll staff were always friendly on entering the hotel daily and the reception staff \/ hosts. \n\nHotel decor is beautiful and the hotel location is fantastic!\n\nIf we had to be critical, the only thing we would  mention is the breakfast \/ food facilities, very small selection of breakfast choices hence why we did not eat in the hotel. The happy hour is just 3 drinks out of a menu of around 200 drinks and finally the hotel reception area is really small so nowhere to sit and wait if waiting for a taxi for example. Sitting in the restaurant is not always possible as we are not always looking to drink so some seating would be ideal although not sure how or where as it’s a small area.\n\nOverall a fabulous stay in a very modern clean and friendly new hotel.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Excelente hotel","lang":"pt","publishedDate":"2024-02-28","publishedPlatform":"OTHER","rating":5,"text":"Quero parabenizar a excelente estadia que tivemos no hotel . Ressalto a sensacional recepção e acolhimento da funcionária Kessi .\nEstrutura e limpeza dos quartos excelentes . Com certeza indicaria para amigos . Localização maravilhosa…Parabéns !","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Terribile experience behind any stretch of immigration 😡","lang":"en","publishedDate":"2024-02-27","publishedPlatform":"MOBILE","rating":1,"text":"Really saddened me having to write a negative review; however in light of our terrible experience I hope this will help others who have a proper knowledge and understanding of the meaning of of the STARS. \nFor clarity my husband and I are consistently travelling around the world for more than 30 years, and we stayed in some of the most luxurious hotels for example:\nThe Anantara Hotel Bangok, the Anantara horel Abusjabi the Rixos the Palm Dubai, etc… so when we give a review based on stars we perfectly know what are talking about… and what to expect about hotels and their staff and the service they offer.\nOn arrival we were given room 2618 and as we entered the electric blackout curtains where in all over the place and outside the railings so we couldn’t open or closed them properly. The fridge freezer empty and the ensuite and everywhere infact full of black airs. I managed to get hold of receptionist after 1 hour😡 and eventually someone was sent to fix the curtain…\nTwo half sparkling bottles of waters 21 dollars … mist have been mixed with gold\nThe mattress was sinking and we couldn’t sleep well\nFirst night a disaster😡\nThe light breakfast is not at all included and infact it is rather shameful… the person at the till will show you food premade and ask you in s very intimidating  way to give a tip which 15% he told us be very poor… fir what really for bringing the food from the fridge to the counter 1 mt circa away. I did explain that in Europe we give tips if we feel that a good service has been delivered…. But he pushed us so badly and felt like if we where obliged to do it…. The bill was around 74 pounds for the ever worst breakfast consumed in our life🤮 that already ruined my first day\nAfter few days We finished the shower gel and in the morning before going out we kindly asked at reception to refill and on our return a bottle was left on top of our hand luggage 🙈 \nOutside the hotel there was an advertisement for Happy Hour… it turned out that there was a very limited selection of cocktails not particularly nice and also you pay for everything is not like in Europe where happy hour means that one over every 2 drinks is free. The waiter was giving tap water something I don’t ever drink and when we politely declined he pulled a disgusting face and seed so you are only going to drink alcohol 🙈 seriously I occasionally drink and do I need to justify myself… he was also constantly addressing us with Hi guys… really??? How disrespectful and clearly discriminatory when you are tolling to people that  are no longer that young … very unprofessional and unimpressive  considering we were customers and not his friends. This was generally  speaking the way we were addressed by the staff , behind unacceptable  for a 4 star hotel. On our check out I was asked how was our stay and I  genuinely  told terrible and requested to talk with a manager. I did explain how unsatisfied we were and that I wanted a full refund… he  as well started addressing me as you guys. I sdo told him that I wasn’t his friend and that it was not professional or  acceptable way to address customers older than him and mostly customer. I explained everything as stated above and he offered me a discount of 130 dollars circa and then instructed the  receptionist to take carr off the bill, she start addressing me as Anna and I did explain that I wasn’t her friend to address me otherwise and she told me that they have   been instructed ti address the customer  that way…    really since when?? Terrible this is not a 4 star… you need to train your staff properly  shame on you management team need to know  how to  address  \npeople with correct manners both professional and polite we are not in the farwest and that is not a guest house although I am sure inn europe even guest houses can offer better service. All in all disgusting and expedia has pretended to request s reimburse but in the end they wrote to us saying the hotel has refused… terrible and this bad affair about tips really has to stop! You need to be able to earn them otherwise this is felt as an extortion …. We will never get back to you and also we encourage you to people like us to stay really away","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing staff","lang":"en","publishedDate":"2024-02-24","publishedPlatform":"OTHER","rating":5,"text":"I wanna say thank you to the staff member Yassin for welcoming us to the Tempo the guy has great energy coming into the hotel to leaving the hotel keep it up . \nAlso I love the gym here at the tempo amazing view very clean . \nI’m upset that the rooms don’t have microwaves and ice machines","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great time","lang":"en","publishedDate":"2024-02-23","publishedPlatform":"OTHER","rating":5,"text":"Great hotel! Amazing views of Times Square m, great restaurant and hospitality throughout the property. Yassin was particularly friendly and help with the elevators and suggestions on local restaurants. Will definitely return! Suggest lowering the price of your bottled water.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Frequent guest","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":5,"text":"Tempo is my go to hotel when ever I’m in NYC, as I am there often. The entire staff is friendly and always so helpful and professional. Clean spacious rooms, well lit spacious bathrooms and beautiful bar and lounge area in the lobby. I highly recommend!","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great stay. Most definitely will be back.","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":5,"text":"Beautiful room decor. Everyone makes you feel comfortable and special at the same time! We were greeted with very hospitable and personable people. Yassin was very friendly and made us feel welcomed. He informed us on what’s to come to the hotel and I’m excited to come back when all of the attractions are finished!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great Hotel, Even Better Staff","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":5,"text":"My daughter and I had a wonderful time at Tempo. The bedding was very comfortable and the Apotheke toiletries were nice. The bluetooth mirror was probably my favorite feature of the room. \nIn addition, every member of the staff was kind and helpful, Yassin especially. Although our interactions were brief, every time I passed him, he was always very welcoming, positive, and helpful. I’ve been in the service industry for almost 20 years and I truly appreciate amazing guest service and Yassin embodies that. Give the man a promotion! His service is what will bring me back to Tempo for my future visits to NYC.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Wished I’d booked another hotel","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":2,"text":"Currently staying here room 1732.\nBooked as surprise for my husbands 50th. \nRoom cleaned daily spotless !\nGreat location in Times Square. \nNow the disappointment bit! Customer service is lacking!! I contacted the hotel several times to advise of my husbands birthday and to see if we could do anything or book anything to make his trip special! Not one reply back. I went through the Facebook page to see if I would have any joy this way. I received a reply advising someone would be in touch again no response or contact . Contacted again no response. I recieved a text to go down to the front desk to make arrangements. Receptionist couldn’t be bothered just asked for room number advised there was no comments and said Happy Birthday and went in to the next customer. If you are here wishing to celebrate any special event this is clearly not the hotel to book!! It’s been so dissapointing!! I really wished I’d booked the marquis marriott now . \nReception need some training in customer service badly","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great concept, terrible exection","lang":"en","publishedDate":"2024-02-21","publishedPlatform":"OTHER","rating":2,"text":"I had a VERY unfortunate stay at Tempo by Hilton New York Times Square the past few days. There were multiple issues with the room and the service, and I ultimately was not provided with all the amenities I paid for. There were also underhanded sales tactics at the hotel restaurant\/bar and issues picking up a package.\n\nInitially, I checked in via the app. I had to try a few times to unlock the door. The room itsef had no issues, but the difficulty with opening the door persisted. We had to wait in line at the front desk the next day to to get physical cards, which then failed to open the door. I was told they would resolve this issue while I was out, but no action was taken. I inquired again upon returning to the hotel that day, after having to wait in line for almost 30 minutes, and the front desk staff ultimately had to give us a new room. I asked if this room would have the same amenities and was told yes.\n\nThe second room had no issues with the door, but several new issues. There was an unpleasant smell, which is likely why I found the window open upon arriving. The sink in the bathroom was backed up, and the toilet paper holder was hanging at an angle so that the roll kept falling off. I paid for a room with a Peloton, which the new room had, but someone had swapped the normal pedals out (which can be used with normal shoes), for pedals that required delta cleets. I went to front desk again, and waited again, asking for them to swap out the pedals and fix the other issues. Again, I was told they would fix it. When I returned, it seemed like the pedals had been swapped out, but the bathroom issues were not addressed. When I went to use the Peloton in the morning, though, I realized the pedal had been installed incorrectly, with the pedal and screw sticking out at angle and obvious metal shavings on the floor where the screw had been stripped by whoever installedd it.\n\nI also sent a small package to the hotel for the day I checked in, and asked the front desk three times during these interactions before they were able to provide me with it on the third day (but the tracking information and the hotel staff confirmed it was delivered on the first day).\n\nWorse, during the first interaction, the front desk staff convinced me that I had a $45\/day credit for hotel bar and restaurant. They neglected to mention there was also a $35 resort fee, so that i was only getting a $10 credit. The underhanded sales tactics continued at the restaurant, where we requested tap water and were given a $12 bottle of still water by the server. We were also charged $33 for an appetizer, despite it being listed for $19, and had to request an itemized receipt and correction. They server also failed to tell us that there is auto-gratuity of 22% both when seating us or when we paid. We were only provided with the itemized receipt upon request, where we discovered that. The quality of the cocktails and food was also poor, although at least that's subjective.\n\nSuffice it to say, I will not be staying at this hotel again. The concept seemed great, but the execution was terrible.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Excellent Hotel","lang":"en","publishedDate":"2024-02-21","publishedPlatform":"OTHER","rating":5,"text":"Wonderful hotel, beautiful rooms, excellent view of Time Square we are coming back one day for sure.\nMy husband fell ill during the night & the staff looked after us so well. I felt looked after during a very stressful few days.\nThe hotel is very safe as the Sky Lobby is on the 11th floor. My children loved this hotel as it's so close to all the action.\nThe hotel rooms are so new & clean & very comfortable. Very modern rooms.\nGreat staff, Yassin & all of his colleagues were fantastic. Simona on watch downstairs was great when I needed help getting a taxi.\nVery happy with my experience in this hotel.\nThank you to everyone at the Tempo by Hilton for a lovely stay in New York.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"The peppermint tea was ok and Ameen one of the workers is a really good person and good at his job.","lang":"en","publishedDate":"2024-02-19","publishedPlatform":"OTHER","rating":5,"text":"Ameen is a great guy and made us laugh and light the mood of my family and just made my day in general and he is really a good person.The food was good and made very well but the peppermint tea was not my favorite but it was ok.The place is nice and makes you feel welcome.The beds were very comfy.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amin is the best","lang":"en","publishedDate":"2024-02-19","publishedPlatform":"OTHER","rating":5,"text":"Had a great experience at the hotel. Amin was exceptional and made sure we had everything we needed and more. Definitely stop by the kitchen and say hello to him. He was incredibly attentive friendly and had a true desire to ensure our experience was top notch!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Love Tempo!","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"OTHER","rating":5,"text":"Hotel is beautiful, clean and in a great location. The staff is  extremely welcoming and helpful. The Highball bar has a nice daily happy hour with a relaxing vibe to it.  Bartenders, Karina and Jennifer, were attentive to everyone and super fun to chat with! \nI would definitely recommend staying at Tempo, and would stay here again.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great stay in Times Square","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"OTHER","rating":5,"text":"The stay was great. Everyone was helpful and courteous. Especially want to highlight Yasmin in security. They Made sure we were taken care of gave us tips on how to get around and where we should look to save money and avoid scams. Thanks Tempo","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing Hotel but Beware","lang":"en","publishedDate":"2024-02-17","publishedPlatform":"MOBILE","rating":4,"text":"Overall really enjoyable stay, rooms were very clean and modern as well as super comfortable beds. The hotel was very quiet for being in Times Square and compared to other hotels I have stayed in around the area previously. A majority of the staff were very friendly and helpful especially in particular one of the female receptionists but unfortunately I didn't catch her name. It is easy to access parts of the city from the hotel with a subway station very nearby as well as being walking distance from many attractions. One bit of feedback I would provide is that the automatic blinds in the room wouldn't shut properly unless you pulled them at the same time. BEWARE - once we had checked out the bellman arranged a yellow taxi for us which seemed a bit suspicious. Once we got into the taxi and out of the city the driver started driving at least 100mph in and out of lanes and swerving around cars, it felt very unsafe, scary and as if we won't even make it to the airport. We asked him to slow down, however he then started driving down bus lanes and the hard shoulder when we were stuck in traffic, again at a very fast speed and was clearly illegal and unsafe, however this is not the hotels fault but DO NOT accept the offer from the bellman to arrange you a taxi!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Nice addition, but do not deal with the front desk until after 3 pm.","lang":"en","publishedDate":"2024-02-16","publishedPlatform":"OTHER","rating":4,"text":"Do not check in early. Do not attempt to check in early Do not.  The A.M. front desk folks hate their jobs and anyone who attempts to check in. Wait until after 4 pm. Do yourself a favor. I'm in my 9.5 year as a Hilton Diamond member. I have been loyal to Hilton as I travel three weeks a month for work (and even own a timeshare in mid-town Manhattan) and yet to check in early at noon instead of 3 pm was a $150 dollar upcharge for guests or $75 for Diamond members. I said no. Normally, a hotel will welcome guests in if there's a room available - it's called hospitality and reduces the number of check-ins later. The morning front desk needs to learn this. It literally costs nothing to check someone in early yet garners good will. If there are no rooms available because they're still being cleaned cool. That was not the case here. So...don't do it. The afternoon desk agents could not have been nicer. They get what hospitality is about. They were kind, considerate, welcoming. \n\nThis is a rebuild of the old doubletree that sat at this spot for years. This a a beautiful redo. Rooms are on the small side, but not as small as the Motto brand which are half this size. Great amenities, comfortable beds. The bar was lovely and bartenders great. The bell staff at the front door were so nice. \n\nThe rooms are wonderful, but you get what you reserve, so choose wisely. Rain shower, a bluetooth speaker in the mirror in the bathroom with clock and nightlight sensor were my highlights. But, it's in Times Square so bright day and night. There are black out curtains on the main switch at the front door of your room which can also control all the lights. \n\nWill stay again. But will check in after 4 pm every single time.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Found items","lang":"en","publishedDate":"2024-02-16","publishedPlatform":"OTHER","rating":5,"text":"Regina found my daughters gloves and earmuffs and saved them for us overnight. She brought them back to us in a timely fashion when we were needing them to leave. She was very kind when bringing them to us.\n I am filling the rest out to meet the 200 characters.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Falls short of what it could be…","lang":"en","publishedDate":"2024-02-15","publishedPlatform":"MOBILE","rating":4,"text":"So first of all the good things:\n- The bed is amazingly comfortable \n- the view from the room is incredible \n- the staff are all outstanding from the security guys downstairs to the reception team and housekeeping, as well as the team at breakfast.\n- the location in the heart of time square on 47th\/Broadway is amazing\n- the look of the room and bathroom is great\n\nBut….\n- our shower was sporadic in delivering hot water at peak times\n- as diamond visitor no upgrade, I’d paid to have a city view rooms and likely could’ve gone cheaper and ended up in same space\n- diamond benefit on food and beverages was told I had $38 plus $10 per day for partner and me and was told it would be taken off. Given price of breakfast items we went every other day, only to find out you only had money taken off for the specific days you visited. Might be case across USA but as first time diamond visitor to USA wasn’t quite as described.\n- the standard of breakfast vs every uk\/Europe Hilton was really low and very expensive.\n- food offering in restaurant was overpriced and underwhelming. Let the hotel down.\n- the drapes and blinds were already broken and out of their tracks in the room so didn’t fully work.\n\nAll in all could so nearly be a 5* but also in danger of being 3* and as the hotel ages further they need to keep an eye on things like the blinds and drapes and the water which just let a really really good hotel down.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"You have to stay here!","lang":"en","publishedDate":"2024-02-10","publishedPlatform":"OTHER","rating":5,"text":"This place was amazing!!! Best customer service I have experienced in a while when traveling. The guest rep names Yassin was the best! . I am from Florida where  southern hospitality is normalcy.. Tempo is centrally located in TSQ -any and everything is within waking distance. Highly recommended if you’re coming yo NYC.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"The perfect place to stay in NYC","lang":"en","publishedDate":"2024-02-10","publishedPlatform":"OTHER","rating":5,"text":"We had a great stay and the room was just wonderful! \nPerfect location: in the heart of Time Square, close to the subway and major tourist attractions, ...\nThe staff is attentive and always available, special thanks to Yassin from the security team! \nWe'll be back with pleasure!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Nice Hotel. Be Aware of Potential Charges.","lang":"en","publishedDate":"2024-02-05","publishedPlatform":"MOBILE","rating":4,"text":"Can’t beat the location! In the heart of Times Square. Rooms were clean, modern and well appointed. They are on the small side which is typical for New York City. Wifi was free and amazingly fast! Tons of usb outlets in the rooms although some of ours didn’t seem to work. \n\nWe arrived at 1pm hoping for an early checkin, but was told it would be a $75 charge. Checkin is at 3pm and I am a Hilton Gold member. That seemed steep. We declined and were advised by the front desk that we’d get a notification in the Hilton app when the room was ready. The notification never came and we had to deal with the front desk at 4pm to resolve.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo Times Square A+","lang":"en","publishedDate":"2024-02-03","publishedPlatform":"OTHER","rating":5,"text":"The hotel has a great vibe! Clean, modern, comfy beds and love the room darkening electronic shades. The rooms start above the 12th floor. We were on the 33rd - nice and quiet being high above Times Square. The bar is exceptional and JUSTIN makes the BEST Espresso Martini!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great Addition to Times Square.","lang":"en","publishedDate":"2024-01-27","publishedPlatform":"MOBILE","rating":5,"text":"The hotel was beautiful and modern.  Staff was exceptionally friendly and attentive.  We really enjoyed the fun features like the automatic shades and digital bathroom mirror.  The two stage elevator system created a strong sense of security.  My new go to hotel in NYC.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"New York holidays experience","lang":"en","publishedDate":"2024-01-26","publishedPlatform":"OTHER","rating":5,"text":"Excellent throughout,the stay at the Tempo Hilton was especially good with the rooms very clean and comfortable.the reception staff were exceptional. Kessi one of the reception staff members went out of her way every time to help and assist us.Overall a great vacation we found New York very very interesting with tonnes to see and do.The only downside was our entry into the USA at immigration where we were waiting to be processed for 3 hours ,which I my experience was the longest I've ever had to wait,which also kept our transfer taxi (Elite ) waiting the entire time.\nSteve Tainton,Bristol UK.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364031,"title":"Uma ótima experiência em NYC","lang":"pt","publishedDate":"2024-01-24","publishedPlatform":"MOBILE","rating":5,"text":"Foram dias incríveis neste hotel que fica no coração de Manhattan. Tu faz tudo a pé. O quarto é muito confortável e tudo muito novinho. Os atendentes são muito simpáticos. Me apaixonei pelo espelho do banheiro. Recomendo e ficaria de novo neste hotel.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364031,"title":"Location location location","lang":"en","publishedDate":"2024-01-20","publishedPlatform":"OTHER","rating":4,"text":"Great hotel. Location could not be any better for a tourist. V comfortable. V busy hotel.\nReception on 11th floor, above a billboard on Times Square.\nDoormen great an excellent service chatting and making suggestions when we asked questions. \nRooms comfortable, bathroom perfect. \n\nHad a drink in bar. Service really poor. The 2 staff seem to want to serve everyone but us! We waited 15 mins to be served sitting at the bar. \n\nService charge on everything even if you ordered your own coffee and then went to collect it. You pay a service charge for them making it! \n\n Bottle of water was $12. \n\nRoom great and location better but would not do anything in hotel, it feels like a rip off to a British person. \nSaying that I would recommend the hotel just use as bed and do everything else outside and it’s easy because of location.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Outstanding hotel on Time Square.","lang":"en","publishedDate":"2024-01-20","publishedPlatform":"OTHER","rating":4,"text":"We stayed here over the weekend for New Year Eve December 29 2023 to January 1 2024.\nI give them a grade of 93 out of 100 ; which is good. I will return to this hotel when I visit Time Square again.\n\nThe Good: I really notice how friendly and gracious all the employees were. The door , elevator, and general front end staff was especially welcoming every time you walk in or out of the  hotel.\nThe hotel is right on Time Square in the middle of everything. The rooms are super clean , modern ,small but feel larger do to the floor to ceiling windows . Maid service was outstanding. We sleep in till 1PM every every day and they would clean our room around our schedule with a simple phone call to front desk.Fastest elevators I ever been on for a hotel. No need to go to front desk for check in when using the Hilton app on phone.-Just go straight to your room.\n\nVery minor annoyance: These were very small issues: The Hilton app on phone stop working to unlock room door. Used the card hotel provided to unlock door. Sometimes the card did not work ;you had to swipe it a few times for it to work. Room is lacking storage space for clothes if staying for a few days. \nAll in all a great place to stay in New York.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Very shinny at first, but a let down in too many respects","lang":"en","publishedDate":"2024-01-20","publishedPlatform":"OTHER","rating":2,"text":"11 -17 Jan 2024.  This hotel is located in the middle of Times Square and in easy reach of many subway stations.  On arrival we were asked if we would like to upgrade at 40 USD per night as we had booked a room that was on a lower level and maybe noise.  I took the opinion to upgrade and was given a room on the 44th floor.  The rooms are decorated to a good standard and modern in design.  The view was excellent although this was night time.  Curtains and lighting are controlled by switches on either side of the bed sadly the controls on one side were not working at all, reported to reception who invited us to move rooms as we had yet to unpack it wasn’t much of an ordeal but did delay us from going out to dinner by an hour.  Our second room was 3902 located on the 39th floor, I was told this was a double upgrade but no further charge would be made ( this room would apparently cost 90 USD per day to upgrade) \nThis had a double aspect view looking downtown, you could still hear street noise which was constant.  On the second evening i could dripping water behind one of the curtains, water was dripping down from what appeared to be a structural crack in the window frame, it had not been raining during out time in NY.  I reported this to the male receptionist who seemed uninterested and said we couple move again, we were about to leave for our broadway show and asked for the water to be clean up and investigated.  I also pointed out that this was not a new problem as when i was looking for the source of the water i noted several water stains on the fabric of the curtainn and valance.  When i remarked on this to the receptionist he said we are a new hotel and have teething problems, I reply its a bit crap as this was our second room and the problems would be obvious to house keeping staff, the receptionist asked me to stop using the profound language (Crap) I think some conflict resolution training is needed.\nWe came vback and the water had been mopped but nothing else.  During the early hours of the next morning I was woken by dripping water again!!  At this point I gave up and concentrated on my vacation as it was obvious the staff at this hotel lacked customer satisfaction.\nThat said the hotel did have its good points the bed was comfortable and the towels and linens are good quality.  The coffee machine is a waste of time it’s a small espresso type with tiny paper cups provided.  We used the bar once which was ok but again I think the staff could be more attentive \nThe guy looking after the luggage was really friendly and polite\nWould I recommend this place then sadly NO, it does has a lot going for it but too many negatives for me.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Thank you YASSIN!","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"OTHER","rating":5,"text":"This hotel had wonderful people working everyday.  Friendly, helpful etc….One stands out, YASSIN.    He made us feel so welcome and always had a smile!     Amazing!!!!!!    I will definitely stay at this hotel again!!!!!    Difficult in NYC Times Square to find a place to stay.   Try this hotel!","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Exceptional service","lang":"en","publishedDate":"2024-01-15","publishedPlatform":"OTHER","rating":5,"text":"We had read the reviews and were a little concerned regarding customer service issues. We had EXCEPTIONAL service throughout our entire stay. The gentleman at the elevators, the front desk staff, housekeeping, and the bar staff- shout out to Justin and Jenn- were all extremely helpful, quick with a smile, and just kind.  \n\nThe rooms are a bit small but they make the most of the limited space and they were very clean. \n\nThe bar is a bit expensive but that was to be expected.  The drinks were well made and the wings and breakfast foods were delicious. \n\nNo complaints at all.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Nice hotel","lang":"en","publishedDate":"2024-01-14","publishedPlatform":"MOBILE","rating":5,"text":"I stayed here for one night.  The front desk staff were absolutely great. I was upgraded to a room with a great view of Times Square which was awesome. The rooms are small but very modern and new feeling. The hotel is in a good spot for walking in the city. Really enjoyable.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Very Clean and Nice staff","lang":"en","publishedDate":"2024-01-13","publishedPlatform":"OTHER","rating":5,"text":"Shenille was very pleasant at the cafe!!!! She definitely has a heart  of gold!!!!!! Please check her out if you ever visit!!!!!!!!!!!! Dino the Valet Guy was out of this world, made my transition smooth and stress Free!!!! Those 2 people were The BEST","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Sad hotel to ever think of staying","lang":"en","publishedDate":"2024-01-12","publishedPlatform":"MOBILE","rating":1,"text":"The hotel is best located but really rooms are small and really unrealistically priced \n\nService I suppose you forget when u chk in\n\nThe staff in restaurant is nice met Henry a waiter too sweet and good to be working in this sad Hiltons misadventure","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Comfortable and Classy - Great Energy","lang":"en","publishedDate":"2024-01-11","publishedPlatform":"OTHER","rating":5,"text":"Great hotel, fantastic stay. Hotel rooms were clean, lounge area was great and quiet. But the best, was my experience with the Bluestone Lane cafe, privately owned within this hotel. The exceptional level of hospitality here was above and beyond. I ordered an Americano, but it wasnt originally made the way Im accustomed too in Bluestone Lane. I went to the counter to get a new Americano if possible the way I wanted it, and Henry went way above and beyond to accomdate me. The entire staff was warm,bubbly and friendly, even my business partner was exceptionally pleased. \nHenry was a joy of fresh air, and remade me a great americano. Very professional and uplifting comments from this individual. This man deserves a raise! Harun, Bibi, Kaizia, Sagan and the team lead Chelsea, all deserve to be recognized for their exceptional and excellent customer service. More often than not people will leave bad reviews for bad customer service and forget to mention the exceptional ones.\nI will definitely be returning here!","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Room\/Front desk","lang":"en","publishedDate":"2024-01-11","publishedPlatform":"OTHER","rating":5,"text":"This Hotel was absolutely amazing the room was luxurious, neat and beautiful my partner and I loved the amenities the room came with.  Kessi at the front desk was an absolute pleasure she was generous and very helpful! I would definitely recommend 10\/10","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Friendly staff goes a long way!","lang":"en","publishedDate":"2024-01-07","publishedPlatform":"MOBILE","rating":5,"text":"Fast and friendly checkin. Was offered an upgraded room, room 2302, which is the best hotel room in the building. This room is a full Times Square view and very clean.  An amazing view and room. The whole staff was friendly from the doormen to everyone else.  If there was something I could change it would be the additional charge of $34\/day, which I have personally titled “activity fee”. At least $10\/day of that can go towards a purchase in the restaurant within the hotel.  But you have to make sure the $10 gets deducted from your bill. This is one thing I would say to be watchful of.  I travel a lot and I use Hilton quite a bit, plus I’ve provided feedback on TripAdvisor as much as possible over the last 20+ years. And besides the additional fee I would put this hotel within the top 10 of my best hotel travel experiences.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Hôtel pas propre","lang":"fr","publishedDate":"2024-01-06","publishedPlatform":"MOBILE","rating":1,"text":"La chambre n’a pas été faite le 3 janvier, j’ai demandé 2 fois à la réception pour qu’on vienne la faire, on m’a dit qu’elle serait faite dans l’heure, personne n’est venue, on m’a proposé 2 serviettes pour attendre … on est sur qu’elle niveau de médiocrité de service ?","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Disaster front desk representative","lang":"en","publishedDate":"2024-01-05","publishedPlatform":"MOBILE","rating":1,"text":"I give one star to the Tempo Hilton Hotel. I tried to open my room at around 6:50 on 01\/05\/24 in the morning with the digital key, but it was not working for the gym. When I tried to get my physical card from the room, it also didn’t work and prompted me to call.\n\nI called five times with no answer, so I went down to reception. There, I encountered the rudest receptionist I’ve ever met. He said that security had to go up with me to check my ID, even though my digital key and ID were not accepted as proof.\n\nWhile I understand and appreciate good safety measures, I complained about the digital key not working and the inconvenience caused. Instead of acknowledging my frustration, the receptionist told me not to raise my voice and accused me of being disrespectful. He claimed that I had been discussing for 10 minutes, which was not the case; I was not even at the reception for 10 minutes.\n\nThe receptionist then called his manager. The manager was very nice, wanting to understand the situation. However, the receptionist interrupted me while I was explaining to the manager. I had to remind him that he called his manager because he did not want to speak to me, and the discussion was now between me and the manager, not between me and him.\n\nThe manager acknowledged the issue and apologized, assuring me they would work on it, something the receptionist failed to do. Throughout, the receptionist kept insisting he was right, blaming me for the errors. He desperately needs basic communication training or perhaps a different role not in customer service of a $200-plus per night hotel.\n\nHis attitude has unfortunately cast a shadow over my entire stay at the hotel. I will choose a different hotel next time, as New York has plenty of options. I no longer feel comfortable at this hotel.\n\nIf you want good service, I would recommend different options, not this hotel.\n\nI suggest the manager review the CCTV, as I never raised my voice, discussed for 10 minutes, or did any of the other unfriendly things he accused me of.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"The worsest experience in our life with hotels globally. The staff is absolutely incompetent.","lang":"en","publishedDate":"2024-01-04","publishedPlatform":"OTHER","rating":1,"text":"1) We booked and paid on 15th November (1.5 months in advance) the corner room with the New year Ball view. the price for this view for 1 night is more than 2000 USD. We travel with my family (my wife and 3 children). 2) when we arrived on 31\/12\/2023 the staff gave us keys with no any comments about any problems. 3) In the room we realized that this is not a room we paid (no view to Time square and the Ball). 4) We returned to the desk and the receptionist told us that there are no available rooms with the Ball view . Overbooking... one more time - I paid 2000+ USD for the room 1.5 months ago. I asked : why I didn't say anything during check it? no answers. But after I clearly understand why... We (including 3 children) had only 3.5 hours before the New Year and they thought that we would not cancel the booking and still stay in the hotel. Pure CHEATING . The staff and both managers are unprofessional. They know nothing about problem solving and should be trained or fired out. i.e. They agreed the decrease the price for 1 night to the normal level (the Ball view is 3-4 ties more expensive) after FOUR hours of negotiations. Their behavior was as of carpet dealers on the Eastern market... Spanish shame. As result: 1) Mariott completely spoiled our New year celebration. we had been the loyal customers. 2) we wasted 4.5 hours of our life during the New year celebration in discussions with the staff. 3) My family made a decision to leave the hotel on 1st January due the staff behavior. 4) on 1st January I missed the excursion and lost 60 USD as I was in discussions with the manager about the decreasing of prices for rooms. So, almost 5 hours I didn't accompany my family during holidays. 5) On 1st January we checked out from Tempo and I had to move all luggage to another hotel. My family was on the excursion , so, I had to make 4 trips with bags and suit-cases. Nice experience.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Jose is the best amenity at this hotel. ","lang":"en","publishedDate":"2024-01-04","publishedPlatform":"OTHER","rating":2,"text":"Check in was 3 pm. We arrived at the hotel at 3:10pm. We went to check in at the front desk where they checked me in, paid for the room plus a few fees I didn’t know I would be paying all for them to tell me the room isn’t ready and they’ll let me know when it’s ready (should be 10-15 minutes). 3:45 rolls around and the lobby is packed full of people waiting around for their rooms to be ready. Some were waiting for over an hour for their rooms to be ready. The front desk personnel were rude to anyone who asked for an update on when the room would be ready. The reason that bothers me is if I’m an hour late to check out, I get charged another night but the hotel can withhold your room from you for over an hour and you still pay full price. My wife was feeling poorly as she is diabetic and her blood sugar needed to be checked so we asked Jose if he knew when our room would be ready. Jose was the most helpful person at the hotel. He called the manager over and explained our situation and the room was ready much quicker. The only reason I’ve given the hotel any stars at all is because of Jose. When we got into our room we discovered that we were paying $400 a night for a room the size of a shoe box that was not properly cleaned. (Cleaning was supposedly the reason we weren’t able to check in on time) there was hair in the shower, the room hasn’t been dusted, there was stuff on the sheets. Would I stay here again? Absolutely not. Moral of the story: Jose: 5 stars. Tempo by Hilton: -4 stars. ","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Grateful","lang":"en","publishedDate":"2024-01-04","publishedPlatform":"OTHER","rating":5,"text":"Excellent hotel, beautiful facilities, very comfortable, and very centrally located. We loved it! We were on vacation with my family and had a mishap when we checked out, leaving our passports forgotten in the room safe. We only realized the next day and contacted the hotel. Luckily, we encountered Tee (security team) , who helped us recover them. Many thanks to Tee for her kind assistance. This speaks highly of the hotel's commitment to taking care of its guests' belongings.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":25364031,"title":"Scandaleux","lang":"fr","publishedDate":"2024-01-02","publishedPlatform":"MOBILE","rating":1,"text":"Un scandale j’ai pris 2 chambres pendant 6 nuits et successivement les chambres n’ont pas été faites.  \nCe jour a 17 h j’ai dis à la réception que ma chambre n’avait pas été faite et on m’a répondu que c’était fait dans l’heure.\nRetour à 21h30 et la chambre toujours pas faites et là on me dis on peux pas la faire on me porte 2 serviettes, 2 café et voilà.  \nPour un tel hôtel à ce niveau de prix un scandale.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"TEMPO is just the right tempo!","lang":"en","publishedDate":"2024-01-01","publishedPlatform":"MOBILE","rating":5,"text":"Had an absolute BLAST!  Hotel is located prime time in middle of Times Square!  Rooms are slightly small but accommodating, modern & with a huge bathroom! Staff was friendly & helpful while bar was convenient with a cool environment. We’ll be back!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Dishonest hotel won’t accept accountability ….stay away","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"OTHER","rating":1,"text":"2 days before we were due to fly to New York I  noticed a pending charge on my card for £528.74, puzzled,  thought  my option is to pay in full on arrival.    After our plane was delayed for 4 hours from Dublin we arrived at Tempo NY Hilton Times Square at 11pm on 23rd Dec shattered, stressed, tired and disappointed we missed out  on the daytime sight seeing because we should have arrived in the afternoon. \n\nThe hotel lobby has a beautiful entrance which gave us a big lift from our damped  spirits.  \n\nI enquired at the check in desk about the pending charge on my card - Tempo NY Hilton Times were holding £528.74  since 21st Dec which had limited my spending power I was told it will be refunded back to my account once  we checked out.  \nSo I Paid the room in full however I kept asking what were the charges the staff would not say and tried to take payment from my card which would not go through my bank blocked Tempo!!! \n\nAfter confirming authorised with my bank  payment went through smoothly.  \nNext morning found I was charge almost double for the room.  So I still have  a pending charge holding my £528.74  plus I was charged a room with 2 queen beds  for £451.92 (tax, service already included and already paid in full )  and a security deposit was taken for £161.89 which is still at pending stage all of this for 1 NiGHT stay!!!!!!!!!  \nWe are still in New York and my trip  ruined with this continuous enquiry, emails etc \na  week has passed, the pending charge for £528.74 is still ongoing inclining the security deposit I was told should be refunded 2-3 days after check out.  I complained to booking.com where I made the booking they raised it with Tempo NY who declined my complaint.  Furious I contacted Hilton Reservations and Customer Care Team.  \nTheyvacted swiftly, apologised profoundly about the confusion, frustrations etc and stated my booking was cancelled !!!! Hence I was charged late payment!!!  Strangely my booking invoice confirmed no cancellation.  Tempo took out another reservation and charged me again.  Also they states my 17 year old son made the booking in his name and  2 rooms were booked and late payment were charged to him ??!!!!!! \nI’ve never heard anything so ridiculous in my life. \nI thought 17 year stays free hence 2 queen beds were book for 1 room. \nSo the theft Tempo NY Hilton still holding  my £528.74  and trying to bush everything under with this so called cancellation, son booking, making a long list of excuses with their ‘investigation’ , stay AWAY FROM THIS HOTEL they employed  dishonest devious staff who would do anything to mislead  and manipulate your booking and bill charge","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great Hotel, Better Customer Service. Ask for Deano","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"OTHER","rating":5,"text":"Great hotel. Comfy beds. Great bar. Was disappointed to find they did not have on site parking, but I went to find the valet service was above and beyond. Find Deano. I don’t know if he’s the manager for the valet service, but he should be manager of the whole hotel. He grabbed our luggage from the truck, put it on a cart, and walked us up to the lobby with it. He reassured us the truck would be safe, and told us where it would be parked. Later we saw him as we were walking out to find a place to eat, and he gave us so many recommendations for restaurants of great local food joints that we couldn’t possibly go to them all. And when it was time to leave, he made sure the truck was retrieved and created us by name when we got there. Great customer service, and just an all around great guy. In summary, great beds, great views, great location, great valet service, and great customer service. They even gave us a later checkout because of the delays checking out due to how busy the city was. Will stay there again","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Theater trip to New York","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"OTHER","rating":4,"text":"I stayed at the Tempo by Hilton for five nights in October, during their soft opening, right before their actual opening. There was some construction outside still taking place the week before opening that made the entrance a little bit challenging to find. Fortunately, they had staff positioned at every potential point where a guest may have had a question.\n\nI arrived a little earlier, prior to check in time and they were able to get me into a room. I was glad that I could leave my bags in my room and start my New York adventure.\n\nThe room is a little compact but it was fine because it was just me in the room. There is no closet, but rather a rack with hangers where you can hang stuff up, above where you can set your luggage on a ledge.\n\nI loved the Bluetooth mirror in the bathroom, which was easy to pair with my phone. I also love Apotheke products, which was the brand of the bathroom soaps and shampoos.\n\nWhen you enter the hotel from the street, you take an elevator up to the lobby. To get to your room, you transfer to another set of elevators. The elevator system is very efficient because it's the type where you enter the floor you need and it tells you which elevator to get into and it goes directly to that floor (and any other floors of the people who are in the elevator with you). The lobby could be a bit more organized, though. I didn't like how when I was waiting to speak to someone at one of the desk pods, people would cut in front of me. It happened more than once.\n\nThe restaurant in the lobby was convenient to pick up morning coffee and pastries. My friends and I brought pizza back one evening and they wouldn't let us sit in the cafe area. We made it clear that we wanted to order drinks but they wouldn't let us in, so we sat in the lobby instead, taking up what little seating there is in the lobby. The cafe closed shortly after we sat down so we felt it was silly that we couldn't sit there and also order drinks.\n\nOn Saturday night we wanted to get drinks at the bar but they wouldn't let us in because they were closing for construction. It was 10pm. This feels like a missed opportunity because 10pm on Saturday night is prime drinking time and they were closing for the night. Hopefully they finished all of the construction in time for opening.","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Overpriced for value","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"MOBILE","rating":3,"text":"Rooms very small for high prices.  Clean but the hotel is not prepared for the volume of guests.  Waited over 1.5 hours to get into a room after mobile check in and checking in at the desk in late afternoon.    Very Limited Amenities.  (I have spent probably 200 hotel stays in NYC as a point of reference).","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing staff and stay","lang":"en","publishedDate":"2023-12-28","publishedPlatform":"OTHER","rating":5,"text":"Great location right on Times Square. Quite even though you are in the center of everything. The staff was so helpful and friendly every time we saw them. The rooms were great and comfortable. Can’t wait to stay here for our next trip. ","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"New, safe and clean!","lang":"en","publishedDate":"2023-12-26","publishedPlatform":"MOBILE","rating":5,"text":"Highly rated for good reason. It's safe (hotel entrance is on the 11th floor and the elevator to it is manned 24\/7.  Then, the guest elevators are separate). It's new, clean, and has a large lounge area attached to the lobby and bar\/restaurant. Our room was delayed being cleaned and ready (it was the week before Christmas so it was very busy) but we stored our luggage and went about our day. Our room was on 22nd floor with Times Square views, and it was QUIET. Amazing hotel we will keep on our list for sure. If you want something in the middle of the Times Square action, close to subway, shopping, Rock center, Broadway, affordable, safe, new and clean, stay here.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"What a gem!","lang":"en","publishedDate":"2023-12-24","publishedPlatform":"OTHER","rating":5,"text":"We loved this hotel that's right in Times Square. The staff were helpful, the bar area was wonderful, and the room was really nice (though typical-NY size). We were there for the Macy's Thanksgiving Day parade and were just one easy block from our spot on the parade route. What a gem!","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great stay! Highly recommended!","lang":"en","publishedDate":"2023-12-23","publishedPlatform":"OTHER","rating":5,"text":"I had an amazing experience at the Tempo. The food is great, hotel is gorgeous, and the staff are super friendly! I highly recommend if you travel to NYC to stay here. I look forward to a future stay.","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great place","lang":"en","publishedDate":"2023-12-21","publishedPlatform":"OTHER","rating":5,"text":"The Cafe in the morning was great. Amin really did a great job making the items that we had ordered. He was very caring. The rooms were awesome. They had modern technology in the rooms that I have never seen at any other hotel","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great location","lang":"en","publishedDate":"2023-12-21","publishedPlatform":"MOBILE","rating":5,"text":"I have just travelled back from spending a mini break here with my son and what a great hotel, clean,great location and comfy beds.\nWe had the most amazing room overlooking Times Square and the rooms are so modern would stay here again.\nThe only downside to my stay was on arrival at the airport to depart, when checking out of the room and asking to leave my bags in reception as we had a late flight the gentlemen offered a private vehicle SUV to take us to JFK, I asked how much and was quoted $120 all in, on arrival to the airport just outside the driver asked for payment and told me it was $160 plus tax and that I had been quoted wrong.\nThe holiday was expensive as it is so to have this extra on top was something I could of done without and I would of rather of got a taxi as that was only $85 from the airport when we landed.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Nice hotel and good location","lang":"en","publishedDate":"2023-12-20","publishedPlatform":"OTHER","rating":4,"text":"Very nice, modern hotel, located right in the heart of Times Square, on 47th and Broadway. Location is perfect, close to major attractions that are all within walking distance.  Our room was on the 36th floor and the elevators are really fast. We never had to wait for one. Our room was small but modern and was cleaned well daily. The bathroom amenities like the LED mirror with bluetooth and the rain shower fixture are superb. For the price we paid to stay at this hotel, it would have been nice to have at least some water bottles available in the room.  The hallways always smelled so nice and the hotel in general is kept very clean. Although this hotel was really good, we cannot give it five stars because of the following reasons:  1) The wifi is not premium high speed at all, so if you are staying at this hotel on business, you won't get anything done! 2) The restaurant in the hotel is expensive and has very limited options 3) The Urban Destination Charge that the hotel charges is ridiculous. It's already costly to stay at this hotel and this extra charge is just a cash grab, especially when the charge includes premium high speed wifi which is not premium at all!  All in all this is a very nice, clean hotel, but if we ever go back to NYC, we will more than likely try a different hotel. ","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best hotel experience ever!","lang":"en","publishedDate":"2023-12-20","publishedPlatform":"MOBILE","rating":5,"text":"First time visit to NYC.  Traveled with my adult daughter and daughter in law. This is absolutely the best travel\/hotel experience we’ve ever had!  Service was unbelievable. Accommodations were perfect. Clean, comfortable, great view.  Impressed with the room and bath. Staff were friendly and so helpful, and understanding to our every need.  Especially Bernard!  He gave us pointers, directions, and made sure we had transportation to places too far to walk.  I am 72 and use a walker.  He wad so gracious and caring in looking out for me.  In fact all staffers went above and beyond their responsibilities to  assure we had the best stay possible.  Truly a most amazing group.  I can’t thank them enough.  Only wish more places I visit could offer accommodations as wonderful as Tempo.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Friendly coffee service from Amin","lang":"en","publishedDate":"2023-12-20","publishedPlatform":"OTHER","rating":5,"text":"Amin at the coffee shop was so kind!  We desperately needed coffee after our travels and even though he was about to close up he made us our drinks with a wonderful smile.  So gracious and we so appreciated him!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Not as expected","lang":"en","publishedDate":"2023-12-19","publishedPlatform":"MOBILE","rating":2,"text":"I upgrade to a suite room totaling almost $5,000 for 3 nights. Beautiful but they lack the service on par with the price.\n\nNo water in the room and the only place you could buy water was in the lobby and it was out of order.\n\nStay somewhere else if you’re looking for value for your hard earned money. Not worth it.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":25364031,"title":"Avoid this place. ","lang":"en","publishedDate":"2023-12-19","publishedPlatform":"OTHER","rating":1,"text":"I am currently at this hotel and while it's rare for me to do review before leaving the location,  I think it's only fair to warn off as many people as possible from making the same mistakes as I have. \n\nWe arrived to Tempo on Saturday 16th December around 3:30pm.  We were told our rooms are not ready yet and to take a seat in the restaurant.  We waited around 45 minutes whilst the rooms were cleaned,  checked and made available..... which is not the end of the world.  But after travelling all the way from London we were ready for a rest. \n\nAnd this is where the problems began.  The hotel WiFi was not working (and still not when I write this)  The hotel staff didn't seem bothered by this and couldn't understand why I was making a fuss or refusing to pay for the internet charge.  Considering it's a city centre hotel WiFi is important to business customers and families alike,  but no one cared.  Then theres the rooms itself.  Ignoring the fact that I'm paying almost $18,000  for our stay,  there's no water in the rooms,  no facility to make tea and only paper cups.  Our room was not cleaned for 3 days,  until my wife called reception to ask why, and they struggle to answer the phone at reception at the best of times. The rooms are compact,  theres almost no. storage space other than a clothes rail and coat hooks on the wall. It's not ideal when you're staying for 12 days with 5 or 6 cases in an expensive but small room. I get they are trying to be \"eco friendly\" and reduce plastic waste,  but there's no reason why water cannot be provided in recycled plastic or even glass bottles. \n\nAnd then there's the restaurant!!  It would be an insult the give this any sort of star rating.  The food is expensive,  the choices are very limited and having to eat breakfast out of a cardboard box with a plastic fork is not an experience I enjoy or recommend.  The one saving grace is Chef Kitt who has gone out of his way to help us with my sons food as he has some severe allergies.  Other than that,  I recommend you go out somewhere else for all meals. \n\nOh... band don't get me started on the in hotel shop.  Once you see that  1ltr bottle of water costs $12 you won't be going back there for anything else. \n\nSo I advice you look for somewhere better and cheaper to stay. If I could afford to move to another hotel at this late stage I would have gone already. ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Magical Christmas weekend in NYC ","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"OTHER","rating":5,"text":"The hotel was fantastic. David, with the Bell Team, was phenomenal. He let us know exactly when we needed to head out for our flight. He had a car waiting for us and quoted us a fair fare, less than Uber. Thank you David for everything. ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Coming Back!!","lang":"en","publishedDate":"2023-12-17","publishedPlatform":"MOBILE","rating":5,"text":"Loved this brand newish hotel right at Times Square. The room had many nice details like automatic opening window shades, beautiful bathroom tile, fixtures and a cool led lit mirror with a Bluetooth enabled speaker. The seven elevators were more than adequate and very fast. Practically no waiting time at all, even at busy times during the day and night. The front desk staff was very capable and helpful. We stayed on the 33rd floor and Times Square noise distractions were negligible. Had a great night sleep.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Absolute waste of space","lang":"en","publishedDate":"2023-12-17","publishedPlatform":"OTHER","rating":1,"text":"Absolute abismal non existent response to telephone. - front desk\nTried 7 times over three days ……after 11 mins on first and over 5 minutes on subsequent attempts have to havg up\nIt doesn’t matter which menu choice you make they all appar3ntly go to front desk but nobody picks up\nNo email address available to use either\nHave had to try and communicate the Expedia\nYou would get better service from ymca…..,,,,,,!!!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Superb Service","lang":"en","publishedDate":"2023-12-16","publishedPlatform":"OTHER","rating":5,"text":"Outstanding staff! Every Tempo employee from front door to front desk and back was friendly, polite, and professional. Big shoutout to Deano, Miguel, and Hank. \nGreat mid-city location. Very clean. Fun entertainment in lounge. ","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"great bar service with live music","lang":"en","publishedDate":"2023-12-15","publishedPlatform":"MOBILE","rating":5,"text":"i was pleasantly surprised with the hotels bar. i went to the tempo hotel to go meet up with some friends that were staying there, while i was waiting for them i went to the bar and had an amazing experience, Karina and Al took really good care of me. Karina gave me recommendations for drinks and food which were on point and Al always made sure i was doing good and if i was in need of anything at any point. they also had a live band which i truly enjoyed as well. if your ever in the tempo hotel i recommend checking out the bar","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Our December NYC experience ","lang":"en","publishedDate":"2023-12-15","publishedPlatform":"OTHER","rating":5,"text":"This hotel is beautiful but what makes the experience is the exceptional service the staff provides. The door man was super sweet giving us tips on how to find Macy’s I think he was Italian. We had the best cleaning lady Norma M. Super sweet always checking in on us making sure we had everything we needed. She was simply a ray of sunshine ☀️! She made our experience exceptional! The only feedback I have for the hotel is provide your guests with access to water in every room. The other thing is definitely not enough staff at the check in counter and outrageous prices at cafe. ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Satisfaction Guaranteed ","lang":"en","publishedDate":"2023-12-15","publishedPlatform":"OTHER","rating":5,"text":"Even better  than the absolutely perfect location and the beautiful hotel was the incredible hotel staff. The friendliness, kindness, helpfulness and professionalism were phenomenal. Special thanks to Regina (security member) - you were wonderful to us and simply a joy. Thank you! ","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Exceptional & Friendly Staff - Great Stay!","lang":"en","publishedDate":"2023-12-15","publishedPlatform":"MOBILE","rating":5,"text":"Super Friendly Staff! Tammy exceeded my expectations at check-in -Especially during the holiday season. We stayed 5 nights & rooms were super clean & housekeeping took care of room each day- excellent bedding - 40th floor with city view -loved the electric shades!  Yassin was so helpful & welcoming in the lobby & elevator area - highly recommend!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Yassin for the Win ","lang":"en","publishedDate":"2023-12-13","publishedPlatform":"OTHER","rating":5,"text":"Best stay ever - hotel is hip, classy and ultra comfy.  Love that staff - especially Yassin.  A kind gentleman helping staff in the lobby get up to their rooms with ease.  Great charisma and charm - hotel was an amazing stay! ","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo is the best!! Every staff member is so happy to see you all the time","lang":"en","publishedDate":"2023-12-13","publishedPlatform":"OTHER","rating":5,"text":"Stayed here with my husband and niece and was impressed with every aspect. The location is impeccable with amazing views and even better customer service! Bo at the front desk went above and beyond in all aspects helping get us in the best room possible - even personally showing us the rooms view before deciding. All of security was so personable and would help with everything from getting the elevator or even a ride back to the airport in a crunch when you ride cancelled! Perfect first visit to NY all made possible by Tempo by Hilton. Would highly recommend!!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Calling Hotel no answer","lang":"en","publishedDate":"2023-12-13","publishedPlatform":"OTHER","rating":1,"text":"Both my wife and I seperately called hotel for over 8 hours off and on today, with no answer. Around 2:00 my wife finally got someone to pick up where he said they were overwhelmed and put her on hold which eventually she was hung up on.  We even called the  Hilton 800 number and the customer service representative could not get through or get anyone to pick up either.  Finally we called the sales department.  The first time the lady was not helpful and just transfered us to a voicemail.  Left a message, no call back.  Finally called back to sales department again and got a different lady and she was very helpful.  Unfortunately we were trying to come in a day early and due to the delay in being able to speak to someone at the property we lost our chance to change our flights without any charge.  I guess they miss out on an extra night from us. My wife and I are Gold members and we expected better service than this.  We used to work in the industry and know there is challenges, but this is beyond acceptable.  There is another review below that pretty much says the exact same thing with this hotel.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":25364031,"title":"Excellent Hotel","lang":"en","publishedDate":"2023-12-13","publishedPlatform":"MOBILE","rating":5,"text":"Excellent service at the restaurant specially from Henry he’s amazing and excellent customer service. The hotel it’s perfect very close to everything all attractions and very clean. We loved this place. We recommend this hotel 100 % ✅✅✅✅","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Cozy Rooms with a View","lang":"en","publishedDate":"2023-12-12","publishedPlatform":"MOBILE","rating":4,"text":"My husband and I stayed at Tempo for our anniversary. We stayed for 4-nights. \n\nLocation: The area around Tempo was very busy, but expected considering it is in the heart of Times Square at the corner of 47th and Broadway. You are within a 5-10 minute walk from various restaurants, the Rockefeller center, Minskoff theatre, and Radio City. \n\nCheck-In: We decided to do early check-in for an additional $75. There is a daily fee charged of $35 that will be added to your bill when you check out. We did have issues with our room key on arrival and had to come back for a new key later in the day when the key machine was working. \n\nStaff & Food: The staff were all friendly. There is a restaurant and bar located on the 11th floor where the lobby is as well. They have live music on Thursday, Friday, and Saturday nights, which we did enjoy. \n\nThe Room: Small but cozy with a beautiful view of the city from the 40th floor. Our drapes were likely off track or had some kind of issue as they did not always open and close appropriately. Each room has a fridge and safe, no microwave. Rooms were cleaned daily and well kept.\n\nCheck-Out: Check-out is at noon, you can do a late check-out but will get charged for half a day. They have a chauffeur service available for transport to the airport\/next location if needed and they always have car service on standby.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Beautiful Hotel with amazing staff.","lang":"en","publishedDate":"2023-12-10","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is beautiful and the staff are amazing, so friendly and helpful.\nSecurity go above and beyond to make sure you feel welcome, safe and secure.\nRegina was exceptionally helpful and nice to me during my stay mid September, as was Deano. Thank you 🤩 \nI can honestly say I did not want to leave.\nSo much so that I am returning back to the hotel this coming week with family for a 5 night stay.","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Perfect Stay ","lang":"en","publishedDate":"2023-12-10","publishedPlatform":"OTHER","rating":5,"text":"Beautiful Hotel centrally located in Time Square. Beautiful Room, spacious with  stellar views of the city.  I took the liberty of checking out the hotel bar. Pleasantly surprised they had live music and a band playing. The drink’s were amazing! The Bartender Karina was so sweet, made excellent drinks and the service was perfect. I definitely look forward to going back.\n\nThank you Tempo ","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"10 de 10","lang":"es","publishedDate":"2023-12-09","publishedPlatform":"MOBILE","rating":5,"text":"Todo espectacular, alimentos, servicio, limpieza! 10 de 10 me encantó el gym, el Rest. Una increíble experiencia!!!!!! \n\nLa pasamos muy bonito esta muy céntrico, literal enfrente de Time Square, restaurantes, spots de fotos. Si quieres algo top este es el lugar.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great support from hotel staff","lang":"en","publishedDate":"2023-12-08","publishedPlatform":"MOBILE","rating":5,"text":"The hotel was fantastic and the entire staff was friendly, helpful, and worked hard to make our stay enjoyable. We forgot an item in the room and the security office was quick in locating it and getting it shipped back to us. We would gladly stay at this hotel again.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best Hotel in NYC By Far!!","lang":"en","publishedDate":"2023-12-08","publishedPlatform":"OTHER","rating":5,"text":"This trip to NYC was for our 10 year anniversary.  A big shout out to all the staff - From the moment we made our reservations via the phone, to when we were greeted at the front door by a very kind greeter, to getting checked into the room by the welcome center ladies who all were so friendly and gave us an amazing room with the best view; to the our new friend Hosea taking our bags to our room and taking the time to answer our questions telling us all the great places to visit and resturants to go eat and e continued to make our stay so special everyday with his kindess; to our safe not working and then we got to meet Tee who also took very good care of us telling us all the great places and things to do in NYC, and gave us some umbrellas since it was going to rain a couple of days - over the top; to all the bartenders and servers, to the doorman John who sent us off so caringly, they all made our experience so totally awesome, we will be telling everyone we know that Tempo by Hilton is a five star rating for service and they need to meet Hosea, Tee and John for sure.  Michelle Shelby  ","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Beautiful experience🤍","lang":"en","publishedDate":"2023-12-08","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is super warmy, clean and chic. You can see time square in all his beauty.\nAll staff hotel is friendly and ready ti help you, specially Henry Alk from the bar. Good breakfast experience!! We also had dinner, which was delicious. In love with this New York vibe.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Found a Gem","lang":"en","publishedDate":"2023-12-07","publishedPlatform":"MOBILE","rating":5,"text":"Wonderful Times Square location. Entry to hotel on side road, rather than on Broadway, which I liked. Good security on multiple levels of the entry., and modern, well lit, open spaces.\nWell priced for the location.  Restaurants of all kinds and theaters are steps away.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Not a super great first impression.","lang":"en","publishedDate":"2023-12-07","publishedPlatform":"MOBILE","rating":1,"text":"Let me preface this by saying we have a reservation and trying to connect with a live person is impossible. Called several times and tried different extensions, no one seems to want to pick up. You would think at least the staff is trained to pick up a call and place you on a hold or request to call you back. Not a good first impression. Hesitant to stay here for first time. We stay at The Conrad Midtown where the staff and service is Superb! We shall follow up to this review because the true expectations are met with high remarks when there is a holiday season and you are treated with a wonderful welcome.","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"SISTAS Birthday week","lang":"en","publishedDate":"2023-12-06","publishedPlatform":"OTHER","rating":5,"text":"We couldn’t have loved it more! The room was perfect except the coffee, it was clean, beautiful and well done.\nThe blinds opening almost on walking in the door was perfect. \nThe service was wonderful, the Cafe staff were  extremely helpful. Henry Alv! Thank you. \nComplaint - NO ONE ANSWERS THE PHONE! Omg how ridiculous.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"A Gem in Times Square","lang":"en","publishedDate":"2023-12-06","publishedPlatform":"OTHER","rating":5,"text":"The Tempo, a Hilton property located in Times Square, is a find. Though the address is Broadway the entrance is on West 47th Street.  The hotel is new and our room overlooking Times Square was spotless, stylish and efficient with a wall of windows equipped with automatic shades, great for shutting out the light from the ads or just filtering them.  The bed was very comfortable, bathroom vanity mirror had great lighting and the shower was roomy. The upstairs lobby flows into a wide room with a  bar, food service and comfortable seating areas. The banks of elevators are convenient and fast. Our room was shockingly quiet, given the Broadway location and there is valet parking. We were welcomed by the hotel’s  friendly staff who greeted us with smiles and service, especially Bernard who took great care of us when we arrived and remembered us by name when we left. We look forward to another visit and a stay at Tempo.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great drinks great setting","lang":"en","publishedDate":"2023-12-05","publishedPlatform":"OTHER","rating":5,"text":"We had an amazing experience Alex and Jen treated us great.  We will be back👍 I would recommend this hotel for sure!  We have stayed in many hotels in New York this is one of the nicest so far lots of menu options food and drinks.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Recommended","lang":"en","publishedDate":"2023-12-03","publishedPlatform":"OTHER","rating":4,"text":"Great location, comfortable beds, excellent shower, coffee pods, superb staff.\nWould have been 5 star but 2 small red wines were almost 50 dollars and that was just too much.\nDino ( with an “eye” ) did an excellent job.\n","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo Hilton - A gem","lang":"en","publishedDate":"2023-12-03","publishedPlatform":"MOBILE","rating":5,"text":"I was extremely impressed from the moment I arrived and was greeted by Dino. He welcomed me and was kind throughout my entire stay. Helped me get a taxi on one of the busiest nights in NYC due to the Rockefeller tree lighting. He stood in the middle of Broadway to hail me a cab as I had to be at an event on time. The next day was raining and he went through storage closets to find me an umbrella. He treated each guest with the same special care. He’s a gem.","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best hotel in NYC","lang":"en","publishedDate":"2023-12-02","publishedPlatform":"OTHER","rating":5,"text":"Amazing service here, truly. The staff go above and beyond to make you feel special. Taj checked us in and was so incredibly nice and welcoming. Henry Alv. was also incredibly helpful and made our trip unforgettable. The room and hotel tech exceeded expectations by a mile. Shower is 10\/10. So clean and new. Do yourself a favor and book now.  Really do love it here! The two staff mentioned in this review are absolutely assets to your business and send the stay here from nice to an unbelievably fantastic experience.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Perfect location","lang":"en","publishedDate":"2023-11-30","publishedPlatform":"MOBILE","rating":5,"text":"Perfect location! Everything is in walking distance. \nThe staff is super friendly and very helpful. \nWe had some problems with the blinds but they fixed it immediately. It’s just the fabric that gets stuck in the motor. \nThe room was really nice. Very modern. Enough outlets to charge your devices. Wi-Fi was fast enough to do some calls on Teams as well.\nBig bathroom for a NYC hotel! It has all the amenities that you’ll need. \nWe would definitely come back.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Security support ","lang":"en","publishedDate":"2023-11-30","publishedPlatform":"OTHER","rating":5,"text":"Needed security support for some items left in the room. Tee from security was very helpful and professional and resolved my issues quickly with minimal fuss. The hotel was also great to stay with. Would highly recommend. ","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Contemporary, stylish hotel with all the mod cons","lang":"en","publishedDate":"2023-11-29","publishedPlatform":"OTHER","rating":5,"text":"Excellent location for those wanting to be in the centre of the attention at Times Square. The hotel is new, contemporary and is thoughtfully designed with large bathrooms and modern fixtures and fittings. The service is subdued but professional and friendly. The main detraction for the property is the food service in the morning - somewhat unimaginative, limited and unchanging - a problem for those of us who stay for more than a few days…service here appeared unpolished with further training and experience clearly needed. Overall a wonderful stay and my Hilton Diamond status saw valuable recognition. A great alternative for my stays in NYC where I would have ordinarily stayed at the W across the Square.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":25364031,"title":"Vinho em copo de água","lang":"pt","publishedDate":"2023-11-28","publishedPlatform":"MOBILE","rating":1,"text":"Tempo by Hilton apesar de fazer parte de uma luxuosa rede de hotéis, nao deixa taças nem copos de vidro nos quartos,não possui serviço de quarto e então seus hóspedes querem tomar um vinho no quarto e são obrigados a descer até o restaurante para pedir uma taça de vinho e um copo para água. As surpresas não acabam, ao chegar ao restaurante, o atendente diz que apenas copos como estes ele envia para o quarto, mesmo tendo inúmeras taças logo atrás dele, são ordens da gerência! Sério?","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best location with amazing views of Times Square","lang":"en","publishedDate":"2023-11-28","publishedPlatform":"MOBILE","rating":5,"text":"Van our bellman was amazing. The staff was very friendly and very helpful. A very nice hotel and the location was amazing. We will definitely be back. The dinner at the restraunt was amazing. The maids were amazing and I cannot say enough great things about this hotel.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Fantastic Times Square Hotel","lang":"en","publishedDate":"2023-11-27","publishedPlatform":"OTHER","rating":5,"text":"This is the best accommodation possible in Times Square. Modern, new, sleek and very quiet!!!! Currently staying here and couldn’t wait till the end of my trip to write a review. Location is unbelievable! Right in Times Square. The room has floor to ceiling windows and you can see all the billboards. Highly recommended. ","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Gloria so better","lang":"en","publishedDate":"2023-11-25","publishedPlatform":"OTHER","rating":1,"text":"I was having an amazing time with Justin Karina and Jenn. Until the “manager” Gloria came in the hotel bar screaming at her staff making all of the fellow patrons uncomfortable to the point of us going to another bar.  She was unprofessional and disrespectful to everyone she encountered.","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great Location and Great Rooms","lang":"en","publishedDate":"2023-11-25","publishedPlatform":"MOBILE","rating":5,"text":"Had a nice stay at the Tempo Times Square.  Had an issue with leaving something in the room after checkout and the Manager, Security resolved it quickly.  Big shout out to Jose!  Location was great and the rooms were perfect. Would recommend to others.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"best espresso martinis in time square","lang":"en","publishedDate":"2023-11-24","publishedPlatform":"OTHER","rating":5,"text":"justin and jennifer  the bartenders made epic espresso martinis! the bar and live music was fantastic, the vibe and ambiance was great. jazz music 10\/10! but honestly our bartenders were what made it top notch. ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great experience!","lang":"en","publishedDate":"2023-11-24","publishedPlatform":"OTHER","rating":5,"text":"Wonderful experience with Justin and Jen. Good food but the service is outstanding! They are attentive and they take great care of their guests!!! Would highly recommend for anyone to dine here, at the bar-top! ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Excellent Central Location","lang":"en","publishedDate":"2023-11-23","publishedPlatform":"MOBILE","rating":5,"text":"Excellent stay, staff looked after us well.  Central location and well sized and presented rooms.  Shout out to Migel & Kevin who got us sorted for a last minute taxi run to the airport.  Excellent service.  Definitely would stay here in the future.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"They DO NOT ANSWER THE PHONE","lang":"en","publishedDate":"2023-11-22","publishedPlatform":"OTHER","rating":2,"text":"The hotel was clean and modern. The staff was friendly. The prices for anything in the convenience section or the restaurant were outrageous. $12 for a bottle of water. $5.00 for a 12oz coffee in the lobby and much more.\n\nHave your bill printed and check it before you leave! I had several mistakes both times I have stayed here. First time, I caught it while still there and it was resolved at the desk. Second issue is still unresolved after several WEEKS because the hotel does not answer their phone. I have called a total of 16 times, and let it ring for an extended amount of time. I tried calling Hilton guest services and they also could not reach the hotel. I have cancelled all remaining business stays here.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great hotel and staff","lang":"en","publishedDate":"2023-11-22","publishedPlatform":"MOBILE","rating":5,"text":"Very clean hotel, great location 2 blocks from Times  square . \nThe rooms are very comfortable with an amazing view.  \nThe staff at the restaurant  is very friendly. Henry Alu  provided  us with the best experience we could had  had.\nI highly recommend this hotel","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Vacation ","lang":"en","publishedDate":"2023-11-21","publishedPlatform":"OTHER","rating":5,"text":"I stayed at Tempo by Hilton recently and had a great experience. My girlfriend thought she left an item back at the hotel room.  We ended up finding it in our luggage. The security manager, Jose Cordero, went out of his way to help me out. Most hotel chains would leave me hanging. Thank you Jose snd the staff for a great experience. Also, I love the fixed rate taxi service offered by the hotel back to the airport. ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Over The Moon View","lang":"en","publishedDate":"2023-11-20","publishedPlatform":"MOBILE","rating":5,"text":"I truly enjoyed my stay at Tempo.  The rooms were more than accommodating and spacious for a NYC hotel.  The rooms have true queen sized beds.  The views of Time Square were awesome.  They lan to revisit and stay here.  The team at Tempo are top notch Customer Service team.  David, greeted us with a smile and patient given all of guest that needed to stow bags.  He was very professional and kind, and we appreciated his assistance.","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Location, Location, Location!!","lang":"en","publishedDate":"2023-11-20","publishedPlatform":"MOBILE","rating":5,"text":"The Tempo hotel is a beautfuproperty. As soon as you walk through the double doors, you know that younare stepping into luxury. It's located in the middle of times square. The hotel has beautiful gold & bronze accents throughout the lobby and hotel rooms. \n\nFrom the beginning to the end, my stay at this property was very enjoyable. All of the staff was very friendly and always willing to assist you. \n\nGary at the Front Desk & the bellman was helpful with providing recommendations for food, nightlife, and places to tour. I will be staying at this property my next visit. ","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Thank you Amin!","lang":"en","publishedDate":"2023-11-19","publishedPlatform":"MOBILE","rating":5,"text":"Came to New York to visit a friend and had an awesome stay at Tempo and truly the team at the hotel was amazing. The food and servers were incredibly kind and, honestly, happy to meet our needs! Amin was exceptionally great and charismatic, he was fast and predicted all our needs. The food was great. I recommend the chicken with grain lunch. Give Amin a high five, he’s great!","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Terrific stay!","lang":"en","publishedDate":"2023-11-17","publishedPlatform":"OTHER","rating":5,"text":"Terrific stay at the hotel near landmark places!  Agnes went above and beyond to make our stay memorable.  Our room was spacious and all the staff members were very helpful.  Highly recommend Tempo Hotel for a visit in New York City!  We will definitely stay here next time we come back for a visit.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Egregious lack of soundproofing in certain rooms","lang":"en","publishedDate":"2023-11-15","publishedPlatform":"MOBILE","rating":2,"text":"This was going to be an enthusiastic 5 star review until an egregiously unacceptable oversight in soundproofing made our stay incredibly uncomfortable.\n\nI’m not certain how other rooms are separated, but our room had a door that opened to a wall. We quickly realized that this very thin wall had to be the other side of the next door room’s bathroom wall. With zero soundproofing. Actually, worse than zero soundproofing, the (lack of) construction AMPLIFIED every. single. noise. the neighbors made in the bathroom. Loudly. \n\nConversations, going to the bathroom, and… shower sex sessions that was like graphic porn was being directly amplified into our hotel room. Good for them, get that fun hotel sex. However, when you can hear every graphic, fluid detail (I am not talking about muffled moans, I am saying I unwillingly knew exactly what was happening every moment of their session) of strangers next door having sex basically like it was done in front of a megaphone directly into our room, it took away from feeling like we had our own private space to relax after our city exploring. And, on the flip side, we didn’t want to disturb them as well, so we were making sure we were speaking softly & being more quiet than natural. Yes, we turned up the tv and tried to tune out the noise, but the way that space between rooms was designed, it was echoing and bouncing off the walls like freaking surround sound.\n\nYes, the location is great, the room itself was well designed for our needs, loved the bathroom & bed, the staff was kind and efficient. But the soundproofing design flaw really took away our ability to feel like we could decompress and relax in our own private space.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing","lang":"en","publishedDate":"2023-11-15","publishedPlatform":"OTHER","rating":5,"text":"I loved the experience I had with Tempo by Hilton, Its a perfect spot to stay just above Time Square. Every spot is just closest to this hotel. The Service was super fine. The food was amazing. Especially Amin from F&B is just the sweetest, and I really appreciate his service. Definitely looking forward to visit again","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great customer service ","lang":"en","publishedDate":"2023-11-14","publishedPlatform":"OTHER","rating":5,"text":"Having a great experience and Mrs. Charlene at the front desk was very professional and helpful. Great customer service. Hotel is really nice clean and great service. Hotel staff was patient and nice. That’s what’s important ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Another great stay ","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"OTHER","rating":5,"text":"2nd stay in a month and this hotel and team just gets better and better the longer they are open.\n\nCompared to my 1st stay, which was just weeks after they’d opened the door, this was a completely different experience, the team are much tighter, the kinks in the buildings new interiors have been worked out and overall, the first stay was great, this one was amazing! \n\nShout out to front desk and the lovely team that make you feel so welcome, and to Amin in the breakfast team who just goes that extra mile to make the start of your day great. ","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Very friendly attentive best bartender ","lang":"en","publishedDate":"2023-11-12","publishedPlatform":"OTHER","rating":5,"text":"Justin was the best bartender ever ! Very attentive and fun. Will come back\nJust for him. He attended to us all night, we were never left without a drink , and to top it off the drinks he made were seriously wonderful!  My fiancé and I are from are LA and Justin made some of the best drinks we’ve ever had. \n","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"She showed she cared","lang":"en","publishedDate":"2023-11-12","publishedPlatform":"OTHER","rating":5,"text":"I was so impressed with Krizia (barista) she took the kindest and most respectful care of me. I have ALS and managing can be difficult. She made it a breeze! because of her, we will recommend and continue to come back.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great visit to NYC!","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"MOBILE","rating":5,"text":"Great hotel, great service, clean rooms, very attentive and responsive staff! From the door men, housekeeping staff, front desk and elevator guards, everyone we encountered was pleasant,  friendly and accommodating. Justin in the sky lab bar was fun, friendly and made the best drinks ever! He should get a raise!! ","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"A Hotel That Goes Above and Beyond the Call","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"OTHER","rating":5,"text":"We chose Tempo by Hilton because we'd read the great reviews about the staff.  It turns out the reviews were wrong: They UNDERstated how phenomenal the service is. Throughout our stay EVERYONE was very upbeat and went out of their way to be helpful. But all of that pales to what happened after we checked out. We had just called an Uber when my wife got suddenly and violently ill with what turned out to the the flu. Without getting too graphic, she started vomiting and then passed out. The staff came running out to help, bringing a wheelchair, towels to clear her up, calling the hotel doctor, and taking her back into the hotel. They put us back in the room we'd  been staying, told us they'd charge us less than half their lowest rate. From then until we left, every time I went to the lobby the staff asked me how she was doing,. The manager called our room to check on her. When I went to the hotel restaurant to see if they had any watermelon - the only thing that sounded good to her - the chef personally made a beautiful, huge platter of watermelon and refused to let me pay for it. In short, I've never seen a hotel go above and beyond the call like at. (Oh, BTW, the hotel is very stylish yet comfortable, and shockingly quiet given its Times Square location.) In short, I can't recommend the Tempo by Hilton New York Times Square more highly.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Stay somewhere else","lang":"en","publishedDate":"2023-11-10","publishedPlatform":"OTHER","rating":1,"text":"I want to start my email by telling you how wonderful Jose the bellman is at this hotel. He should be recognized as one of your most valuable assets. \nI chose to stay at this new hotel because this is where my wife and I had stayed there when it was a doubletree several years ago. After the doubletree closed we chose to stay at the Hilton on the Avenue of the Americas. Mistake number one on this trip was not going back to the Hilton.\nWe arrived in the city around 10:30am on Tuesday November 7th. I went to the front desk to try and check in. Much to our surprise there was a room ready. An even bigger surprise was when I was charged $150.00 to check in early. I guess I am wrong to assume that as a Diamond member who has spent over 100 nights in your hotels in 2023 that an early check in was a benefit I had earned. After talking with the front office manager later that night she was able to remove this charge from the final bill.\nAfter spending the day walking around and enjoying New York City we stopped at the chick-fil-a to get my 7 year old son some chicken nuggets. My wife and I were going to use the close to $50.00 F&B credit in the hotel restaurant to have dinner. I was again surprised when the waitress came over and informed us that we could not have outside food in the restaurant while the kitchen was open. I could understand this if the restaurant had a kids menu but it does not. So on day one I was unable to use my F&B credit.\nAfter walking back to chick-fil-a to get myself and my wife dinner to eat with our son I went back to the lobby to ask to speak to a manager. It was 5:30pm. Anyone that could actually do something had already left for the day. It is my understanding after speaking with Destiny who I believe was the front office manager that Matt is the GM of this property. I asked her to have Matt call me. She assured me that everything we spoke about would be put in her report and Matt would give me a call. 3 days later and Matt still has not given me a call.\nThis hotel has a \"market\" area as well as a restaurant. The restaurant is open for breakfast for a few hours in the morning. Beside the counter they have a cooler where you can get drinks and snacks. If you get something from here you can use it as part of the F&B credit. However this cooler closes at 11am so when you come back in the afternoon and want a soft drink or a bottle of water you have to get it from the \"market\" area. The food and beverage you get from the \"market\" area is not allowed to be charged as F&B. Can someone please explain this one to me?\nThursday when it was time for us to leave we went back to the hotel to get our bags. We were going to use the restroom in the lobby area before we got in our uber to head to the airport. We were once again hit with a surprise. The not so wonderful restaurant where you can not get a decent meal and especially can not get anything for a kid to eat was closed for a private event. Guess where the restroom is. You got it. The closed restaurant. So I guess we will just hold it for the hour ride to LGA. Speaking of restaurants you should change the about us section of this hotel on their website and the app. You claim that the restaurant has iconic NYC views. It has a great view of a solid dark wall. Maybe it should read if you walk out of the restaurant and down the hall pass the check in counter then you can have an iconic view.\nJust an overall bad experience. I expected more from a brand new hotel in times square. I expected the same level of service and hospitality that I receive at countless other hilton hotels around the country. Go back to being a doubletree. Or better yet in my case I will stay where I know the service and food is good. The hilton around the corner.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Perfect Escape in the middle of Times Square ","lang":"en","publishedDate":"2023-11-10","publishedPlatform":"OTHER","rating":5,"text":"Everything about our stay was amazing. Every door, elevator, valet, housekeeping attendant and security guard was personable and helpful. I enjoyed having conversations with each I encountered. Bianca is hilarious. The room was perfect. The bed was sooo comfortable and the auto shades allowed us to get quality sleep with the all of the lights of Time Square outside. I can hardly wait to book my next stay. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing Experience!! ","lang":"en","publishedDate":"2023-11-10","publishedPlatform":"OTHER","rating":5,"text":"We can’t say enough about the excellent service we received at this new hotel. This has yet been the best experience I’ve stayed at any hotel. It’s new, it’s beautiful and the staff is incredible. The cafe staff there started out our days with gracious smiles, good coffee and food. Amin at the cafe was so sweet and helped us with anything we needed. The check in receptionist and managers were also very amazing. We will definitely come back again! ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best Hotel Stay Ever","lang":"en","publishedDate":"2023-11-10","publishedPlatform":"OTHER","rating":5,"text":"This hotel was amazing! The room was superb and the staff was very friendly & helpful at all times. We had a corner room overlooking Times Square, so we not only could see everything on the strip, but also the harbor and NJ side. Room was clean, spacious and very modern. If I had to give a complaint, it would be that it was noisy, but that's just the city in general; not the hotels fault. If you are ever in NYC, stay here! You won't be disappointed. My husband and I loved our stay!! ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Buenas atenciones","lang":"es","publishedDate":"2023-11-10","publishedPlatform":"OTHER","rating":5,"text":"Henry es muy atento y entregado a dar buen servicio. Estuvimos en el área de restaurant y recibimos sus atenciones de manera rápida, eficiente y educada.\n\nEl café estaba muy bueno y el ambiente también.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Lovely ","lang":"en","publishedDate":"2023-11-09","publishedPlatform":"OTHER","rating":5,"text":"Hotel view is amazing. This is my first time in a a Hilton of any kind so to say the least it was quite the experience so far. The staff has been so welcoming and friendly and helpful. The overall service is great ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"New York Perfection! ","lang":"en","publishedDate":"2023-11-07","publishedPlatform":"OTHER","rating":5,"text":"My colleagues and I stayed here for two nights during a work trip, and it was amazing. Whoever designed the hotel and the layout of the room really thought of everything. The rooms are not large (at least the ones we stayed in weren’t) but they were beautifully appointed and very comfortable, with modern tech features like Bluetooth in the bathroom mirror and automatic shades. The staff were all so nice, friendly and helpful, particularly John B who gave us great advice on transportation down to the Halloween parade, and also a recommendation for our new favorite Times Square restaurant (Juniors) with the best cheesecake we’ve ever had! We were all sad to leave the hotel and hope to be back again! ","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"First time at this property ","lang":"en","publishedDate":"2023-11-07","publishedPlatform":"OTHER","rating":4,"text":"The staff was friendly and helpful.  It had recently opened but for the most part you couldn't tell as far as knowledge of the staff.  The rooms are nice and the typical size for the area.  The menu was limited but hopefully now that they have been open longer there will be more options.  Make sure you bring a water bottle, honors members don't get free bottles of water.  Karina was awesome!  Make sure you stop by the bar.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":25364031,"title":"Bianca from Security ","lang":"en","publishedDate":"2023-11-07","publishedPlatform":"OTHER","rating":5,"text":"Wonderful staff-\nDuring my trip it was my privilege to meet Bianca, a member of Tempo’s Security Staff.  Bianca assisted me on multiple occasions during a visit for my daughter’s spine surgery.\n\nBianca personifies-\n• Professionalism\n• Positive Personality \n• Potential for growth in your organization \n\nVic Beninate ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best NYC Hotel We’ve Stayed At!","lang":"en","publishedDate":"2023-11-06","publishedPlatform":"MOBILE","rating":5,"text":"My husband and I have stayed in a few hotels in NYC but we both agree that Tempo is our favorite. \nThe room itself was spectacular. When we opened the door, we felt right at home. It was cozy and super clean! \nThe staff were also great. I wish I knew the name of the gentleman who helped us with our luggage this past Sunday. Even though he was very busy because of the marathon, he helped us with everything that we needed. Our valet driver Miguel was also very sweet and helped us with our luggage and getting through the crazy traffic. \nMy husband and I are looking forward to coming back to the city and staying at the hotel again!","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"A gem at the heart of NYC ","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"I stayed here on a trip with my mother in September, we were travelling in the US with NYC being our last stop. I knew the hotel was newly opened and excited to see what it could offer. This hotel has to be one of the best I have ever stayed at. From the amenities to the staff this was the perfect end to a great vacation. The rooms were modern and relaxed, perfect for winding down or getting up to go in the morning for a busy day in the city. You could switch the room vibe depending on your mood literally with the touch of a button. Reception were incredibly helpful after we were delayed coming in from a storm and welcomed us on a busy day still smiling. Every staff member was so friendly but I have to give a special shout out to Gregory in the restaurant. Ive worked in customer service most of my life and that man had something special. We dined the first night in the restaurant, and he was so welcoming and friendly to not just us but seeing the way he interacted with other guests too. He created a lovely atmosphere for everyone around and should certainly be recognised! Thank you Tempo team for a lovely trip and I hope to visit again next time I'm in the city! <3 ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Sister’s Getaway ","lang":"en","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":5,"text":"The location is perfect for walking. Rooms are comfortable and the shower was my favorite. Staff was friendly but I have to especially recognize Dino at valet. He was the best part about this hotel!! ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"We enjoyed seeing the sights of NYC","lang":"en","publishedDate":"2023-11-04","publishedPlatform":"OTHER","rating":5,"text":"Excellent accommodations. The staff was very polite & helpful. \nThe blackout shades were perfect to keep Times Square outside at night. \nOne tip. When using the in room espresso machine. Don’t push the large button, it fills the cup to the brim. You can’t move it without spilling. If you hit the small fill twice, it’s the perfect fill. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great place to stay in Times Square","lang":"en","publishedDate":"2023-11-04","publishedPlatform":"MOBILE","rating":5,"text":"Easy check in and great room . The room on the 31st floor had fantastic views over Times Square and was super clean. It had everything that you could possibly need. Super toiletries in the bathroom. Cannot fault this hotel at all. The staff were really friendly and professional . It was my sons first visit to NYC and he loved the hotel and the views from the window .Special praise should go to Juan who helped get transport to the airport. All in all a totally excellent experience . The bar is slightly expensive but given the location this was expected. We will return next time we are in NYC","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Deano and John - doorman","lang":"en","publishedDate":"2023-11-03","publishedPlatform":"MOBILE","rating":5,"text":"Deano and John are the best doormen in NYC xxx\n\nThank you so much your amazing. Kind and super helpful xxxxxxx\n\nGreat hotel really sound proof and beautiful.\n\nAmazing car back to the airport. \n\nIn the heart of Times Square. Amazing experience. \n\nXxxx\n\nXxxxxx","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Bravo Tempo - just start serving tea and you'll be perfect!","lang":"en","publishedDate":"2023-11-02","publishedPlatform":"OTHER","rating":5,"text":"The beds are to die for!!!  We have stayed in this hotel before it shut down when it was the Double Trees Suites and we've stayed there twice originally.  It is now Tempo Suites and it is amazing.  Still ironing out some issues looking at the reviews but our experience was overall great.  We are regular visitors to New York and we will stay again.  We had a little trouble checking with our room key with the key not working, (wrong room keyed in at front desk), given another room which was wrong again, got in this time to find a bouquet of flowers for someone else and then upgraded to a top floor with a ball drop view room (thank you very much!).  We didn't mind! The first room was great anyway but the second room was jaw dropping!  Ironically we had stayed in that style of room before and it was interested to see the differences with the refurb.  The room was perfectly thought out with shades which are electronic.  Coffee machine but only three pods so you have to fight if there are 2 of you but no problem you can buy a pack in the shop downstairs.  The beds are amazing!  As comfortable as the ones in the Bellagio in Las Vegas and no bed has EVER come close to that in my eyes over 10 years ago!  Like you are sleeping on a cloud if you can imagine that (if I can imagine that!).  Things to improve: 1) please serve tea to the Brits at the very least.  I was dying for a cup and they refused to serve me a cup \"oh no we don't serve that here\".  Really?!  What happened to the American dream of you can have anything you wan?!  Apart from a cup of tea?!  2)  Highball restaurant which by the way is going to have a fab outdoor dining terrace due to be complete by end of Nov is FREEZING!!!  Everyone sat in coats.  I asked why so cold the staff knew about this but appeared to not have any answers as to why so why Tempo is it sooooooo cold?  Made me very reluctant to want to be there but maybe that's why to discourage you to stay too long?  The food is amazing though but prepare to be very cold. Overall though this is still a 5 star experience and we will be back!  Thanks Tempo - great job x","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"An modern oasis overlooking Times Square!","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"An oasis overlooking Times Square! Rooms are beautiful, modern, clean and surprisingly quiet given the location. A great value overall, and the staff was super nice too. A special shout out to our bellman extraordinaire Van, who let us use his personal umbrella on a rainy Sunday.","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Poor level of service","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"MOBILE","rating":2,"text":"I am writing to express my extreme disappointment with the service we received during our recent stay at your hotel. Unfortunately, our experience was marred by several significant issues that I feel compelled to bring to your attention.\n\nFirstly, upon our arrival, we encountered a security issue where we were robbed by a scamming cab driver who charged our credit card a staggering amount of 650 USD from JFK. Understandably, we immediately sought assistance from your security team to obtain video footage of the incident. However, despite our repeated requests, we were left waiting for an extended period of time without any response or assistance. It took us two days to finally meet with the head of security, which is simply unacceptable.\n\nFurthermore, we were also disappointed with the housekeeping service. On the fourth day of our stay, our room was not serviced despite our request to the reception before leaving for dinner. Upon our return, we were dismayed to find that the room had not been attended to.\n\nAdditionally, during our entire stay, we found the overall level of service to be poor. The reception area was cramped with limited seating, making it difficult for guests to comfortably wait. Moreover, the lack of storage space in our room was inconvenient, especially during a six-day stay. The rooms were also noisy, further adding to our disappointment.\n\nTo make matters worse, when we checked out, we were informed that the system was down and we could not receive a receipt. This lack of organization and communication only added to our frustration.\n\nAs loyal of Hilton hotels, we had high expectations for our stay at your establishment. However, the service we received fell far short of these expectations. It is disheartening to compare our experience with the neighboring hotel, where the hospitality and security were significantly better.\n\nRegrettably, based on our experience, we have no intention of returning to your hotel in the future. We hope that you take our feedback seriously and make the necessary improvements to ensure a more satisfactory experience for your guests.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Really good in every way!","lang":"en","publishedDate":"2023-10-29","publishedPlatform":"MOBILE","rating":5,"text":"This hotel is even nicer in person than it looks in photos. Great location leas than a 30 second walk from Times Square. Our room was super clean with high end furnishings, and an excellent bed. They had a ton of very friendly staff that was always around to welcome you, hold doors, direct you to your elevator (which you never have to wait for), etc. We usually like to venture out for meals but the breakfast food was so good that we didn’t go anywhere else. The oatmeal is as good as I’ve had anywhere and the breakfast bowl was equally good. Both were full of fresh, hardy ingredients. Again, tons of friendly service. Henry went out of his way to get the chef to make some breakfast items for us when we overslept after a red eye and the kitchen had already switched over to lunch. We loved everything about our stay. Highly recommend.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Useless hipsters and security personnel that go through your safe.","lang":"en","publishedDate":"2023-10-27","publishedPlatform":"MOBILE","rating":2,"text":"The hipsters at the front desk are completely useless. I came in late on a Thursday night, my airline had lost my bag and I didn't have anything with me. I asked the front desk where I could buy a toothbrush and toothpaste and they told me that they would send it to my room. I was really happy about it as I was exhausted after the travel. But they never sent it. I called the front desk much later and politely asked if I could pick it up. No need Sir! We will send it up right away! Nope, it never arrived. \n\nThe morning after I was looking forward to having coffee in my room, and I had a great Nespresso. Nope, it was broken. Back to front and ask them to change it. No problem Sir! We will do it right away. I stayed at the hotel for 6 nights and asked them to change it every day. On the 5th day, it was finally changed.\n\nThen for the most serious part. On my second day, I came back to my room at about 1 p.m., and as I walked to my room two security guards from the hotel were walking out of life my room, holding everything I had locked in the safe! My computer, my passport, my wallet, everything!!! The excuse was that there was luggage in the room I must have checked out! I didn't receive any email or phone call from the hotel to confirm it, they just took it!\n\nOther than that the room was nice and it was cleaned really well every day. The staff, other than the useless hipsters at the front desk and the two security guards were all good and made me feel welcome.","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great in every way. Perfect location","lang":"en","publishedDate":"2023-10-27","publishedPlatform":"MOBILE","rating":5,"text":"The facility and staff exceeded expectations. Room clean and very comfortable. Beds 10\/10, great shower, partial view of Times Square from the 44th floor. The LOCATION is perfect! Easy access to everything. \nWe were particularly impressed by Harun who mage us feel welcome and was very helpful. Also, Nru in the bar\/cafe. Very professional and attentive. And the porters went above and beyond - Kingston was great. \nWill definitely book again when I am next in NYC.\nGood value for the money.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Wonderful dinner ","lang":"en","publishedDate":"2023-10-26","publishedPlatform":"OTHER","rating":5,"text":"The restaurant went above and beyond all expectations! Nur our server for dinner in the hotel was very attentive and even gave me a birthday dessert since I was celebrating my 21st birthday! 10\/10 would recommend. ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Nice hotel with minor glitches","lang":"en","publishedDate":"2023-10-26","publishedPlatform":"MOBILE","rating":4,"text":"Hotel was very clean. Floor to ceiling windows with motorizes drape and sheer. Bed and pillows very comfortable. King room can feel cramped, especially between the desk and the wall. Liked the “night light mirror “ in the bathroom.\nLobby is small for a hotel that accepts group tours. Room on 43 floor very quiet. HVAC operates well and is unobtrusive .\nTip: Boomers will need reading  glasses for the small print on the small buttons.\nTip: Make sure to ask about the discounts that come with the mandatory urban destination fee. That was not offered when we received the room key.\nTip: If you get food or beverage from the gift shop it is not included in the $10 allowance. You must get from the restaurant.\nTip: If you want to use your allowance in a soda for example, do before the restaurant opens for diner. Once dinner starts they close the shelf and you have to pay for the same at the gift shop (Sneaky)","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great experience","lang":"en","publishedDate":"2023-10-24","publishedPlatform":"OTHER","rating":5,"text":"Great hotel and great staff, Kessi was very friendly and patient with us as she helped us book our bus tour, she explained everything clearly and answered all of our questions. \n\nThe only annoying part of my stay was trying to figure out how to connect to the wifi. You still get free wifi thought so it’s all good","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Plentiful Elevators, good staff, clean hotel, overall good location","lang":"en","publishedDate":"2023-10-24","publishedPlatform":"OTHER","rating":4,"text":"We arrived on Friday, October 20, after waking up at 3:30 am our time. We knew our room might not be ready, but unfortunately the hotel's whole system wasn't working. So we were offered luggage storage and told we would be called when our room was ready. We ate breakfast, wandered around Rockefeller Plaza and never heard back. So we went back around 2:45 pm to a huge line. I tried to check in online at that point and was unable. So waited in the line only to be told our room was ready. While I understand this was unusual, I was disappointed that we were never contacted. The elevators are plentiful and fast, which was great. The room was tight for 4 with luggage, but doable. The blinds are electronic, but ours was already broken and on our last night we couldn't get the blinds down, only the shears so our room was quite bright. Definitely working out the kinks, but overall a great location and great hotel. I tried to call the hotel to provide feedback, but was told to post it here. I was hoping to get our rate adjusted at check in as I found a slightly cheaper rate, but with the enormous line I didn't both and then was unable to get it fixed during our stay. Also we did call down for pillows and extra towels and only after calling back were they delivered. I'd definitely recommend the hotel, but like I said, a few kinks still to be worked out.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"A GEM in Times Square ","lang":"en","publishedDate":"2023-10-24","publishedPlatform":"OTHER","rating":5,"text":"Lovely new hotel in the middle of lively Times Square and the theater district. Their restaurant and bar provides beautiful views of the city and the rooms are very spacious for Manhattan and brand new! BIG THANK YOU to Charlene at the front desk for getting me checked in quickly and being so welcoming. Looking forward to returning soon. ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"It's the little things","lang":"en","publishedDate":"2023-10-23","publishedPlatform":"OTHER","rating":3,"text":"Upon our arrival on the afternoon of 10\/20 we exited the lobby elevator to a roped off sea of suitcases, some people in line (like 4 or 5), and no clear idea what was going on. Finally find out the system is down. I understand its a new hotel but I didn't really get a great answer just come back at 4. Ok so where do I check my bags? \"over there\".  A not so pleasant gentlemen took my bags and we set out to explore until 4 :30 sh. Of course it poured while we were out, so when we returned soaking wet to the hotel after 4pm there was a line of people all the way back to the restaurant\/lounge. So I waited while my husband who had hurt his foot while we were out sat in the lounge area. When I finally got to the desk, I handed the gentleman my credit card and DL explained the room was in my husbands name but he was in the lounge and I had no signal and couldn't get on the wifi to reach him. I was given two keys for us, no other explanation about anything whatsoever, got my bags and we went to change into dry clothes. \n\nThe room was on a high floor, small and clean. Nice to have many plugs and a window to pop open. The bed and pillows were comfy, and the bath was nice but that is where it ends. There was not a full roll of toilet paper in the bathroom when we arrived and not a single extra roll in the room, seriously WTH.  The rubber fittings on the shower handle were already coming off, when we showered with the door closed, a large amount of water leaked onto the bathroom floor-so I had to mop that up before drying my hair UGH, and there was not hook or anywhere to hang the hand towel. I know it is a little thing to complain about but it isn't an expansive vanity, with two people sharing the tiny sink leaving the hand towel on the counter top is gross. \n\nFortunately we had carry on luggage but there is really nowhere to store luggage. I have been on cruise ships with better storage. There isn't a good spot to open your suitcase to remove clothes to hang up, I don't want to put my suitcase on the bed, and then there is no drawer space so you have to leave your carry-on with socks and what not on the case for the safe, It is fine not to have a closet but good grief, any decent wall organizer could handle some shelves or a drawer.\n\nIt was a lot of money to spend on a room that required so much extra effort to be comfortable. I am curious how well some of the fittings will hold up over time, some things seemed well thought out, others not so much. We didn't spend much time in the room, but I expected better. \n\nWe checked out early and a much more pleasant man took our bags and arranged a car for the airport so we could sight see until it was time to go. That was the level of service I expected for our entire stay but didn't receive.\n\nAnd after checkout-with no receipt I might add, I see the destination charge of $80 on my card for amenities I was never told about.  It is Hilton, they open up new hotels all the time, I get that technical issues occur, but better communication all around is desperately needed here so people don't feel cheated. So with feeling cheated, the glitchy system, and the other little things I don't think I would stay here again.  Another night here and I would probably have to go buy some toilet paper.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo Hotel is awesome","lang":"en","publishedDate":"2023-10-23","publishedPlatform":"MOBILE","rating":5,"text":"We absolutely loved the Tempo Hotel!! The location is perfect, the rooms were clean & modern and the staff was amazing!! John was particularly helpful. We arrived well before checking time and he did a great job taking care of our things and giving us great advice about cool things to do until check in time. He was also helpful when we were leaving to coordinate our transportation. We are definitely going to stay here again!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Worth every penny .","lang":"en","publishedDate":"2023-10-22","publishedPlatform":"MOBILE","rating":5,"text":"New Hotel . Perfect location . Family Friendly . Quick walk to all theatres and shows . View of Times Square . Rooms are small BUT the staff is worth the price of the room . We will be back because of the employees who worked so hard to make us feel at home . Everyone we came in contact with was kind , caring , and always ready to help. \nTrust me on this one . Look no further . This is the hotel for you !","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Family-friendly in the heart of the action","lang":"en","publishedDate":"2023-10-22","publishedPlatform":"MOBILE","rating":5,"text":"We don’t typically stay in Times Square when we come into the city, but decided to stay there this trip in order to stay in a newly opened hotel. We came with our two daughters and stayed for 5 nights in a two-queen city view room on the 30th floor.\n\nCONS: the room was small with very little storage areas for suitcases and no drawers for clothes. (We knew we would be sacrificing room-size with our choice to stay here, but we’re disappointed with the lack of storage space). \n\nPROS: The fixtures in the room were beautiful and the beds were really comfortable. The bathroom was bright and surprisingly spacious. The view was great and you could crack the window to take in the sounds of the city, but when it was closed and the automatic shades were closed you couldn’t hear or see any sign of the activity below.\n\nThe location was very convenient to the theatre district and subway and the entrance being off on the side away from the main Times Square traffic made it easier to enter and exit the hotel . \n\nBianca (one of the security team members), was one of the favorite parts of our stay. She always greeted us with a smile and provided an exemplary level of customer service to us every time we came in or left the hotel. She even gave our girls treat bags when we checked out.❤️ All other team members we encountered were friendly and helpful as well. \n\nIf you are looking for a clean, updated hotel and don’t mind being in the middle of Times Square and small rooms, I would definitely recommend The Tempo!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Five start experience! ","lang":"en","publishedDate":"2023-10-22","publishedPlatform":"OTHER","rating":5,"text":"Just visited the Tempo Hilton hotel for drinks  with a group of my friends this past weekend and the staff and ambience was amazing! Everything was clean and immaculate and the security manager Jose Cordero went above and beyond with answering our questions ! Very knowledgeable and welcoming person. ","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":25364031,"title":"Terrible","lang":"en","publishedDate":"2023-10-20","publishedPlatform":"OTHER","rating":1,"text":"Worst service ever. Arrived at the hotel and informatic service wasn’t working. Been told to come back later. Came back twice in the afternoon with incredible line up waiting for help. Came back at 6 pm and room wasn’t ready. 20 minutes later, still waiting for my room, no word from desk, no help, nothing offered for inconvenience. Never seen such a bad service…!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great service, clean\/modern hotel","lang":"en","publishedDate":"2023-10-18","publishedPlatform":"MOBILE","rating":5,"text":"While I normally wouldn’t choose to stay in Times Square because of the crowds, I was pleasantly surprised by the quality of the hotel and service. Room was clean and modern, with a smart mirror that had built in Bluetooth speakers and a motion sensitive night light. Build in chargers all with USB-C. The staff was consistently professional and helpful, and Dino at the bell desk went above and beyond for me. He’s the man!!","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great experience. Amazing service. ","lang":"en","publishedDate":"2023-10-18","publishedPlatform":"OTHER","rating":5,"text":"Amazing service.   Very clean. Amazing view. Definitely it will be my first choice in New York City.    Kessi has amazing customer service. Very polite and very helpful.     She helped us with great suggestions   To make our trip memorable ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great Place to Stay","lang":"en","publishedDate":"2023-10-17","publishedPlatform":"MOBILE","rating":5,"text":"What can I say but just WOW !! \nThis hotel has amazing views of Times Square it’s close to everything. We went to see Back to the Future and it was less than a 10 mins walk. \nThis hotel is super clean , everyone is so nice and what made it even better was seeing a familiar face we saw Sue !!!!! Who is just amazing I will be staying here again , Thank you Tempo !!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Location, location, location","lang":"en","publishedDate":"2023-10-17","publishedPlatform":"OTHER","rating":5,"text":"If you want to see Broadway shows, you can't do better. The TKTS booth is a short stroll across the street. This being a brand new hotel, it has all the modern conveniences. Outlets and charging ports everywhere, motorized blinds and sheers, elevators you summon  by floor number with the screen indicating which one it will be. We never waited for an elevator. Our king room was small, but we're cruisers so that was no problem for us.  The bath was generously sized. The window was a stepped affair that gave you a fantastic view, better than a regular window. What can I say, our 4-night stay was a delight, start to finish.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"A very special place in the heart of Time Square","lang":"en","publishedDate":"2023-10-17","publishedPlatform":"OTHER","rating":5,"text":"From the moment the lobby doors opened, I knew this was going to be a special place.  The customer service was next level ( the people greeting you at the front door and elevators , the person who checked my luggage after checkout so that I could continue to explore the city ,  the bartender).   Taj checked me in and was amazing! She gave me a beautiful room with a spectacular view of Times Square and helped me with directions to my Fashion Week venues.  The room was gorgeous, modern and so comforatble!  I especially loved the automated blackout curtains that blocked out all the excitment below at bedtime.   The lounge\/restaurant was a nice, comfortable place for lunch when I checked out.   I'll defintely be back.  It is an great hotel for business for leisure travel.  ","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best help and employee!","lang":"en","publishedDate":"2023-10-16","publishedPlatform":"OTHER","rating":5,"text":"The best help and service at the restaurant. Kind, caring and personable.  Willing to give advice, extra help and cared about ensuring we had a great time.  She was spot on with suggestions, worked hard and was fun!","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great hotel and AMAZING staff","lang":"en","publishedDate":"2023-10-16","publishedPlatform":"OTHER","rating":5,"text":"We loved everything about this hotel! Our room was amazing, the entire staff was so polite from check in to the hosts, housekeeping, bartenders, elevator peeps (yes....they have someone to get the next elevator for you!) Everyone! I have never had such 5 star service before.  Will definitely be coming back!","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Disappointed","lang":"en","publishedDate":"2023-10-15","publishedPlatform":"MOBILE","rating":2,"text":"Firstly the hotel entrance is nothing like your photograph! Although a great  location it is newly opened and still has a lot to learn\nWe arrived at 09:30 having disembarked from a cruise. No greeting and difficult to find help with our luggage. We had booked 3 nights. We were not checked in till 14:30 although check in is 15:00. Apparently we were upgraded. However I think they meant we were put in a room on an higher floor as I couldn’t imagine anything more basic in a room. It was of average size and the shower was excellent. However no shower cap provided. When the tissue box was empty it was not refilled even though I asked!! The communication is non existent. There is seldom any answer from reception. There are no instructions for the coffee machine or any information about facilities if they exist! A refrigerator is provided but empty. If we needed water we had to go to the lobby. There is no lounge just a restaurant where the service is non existent. No drinking glasses in the room although they were provided when we asked. \nThere must be better hotels in New York for a similar price","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great experience in nyc!","lang":"en","publishedDate":"2023-10-14","publishedPlatform":"MOBILE","rating":5,"text":"Great experience - front desk personnel were amazing particularly Marta and David the Bellman.   Really nice time in nyc.  Room and hotel itself were great.  Some phone system problems while I was there but overall super pleasant time in nyc!    Go Tempo!","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Coffee bar","lang":"en","publishedDate":"2023-10-14","publishedPlatform":"OTHER","rating":4,"text":"Stayed at the Hotel in october for a couple of days visiting New York. Nice rooms and views.  When leaving on the last rainy day went the coffee bar where we had some coffee and a very good service from Amin","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Come for the atmosphere but don’t miss the coffee bar.","lang":"en","publishedDate":"2023-10-14","publishedPlatform":"MOBILE","rating":5,"text":"Nice hotel but the coffee bar is a bonus.  Amin the bistro was quick and very personable.  Knows his coffees and keeps the line moving without feeling rushed. The atmosphere here is casual and very relaxing.  Rooms are a bit small but offer 2 queen beds which is a rare find in the theater district\/ Time Square","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great place, great service! ","lang":"en","publishedDate":"2023-10-14","publishedPlatform":"OTHER","rating":5,"text":"Tempo by Hilton was the best place to stay! This is one of the newer hotels in Times Square and it’s so clean, sleek and modern. You enter the main lobby to check in on the 11th floor, and there’s also an onsite restaurant on the same floor. In terms of aesthetics, the lighting is very dim and the placement of the columns as you exit from ground level to the main lobby can be better but it doesn’t take away from everything else. From check in to check out, we had a great experience! When we visited the on site restaurant (Highball Times Square), Shenille and Henry Alvarado were so nice and helpful. They provided the absolute best service!  Check them out if you’re ever in the area. All of front desk professionals were a pleasure to deal with as well. Great hotel, great views from our room, great staff and the location is perfect. Will definitely stay again.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Location is tough to beat!","lang":"en","publishedDate":"2023-10-12","publishedPlatform":"MOBILE","rating":5,"text":"Everything is brand new, the staff was friendly, the rooms were on the small size but well equipped and modern.\n\nClose to all the best Broadway shows, 5 min from Harry Potter. 15 min walk to central park, right next to several subway lines including the one connecting to the free bus to go to Laguardia Airport\n\nPerfect for few days or a weekend. Would go again.\n\n","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Right off Times Square","lang":"en","publishedDate":"2023-10-11","publishedPlatform":"OTHER","rating":5,"text":"Great hotel in a convenient location. Will be back the next time I’m in NYC! Clean rooms refreshed daily. Surprised at the quality of the restaurant as well. Excellent service in the restaurant, especially from Nur! ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"The best place to stay in the city!","lang":"en","publishedDate":"2023-10-11","publishedPlatform":"OTHER","rating":5,"text":"We had a very pleasant stay. Everyone was so accommodating and most importantly to me they went above and beyond to greet us with a smile, they were so friendly!  Bianca with the security team was always there to greet us as we entered and exited the facility.  It was a refreshing and pleasant experience to meet so many  kind people in the city. This hotel has a great team of employees.  The rooms were clean, and room service never missed a beat.  They were always doing their job and offering a smile in passing.  The restaurant staff was great as well. ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"New Hotel still working out the flow of business ","lang":"en","publishedDate":"2023-10-10","publishedPlatform":"OTHER","rating":3,"text":"The hotel is new, and location is great you will be in the heart of time square.\n\nPro-great location, clean, nice staff, fridge in the room, dog friendly, hardwood floors, nice view, and great shower\nCons- No ice machines on the floor you have to go to the bar to get ice.  No microwaves in the room.  Valet is a 3rd party don't use it if you have to because they can't bring your car back you will have to walk 6 blocks like we did to get our car with luggage.  It's not worth it!  They don't have a lot of food options in the hotel no hot breakfast.  But it's NY you can go outside the hotel to get food lots of great options.  Finally, they don't answer the front desk phone you have to go down there to speak with someone which was very frustrating; however, they seem extremely busy all the time at the front desk not sure why they don't answer though.  They didn't answer when I called prior to arrival.  ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Attentive Staff to Pricing\/Value Concerns","lang":"en","publishedDate":"2023-10-09","publishedPlatform":"MOBILE","rating":3,"text":"Great new hotel; sleek and modern decor.. cozy and comfy rooms for solo or couples.  Great location off of broadway! However, I experienced unreasonable prices\/service , particularly breakfast and coffee in the lobby canteen. I was given 1 slice of avocado toast and coffee for over $20usd. Really bizarre, 1 slice of toast (why not 2?) ?This seems obviously egregious for the value.  However- I happen to incidentally mention this to an evening bartender, Alex . Much to my surprise, Alex expressed concerned as to my experience and offered to get a manager for me to provide feedback. Glori, the manager came over and  to my surprise actually wanted to hear more. When i shared my view, she and Alex were open and accepting of the feedback. They then offered me a glass of wine as a hospitality gesture of appreciation. These two are on their game! Not sure if hotel will review the breakfast offering and prices, but much to my surprise- the staff was attentive to my stay experience and concern.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"A wonderful weekend ","lang":"en","publishedDate":"2023-10-09","publishedPlatform":"OTHER","rating":5,"text":"Bianca in security was so incredibly helpful. She ensured our visit would be safe, secure and comfortable.  It was such a great time that I will definitely come back to visit again.  Thank you for an amazing weekend. ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Worst ever","lang":"en","publishedDate":"2023-10-09","publishedPlatform":"OTHER","rating":1,"text":"The small details are what ruins a great stay or experience and unfortunately are what leaves the most memorable impression.\n\nFirst, we arrived early around 11:30am and opted for valet parking and went to check-in and they said they would text or call when the room was ready maybe within an hour or two. Certainly did not expect to get a room since check-in is normally 4pm, and we wanted to walk to get lunch as well.\n\nBut we never ended up receiving a text at all. So didn't go back to the hotel until 3:30pm because of that. We had to have our toddler sleep in the stroller while we pushed him around in the crowd.\n\nThen, now when checking out, for the first time I hear they need an hour notice for valet car retrieval. Well nobody told me that when I arrived. So I'm sitting here waiting endlessly for my vehicle and have a long drive back to Canada and way behind schedule because of the lack of communication.\n\nWhy don't you even just put that on the valet ticket or something. So that it's in writing.\n\nWe were all packed before 9am, and walked over to grab a coffee at McDonald's before checking out and asking for the car. Had we known, we would have obviously asked for the vehicle earlier.\n\nWhat a complete waste of my time. There are so many positives to the hotel, but they didn't earn my time for that because I have to spend it on writing the above instead.\n\nRoom 2321 (Oct 8 to 9).","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"I like Tempo because of Kessi‘s service","lang":"zhCN","publishedDate":"2023-10-06","publishedPlatform":"OTHER","rating":5,"text":"My wife and I like Kessi‘s service.She is so nice that we have very good time in Times Square.We do come again.Thank you Kessi！！！🥰🥰🥰很热情的服务，无微不至，让人宾至如归，感恩！很多美国酒店的服务很敷衍，这边不一样，给我超预期。","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Thank you for the experience ","lang":"en","publishedDate":"2023-10-06","publishedPlatform":"OTHER","rating":5,"text":"The view is awesome, the bathroom is luxurious, the bed was so comfy, the room was cozy, I like the lights and the curtness were electronic, MAKE SOURE TO GIVE KESSY A RAISE please she was so nice to me","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo staff make the experience ","lang":"en","publishedDate":"2023-10-06","publishedPlatform":"OTHER","rating":5,"text":"What a wonderful experience. Excellent location. Central and can walk to all the theaters and fun shops. Shout out to Brianna and Marcell for amazing customer service. They elevated our experience with kindness and care","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Setting the Tempo in the center of everything","lang":"en","publishedDate":"2023-10-06","publishedPlatform":"MOBILE","rating":5,"text":"The staff had it all together even just having been open for a few weeks. Everyone was friendly, helpful and welcoming from the Valet (wish I could remember his name, his daughter just graduated college in PA with a degree in architecture), bell staff (David and Jose), front desk  and the cafe staff(Henry and Chelsy). Please note that the entrance and where you will park for the valet is under construction, so there were only 2 spots right by the door, so be prepared for some NY style driving. This also causes for some back up with the bell staff, as it takes 1 hour notice for you to receive your car. \nI appreciated security at the entrance door and that the for the elevator to your rooms you enter your room number before entering, so not everyone else knows who is getting off at what floor. \nTha main lobby has amazing Times Square views, as do many of the bedrooms. Rooms are standard NYC size, but have everything you need to store your items, including a mini fridge, as well as black out shades, since the lights in Time Square makes it daylight 24\/7.  The bathroom was large with a mirror (and lighting around it that could be dimmed), a step in shower with a rainfall shower head, and bulk toiletry dispensers.\nCafe had a few grab and go items, but could use more variety.\nThe hotel itself is located near everything you could want from restaurants, the theatre district, souvenir and chocolate store shopping. Would absolutely stay at this hotel again.","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":25364031,"title":"A New York experience must!","lang":"en","publishedDate":"2023-10-05","publishedPlatform":"OTHER","rating":5,"text":"The hotel was super beautiful. The bed was sooo comfortable and the bathroom was state of the art! The one most amazing thing was when we came in the room and it a welcome to my husband on the television!!! \nThe team members Laura and Bianca in security were extremely friendly and wonderful! Their attitudes were so welcoming and made us feel at home!! We really appreciated them, but all of the staff was excellent! The restaurant in the hotel was good just not enough selections on the menu for guest who may not want to go out to eat. Overall the next time we’re in New York we definitely be back at the Tempo by Hilton!","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"A wonderful stay ","lang":"en","publishedDate":"2023-10-04","publishedPlatform":"OTHER","rating":5,"text":"I had a great stay at this hotel, lovely room and staff. I wanted to say how helpful the bell staff were - Jose, Kingsley, Kevin were. They helped me with all my bags and made sure I got taxi’s and were very friendly. ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Times Square Gem!","lang":"en","publishedDate":"2023-10-04","publishedPlatform":"MOBILE","rating":5,"text":"I recently stayed at the Tempo by Hilton off of Times Square and really enjoyed my overall visit. The hotel is very chic, and the rooms are excellent. I stayed in a king room. From the shower and bathroom to the bedding, flatscreen, automatic shades, this was by far one of the nicest rooms I’ve stayed in for the money.\n\nThe only thing at this very time that I can say that could’ve been better (unfortunately cannot be avoided because of construction) was the valet service. Now this is not a reflection on the staff of the valet, but just the overall availability of space to be able to pull your vehicle into valet in the first place, considering that , the front of the building off of 7th Ave is under complete construction. I had to circle around the building twice, which took me nearly 45 minutes until I was able to finally contact the hotel and have a valet attendant meet me out there. The service from them again was excellent, It was just the process that could’ve been better, I would assume that it will be better once the construction is no longer there.  My advice in the meantime is to make sure that you pull up to the hotel traveling eastbound on 47th St. this is where you will find the entrance to the hotel currently as well as the valet service.\n\nIf you choose not to use the valet service, my advice would be to research the multiple parking garages that are in the area. I use Google maps, for example and found multiple garages. However, there is one garage on 47th St. that was nearly the same price as it would have been for me to valet, which is ultimately what I did. The next time I go, I will look for the icon parking garages, which are all over the entire area and only a few blocks away for about half the price, if you don’t mind walking this is your best option and guess what you’re gonna be walking anyways so why not?\n\nOverall, this is a five star hotel and I know you will enjoy the day very much.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing new hotel","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"OTHER","rating":5,"text":"Very impressed with this new hotel. Staff were wonderful and very helpful. Door staff were amazing. This hotel is right at the north end of Times Square and central to many attractions. Looking forward to coming back.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Good location for Broadway shows","lang":"en","publishedDate":"2023-10-01","publishedPlatform":"OTHER","rating":5,"text":"We stayed for 2 nights, Friday and Saturday, to see Broadway plays and enjoy NY.  The location was excellent, we walked to our shows, to Grand Central and across the street to the Hershey Store.  The hotel was well staffed, which is unusual these days.  We were able to check our luggage with the bellman, as did many guests.  Lobby check-in was smooth and as a diamond Hilton member I was given credits that covered breakfast the next morning.  The dining area is casual, you place your order with attendant and pick up from counter when ready.  There is also prepared food such as yogurt, breakfast sandwiches, soft drinks.  The room was a 2 queen style.  As with all NYC rooms, there isn't much extra space but the room was set up comfortably and very clean.  The bathroom was large with a walk-in shower.  There was a water-bottle filling station in the hallway, but the water was not cold.  I would stay here again and recommend.  ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Thanks Bianca","lang":"en","publishedDate":"2023-10-01","publishedPlatform":"OTHER","rating":5,"text":"Thanks to Bianca on security at the elevator.  Stayed a week for NY Climate week and she always had a smile and kind word in the morning :)  Totally appreciated that!!  People make all the difference in an experience.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Theatre Fans","lang":"en","publishedDate":"2023-10-01","publishedPlatform":"MOBILE","rating":4,"text":"Fantastic location to Theaters, Time Square, and Port Authority. \n\nClean, modern, comfortable, and efficient use of space. Loved our view.\n\nStayed during a bit on construction around restaurant that obstructed view. \n\nVery kind staff. Would recommend.","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"My experience at tempo restaurant ","lang":"en","publishedDate":"2023-09-28","publishedPlatform":"OTHER","rating":5,"text":"Service was decent… fast and efficient. Food was very light and airy aka small and non existent. Very expensive for such small portions.. but it was decent.. chicken was a little undercooked but very flavorful.. 3.5 out of 5 stars….","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"My experience at Tempo ","lang":"en","publishedDate":"2023-09-28","publishedPlatform":"OTHER","rating":4,"text":"The restaurant was extremely elegant. The food was okay but the service was superb. I came with my family and the server, Nur, made sure to course our meals. He checked on us multiple times. I would refer my friends and family to this restaurant ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Beautiful Hotel, Great Location","lang":"en","publishedDate":"2023-09-28","publishedPlatform":"OTHER","rating":5,"text":"Beautiful, new hotel in great location. Rooms were clean, staff was friendly, and it is right in the heart of Times Square. An easy and safe walk from Broadway theaters. On site restaurant had nice variety and tasty food for breakfast. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing City Views & Exceptional Customer Service from Nicole","lang":"en","publishedDate":"2023-09-27","publishedPlatform":"OTHER","rating":5,"text":"Nicole at the front desk is incredible! She has THE best customer service, and she let me know about some of the cool features in my room, including the city view! I highly recommend this hotel, and I hope Nicole assists with your visit, she is awesome! ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":25364031,"title":"Perfect.. ","lang":"en","publishedDate":"2023-09-27","publishedPlatform":"OTHER","rating":5,"text":"I want Tempo by  Hilton to be my forever hotel. ❤️ I absolutely loved my security team. Bianca went above and beyond..  Every time we came in from our adventures in the city she  was  sure to check on us to see that we had a good day. I loved this hotel. Everything was fantastic. The room was so clean the staff made my vacation…when we were   out in the city we had the worst luck with the food and excursions. Everything was closed because of rain or construction - our tour guide was even in a car accident canceling our food tour in Chelsea - but whenever we came back to the hotel, everyone was sure to make sure we were happy, and all our needs were met… Bianca and Tee even celebrated my 50th birthday with me with a gift of the very best kind- chocolate.. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364031,"title":"TEMPO Hotel novo, limpo e bem localizado. ","lang":"pt","publishedDate":"2023-09-27","publishedPlatform":"OTHER","rating":5,"text":"NOVO, só o fato de ser um hotel recém inaugurado faz toda diferença, quarto incrível com uma vista sensacional da time square, elevadores extremamente rápidos, atendimento bom e cordial, para os brasileiros que se hospedarem procurem pela atendente KESSY, brasileira paranaense e super disposta a ajudar, deu altas dicas para não entrar em uma com transportes, alimentação, etc. A estadia com ela fez toda diferença. Limpeza OK, Blindagem de ruídos OK. Alimentação ótimo porem preço salgado. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Good hotel but needs some improvement ","lang":"en","publishedDate":"2023-09-26","publishedPlatform":"OTHER","rating":3,"text":"I have stayed two weeks at the hotel. The rooms are loaded with the latest features, though the rooms are small. The staff is friendly, especially the security, who make you feel welcome every time. \nI was not too fond of the breakfast options for the room's price. It should have at least a decent buffet menu, and I ran into multiple guests who didn't appreciate it either. The staff said they are trying a new takeaway concept. Not of my liking. Otherwise good location close to everything around it. ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Absolutely Incredible","lang":"en","publishedDate":"2023-09-25","publishedPlatform":"OTHER","rating":5,"text":"From start to finish, our stay was amazing. This was our first trip to New York, travelling from the UK, and I was so worried as I had read so many reviews on the accommodation in NYC. I can honestly say, this is the best hotel we have ever stayed in. \n\nThe staff were so friendly and attentive, the layout was fabulous and the whole place was spotlessly clean with modern decor. \n\nThe location is superb -  walk out of the main door and you are at the red stairs on Times Square. We were able to walk to Central Park, Empire State Building, the Financial Distract and even Brooklyn. The view from the room was breathtaking. \n\nThank you so much Tempo by Hilton for making our first trip to New York so memorable. We can not wait to return. \n\nJ&L Christie 09\/14\/23 - 09\/19\/23","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best doorman","lang":"en","publishedDate":"2023-09-23","publishedPlatform":"OTHER","rating":5,"text":"We had the best time at the Tempo- every detail was thought of and well executed- down to the nicest smiling face every afternoon from the doorman Marcelle. We thoroughly enjoyed our time! \nAlso, traveling as two women we felt very safe. ","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Geweldige locatie servicegericht personeel fijn verblijf midden in de stad","lang":"nl","publishedDate":"2023-09-22","publishedPlatform":"MOBILE","rating":4,"text":"Leuk hotel met zeer servicegericht personeel. Het is overigens heel schoon en goed georganiseerd tevens vindt ik het personeel heel erg vriendelijk.Er zijn moderne kamers wel wat aan de kleine kant maar er is buiten genoeg te doen. Als je dichtbij times square wilt zitten is dit hotel de beste keuze. Ik ga volgende keer weer hier blijven vanwege het personeel en de ligging. Er was wel een minpuntje het eten in het restaurant vond ik niet kwalitatief sterk en ook erg weinig keuze op de kaart. Maar dit hotel is echt een aanrader.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Exceptional Customer service and Beautiful Interior Designs\/Room","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":5,"text":"I must say from start to finish Grey was amazing. He is very knowledgeable of Hilton Brand and Tempo Times Square Property. He made sure my Family and I was well taken care of and had a nice room with a wonderful view. The bed was clean which was very important to us with having a new born. The room overall was clean. Quiet floor and just over all great stay. Van was very attentive with making great choices of sushi spots to go to. I enjoy every time I entered and exit the hotel BO demeanor and beautiful smile lit up the room. Thank you all and we will return. Again Grey and the rest of the Team God bless and much Prosperity.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo bar sets the mood","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":5,"text":"If you're staying at Tempo by Hamilton you must visit the bar in the lobby restaurant. Alex and Karina know how to make you feel at home I was only at the bar for a thirty minutes but I formed memories of a life time. They will converse with you as if they were life long friends of yours and serve the absolute best drinks one can have. 10\/10 I would come again.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"One amazing hotel on Time Square!","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":5,"text":"Everyone at this hotel were amazing! Thank you to Bianca in security to greet us everyday with a smile! The room was facing time square and had some amazing people watching!  The pillows and beds were so comfortable. Thank goodness for the darkening shades. I would highly recommend this hotel.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great New Hotel","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":5,"text":"Great new hotel. Very nice staff.  It’s right next to Times Square but on the north side.  Nice room setups and super attentive team and security.  Easy check in. Good restaurant. Would definitely stay again. ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Very good","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":4,"text":"Missing some snacks & drinks in the room as a four star hotel & some bathroom necessities as tooth paste, shower cape, slippers … \nService is good & stuff super cool \nBedding is super comfortable. \nView is nice.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best lemon martini","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is very modern. Staff is very hospitable and friendly. The bar has the best tenders. Alex and Kasandra are amazing. Bear lemon martini! We cannot wait to come back❤️❤️❤️❤️❤️💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing stay with the family!","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"OTHER","rating":5,"text":"I just want to take the time to acknowledge and appreciate my stay at Tempo.  I used my one free night, and when I looked it up online there was two  queens but when I called in, it was gone and the person attending the desk at the time told the agent I would likely have to pay the difference but would need to speak to the manager to confirm. The manager called back the Hilton agent noting they can upgrade me to the 2 queens room with no additional charge. I was super appreciative of this and my family very much impressed and loved the room.\nEvery single staff at Tempo were so kind and amazing. They showed true example of hospitality. I received a text right when I flew in to check in to see if we are good with our check in. I even texted them when we were running late. Valet were kind as well and we kept changing up our pick up time for valet too but they were super accommodating throughout. \nOnce we arrived, they acknowledged me as diamond which was nice. Again the staff for check in, the luggage storage, restaurant and valet all were nice and friendly to everyone.\nThe hotel is literally steps away from Times Square so the location is honestly great if you want to explore the times square area. \nThe only con I would say would be the price of breakfast as I find it a bit on the pricey side. While do I get $18.00  daily credit up to 2 people, it still barely covered the costs of what we ordered. I do appreciate the staff were able to make some of the meals vegetarian friendly as well but again did find it all more on the expensive side of things. \nOverall still would give it 5\/5 as everyone was so friendly and welcoming. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great quality service and professionalism ","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"OTHER","rating":5,"text":"This is an amazing place to go eat and relax. Great service, very professional, and the food is spectacular. If you ever decide to visit I suggest asking for the server Nur he is a wonderful person and made our dinner experience the best it could be. Not to mention the room and view of the hotel itself. It is a wonderful place to be if you ever want to visit New York, Tempo is the place to go for quality, comfort, and professional service. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo!It's the greatest!!","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"MOBILE","rating":5,"text":"I have never experienced such courteous staff in all my years of travel. Tempo staff, by far, exceeded any staff of any hotel that I have visited in the past 40 years. Service with a smile!100% best service ever!!!If you want luxury with great service, Tempo is the place for you!Five star rating for sure!!!","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing place and great service from Kessi on reception ","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"OTHER","rating":5,"text":"Absolutely surpassed our expectations. I booked two rooms for a business trip and needed some items printed out for an event we are hosting. Kessi in reception went above and beyond to help us and get the stuff printed. The rooms are beautiful, fresh and new. There is a lovely espresso machine, the bed is lovely and comfortable and my room has a view of Times Square. Amazing value for money. I will be coming here again and again. ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great hotel with a great location!","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"OTHER","rating":5,"text":"Perfect location for Times Square theatres.  Room wasn't large, but really well-appointed and comfortable. Nice, clean decor, and a great bathroom set-up!  Staff was terrific all around, but found Bianca and Jose extremely helpful and available.  Will be back to this hotel!","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing Experience","lang":"en","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"The Hotel is fairly new. Staff was very friendly, welcoming and helpful. The food I’m the lounge was great! I tried the watermelon Salad and OMG!!! Delicious! The bed was perfect. My honey has a tough time sleeping usually and slept like a baby. There was a concert outside on the side of the building every day during the weekend. If you’re looking for a great time and an atmosphere full of energy as soon as you step outside. I would definitely suggest Tempo. You can also pay $40 to be featured on the billboard that’s on the side of the building. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Good stay ","lang":"en","publishedDate":"2023-09-18","publishedPlatform":"OTHER","rating":5,"text":"Nice hotel, clean, friendly staff....no complaints. The only thing to know is if you have a car, there are no in and out privileges which kind of sucked for us.\n\nOther than that it was excellent. Oh also must know, the rooms start on like the 25th floor incase you're afraid of heights. I was supposed to be higher but asked them to change it because the 35th floor was not going to do it for me lol","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Bartender his name Jonathan from Highball","lang":"en","publishedDate":"2023-09-17","publishedPlatform":"OTHER","rating":4,"text":"When i going to HighBall, and got the cocktail was so amazing. Jonathan make the whisky sour so amazing. I love it!!! I will come back here and the service was so great all the staff so friendly. Thank you For Chris the guy stand in front the enterence Highball let me know about the Highball. ","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great oasis in Times Square","lang":"en","publishedDate":"2023-09-17","publishedPlatform":"OTHER","rating":5,"text":"We stayed for 4 nights in Sept 2023. This hotel became like an oasis in the middle of busy Manhattan.  The staff at the door was always welcomed us back after hours of walking, the darker, cool, quiet interior was a lovely break from the busy streets.  Bianca on security was fantastic, and the restaurant staff was always accommodating, especially Spencer who listened and always seemed to know exactly what we needed!  Thank you for a great stay. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Highly recommended, located, and appointed","lang":"en","publishedDate":"2023-09-15","publishedPlatform":"MOBILE","rating":5,"text":"Excellent location, nicely appointed rooms, and a very friendly and welcoming staff. A great place to stay either for business or travel. Nicole from reception was especially warm and friendly when checking in and that helped make my stay even better!","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Wonderful","lang":"en","publishedDate":"2023-09-14","publishedPlatform":"OTHER","rating":5,"text":"The hotel is new renovated and centrally located 2 minutes from times square near the famous red stairs. The room is big and it has also new and modern furniture. Despite the Location near times Square with closed windows it was quiet and I slept good. The bed was very comfortable. My recommendations for breakfast is the  Avocado - Toast with Sauce it is excellent& delicious. The staff is very friendly at the desk and at the breakfast. Good Services included such as opening the door for the elevator and the staff is always smiling. Henry, team member at the breakfast desk has given me great, heartly recommendations for rare Sightseeing trips such as brigthon beach and roosevelt island! Thank you!  The Tempo Hotel by Hilton, Times Square is wonderful!","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":25364031,"title":"Spectacular view  and Great location","lang":"en","publishedDate":"2023-09-13","publishedPlatform":"OTHER","rating":5,"text":"There is nothing Negative to say about the hotel . Everything is new , bed is super comfortable, bathroom is huge , we stay in room 3602 OMG the view of Time Square was amazing . Kudos for Norma she did our room 2317 then we move to 36 floor . Charleen from front fest was super helpful , professional . Antonio from outside and All the personal of the hotel were so friendly. I recommend if you need someone to pick you up from airport LG or take you to the airport call Gorge 917 335 9056 . Overall the hotel is spectacular and super clean. Only suggest the menu from the restaurant is poor no many options and very very expensive. 80$ for two hamburgers . ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Designed beautifully ","lang":"en","publishedDate":"2023-09-11","publishedPlatform":"MOBILE","rating":5,"text":"Wow - it’s rare to have such a wonderful and seamless stay in NYC but this was perfect. Stayed here for US Open as its convenient to both 7 train and MSG. It was a bit hard to find at first but we’ll worth it and pleasantly greeted every step of the way. Times Square is still an awful place to walk through but if you go east to Bryant park it’s much quieter. Having the lobby on 11th floor also helps keep non wanted guests out of lobby - there was lots of friendly security though\n\nRoom was excellent and brand new, nice shower, one push blackout drapes and comfy beds. No ESPN but I think that’s Spectrums fault\n\nIn the morning we got a very expensive breakfast in the lobby (delicious bluestone coffee) and if you’re Hilton Gold you can get credits for food. Plus they have a cold water refilling station which is plus for those hot days\n\nOnly recommendations - maybe more soundproofing in hallway, bigger baggage hold area as it was overflowing into hallway.","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":25364031,"title":"Best hotel in Times Square","lang":"en","publishedDate":"2023-09-10","publishedPlatform":"OTHER","rating":5,"text":"I came to New York for New York Fashion week! As a model I didn’t have time to enjoy most of the amenities, but check in was AMAZING with Shaeena. She immediately recognized me as a Hilton Gold Member and she was so so friendly. She informed me about everything and made the check in process smooth and easy. Even though my room wasn’t ready, she was still so amazing I didn’t mind the wait. On Sunday I called front desk and talked to Nicole. She was super chipper like me in the morning and ready to assist. As someone who is in the hospitality industry I’m extremely impressed! I will definitely be back! \n\nThanks again Shaeena and Tempo by Hilton for an amazing stay. \n\nBest,\n\nAlexandra Benjamin ","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Top Notch Service!","lang":"en","publishedDate":"2023-09-08","publishedPlatform":"OTHER","rating":5,"text":"From the moment I checked in, Andrew was the most accommodating person I've EVER experienced at a hotel. He helped my partner and me tremendously and ensured we had the best stay. He acknowledged my birthday and the fact that I was a Diamond Hilton member. From there, Shy continued with the great service! Everything was top tier in the hotel. The view is AMAZING. The location is AMAZING. The service, you've guessed it, is AMAZING. My only compliant is there are no microwaves on property. I've stayed in hotels that didn't have microwaves in the room, but they would have them elsewhere in the hotels. This one didn't. I'm not taking off a star for it though because literally the experience was top tier. I am already looking to book again for my partner's birthday in October. \n\nTrust me when I say, you should definitely stay here. Even the security gave great service. (Shoutout to Bianca) I'm pregnant and I was able to walk to and from everything I wanted to experience. The associates at this hotel made my birthday weekend absolutely amazing. I am very appreciative of them, their attentiveness, great service, and suggestions. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"great","lang":"en","publishedDate":"2023-09-07","publishedPlatform":"OTHER","rating":5,"text":"my server andrew was great he recommended the best plates very friendly and professional i couldn’t ask for a better service the hotel is great brand new and great view the beds are really comfortable and the hotel is very technical ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Amazing","lang":"en","publishedDate":"2023-09-07","publishedPlatform":"OTHER","rating":5,"text":"The best hotel in Times Square. Brand new extremely clean. Laura she’s amazing great service also bilingual and very friendly very professional had a great time. I couldn’t ask for better service. Thank you so much. Highly recommend ","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"A new experience in Times Square","lang":"en","publishedDate":"2023-09-05","publishedPlatform":"MOBILE","rating":5,"text":"Hello we had an amazing time at this hotel. It’s new, clean and have the best views of Time Square.  The bell staff is polite and willing to assist in anyway.  I loved security Bianca stood out the most.  Always greeted with a smile.  The front desk staff were amazing especially (Shy). She went over and beyond to make sure our experience was wonderful. And Taj was the nicest I ever met.  She made sure ever need was met as well.  Destiny and Adam were front desk managers and they also looked into small issues and handled them fairly.  Which makes for a great foundation on a startup business. I also wanted to point out a wonderful person that served me breakfast in the morning. Bibi was the nicest light to have come into contact with in the morning.  She went over and beyond to make sure we had a great experience and we did.  We many things could have gone wrong with a new hotel, it was nice to have had an opportunity to see what was the nicest staff in the hospitality business.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great Hotel Choice!","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":5,"text":"Great customer service! Staff are very knowledgeable about the area and offer great recommendations. The hotel is directly in Time Square. Therefore, the views from the hotel are amazing. Time Square lights are bright. Thankfully, the hotel has shades to keep the light out when sleeping. The pillows are fluffy. The bathrooms come with Bluetooth. They have smart TVs. This was a great hotel choice.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Can’t wait to return!","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":5,"text":"Me and my friend stayed at the Tempo for three nights this week. From the moment we arrived to the moment we left, the service was impeccable! Bianca in security was especially great, welcoming us with a friendly face every time we came back. The hotel is right in the middle of Times Square, making it super easy to find. The rooms were beautiful, modern, and clean. I can’t wait to come back! ","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Awesome hotel","lang":"en","publishedDate":"2023-09-03","publishedPlatform":"OTHER","rating":5,"text":"Beautiful hotel & great service provided especially by Bibi at the restaurant! 😊 It’s literally in the heart of Times Square with walking distance to everything, includes mass transit! I would definitely stay again!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364031,"title":"Dino is amazing!!! ","lang":"en","publishedDate":"2023-09-03","publishedPlatform":"OTHER","rating":5,"text":"This was our first time at Tempo, and the staff is amazing. Dino at the front went above and beyond to help our driver locate us at pick up. He has exceptional customer service skills and he was so friendly and knowledgeable about the Tempo property. It was a pleasure meeting him and we hope to see him when we return. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Rockstar service at the Tempo","lang":"en","publishedDate":"2023-09-02","publishedPlatform":"OTHER","rating":5,"text":"Krizia was a rockstar!  Thank you for providing great service!   We had breakfast and lunch at the hotel restaurant and she went out of her way to ensure that we had everything that we needed.  She was also very knowledgeable on the local events going on! ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Sterling Experience","lang":"en","publishedDate":"2023-09-02","publishedPlatform":"OTHER","rating":5,"text":"Hotel is stylish, room comfortable, and the staff is very friendly and helpful.  Breakfast is easy and seating area accomodated eight of us easily.  I Would definitely return again with thenfamily in the future.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo Hilton","lang":"en","publishedDate":"2023-09-02","publishedPlatform":"OTHER","rating":5,"text":"My spouse and I stayed at the Tempo by Hilton for the first time, and it was the best experience ever. The hotel was super nice and the staff was superb. I have never experienced a hotel stay as grand as this.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"1000x Beyond Our Expectations!","lang":"en","publishedDate":"2023-09-02","publishedPlatform":"MOBILE","rating":5,"text":"From the moment you step into the Tempo, the hospitality is 5 stars!\nThe friendliness and kindness by all the staff is beyond our expectations. From Henri, to Bono, to Krista in the Coffee Bar they made our experience 1000x delightful!  Experience it for yourself!","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Great location but lobby ambience poor","lang":"en","publishedDate":"2023-09-01","publishedPlatform":"MOBILE","rating":4,"text":"Arrived at this new hotel covered in scaffolding . Entry is on the ground floor which is like entering via a basement garage . Lifts take you to the lobby which is small and lacks ambience - but the location in Times Square with floor to ceiling windows is spectacular . It’s close to everything and even at 5am looking out of the window there is so much to see . \n\nWe choose a room with a peloton - the room was small but that’s typical for the area . \n\nThe concierge couldn’t answer any tourist questions saying the hotel was new so no one would be able to help -  I was only asking how to get to the train station .\n\nFor the location though I would stay again . The lifts are super quick !","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"OK","lang":"en","publishedDate":"2023-08-31","publishedPlatform":"MOBILE","rating":4,"text":"So it’s brand new which is great. Rooms are minuscule super small.\n\nOne feels like being in a cubicle.\n\nLocation is very good, it has not fully opened yet.\n\nAnything extra expected from the front desk or manager is not met, which is strange being a new hotel. Be it bigger size room or late check out specially when hotel is not sold out.\n\nWill I come back- maybe no as other hotels are there giving same or better stuff as well.","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Home away from Home","lang":"en","publishedDate":"2023-08-30","publishedPlatform":"OTHER","rating":5,"text":"The hotel room was extremely comfortable with a million dollar view!  Request a ball drop corner room!  The staff was so friendly and accommodating. Taj went out of her way for us and was extremely helpful.  Security was impeccable.  We look forward to staying at this property again in January.  When in New York City, this will always be our home away from home.\nThank you Tempo and staff!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"New York - New Hotel!","lang":"en","publishedDate":"2023-08-30","publishedPlatform":"MOBILE","rating":5,"text":"Location is ideal, being right by Times Square. \n\nService could not have better in all aspects! Especially loved local stories shared by bartenders Alex and Karina.  Highly recommend this new hotel.\n \nBreakfast was very creative and offered all you needed.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"GREAT STAY","lang":"en","publishedDate":"2023-08-29","publishedPlatform":"OTHER","rating":5,"text":"This place couldnt have been more impressive- we came for the US Open and are staying 6 nites- every interaction with the staff is excellent - they are clearly working hard to create a good atmosphere.  The room was great, the logistics (breakfast, elevators, access to subways, etc) were easy - just a perfect place to stay.  It also felt very safe with staff\/ security at the entrance and in the lobby.  We ate dinner at Highball restaurant tonite and it was great food and great service by Karina, Alex and Kevin.  We will be back.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Pre-wedding celebratory dinner","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":5,"text":"Amazing food, and amazing service. Spencer was wonderful throughout our experience. The watermelon salad and chef Kit’s chocolate desert were delightful. The perfect way to celebrate with drinks and great food. Can’t wait to come back. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"The watermelon salad was more than worth it.","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":5,"text":"Best service in town. Great food. Will be back soon. If you need a place to eat in time square I suggest this spot. My wife and I were celebrating our marriage and we were thrilled with our decision to celebrate here. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Everything is new","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":5,"text":"Im very picky when entering into a room, when I walked into my room, I fall in love, everything is new, so perfect, my daughter loved everything in the restroom and my husband the blinds. The staff nice! I didn’t enjoy the bar that much because too dark for being in a time square hotel y Nyc, the view from the lobby it’s perfect, I think the should take advantage of the location at their bar restaurant. Beside that, staff nice and when we left at 3 am for our flight, Juan who was downstairs, was very nice and helpful. Definitely the right hotel! ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"The place to be. ","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"OTHER","rating":5,"text":"This is a nice hotel! Brand new everything. The rooms are small but have everything you need with some excellent views of Times Square. The bed was comfortable and it was quiet — no issues sleeping.\nOn-site bar was excellent, Alex makes the BEST mojitos ever. Jada.Hostess was such a pleasure to talk to heart warming, well educated. A true kind hearted individual. People like Jada and Alex it’s what truly makes this hotel a place to come back. \n\nThank you guys😊","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Nice new hotel!","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"MOBILE","rating":5,"text":"This is a nice hotel! Brand new everything. The rooms are small but have everything you need with some excellent views of Times Square. The bed was comfortable and it was quiet — no issues sleeping. It is right in Times Square so that can be good or bad — it is a busy area! So close to everything but also crowded a bit. Overall a nice stay at a new and techy hotel.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":25364031,"title":"My new \"Go To\" in NYC","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":5,"text":"I’ll start by saying that I’m an Honors Diamond Member, have traveled extensively, and don’t have the time to post reviews for all the properties I stay at. I reserve the reviews for the really good or really bad experiences.  This is one of the really good experiences.  Not even good… legitimately perfect.  I am unable to find one single fault with my 4 night stay.  The hotel is brand new, only open 2 weeks, and the rooms and public areas and accommodations are spotless and well appointed.  The rooms (by NYC standards) are fairly spacious, offer motorized shades, wireless phone chargers, rain showers, bluetooth speakers, etc.  The bed was more comfortable than any Hilton property I've stayed in, granted I was probably the first or second person to ever have slept in it.  One of the biggest complaints of travelers staying in larger city hotels is the wait for an elevator.  This hotel has 3 from the street level to the lobby (11th floor) and another 5 or 6 that go to guest floors.  I never waited more than 20-30 seconds for an elevator.  If anything, they're too fast.. by the time you get to them the doors are closing... This needs to be improved but is a small tweak.  The biggest strength of this property is not the public areas or accommodations, it's the staff... The words \"no\" or \"maybe\" are not in their vocabulary, the answer was \"absolutely\" or \"my pleasure\" to any and every request I had.  I'd recognize the shining stars, but to be honest, I literally did not come across an employee who was not friendly or helpful.  The only area for improvement would be the restaurant... Everything I had was outstanding, but the menu was extremely limited and room service was not offered.  Bottom line... Great property and I'll choose it every time I get the opportunity.","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":25364031,"title":"Great hotel, made even better with the AMAZING staff","lang":"en","publishedDate":"2023-08-20","publishedPlatform":"MOBILE","rating":5,"text":"My boyfriend and I stayed at the Tempo by Hilton for our first New York trip together.\n\nWe could not have asked for more in terms of the level of accommodations provided to us at Tempo! Specifically we want to thank the front desk manager, Destiny who went out of her way and above and beyond to make our stay as pleasant and smooth as possible. Tammy and Dino, with their warm and friendly energies also made us feel very welcome :)\n\nThe rooms were small but comfortable, luxurious and clean. The hotel location is prime, and were greeted warmly by the hotel staff each and every day.\n\nDespite being a brand new hotel, the hotel staff proved to be knowledgable, and above all else, incredibly hospitable in the way they value their guests, especially DESTINY - she's amazing!\n\nWe'd gladly recommend Tempo to friends, families and curious strangers who read this review :)","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":25364031,"title":"Tempo Love","lang":"en","publishedDate":"2023-08-19","publishedPlatform":"MOBILE","rating":5,"text":"Greatly enjoyed our stay at this brand new, beautiful and modern hotel. Rooms were well appointed and sustainable. We love being close to Times Square and were  just a half block away, but could happily daily retreat to a peaceful room after the city hustle and bustle. Check in was friendly and welcoming. Super hero Dino Hernandez, valet services, helped our late arriving daughter safely navigate the nightly 47th street construction closure and rescued her and her car! Those superior customer services were truly appreciated. We are making Tempo “our” NYC hotel choice going forward!","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":25364031,"title":"Upscale hotel in the heart of Times Square with amazing friendly service","lang":"en","publishedDate":"2023-08-19","publishedPlatform":"OTHER","rating":5,"text":"Our stay at the Tempo by Hilton was absolutely wonderful. We were looking for a Hilton brand hotel which offered two queen beds within walking distance of the Broadway theaters, and we were thrilled to find this brand new hotel. Beautiful and quality furnishings, with an international and luxury feel, and a friendly greeting from every single hotel staff member we encountered. We were a little worried about the street noise since the hotel is located right in the heart of Times Square, but we really didn't hear very  much from outside. The elevators were FAST, and the fitness center is outfitted with very nice equipment (including Peloton bikes). The queen beds did not appear to be the full 60 inches standard width to us, but we slept just fine. The only complaint we have is the costly parking rate: valet parking only, $85 daily rate for a sedan, $95 daily rate for an SUV.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":25364031,"title":"Perfect place to stay in Time Square, with excellent service.","lang":"en","publishedDate":"2023-08-16","publishedPlatform":"MOBILE","rating":5,"text":"So this hotel has only been open for one week, and it is officially my new favorite hotel in NYC. I had no idea it was the former Doubletree Time Square until I arrived. So if you want Time Square access, it doesn’t get any better! They completed a $2 billion reno and it shows. The rooms are much more European in their feel (very modern, small, and efficient) but they have everything you need including a small refrigerator and coffee machine. The mattress and bedding are high quality, and I loved the different pillow options included on the bed. The towels were super plush - I’d love some of these at home. The rain shower and detachable wand worked great, and great water pressure and temperature. The lighting made it easy to work, and I loved the “relax” option for more subtle lighting in the evening. The shades and drapes are automatic - I used both given the lights from Time Square pouring in. Interestingly, there was not much street noise, which was great. I had a room on the 25th and 17th floor (I extended my stay) and they had the same layout.\n\nWhat impressed me the most was the level of service that I received EVERYWHERE in the hotel. From the gentlemen at the check in, to the folks in the restaurant, to the security staff, to the ladies who checked me out, to the bellman at the door, everyone was genuinely kind and seemed to care about the quality of my stay. When I checked out the 2nd time, they helped me pack my pizza (John’s on 44th never fails!), found more of the Bluestone Lane drinks I fell in love with to take home, and arranged for my transportation to the airport. Every single person smiled - I travel a crap ton, so a smile means everything to me; and everyone delivered. The only small mishap was in the restaurant - I ordered the pork belly and it was not hot when it arrived. The server apologized, took the plate and returned with a new plate of perfectly cooked pork belly - and it was DELICIOUS! Again, the server clearly cared about my meal and my experience. \n\nThe entrance is actually on 47th right now, as they are completing the Broadway entrance. I received a text to let me know that just prior to my arrival, which was nice. \n\nIn short, for the location, the service, and the quality of the room\/hotel amenities, this will remain where I choose to stay when I’m in the City! Now… if they had a hot Doubletree chocolate chip cookie… Lol!","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":25364031,"title":"Excellence in every way, so enjoyable!","lang":"en","publishedDate":"2023-08-14","publishedPlatform":"MOBILE","rating":5,"text":"We enjoyed everything about our stay.  Before we arrived we received a text asking if we had any requests prior to our arrival.  A extra step of the wonderful hospitality we enjoyed. It’s a brand new hotel in the middle of Times Square, Manhattan, NYC.  The room was beautiful, comfortable and clean and a good size for the location.  Everyone was a delight, the bed was one of the most comfortable one I’ve ever sleep on, the shower  and amenities were equally wonderful.  A shout out to the front desk team for being some welcoming to us.  Great view of the city.  We enjoyed everything about our stay at the new Tempo by Hilton Hotel - will definitely return!","travelDate":"2023-08","tripType":"COUPLES"}
