{"helpfulVotes":0,"locationId":23719753,"title":"Achtung ABZOCKE","lang":"de","publishedDate":"2024-04-13","publishedPlatform":"OTHER","rating":1,"text":"ACHTUNG ABZOCKE !!! Auf keinen Fall buchen!!!\nHaben letztes Jahr im Juli gebucht (mit kostenloser Stornierung über booking) ,das hotel hat sofort die Kreditkarte belastet.\n6 Wochen vor Reisebeginn hat das Hotel das Zimmer storniert. Warum weiß keiner. Infos bekommt man nicht. Booking macht gar nichts. Geld bis heute nicht zurück bekommen!!!!\nDas hotel habe ich bereits mehrfach per Mail über verschiedene Plattformen angeschrieben: nichts. Keine Reaktion.\nWir werden nun einen Rechtsanwalt einschalten.\nMussten nun 1000 Euro pro Zimmer im anderen Hotel mehr bezahlen weil 4 Wochen vor Reisebeginn.... Danke für nichts.","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Ohne Gründe storniert und noch kein Geld zurück","lang":"de","publishedDate":"2024-04-13","publishedPlatform":"OTHER","rating":1,"text":"Wir haben für Juni 2 Zimmer gebucht, im August 2023, über Reisebüro und Booking.com, jetzt wurde vom Hotel storniert ohne Begründung, uns wurde der Gesamtbetrag der 2 Zimmer kurz nach Buchung vom Hotel auf der Kreditkarte belastet und abgebucht, obwohl wir kostenlose Stornierung haben, wir haben noch kein Geld zurück, wir haben Mail an Hotel und Booking.com geschrieben, keine Reaktion","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"They will not refund! Don’t book!!","lang":"en","publishedDate":"2024-04-12","publishedPlatform":"OTHER","rating":1,"text":"If there’s a chance you may cancel do NOT book!!! As I have since realised I have the same refund problem as may others. Booked with free cancellation, money was taken within 24hrs, nearly a month after cancelling I am still waiting for my money back. I have contacted the hotel and been fobbed off, like many,  with the backlog excuse. How about change your policy to pay at property if you are unable to issue people their money back! Absolutely disgusting!","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23719753,"title":"Booked, but cancelled due to health reasons","lang":"en","publishedDate":"2024-04-11","publishedPlatform":"OTHER","rating":1,"text":"Travelling from Australia and booked our holiday in good faith in Nov 23 (with booking.com) - 9 nights in total for Apr 24, with the understanding that we could cancel if needed. Unfortunately we had to cancel our booking due to health issues.\nCancelled 03\/03\/24, but to date no refund….several attempts to contact have been met with no response. Out of pocket AUD4,000 which is causing unnecessary stress.\nHas anyone had any success in getting their refunds??? Or are there any other means of taking further action???","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Great City Views from Comfy Window Seats","lang":"en","publishedDate":"2024-04-09","publishedPlatform":"OTHER","rating":5,"text":"I chose this hotel because I wanted a nice room with good views.  This hotel met and exceeded my expectations.  I was concerned about the many bad reviews here.  However, while it would be nice if they fixed some of the cracked tiles and scuffs here and there, this is not a reason to “tank” a review for this hotel.  I also want to say to all those who are upset about the initial fee they put on a credit card.  This is common practice, and they do actually refund your credit card.  Secondly, if you give a bad review of this hotel due to a refund or transactional issue, please check back.  The hotel staff actually reads and replies to these reviews and offers genuine attempts to help.  In the end, this is a nice hotel, in a convenient location and it offers fantastic city views that you can enjoy from a comfy window seat.  This has now become my favorite hotel in NYC!","travelDate":"2024-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23719753,"title":"Price-performance ratio fantastic!","lang":"de","publishedDate":"2024-04-08","publishedPlatform":"OTHER","rating":5,"text":"Unfortunately, all the bad reviews here only refer to the fact that these people canceled the hotel and didn't get a refund! It's a shame about the overall picture, because the hotel is fantastic!\nIn the Financial District, in the middle of Wall Street with the best view of the One World Trade Center! The hotel had a water dispenser, which isn't common everywhere, and the reception staff were very friendly and helpful the whole week!\nWhether you're in Uptown, Midtown or Brooklyn, you can get anywhere very quickly from here using the metro! From the airport (JFK), it's best to take the Airtrain to a metro station, then you can get directly to the hotel for €2.90 in around 45 minutes!\n\nIf I'm in NY again, I'll 100% come back to this hotel, highly recommended!","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23719753,"title":"Refused to refund booking canceled within free cancellation window","lang":"en","publishedDate":"2024-04-06","publishedPlatform":"MOBILE","rating":1,"text":"I didn’t end up staying at this hotel but I had a reservation for a week which I canceled and never received a refund .\nI was immediately charged upon the free-cancellation booking.  I have canceled my reservation during the free cancelation window and according to the terms I should have received a refund within 14 days.\nAfter 2 weeks I sent the hotel an email about it and never received a reply.\nI then contacted booking.com which is what I used to place the booking and booking.com representative had contacted them again promising me a refund within 5 days.\nAnother week passed by and still no refund or any acknowledgment from the hotel.\nThis place is a scam be aware.","travelDate":"2024-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23719753,"title":"Great hotel in the financial district","lang":"es","publishedDate":"2024-04-06","publishedPlatform":"MOBILE","rating":4,"text":"Hotel well located in the financial district of NY, 1 minute from the 9\/11 memorial and a few minutes from different subway lines. Spacious and clean room, with a fairly clean bathroom as well. To highlight the bed, very large and comfortable. Also note that there are no hidden fees when booking through Booking. They have luggage storage service for only $2 per suitcase. One thing to improve would be that they do not offer breakfast service.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Refund not yet received","lang":"it","publishedDate":"2024-04-04","publishedPlatform":"OTHER","rating":1,"text":"I booked through booking com free cancellation. I was charged the full amount and never received a refund. If I try to write to their email address it tells me it is not valid. Please is there a valid email address to make a complaint to??","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"No complains here. Would stay again","lang":"en","publishedDate":"2024-04-04","publishedPlatform":"MOBILE","rating":5,"text":"While I got a bit of a shock when the payment for our stay was taken upon booking as when booking through booking.com it states payment made at hotel, it wasn't a major deal for us. \nFound contact through the booking.com messaging system prompt but not very helpful as one of my queries in advance of going was if there was a fridge in the room which I was told there wouldn't be..... for us to arrive and be pleasantly surprised that there was a fridge (travelled with a toddler so made our life alot easier) \nCouldn't fault hotel, was clean and very comfortable, staff were helpful and nice. Rooms were cleaned daily and everything was replaced with new products as needed. We needed extra pillows and within 10 mins of ringing guest services, we had received them up to our room. \nNo breakfast facilities at the hotel, but there are a number of places near by. \nHotel is in a great location..... overlooks the 911 memorial, short walk to battery Park, oculus, China Town, Wall Street etc etc. \nLoads of subway stations within a short walk of the hotel too so handy to get to anywhere u could want in NYC. \nI have read other reviews prior to going and was worried about our upcoming stay but honestly, I worried for nothing. I saw the scuff marks around the hotel that ppl had mentioned but nothing a touch up of paint wouldn't fix, wouldn't be something that would bother us. As I gave the same credit card to preauthorise a deposit as my payment was taken from, nothing was held, or if it was, it was released same day as check out. We were in room 1806, and it overlooked the 911 memorial. Photos of room attached to review. There was a shower in our room to the left of the sink when u walked into the bathroom. \nOverall would stay here again, safe and good location, travelled as a family and was out at all hours, early morning, late in evening\/night. ","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23719753,"title":"The ABSOLUTE SCAM hotel that does not refund you for a cancellation make by them - DO NOT BOOK","lang":"en","publishedDate":"2024-04-04","publishedPlatform":"OTHER","rating":1,"text":"I made a booking in early February via Booking.com and a payment of over 1,200 $ was confirmed by them. The hotel cancelled it with no explanation at the end of February. I have sent numerous emails to them and to Booking.com to arrange the refund and I still have not received my money back. Legal proceedings are now in place.\n\nThe absolute scam hotel - avoid booking at all costs - they take your money, then cancel your booking, and do not give you a refund.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"Cancellation Problems","lang":"en","publishedDate":"2024-04-03","publishedPlatform":"OTHER","rating":1,"text":"Not sure if it has been fixed as they have claimed, but I never received a refund for my cancellation that what was done 8 months in advance.  Surprised that I was actually pre-charged for the entire stay in the first place, but really annoyed I was never refunded and emails sent to the email address they have went unanswered. Luckily Chase promptly refunded me after I disputed","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"BRING YOUR OWN TOILET PAPER!!!","lang":"en","publishedDate":"2024-04-03","publishedPlatform":"OTHER","rating":1,"text":"The bathroom was not re-stocked with toilet paper, resulting in a very undignified use of my hand to clean my back side.\n \nI tried to call down to the front desk about 10 times, using the phone in the room and my personal cell phone, but no one would answer.\n \nAfter about 20-30 minutes I decided my only option was to come down to the front desk, to get the toilet paper. What I found was a desk clerk capable of answering the phone, but refused to do so because she told me she was not the phone operator.\n\nI contacted Randy Pagan - GUEST SERVICES SPECIALIST at The Washington Hotel\n\nHe did not reply to my email which contained the same information as above.","travelDate":"2024-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Great experience, friendly staff and amazing view.","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":4,"text":"We had a great experience at this hotel, staff were super helpful and polite. Our room was huge, with a corner window providing a great view. The location was ideal for us, away from the hustle and bustle and a subway station just round the corner. My only complaint would be there was no coffee making facilities but there is a Starbucks just round the corner. Would definitely stay here again, it was excellent value for money.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"FRAUD","lang":"it","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":1,"text":"Reservation made with advance and non-refundable payment.\nAfter payment, after two weeks, the hotel canceled the reservation in its discrimination without any reason.\nAlthough the cancellation was carried out by the structure itself, I am still waiting for a refund.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Warning about this hotel - money gone","lang":"de","publishedDate":"2024-03-29","publishedPlatform":"OTHER","rating":1,"text":"Attention!!! Rooms were booked through Booking.com for November 2024 with free cancellation! Money was debited immediately and we then canceled the room and booked a cheaper room in the same hotel! Here, too, the money was debited immediately. The money for the first room has still not been refunded to this day, after months and countless attempts to contact them! The cases are piling up on Google. Yesterday, the hotel sent an email canceling the second room. Here, too, dozens of others had the same experience! Over 4,000 euros are gone and it seems to be a scam! Booking.com does not respond and is still offering the hotel!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Hotel that scams customers","lang":"es","publishedDate":"2024-03-29","publishedPlatform":"OTHER","rating":1,"text":"I booked through booking at the end of January 24 for a stay in July 24; The amount is charged immediately, they have 15 days to return if you cancel (free cancellation). Two months have passed and I am still fighting with Booking (it seems that they will refund the amount) because the hotel ignores me. They scam customers who cancel their reservation. They tell you that they have problems with returns (it's one click to process a chargeback) and they go back and forth until they stop responding to emails. If you do not cancel the reservation you can read other reservations in which you will see that you will find unpleasant surprises. Painful.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"TO FLEE!!!!!!!!!!!!!!!!!!!!!!!!!!! THIEVES!!!!!!!!","lang":"fr","publishedDate":"2024-03-20","publishedPlatform":"OTHER","rating":1,"text":"I have to give one star (too bad, I couldn't rate it negatively)!!! I had to cancel my reservation last December, for a trip planned for next July (reservation with free cancellation option). It's March, I'm still waiting for the refund! However, they know how to be quick when it comes to cashing out! To flee!!! Really!! I never leave reviews in general, but in this case, I couldn't do otherwise! I don't understand why this hotel is still on online booking sites! If my message can help at least one person and prevent them from losing an astronomical amount of money, that's always winning..","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23719753,"title":"Unresolved refund nightmare at The Washington by LuxUrban: DO NOT BOOK THIS HOTEL!","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"OTHER","rating":1,"text":"I am having an incredibly disappointing experience with The Washington by LuxUrban, Trademark Collection by Wyndham, which has failed to refund $1,222.41 for a cancelled booking on Booking.com since December 1st, 2023. Despite their free cancellation policy, and over a month passing, I've received neither my money back nor a satisfactory explanation.\n\nDisturbingly, online reviews reveal I'm not alone—DOZENS of guests report similar refund issues, hinting at possibly deceptive practices. This situation isn't just about the delay; it's about the lack of respect for customers and fraudulent behavior.\n\nI advise potential guests to think twice before booking with this hotel. A company that doesn't prioritize customer service and integrity doesn't deserve your business.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"Refund issues","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"MOBILE","rating":1,"text":"I experienced the same issue as everyone else. I cancelled my booking within the free cancellation period, attempted to contact the hotel regarding the refund, but received no replies. In the end, I had to dispute the charge with my credit card company; it was the only way to get my money back.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23719753,"title":"Hotel with old mattress and poor service","lang":"pt","publishedDate":"2024-03-08","publishedPlatform":"MOBILE","rating":2,"text":"This hotel only has location. Horrible service, no restaurant, no breakfast, old mattress, soft and impossible to sleep on. The noise in the hallway is deafening. At reception the staff are rude, rude and impatient.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Lack of compliance with the commitments offered to the client.","lang":"es","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":1,"text":"The Hotel is good, however they do not comply with what was offered, I traveled for the month of December 2023 and the reservation had been made since June 2023 where breakfast was included in the canceled rate, however when I arrive on 12\/21\/2023 The hotel gave me information about the services and it indicated that the breakfast service had been discontinued, for which a disbursement of 8 USD per day per person would be made for the total number of days in which the service was applicable, however at the date the disbursement of this amount has not been made, the hotel does not fulfill its promise.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Attention: No refunds will be made in case of cancellations","lang":"de","publishedDate":"2024-03-06","publishedPlatform":"OTHER","rating":1,"text":"The hotel does not refund the money for free cancellations, although according to Booking.com this should be done within 14 days. There is no response to emails. As you can see from the reviews, this is not an isolated case and for me a strong sign of impending insolvency.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Still not refunded 1 month after cancellation","lang":"fr","publishedDate":"2024-03-06","publishedPlatform":"OTHER","rating":1,"text":"I made a reservation on January 29th and canceled it the same day since my plans had changed. I have been waiting for a refund for over a month now. I called the hotel and contacted refunds@luxurbanhotels.com who responded on February 22 and nothing since then when I contacted them again on March 4.\n\nThe treatment of customers is absolutely scandalous, especially when you know that the sums involved are high. Apparently I'm not the only one to have been treated like this which is even worse.\n\nOf all the hotels I have visited in my life, I have never had this kind of problem.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23719753,"title":"Dubious hotel that does not refund money","lang":"de","publishedDate":"2024-03-05","publishedPlatform":"MOBILE","rating":1,"text":"Worst customer service ever. Immediately after booking through Booking, the room price is debited from the credit card, $1800 10 months before arrival! I canceled the room free of charge through Booking because I found a cheaper room in the same hotel. The amount was debited immediately there too. My cancellation was on January 17th! So it has been almost 2 months and I still haven't got my money back. I wrote at least 5 emails setting deadlines and received a single reply at the beginning of February. It said the refund was in process and I didn't need to worry. That was a month ago and after further complaints by email I haven't received any more replies. Now I've submitted the case to my credit card provider. Unbelievable. I've never experienced anything like this before, absolutely dubious hotel!","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23719753,"title":"A disgrace of a Hotel","lang":"it","publishedDate":"2024-03-03","publishedPlatform":"MOBILE","rating":1,"text":"If you are not sure about staying there DO NOT BOOK THROUGH BOOKING or any other platform. Free cancellation is only indicated, but in fact if you don't open a complaint on booking the hotel doesn't care and won't refund your money. The negligence of this hotel is truly incredible. Instead, I applaud the booking assistance which, after about ten days from my complaint (made almost a month after the failure to refund) managed to get my money back.\nChange hotel. There are many in NYC.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"WORST CUSTOMER SERVICE EVER","lang":"en","publishedDate":"2024-03-01","publishedPlatform":"OTHER","rating":1,"text":"This hotel is a scam. They take your money, and if you opt for free cancellation, they refuse to refund it. Reviews everywhere indicate that delayed refunds are a common issue. They throw around a 14-30 business day promise, and when that's up, it's always some new excuse like a backlog. No surprise there's a backlog – they've pocketed money from countless customers. Emailing refunds@luxurbanhotels.com only gets you vague responses. It's been over 40 business days, and this hotel owes me $1800 USD\n\nIs there anyone here who actually did receive a refund ? Please let me know ! because after reading the reviews here it looks like people are just waiting!\n\n(PS. I made the booking in Dec- fully refundable. Canceled it in January. And still waiting for the refund)","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":23719753,"title":"Sorry customer service","lang":"en","publishedDate":"2024-03-01","publishedPlatform":"OTHER","rating":1,"text":"I had free cancellation and canceled a month before my stay due to personal issues and never received my refund. I waited over the 14 as stated per their policy to receive my refund and did not, therefore I called. I was told that I must email their refund department which I did. Their response was they’re backlogged and they’ll get to me when they can. That is unacceptable when they took my $600 as soon as I booked. I understand that I had to wait 14 days for my refund. However, we are hitting a month at this point. This is not how you conduct business or good customer service with a response like that. I will be sure to never book with them again.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Beware of immediate debit!!!!","lang":"it","publishedDate":"2024-03-01","publishedPlatform":"OTHER","rating":1,"text":"I made a reservation through booking.com and was immediately charged the full amount on my credit card. I later canceled the reservation but I still have not received any message regarding the refund, as expected in the confirmation. I didn't even receive a response to the messages and emails I sent. Be careful ⚠️","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Failure to refund","lang":"it","publishedDate":"2024-02-29","publishedPlatform":"MOBILE","rating":1,"text":"I booked through booking with free cancellation.\nThey withheld the entire amount immediately and since I canceled the reservation I am still waiting for the refund (a month has passed!!!), despite having also reported the matter via email and telephone to the hotel.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"I was cheated","lang":"en","publishedDate":"2024-02-26","publishedPlatform":"OTHER","rating":1,"text":"It supposed to be the best hotel to stay with my family and it turned out to be the worst. I had Manet calculated for the 2 week stay in NY . Not only did they took the money earlier than I expected ( via booking) they also took the deposit of 300$ and I was told that money would return within 2 days. 2 weeks has passed and I have no money back. My family had to restrict the budget , my daughter were to by some souvenirs and I could not afford what I wanted , they spoiled my stay. I regret to spend money on them. I could have visited more places in NY instead of staying there for 1 night. I just wanted to show my kids NY at night. \nI DO NOT RECOMMEND!!!!!!!!! STAY AWAY from them","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23719753,"title":"Absolute nightmare - DO NOT BOOK WITH THEM","lang":"en","publishedDate":"2024-02-24","publishedPlatform":"MOBILE","rating":1,"text":"Absolute cowboys. DO NOT BOOK WITH THEM IF YOU MIGHT CANCEL YOUR BOOKING. I had the free cancellation option. I canceled after 3 weeks because they never answer any emails\/messages\/phone calls and I had some questions to ask. \nThey took $ 2,000+ from my credit card after 24 hours, then never refunded me when I canceled. Dozens of emails, calls and messages never answered, lots of promises and never a penny refunded after more than a month. They are simply disgusting. That Randy who answers on Tripadvisor never actually replies to any email. The hotel never answers either, the only email address that work is the general refunds by hotel chain, but all they do is tell you that they will refund you, when in fact they never do. Thank god I booked through booking.com (who also couldn’t get hold of the hotel). They will probably be banned soon from booking as this way of doing business pertains to cowboys and scammers. Don’t make the mistake of booking directly on their website, otherwise your money will be well gone! Worst experience of my life","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"RUN!!! THEY WILL CON YOU OUT OF 1000s","lang":"en","publishedDate":"2024-02-24","publishedPlatform":"OTHER","rating":1,"text":"WHATEVER YOU DO, DO NOT BOOK THIS HOTEL IF YOU DON’T WANT TO BE SCAMMED. CANCELLED MY BOOKING 3 WEEKS AGO AND BEEN WAITING FOR A REFUND OF +1000£ EVER SINCE. NO REPLY FROM THE HOTEL DESPITE CHASING EVERYDAY!!!!! HAVE TO OPEN A FRAUDE CASE. JUST RUN !!!!!!!!!!!!!!!","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23719753,"title":"Was told in December breakfast refund","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"OTHER","rating":1,"text":"I went here in December and stayed for 10 nights. The first day we showed up they said the restaurant was closed and we were going to receive eight dollars each for breakfast and now I’m back in Australia. We cannot get the refund it’s February and I’ve been waiting since December 27 when I checked out. Flight Centre who I booked it through have been trying to communicate with them and no one gets back to them. I would like this sorted out if someone from the hotel can reply. My name is Mark","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23719753,"title":"No communication or refund","lang":"en","publishedDate":"2024-02-10","publishedPlatform":"OTHER","rating":1,"text":"Looks like a lovely hotel but had to cancel out booking and two weeks later no refund or email\/booking.com correspondence. \nSimilar to others reviews it looks like I’m in for an extended wait to get a significant amount of money back; incredibly disappointing and will put me off booking in any of the luxurban hotels for future trips.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Great location, but rooms need some love.","lang":"en","publishedDate":"2024-01-27","publishedPlatform":"OTHER","rating":4,"text":"Firstly I have to say this hotel is in a great location! You are so close to lots of subway options, the 9\/11 memorial, One World Trade Centre and a short walk to Brooklyn Bridge and the likes of China Town and other attractions. \n\nThe hotel check in was easy enough, with friendly staff on reception.\n\nThe bar attached to the hotel had a nice atmosphere to say it was fairly quiet, with great cocktails, which we tried a few different ones. There was restaurants and bars close by and we enjoyed drinks in the well renowned O'Hara's ground zero pub which is literally across the road. \n\nThe rooms need some love, whilst clean they could do with a good lick of paint and some updated furnishings with lots of chips and scuffs on the walls and skirting boards. The bedding also felt old and worn and was not soft but almost a little rough. However we felt the price was reasonable and the location outweighed this however I think unless they upgraded the rooms we wouldn't stay again. The big windows in the room was a nice touch but we was at the back of the building so not much of a view. \n\nOverall, if the rooms had an upgrade we would stay again, but based on the price we have seen more modern hotels locally to this one at around the same price we would not go back unless they did have a renovation would not recommend it at this time.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"To be avoided","lang":"it","publishedDate":"2024-01-23","publishedPlatform":"MOBILE","rating":1,"text":"simply shameful!!!\nI booked a room for four for December 2024 (excellent offer as a Genius customer) with free cancellation, I put a credit card as a guarantee (while waiting for the bank to increase) which did not internally cover the cost of the hotel (€135 was missing ) not only did they not accept the card but after several emails asking me to pay immediately with a prepaid card or PayPal they canceled my reservation.\nIt should be noted that they did not respond to any type of e-mail, sent by me and also by Booking,\n\nAttention","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"No cancellation booking fee is payable.","lang":"tr","publishedDate":"2024-01-22","publishedPlatform":"MOBILE","rating":1,"text":"We canceled the reservation we made through booking.com on January 6. Because there was a free cancellation option. But the hotel does not refund even after 17 days. I've seen many similar complaints. Be careful if you are going to book this hotel.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"HANDS OFF!","lang":"de","publishedDate":"2024-01-19","publishedPlatform":"OTHER","rating":1,"text":"We booked a room in February 2023, which could be canceled FREE of charge until shortly before arrival on December 2nd, 2023. At the end of October 2023 we canceled the room via Booking. The money was charged to us when we booked. (Prepayment) We did not get the refund back from the hotel. We kept contacting them via email and were always told it would be forwarded. We then contacted booking and the hotel was given two deadlines of 5 working days to refund the money. After not meeting the deadline, we have now received the money back from booking. In total, we waited almost 3 months for the refund. We would NEVER book a room with you again. We think it's a disgrace to pocket the money so early even though there is the option for a free cancellation until shortly before arrival.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"Take care with this hotel","lang":"en","publishedDate":"2024-01-17","publishedPlatform":"OTHER","rating":1,"text":"Take care!!!! We booked a room last december with free cancellation and cancelled, because we found an other hotel. The hotel charged after the reservation  immediately the full amount, \nbut  they do not refund after one month! We are still waiting for our money!\nThey just ignore your messages and do not answer several of emails (also the operational manager who is responding the reviews here on TripAdvisor ignoring our emails!!!)  and messages via booking.com!\nWe’ve never had an issue like this before. It’s the very first time, that a hotel is just ignoring us, costumers. Very disappointing and poor costumer service.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23719753,"title":"Watch out for your money!","lang":"en","publishedDate":"2024-01-17","publishedPlatform":"OTHER","rating":1,"text":"The hotel neither respects reservations nor refunds. we booked a room last December with free cancellation and even though we should be paid the whole prepayment back there has been no refund so far. It is beyond disgusting how this hotel does not answer to calls, emails and even messages via booking.com. I tried to call the reception several times and I was transferred to customer care service that seems not to work. This is the first time that I've had such situation and it amazes me how many other people have been left hanging by this hotel","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Well located","lang":"fr","publishedDate":"2024-01-09","publishedPlatform":"OTHER","rating":4,"text":"Well located hotel close to WTC and metro station.\nUnfortunately no more restaurant open in the hotel which no longer offers breakfast (we were reimbursed on arrival). Nice little terrace with a view of One WTC. Water fountain available for customers. We were upgraded on arrival and got a studio with an unequipped kitchenette (too bad) and a large living room. The room is very large and very bright.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":23719753,"title":"Not professional","lang":"en","publishedDate":"2024-01-05","publishedPlatform":"OTHER","rating":1,"text":"I booked a room on Booking.com two months ago and canceled with the free option because I changed the dates. The hotel charged the full amount, and despite writing to them multiple times, after more than a month, still no news. I didn't think something like this was possible. It's the first time it has happened to me. Not professional","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"Still no refund ","lang":"en","publishedDate":"2024-01-04","publishedPlatform":"OTHER","rating":2,"text":"I had booked a room on December 7 but had to cancel it on the December 11 I got an email saying “I would be refunded by this property may have already taken payment from you this is normal and you’ll be refunded in the next 14 days” I’ve tried calling the place and emailed and still no refund it’s been it’s 24 days and still no refund very upsetting I’ve tried emailing and calling and no help ","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23719753,"title":"Excellent hotel with panoramic views. Don't listen to negative reviews.","lang":"it","publishedDate":"2024-01-01","publishedPlatform":"OTHER","rating":5,"text":"\nExcellent hotel with panoramic views. Don't listen to negative reviews.\n\nAfter reading several totally negative reviews in the weeks preceding our arrival, we were almost afraid that the stay in this hotel would be traumatic.\n\nAnd instead....\n\nCheck-in 6 December 2023 and check-out 10 December (4 nights)\n\nUpon arrival they informed us that the breakfast service was canceled and that they would refund us 8 USD each for each night (so 64 USD).\n\nLuckily there's a Starbucks right around the corner.\n\nOur room was on the 22nd floor, with a great view of the Freedom Tower and the 9\/11 Memorial.\n\nAll 3 elevators were working and we never had any problems with boring waits.\n\nThe room was very spacious, very comfortable bed and pillows, USB sockets on the bedside table near the bed. Great television. Small minibar available, safe, small but sufficient wardrobe.\n\nFairly large bathroom, with toilet but without bidet. Nice sink and great walk-in shower. No tub. The bathroom would be missing an extra shelf. Present products (shampoo, conditioner, creams, soaps), small toiletries and hairdryer.\n\nVery fast wifi and no disconnection.\n\nThe room is well heated, bright, quiet and very very comfortable. The large window with that wonderful view is its strong point. At sunset all the lights of the skyscrapers are turned on and the city shows itself in all its splendor. Really suggestive.\n\nDaily cleaning with change of towels. The room and bathroom were very clean.\n\nIf there had been a coffee machine with a few pods and a kettle of water, the room would have been perfect.\n\nThere is only one dispenser of still, sparkling or hot water available in the entire hotel. Maybe it would be good to put one on each floor.\n\nCheck-out is 11 a.m. and to keep our two trolleys in storage we were asked to pay 2 dollars for each package. This has never happened in any other hotel around the world. You can pay with cash and card.\nBut be careful: keep the receipt that is provided to you for luggage storage carefully because otherwise returning it becomes complicated and if you are in a hurry, you could waste time.\n\nOn the lobby floor there are many sofas where you can sit after checking out while waiting for your flight. There are several USB sockets for charging mobile phones and wifi is always available for free even after checkout, as is the very spacious and very clean toilet and, of course, the water dispenser. Excellent service.\n\nThe hotel is located in the Financial District, Lower Manhattan, within walking distance of several Subway lines. The beautiful and modern Oculus shopping center is just a stone's throw away. The Freedom Tower right in front, Wall Street very close. Area full of local shops and restaurants. Very recommended even if it takes 20\/30 minutes by subway or 40 minutes by taxi to get to Times Square.\n\nThe Washington by Luxurban hotel was an excellent discovery and, despite a couple of small shortcomings, it is absolutely recommended for a short stay in New York.\nRating 8.\n\n ","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Long delay in returning the money","lang":"es","publishedDate":"2024-01-01","publishedPlatform":"OTHER","rating":1,"text":"I made a reservation with free cancellation in August 2023, they instantly charged me the entire reservation. On December 2 I canceled it. I have written them several emails requesting a refund and they have not responded. Finally, after contacting Booking customer service, they managed to contact them, informing them that they would proceed with the refund in February. 2 months !!!!\nAll this indicates the lack of formality and professionalism of a hotel that, after all, works on customer service.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":4,"locationId":23719753,"title":"The hotel does not refund room fee even if the room is cancelled in due time to receive the full payment back!","lang":"en","publishedDate":"2023-12-19","publishedPlatform":"MOBILE","rating":1,"text":"I booked a room at the hotel for a week’s visit. At the booking the hotel withdrew the total amount from my credit card. \nDue to changed plans the room was cancelled in due time. \nI have sent three mails with copy of the confirmed cancellation, where it is stated that I shall receive back the full amount, and requested them to refund me. The only answer I get from the hotel is an automated response.\nIf you intend to book a room at this hotel do not accept any prepayment!","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":4,"locationId":23719753,"title":"Ignore negative reviews - this location was GREAT","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"MOBILE","rating":5,"text":"I had read the reviews in the upcoming weeks before our holiday and was a little apprehensive. We arrived at the hotel in the evening 6\/12\/23 and checked out on 10\/12\/23. Check in was easy and straightforward, we were informed that the hotel was no longer serving breakfast and we would receive a $8 per night per person refund if we had booked with breakfast. For us, this wasn’t an issue as we planned to eat elsewhere regardless. We stayed in room 1205, on floor 12 of 30. All lifts working. Room was clean and tidy. Views from the room were incredible. Huge windows with padding on ledge so you can sit and admire NYC. This hotel is literally next to the world trade centre and 9\/11 memorial. The free WiFi was very fast and didn’t disconnect at all. Good shower with soap, shampoo, conditioner, body wash and hairdryer provided. Beds were comfortable and our room was cleaned everyday. On the final day, the hotel was able to store luggage, there is a surcharge for this of $2 per bag - which was fine for us. We stored 4 bags but they only changed us $6, the doorman was very helpful friendly. They take cash and card for this. \n\nIf you are planning to stay here when visiting NYC:\n\n•The closest subway stations are probably going to be WTC, Rector Street and Wall Street. We found the subway easy to use, after 12 journeys in a week or after $34 you won’t be charged any more to use it. We found this was the most cost and time efficient way of travelling. You can get the AirTrain from JFK (approx $8) to Jamaica. From there you can get an E train to WTC. The hotel will be about a 5 min walk from there. Although this journey took about an hour, this cost less than $12 each, whereas a taxi was going to be $50+. Do the reverse journey for your return. \n\n•If I was to visit again coming from the UK, I would chose to stay Monday-Friday. We stayed Wednesday- Sunday and I personally found the Saturday to be overwhelming busy in NYC, particularly on the subway. However, it’s a Saturday in the run up to Xmas - I should have expected it really. \n\nOverall a really pleasant stay. I would love to return to New York and stay here again. Thank you to all the staff for a great trip!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"BAD EXPERIENCE","lang":"it","publishedDate":"2023-12-13","publishedPlatform":"MOBILE","rating":1,"text":"Booked by Booking, with free cancellation.\nOn the same day, the Hotel charged the credit card in full,\nand when I canceled the reservation, I wrote to the hotel to ask for a refund, I was told that the refund takes up to 30 working days.\nI will never book it again.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Good location and nothing more","lang":"es","publishedDate":"2023-12-10","publishedPlatform":"OTHER","rating":1,"text":"Do not expect your money back if you cancel or if they leave you without the breakfast you have reserved, they act with total impunity because they know that you are not going to sue them, the rooms are good but it gives the feeling that it is about to close, very unfortunate . You ask them for explanations over and over again and they give you pause.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":23719753,"title":"Apparently I'm not alone","lang":"en","publishedDate":"2023-12-09","publishedPlatform":"OTHER","rating":1,"text":"I booked three separate rooms for a trip with friends from out of State for St. Patrick's day weekend in 2024 through booking.com.  Unfortunately the plans changed and I needed to cancel.  I had paid in full for all three rooms when I booked.  I cancelled on November 5, 2023 well within the full refund period.  I waited two weeks as booking.com advises that a refund will take a maximum of fourteen days.  I reached out to booking.com about the status of the refund after the fourteen days.  I was surprised I didn't receive the refund almost immediately. Booking.com advised to contact the property as I had paid them directly.  I messaged the property and received a message saying the refund would take up to thirty day.  I waited the thirty days and still no refund.  I recontacted the property and they advised me to email the hotel chain's refund department and they supplied an email address.  I sent an email earlier this week with all of the information I thought was necessary for them to process the refund but added if they needed anything else to contact me.  Still no refund or even a response to my email to the refund specific email address.  I decided to go to trip advisor to see if anyone else has had the same issue and it appears that the treatment I am receiving is unfortunately the norm and not an unfortunate exception.  I have stayed hundreds of nights in hotels all over the world and never had an experience like this when I've cancelled a stay and requested a refund within the rules for that booking. Hopefully this review will prompt a response and refund.  ","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Just the location doesn’t matter","lang":"de","publishedDate":"2023-12-08","publishedPlatform":"MOBILE","rating":2,"text":"It is almost impossible to find a hotel in NYC during the Advent season that is good and \"cheaper\".\n\nFirst of all, the location:\nIf you have booked a room facing north like we did, you can enjoy a breathtaking view of the WTC and Ground Zero. That is really perfect,\n\nat least until the WTC 5 building is built. Then you have a huge construction site right in front of you for 3 years, and after that no view at all\n\nBut:\nThe service is a 6.\n\nNo breakfast, even though you booked.\n\nIn return, you get a refund of €8 per person per night.\n\nIt's a joke, I can only get a café latte for that in NY.\n\nYou can't even get a coffee in the hotel. 😡\n\nThe hotel and room are a bit run down.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"Beware - do not book!!!!!","lang":"en","publishedDate":"2023-12-01","publishedPlatform":"MOBILE","rating":1,"text":"Beware - do not book!\n\nBooked through booking.com in Jan 2023, booked as a refundable booking up until 2nd Dec. Full booking amount taken within 24 hours of booking.\nCancelled 14th October and am being given the total run around, I have never had such appalling customer service! \nAbsolute crooks who respond to emails with the same stock responses and 7 weeks after cancelling the booking still no refund! \n\n£750 this company has of my money and I’m disgusted by their behaviour!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Beware of rip-offs!!!","lang":"de","publishedDate":"2023-12-01","publishedPlatform":"OTHER","rating":1,"text":"The hotel offers breakfast, but this is not kept. There was no prior information about the cancellation until check-in. Absolutely disgraceful 😡 On top of that, the service at reception is unfriendly.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":3,"locationId":23719753,"title":"Free cancellation policy is fake - still no refund after months of the full amount. ","lang":"en","publishedDate":"2023-11-26","publishedPlatform":"OTHER","rating":1,"text":"Booked this hotel via booking.com with free cancellation policy. The day after the booking, to total amount was withdrawn from my credit card. I had to cancel the reservation due to changed travel plans. To this date still no refund. Been in contact via mail and even went to the hotel afterwards when I was in New York. Also booking has been in contact with them. No word from the hotel and still no refund.  ","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Non rimborsano","lang":"it","publishedDate":"2023-11-23","publishedPlatform":"MOBILE","rating":1,"text":"Ho prenotato ad agosto tramite booking, alla prenotazione era richiesto il pagamento anticipato ma anche la cancellazione gratuita. \nIl 14 settembre ho cancellato la prenotazione ad oggi malgrado vari solleciti, mail ed anche dopo aver contattato booking non mi hanno rimborsato nulla, non mi resta a questo punto che rivolgermi ad un avvocato.\nRitengo che booking dovrebbe selezionare meglio le strutture proposte sopratutto se richiedono il pagamento anticipato.\nLascio a voi il termine per definire i signori di questa struttura.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23719753,"title":"Be careful","lang":"en","publishedDate":"2023-11-20","publishedPlatform":"MOBILE","rating":1,"text":"Unfortunately, this hotel refuses to refund you what they said they would. We booked bed and breakfast in February 2023 to stay in October. The day before we arrived, we received an email stating they no longer offer breakfast but would refund us the cost (8 dollars per guest per day). Although frustrating, we appreciated the offer to refund. It has now been over 3 weeks with countless emails chasing this up and their only response is ‘we have forwarded it onto our refund department’. I have asked for a timescale and the contact details of a manager but have received neither. I will continue to chase this until we get our money back ($64 dollars in total). Avoid booking incase anything like this happens to you and they wrongly hold your own money.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Very positive experience ","lang":"en","publishedDate":"2023-11-17","publishedPlatform":"OTHER","rating":5,"text":"This hotel is much better than recent reviews indicate.    It has an absolutely stunning location overlooking the world trade centre memorials and WTC1 . Staff are friendly and helpful.   Rooms spacious. Value is very good for NY.   Loads of eateries nearby for breakfast, dinner, etc.   ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":23719753,"title":"Poor customer service when cancelling stay","lang":"en","publishedDate":"2023-11-16","publishedPlatform":"MOBILE","rating":1,"text":"Booked a stay for a week and paid full amount up front. Cancelled the trip in due time within limit to get full refund.\n\nNow, 35 days after the cancellation, the hotel haven’t refunded my money yet. \n\nReceived an answer from the hotel explaining that the delay is due to payment through an agency, however that is not the case - which they also will see if they looked into the case. \n\nVery poor customer service. Usually, hotels are fair and refund instantly without any discussion.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Den værste gæsteoplevelse - de snyder dig!","lang":"da","publishedDate":"2023-11-15","publishedPlatform":"MOBILE","rating":2,"text":"Dette hotel er godt i gang med at ødelægge sin fremtidige forretning med den måde, de behandler deres gæster på! \nJeg taler - ligesom mange andre - om den manglende morgenmad. Jeg har her efter over 1 måned stadig ikke fået mine 224 USD retur :-(","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Budgethotel in guter Lage","lang":"de","publishedDate":"2023-11-09","publishedPlatform":"MOBILE","rating":4,"text":"Das Hotel in unmittelbarer Nähe zum Ground Zero bietet einen guten Ausgangspunkt für einen mehrtägigen Aufenthalt in New York. In Fußnähe befinden sich Brooklyn Bridge, Wall Street, Battery Park, Broadway, One World Observatory inkl.  Westfieldcenter, Little Italy sowie China Town. Verschiedene U-Bahnstationen sind nur wenige Minuten vom Hotel entfernt.\nDie Zimmer können nicht ganz mit dem Eingangsbereich der Rezeption und der Aussicht mithalten, sind aber ausreichend ausgestattet und sauber.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"There is nothing wrong with this hotel!","lang":"en","publishedDate":"2023-11-06","publishedPlatform":"OTHER","rating":4,"text":"Honestly, if we'd have listened to the reviews on here we would have cancelled our booking if we could. What do people expect for the price? We were so worried about arriving at the hotel having read these reviews, that we turned up expecting to be so disappointed and I'm so glad we decided not to cancel.\nUpon arrival we were helped by José who gave us two options for views and room size, we opted for a view of the city and a slightly smaller room to avoid construction noise, having stayed in hotels in the area previously, the room was no smaller than any other in the Financial District, but perfectly fine for what we needed. Ok yes, a coffee machine wouldn't go amiss, neither would a lick of paint, but you can't fault the location, comfy bed and decent size bathroom. We had a clean room every single day, neatly made bed, fresh towels and replacement toiletries. We didn't have to wait long for a lift, again having stayed at other local hotels we knew what to expect, and were pleasantly surprised with how quick the lifts arrived.\nWe liked the fact that you take a lift to the fifth floor for the lobby, and then a separate hotel key-card activated lift to your floor, it felt much safer than some other locations. \nThe comments about staff being thuggish is ridiculous, everyone was so helpful whenever we needed assistance, be that the doorman, cleaners or reception staff.\nPlease do not be put off staying in this hotel, if you're expecting The Plaza then you're paying the wrong price.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Excellent - exceeded our prior expectations","lang":"en","publishedDate":"2023-11-06","publishedPlatform":"MOBILE","rating":5,"text":"We were in two minds about this hotel after reading some of the poor reviews, after we had booked. We would have cancelled if we could have, based on what was written. This would have been so unfair for the hotel. The front desk staff were brilliant, polite and helpful as too were all other staff. In advance of the stay they sent us details of a refund for breakfast - this was paid back to us as we landed on US soil.. All in all we had a very good stay. A touch of paint wouldn't go a miss, but for what we paid, especially in Manhatton, New York it was excellent. We would thoroughly recommend the hotel to others.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Terrible experience","lang":"en","publishedDate":"2023-11-03","publishedPlatform":"OTHER","rating":1,"text":"I would give a zero if I could.\n\nNo one came to our room to clean our room. We left the room early and when we were back at midnight, I found out that the room was not cleaned.\n\nThe common area is so-so, and the service is mediocre. There’s no toothpaste or toothbrush in the room, no complimentary water, even if you are willing to pay extra. The locker was broken, and the water pressure was low. There’s hair from strangers on the bed. Asked  for another room and they said all rooms were taken.\n\nAbsolutely unhappy with our stay, I feel this hotel is almost on the verge of bankruptcy lol. The only thing we liked about the hotel is the location. We will not come back again and would not recommend it at all.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Don’t stay at this hotel. It will be closed before Christmas and you will loose your money you have been warned.","lang":"en","publishedDate":"2023-10-31","publishedPlatform":"MOBILE","rating":1,"text":"This place is a complete joke! I booked this Trip in January 2023 for October- I should have paid attention to the desperation of the company demanding payment directly even though I purchased on booking.com. They had months to contact\nMe to say they were no longer offering breakfast even though we had paid for it but also they had removed coffee from the rooms and locked the fridges. Instead they let you arrive so you don’t cancel and you are faced with the  worst hotel experience ever… in NYC. The staff also don’t help, this place could just close down any moment, they have nothing it’s\nA shell, you could loose your money so don’t book!!! There are better hotels in the area with the services you are Expecting","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Gastvrijheid ver te zoeken.","lang":"nl","publishedDate":"2023-10-28","publishedPlatform":"MOBILE","rating":1,"text":"Geannuleerde kamer na 2 maanden nog \nsteeds geen refund!! Ondanks gratis annuleren in de voorwaarden.\nLees dezelfde problemen in andere reviews.\nAls je je bagage in bewaring geeft voordat je naar het vliegveld gaat, moet je daarvoor betalen zonder dat dit van te voren gemeld wordt.\nGeen ontbijt, daarvoor zou een refund komen maar ook niet ontvangen \nUitzicht en bedden zijn top. Gastvrijheid alleen bij 1 dame bij de balie. De rest is niet geinteresseerd","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Buono ","lang":"it","publishedDate":"2023-10-23","publishedPlatform":"OTHER","rating":3,"text":"Buona posizione e buona soluzione a prezzi corretti. Stanza piccola, reception futurista . Si paga per lasciare i bagagli il\nGiorno della partenza. Colazione è stata eliminata. Acqua gratuita al piano reception","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Décevant ","lang":"fr","publishedDate":"2023-10-20","publishedPlatform":"OTHER","rating":3,"text":"L’emplacement de l’hôtel est un des seuls points positifs .\nPas de petit déjeuner alors que nous avions réservé et on nous rembourse 8$ \/jours\/personne ! \nChambre limite propre , bagagerie payante !\nPas de cafetière dans la chambre.\nCertainement pas un 4 étoiles.\n","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Prime location ","lang":"en","publishedDate":"2023-10-18","publishedPlatform":"OTHER","rating":4,"text":"Great stay! Wonderful location with easily accessible public transportation. A lot of places around the area to get some good food. Every staff member that I came in contact with was very friendly. Would recommend.","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23719753,"title":"Nur noch die Lage macht es- aber bald wird der Blick verbaut sein","lang":"de","publishedDate":"2023-10-15","publishedPlatform":"MOBILE","rating":2,"text":"Leider heruntergekommen. Desinteressierte Rezeption. Abgenutzte Ecken und Kanten.\nNur der Zimmerservice war freundlich und akkurat.\nIn der Lounge zu lauter Musik (mit der werden andernorts Penner vor zu langen Aufenthalten abgeschreckt) ein kläglicher Automat mit kaltem Wasser, das war's denn schon- von wegen Bar. \nDie Zimmer zur Straße werden ihren Ausblick auf das WTC verlieren, wenn der Bau des WTC5 realisiert wird, daher die aktuelle Lage checken.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":4,"locationId":23719753,"title":"DO NOT GO HERE - THEY ARE REFUSING TO REFUND ME MY MONEY FOR A FREE CANCELLATION.","lang":"en","publishedDate":"2023-10-11","publishedPlatform":"OTHER","rating":1,"text":"Cancelled my booking in July (it was a free cancellation). STILL haven’t refunded my money back despite my sending multiple emails. It is not OCTOBER. I always get a response that says “we will let you know when there is a response”. DO NOT BOOK HERE - THEY ARE THIEVES AND WILL STEAL YOUR MONEY!","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23719753,"title":"Horrific!","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"MOBILE","rating":1,"text":"Where do I start? Maybe with the good stuff - good sized room and great location, that's worth one star but that's where the good stuff ends.....after that it was farcical,   breakfast cancelled 'because we go too many complaints!' Bar closed, balcony closed 'because guests were walking in with wet shoes!', filthy room, no maintenence anywhere in the hotel and casually dressed, thuggish staff who never mind being rude, were downright intimidating! I think this was once a great hotel run by the W group but now under Luxurbans stewardship, its a shadow of its former self and should be closed....take your money elsewhere!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":" 2* Hotel with a 4* Price","lang":"en","publishedDate":"2023-09-27","publishedPlatform":"OTHER","rating":1,"text":"he hotel never informed us regarding the cancellation of breakfast until we arrived (we discovered it early be reading other guest reviews) and no possibility was given to change hotel from Booking.com even though this is a clear reason for cancelling it as we were looking for an hotel with breakfast included.\nIn Manhattan a 4* hotel charges 18-25$ per breakfast per person per day but we have received a miserable compensation of 8$ per person for 9 days equally to 144$ in total.\nUnfortunately this amount has been sufficient to pay only for a coffee\/cappuccino per day during our stay - Not a Continental Breakfastas booked.\nWe paid almost 300$ per night and for the same amount you can find better and real 4* hotel in the same area. Mold was found into the bathroom and it was NOT POSSIBLE to close the bathroom door because it was locked, so completely no privacy! The room lacked ventilation in the bathroom, as well as a coffee machine and a kettle.\nBar inside the hotel on the 5th floor is a ghost place. Not sure how the 4* have been assigned.\nFinally the hotel charges 2$ per luggage for keeping the luggage after check out. No other 4* hotels have asked money for leaving my baggage\nOverall I have been disappointed about the property that just milk customers and from booking.com that doesn’t care about customer rip off!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":23719753,"title":"Save your money","lang":"en","publishedDate":"2023-09-23","publishedPlatform":"MOBILE","rating":1,"text":"Visited for our honeymoon. From the pictures and the price I paid (£400 per night ) I was expecting a great hotel and welcome. \nWe got neither\nWe were greeted (just about) by front desk. Given our room and told we have a great view. \nMaybe a few floors up yes, from our room just a car park. Not what I would call great \nHowever it was the room itself that let this hotel down \n\nGrubby carpets, grubby shower, room stank of drain. Far from the ‘lux’ hotel I was expecting\nWalls were dirty. Room only ‘cleaned’ once during stay. \n Booked with breakfast told when got there they had stopped doing it. Clearly from reviews this has been known for over 2 months and no refund given until we checked in. Presumably so I wouldn’t cancel beforehand. \nWe booked this and upgraded the room due to the promise of molton brown toiletries and crisp upgraded linen. There was neither. Toiletries were not Molton brown.  Towels and bed linen were threadbare. \nIron in room didn’t work\nBlinds just about cover windows. \nThis was not an epic corner view room as described. \nMaybe once it was a good hotel, now it’s dark gloomy and dirty. \n\nThe only positive is the proximity to trade centre and museum. That’s it. Had I been able to find the reviews before I booked no way would I have stayed here. Ruined last part of honeymoon. \n\nSave yourself money. Get a hotel nearer empire state and get the underground to the memorials. It’s super cheap and easy. \n\nRector street yellow line runs to location about 2 mins from trade trade centre.. cost about £2.50. You can scan your bank card as payment on the barrier no need to buy tickets.\n\nYes, we could have spoken to the hotel about it however from the outset they didn’t appear helpful and judging reviews would be fruitless anyway.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"NI SE OS OCURRA!!!! Importante leer mi opnion","lang":"es","publishedDate":"2023-09-21","publishedPlatform":"OTHER","rating":1,"text":"El hotel no tiene ni de lejos 4 estrellas. Es un auténtico engaño. \n\nLo único bueno son las vistas y la ubicación y ahí se acaba lo positivo.\nNada más reservar te cobran íntegramente la estancia a pesar de que puedas cancelar gratuitamente. Ahí viene el tema. Cuando cancele para unos familiares de forma reembolsable dado que no cumplía con las expectativas ( reserve con desayuno q ya no daban, habitaciones más pequeñas de las reservadas, personal muy antipático) me he encontrado que están poniendo todo tipo de pegas para devolverme el dinero y a día de hoy después d más de 3 semanas de irme de allí siguen sin devolvermelo. Así que mucho cuidado con lo q reserváis si no queréis perder el dinero . Totalmente lamentable.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Very unpleasant","lang":"en","publishedDate":"2023-09-19","publishedPlatform":"OTHER","rating":2,"text":"First of all: great location. But thats about it. Staff is rude, uninteressted, unmotivated. Water dispenser in the lobby was out of order. Every cheap highwaymotel offers free coffe in room or lobby. This hotel doesnt have a coffee machine or kettle in the room. \nBut worst of all: the room was filthy. Please see photos. Thick black mold in the bathroom, illumination behind bed was broken and litterally on my pillow. Dust everywhere even on the walls. This room 1012 hasnt been properly cleaned in months. Because of the rude staff we didnt wanna tell them allthou i am sure they know in what kind of state the rooms are. Besides being dirty it needs renovation too. Plus they asked for a 2$ per luggage to stow it. No thank you. We walked over to the Club Quarters. They were so friendly and offered to store our liggage and offered to have a coffee too. Additionally upon checkin they told us breakfast is no longer available and they will refund 8$ per person per night. Tell me where to get a breakfast for the same price?!!! \nI absolutely cannot recommend this hotel and i have the feeling the W chain gave it up and LUXURBAN took over and will run it to the absolute end without investing anything for maintenance until they sell it or make it a refugee camp like what they did with the Holiday Inn around the corner. \n\n","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Rude, unprofessional and lying staff","lang":"en","publishedDate":"2023-09-17","publishedPlatform":"OTHER","rating":1,"text":"Our one week stay in this hotel is made on a couple of reservations and we have not been given any solution for not moving out at 11 and moving in again at 3pm. Thats fine. But every time we go down to the front desk there is always this rude tone towards us or some other customers in front of us. We kindly ask about the room in a higher floor, if possible, but it never has been possible: everyday we get a room on a lower and lower floor. We haven’t had one normal check out or check in at this hotel, people working at the front desk are being rude every time. One time we went to the front desk when the nights shift started and talked to a really professional and nice front desk employee, he explained to us that he can see that our room type is available on the 7th and on the 22nd and that we could choose the floor. We asked for the 22nd and he said he would leave the note for the morning shift that we ask for this floor and higher floor for the next days of our stay. He also recommended that we ask about the floor early in the morning when other customers check out. The next morning we got yelled at by the women at the front desk, because we asked about the 22nd floor and about the deposit. \nThere has not been taken any deposit for the rooms and the woman from the front desk tells us she had been taking the deposit every day from us (she hasn’t, but if that was true, she would have done that WITHOUT informing us about it four times in a raw! ). Today there has been taken the deposit and we have not been informed about that when we checked in, and we got a room on the 6th floor when we checked in at 3pm. Women at the front desk interrupts us in the middle of the sentence, tries to prove to me that we are lying, lies to us, yells at us, does not answer our questions and stresses us.\nWe do not know what is happening, but we do not feel comfortable with this kind of behavior, we don’t accept to be yelled at and we do not wish to be treated this way. This is too stressful for a us and this is to addition to all the dirt in all of the rooms we have been in, the lights not working, the mold and stink in the bathrooms, the AC not working\/working really loud AND not getting answers about the refund for not existing breakfast that we payed for when asked by writing directly to the hotels customer service. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Stunning room - but that's all you get","lang":"en","publishedDate":"2023-09-10","publishedPlatform":"OTHER","rating":3,"text":"Our 15th floor room had totally stunning views towards the new World Trade centre, maybe the best in south Manhattan - and we paid a pretty price for that. And we got a good bed and space and a shower and the lifts worked, and that was it.\nWe expected as least a few more basics - particularly as the hotel ended breakfasts after we booked without telling us. \nNo food. No working cold water dispenser. \nNo coffee maker so a half a mile trip. Not even a vending machine?  \nNor a welcome desk beside the lift?\nWe think the hotel owners need to wake up and smell\/develop a taste for coffee and basic services for guests.  Show a little bit of love for the hotel OR there'll be a lot more empty rooms.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Goed hotel, mooie buurt en ideale uitvalsbasis.","lang":"nl","publishedDate":"2023-09-09","publishedPlatform":"MOBILE","rating":4,"text":"Financial district is een mooie en tegelijk strategisch gelegen buurt met maar liefst 3 verschillende metrolijnen om je te verplaatsen. Verder is er de nyc ferry en kun je de gratis downtownloop bus nemen. Dat maakt ook dat dit hotel prima  gelegen is. Ook vlakbij Ground Zero, Oculus, Winter Garden. Eetgelegenheden genoeg in de buurt. Kamers zijn in orde. Vriendelijk personeel. 2 goede ontbijtzaken op 1 minuut: George's en ZaZa. Ben meermaals in NYC geweest. Volgende keer check ik eerst hier weer de prijs. Is een aanrader!","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23719753,"title":"Bella posizione e ottima vista, servizi inesistenti","lang":"it","publishedDate":"2023-09-03","publishedPlatform":"MOBILE","rating":3,"text":"Posizione ottima e molto comoda, camera al 20 piano con una vista molto bella, camera grande e ben arredata. Peccato solo che:\n\nIl rooftop pubblicizzato non so dove sia, c’è una sorta di balcone al piano della reception con qualche tavolino ma niente a che vedere con le foto del sito\n\nIl bar al piano e’ in disuso\n\nHo prenotato su Booking e la colazione era inclusa ma non ci è stata fornita (stupida io a non chiedere subito il rimborso) \n\nSicuramente per posizione e camera un’ottima scelta peccato tutto il resto più che altro perché ci si sente parecchio presi in giro e in generale sembra una struttura mezzo abbandonata e in declino","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"excelente","lang":"pt","publishedDate":"2023-08-31","publishedPlatform":"OTHER","rating":5,"text":"O Hotel é muito limpo, muito aconchegante, perto de vários lugares incríveis, adorei a oportunidade de ter usufruído do hotel e espero voltar assim que for possível. Parabéns à equipe do Hotel.\nCélia Cortez","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"terrible","lang":"en","publishedDate":"2023-08-31","publishedPlatform":"OTHER","rating":1,"text":"horrible hotel, horrible staff,  dirty, run down, moldy , stinky,  the only plus was the location but there are plenty of better hotels in the same area, this was terrible.  the amenities advertised are non existent ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Bad","lang":"en","publishedDate":"2023-08-31","publishedPlatform":"OTHER","rating":1,"text":"Terrible experience, the only thing decent is location if you are looking to stay downtown. Rude and angry staff. Dirty and half the amenities they advertise or show in pics are not available. Poorly maintained building. No response from management with any questions once you have paid ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Bien pero sin desayuno ","lang":"es","publishedDate":"2023-08-30","publishedPlatform":"OTHER","rating":4,"text":"Hotel ubicación fabulosa, vista fabulosa al world trade center y la zona 0, habitación calidad precio  buena, necesita algunos retoques pero bien, lo único es que habíamos contratado con desayuno incluido y al hacer el checking nos dicen que ya no daban ese servicio y nos lo reembolsarían, desayunar en Manhattan no es barato y trastocó un poco nuestros planes ya que tuvimos que perder más tiempo diariamente para buscar sitios donde ir a desayunar.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Recommended to all!!","lang":"en","publishedDate":"2023-08-30","publishedPlatform":"OTHER","rating":4,"text":"Excellent position for visiting NYC, our room was really nice with every comfort you could wish for. The view from the terrace is breath-taking, as you can take a really good look at World Trade Centre and 09\/11 memorial. We hope to come back in the nearest future. ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"TERRIBLE HOTEL","lang":"en","publishedDate":"2023-08-25","publishedPlatform":"OTHER","rating":1,"text":"I would NEVER EVER recommend this hotel to anyone\nThey take your money the day you book the reservation and when i canceled it I am being told it takes up to 30 business days for the refund\nThis is BS","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Great hotel, great value, great area.","lang":"en","publishedDate":"2023-08-24","publishedPlatform":"OTHER","rating":5,"text":"Fabulous hotel in downtown right opposite the 9\/11 memorial.\nWe could not have been happier with the service and everything surrounding our stay.\nIf you want to be irritated by over zealous bell boys getting on your nerves every two minutes then this isn’t the hotel for you.\n\nIf you want a clean and great hotel where you are treated like an adult and basically left to your own devices after checking in then this is perfect.\nWe had an epic corner king room on the 19th floor for a week and loved it. Very well appointed, loads of storage space, big bathroom, and a very large room with spectacular views.\nWe felt comfortable from the moment we checked in until the moment we checked out.\nIt was also an oasis of calm when we returned from the madness of NYC each evening.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Ottima posizione ma per il resto da dimenticare","lang":"it","publishedDate":"2023-08-20","publishedPlatform":"MOBILE","rating":2,"text":"Abbiamo prenotato 4 notti in questo hotel , ottima posizione a pochi passi dal WTC e da molte fermate della metro , vista dal 12 simo piano molto bella, camera grande , bagno piccolo ma passabile . Personale alla reception poco attivo, al nostro check in ci hanno informato che la colazione inclusa non ci sarebbe stata per problemi al bar , quindi ci faranno un rimborso ( speriamo !) , peccato che non si siano dati pena di avvisare prima . Comunque intorno ci sono svariati bar e posti in cui fare colazione anche se non è la stessa cosa . Poi il primo\nGiorno ci hanno addebitato 150 dollari come cauzione sulla carta di credito , ma se hai il passaporto che bisogno hai ?. Ma hanno superato ogni limite quando abbiamo chiesto di tenerci 1 valigia perché dopo 4 notti saremmo stati via 1 notte per un tour fuori New York , tornandoci il giorno dopo con un’altra prenotazione già fatta di altre 4 notti . Ci hanno risposto negativamente , risultato ho cancellato la seconda prenotazione e siamo andati in un altro hotel per le altre 4 notti successive . Peccato , hotel merita ma il\nPersonale ed i servizi non altrettanto","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Great hotel with friendly staff","lang":"en","publishedDate":"2023-08-13","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is in a very good location right across the 9\/11 memorial and close to the subways. \nThe rooms have a gorgeous view from the area, our housekeeper was very nice and always happy, and the front desk was extremely helpful. Big thanks to Jose and Sabrina who made our wedding anniversary trip very special. We highly recommend this hotel.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Very central location and nice rooms","lang":"en","publishedDate":"2023-08-11","publishedPlatform":"OTHER","rating":4,"text":"Good location, just in front of One World Trade Center. Good rooms, some construction noice though, but they stopped during the night. Most of the hotel staff was very nice. Lobby was nice and clean. ","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Ingen morgenmad som betalt for. God beliggenhed.","lang":"da","publishedDate":"2023-08-05","publishedPlatform":"OTHER","rating":3,"text":"God placering og rene værelser. Rengøringspersonalet er de sødeste. \nMen vi valgte dette hotel på grund af morgenmaden, og da vi ankom, fik vi blot at vide, at der IKKE blev serveret morgenmad længere. Vi har IKKE modtaget penge tilbage for betalt morgenmad. Vi vælger derfor IKKE dette hotel igen. De snyder folk! \nDesuden dårlig service i receptionen. ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Basic room","lang":"en","publishedDate":"2023-07-29","publishedPlatform":"MOBILE","rating":4,"text":"This was a very basic room with a beautiful view. The room was clean and had the basic amenities. The bathroom was a little outdated but still it was clean. \nThe location of this hotel is very safe. Short walk to the 9\/11 memorial and about a 10 min walk to Battery Park, or Wall Street. \nThe person at the  front desk was friendly at checkin.\nI  had low expectations for this hotel based on the reviews, but it was fine. I have no complaints.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Very dissapointed!!","lang":"en","publishedDate":"2023-07-26","publishedPlatform":"OTHER","rating":2,"text":"We had booked with our family of four in The Washington by Luxurban From July 10 to July 15. We booked the overnight stay and breakfast included. We also paid decently for this. When we arrived we were told that breakfast is no longer offered at the hotel and that we would be reimbursed part of it. Now that we are home, we get the message that they refund two dollars per person, per day for breakfast??!! So eight dollars a day for four people?! They can explain to me where you can have breakfast somewhere in NYC for two dollars per person!! If you buy a coffee and a croissant at Starbucks, you already pay almost $40 for four people! Very disappointed!!","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Peccato ","lang":"it","publishedDate":"2023-07-18","publishedPlatform":"OTHER","rating":3,"text":"Se fosse per la posizione e la vista avrei dato 5 stelle: l’hotel infatti si trova a due passi della Metro con possibilità di raggiungere qualsiasi zona di NY in breve tempo.  La zona in cui si trova è tranquillissima, per nulla trafficata e molto sicura , vista la presenza h 24 della polizia che pattuglia Ground Zero. \nLa nostra camera si trovava al 19 piano: la vista sul WTC e il Ground Zero era meravigliosa. \nPersonale gentile e rapido nel risolvere piccoli problemi (chiave smagnetizzata), comoda la possibilità di poter depositare i bagagli  prima del check in e\/o dopo aver lasciato la camera. \nNota dolente: la colazione. \nI primi giorni questa prevedeva la scelta di muffin, plumcake, frutta, yogurt con avena, pane, marmellata, the\/caffè americano e veniva servita, con modalità  buffet a self service, nel ristorante Skyathos al primo piano. \nI tavoli però non venivano puliti perché \n non c’era personale di sala: quando arrivavi, dovevi aspettare che si liberasse un tavolino, pulirtelo e poi servirti. Ma a parte il servizio, la colazione era comunque buona ed abbondante ( anche se mancava la scelta del salato). \nDopo 4 giorni di permanenza, ci dicono che le modalità della colazione sarebbero cambiate: ci viene fornito un sacchetto a testa con dentro una banana ( spesso ammaccata e da frigo) uno yogurt e una brioche\/muffin confezionato, il tutto da consumarsi o in camera o negli spazi comuni siti al V piano. Una tristezza desolante, una quantità e una qualità del cibo pessima, per nulla all’altezza di quanto visto nei giorni precedenti e soprattutto di quanto pagato. Una tristezza e soprattutto uno sgomento per aver ricevuto due trattamenti così diversi in una settimana di permanenza. \nAssolutamente da migliorare.\n","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"State e alla larga se non volete essere fregati!","lang":"it","publishedDate":"2023-07-13","publishedPlatform":"MOBILE","rating":1,"text":"Ho prenotato tramite Booking con possibilità di cancellazione gratuita.\nAvendo cancellato la prenotazione entro i termini, mi era stato garantito il rimborso in 14 giorni, ma, a distanza di un mese, non ho ancora ricevuto nulla.\nHo contattato ripetutamente la struttura e Booking, ma senza ottenere nulla.\nA questo punto dovrò consultare un avvocato per risolvere la situazione.\nState e alla larga!\nAssolutamente sconsigliato!!!","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23719753,"title":"Lusso, una volta","lang":"it","publishedDate":"2023-07-09","publishedPlatform":"OTHER","rating":3,"text":"Posizione invidiabile: diverse fermate della Metro in prossimità dell'Hotel con possibilità di raggiungere qualsiasi zona di NY in breve tempo. Camera al 19 piano con vista eccezionale sul World Trade Center e Ground Zero e molto silenziosa. Camera ampia con due letti matrimoniali comodi. Bagno sufficientemente grande per 2 adulti + 2 ragazzi. Pulizia quotidiana della camera. Molto apprezzata la possibilità di avere acqua fresca naturale\/gasata gratuita al 5 piano dove si trova la reception. A piano terra vi è il bar per la colazione ed il deposito bagagli (2 dollari a collo) se si arriva prima del check in (ore 15.00) oppure per la partenza dopo aver lasciato la camera (entro ore 11.00). L'Hotel da l'impressione di essere lasciato un po' a se stesso: personale presente 24h24 ma non particolarmente attivo (trovi sempre qualcuno seduto alla reception, ma mai nessuno che lavora in giro per l'hotel), segni di rottura un po' dappertutto sia nella camera che negli spazi comuni. Macchia di umidità sul soffitto della doccia (presumo che provenisse dalla doccia della camera al piano superiore). Al 5 piano c'è\/c'era un bar completamente abbandonato: non che io venga a NY per stare al bar dell'Hotel, ma da un senso di completo abbandono. Capitolo a parte la colazione: i primi giorni devono avere avuto qualche problema con il bar e quindi veniva fornito un sacchetto con dentro una banana, uno yogurt e una brioche\/muffin confezionato, il tutto da consumarsi o in camera o al 5 paino negli spazi comuni (le bevande calde le ritiravi insieme al sacchetto); che tristezza. Poi hanno risolto il problema ed il bar è tornato accessibile, ma la musica non è cambiata: a parte il sacchetto e la possibilità di consumarla seduti ad un tavolino, quello che veniva offerto non è cambiato con il più il disagio di trovare un tavolo libero (il bar è piccolo e l'Hotel è grande) e possibilmente pulito (nessuno passava a liberare i tavoli). Quindi in sintesi il The Washington by LuxUrban è stato probabilmente in passato un Hotel di uno certo standing, ma ora non lo è più. Se si cerca un hotel senza grandi pretese, comodo al centro senza spendere le cifre degli hotel più centrali e con una grande vista, questo va benissimo, ma se si vuole il lusso che reclamizza con il suo nome, cercatene un altro oppure aspettate che gli diano una rimodernata.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Beautiful facility with at an amazing location!","lang":"en","publishedDate":"2023-07-05","publishedPlatform":"OTHER","rating":5,"text":"I stayed at The Washington for 2 nights and would definitely go back. The lobby, rooms, viewing deck, and staff were top notch. Outside of the clean, spacious rooms, the location can't be beat. You can walk out, visit the 9\/11 memorial, shop, stop by Wall Street, and more, all within a morning. ","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23719753,"title":"Die Realität sieht so aus. Die hübschen Bilder im Internet sind alt. ","lang":"de","publishedDate":"2023-07-04","publishedPlatform":"OTHER","rating":3,"text":"Bars im 5. OG auf Terrasse und innen im Juni 2023 geschlossen. Hatten Zimmer nach hinten mit Aussicht auf aktive Baustelle und direkte Nachbarbebauung. Frühstücksbuffet national\/günstig, Kaffee in Einwegbechern.  Kein Service vom CheckIn Personal-  einen Zimmerwechsel wollten diese nicht ermöglichen.  Die gemachten Angaben bei Buchung wurden nicht berücksichtigt. ","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Una semana en Nueva York","lang":"es","publishedDate":"2023-06-16","publishedPlatform":"OTHER","rating":5,"text":"Lo elegí porque estaba muy bien de precio para su categoría, bien situado y la buena pinta de las fotos. \nEntras por la puerta del edificio e, inmediatamente, tienes que coger el ascensor que te lleva directamente a la quinta planta donde está la recepción. Hablaban en inglés. Nos dieron una habitación en la parte de atrás, pero había ruidos y nos la cambiaron a una esquina de la planta 17, la habitación era mejor, mejor cuarto de baño, esquina Washington Street con Carlisle St, se veía un trozo del Río Hudson y Nueva Jersey. Desde allí vi unos cuantos atardeceres. Supongo que las mejores y más caras serán las de Albany St porque tienen vistas al World Trade Center.\nIncluía desayuno, se servía en el bar de la planta baja y apenas cabíamos, mucha gente tenía que desayunar de pie, bastante caótico.  Había café  muy aguado, infusiones, bollería, fruta, leche, yogures. No visitamos el gimnasio. Tenía restaurante, pero no lo visitamos. Cerca de la recepción hay una terraza con unas vistas espectaculares del World Trade Center. \nPara hacer turismo utilizamos las paradas de Wall St y Rector St. Subimos al One World  Observatoy, impresionante, estaba frente al hotel. La zona es segura,  había mucha policía de NY y sistemas de bolardos para parar el tráfico. Es una zona súper vigilada, con mucho turismo. Muchos sitios para comer y comprar ropa.  Nuestra experiencia fue muy positiva. Era la segunda vez que visitábamos NY y quería estar en otro zona distinta a la 42 St y sus alrededores. Puedes dejar la maleta abajo el dia de la salida, cuesta 2 dólares. Nos pidieron un taxi, que era mucho más limpio que el que cogimos al llegar al aeropuerto. Una buena experiencia.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Friendly staff, rooms dire","lang":"en","publishedDate":"2023-06-15","publishedPlatform":"OTHER","rating":2,"text":"The reception area on the fifth floor was very cool, and the check-in process was great - staff are friendly and helpful. My room was on the 20th floor with a spectacular view of the Freedom Tower. Elevators were quick. Everything worked.\n\nOnce you get to your floor, the musty smell of old carpet hits you. I honestly thought I had a smoking room. The towel rail in the bathroom was hanging on for dear life, and the dark tiled floor of the shower room had been horribly repaired and re-grouted with white grout. Turn on the shower and instantly get soaked by freezing cold water. It baffles me why so little thought is put into bathroom design, and maintaining a property to original specifications seems beyond anyone's ability.\n\nThere is no coffee maker, no bottles of water. The AC worked, but when it powered down it sounded like someone was knocking my door. And one of my colleagues is flying home tonight with bed bug bites. \n\nThankfully, on the advice of others, I didn't even try the bagged breakfast.\n\nThe audacity to say this is a 4.5 star establishment! Solid 2\/5.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Great location, style and view!","lang":"en","publishedDate":"2023-06-14","publishedPlatform":"OTHER","rating":4,"text":"We liked the design of your hotel and the majority of the staff were friendly. Also the rooms - especially the view! - were really nice.\nRoom could have been cleaner though: dust everywhere, esp. in the closets and deeper drawers, urine smell (through the AC?)... As soon as I gave this info to the front desk, the reaction was very friendly and a room maid was sent to clean again (which helped a little).\nOne really annoying thing was, that we had chosen the hotel also because of the breakfast buffet - and exactly that had been abolished two days before our arrival. No excuses, no refund, nothing. We got paper bags in the restaurant with croissant\/muffin, fruit&yoghurt, banana. That was it. For us actually no problem, but there should have been some kind of explanation at least. The manager kept hiding in his office and I didn't bother to give him a call. The staff were also stressed by the situation of guests making complaints. And, the worst thing: Everything that was left in the bags simply got thrown in the garbage every hour twice or so - homeless people sitting everywhere in NYC! We enjoyed our time at the hotel very much, but the breakfast situation was not well handled.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"Peu mieux faire...","lang":"fr","publishedDate":"2023-06-11","publishedPlatform":"OTHER","rating":3,"text":"Cet hôtel est correct mais ne vaut pas un 4 étoiles. Niveau propreté, on peut mieux faire, il ne faut pas s'attarder sur les détails. Certains des accessoires mentionnés dans la description n'étaient pas présents comme le sèche cheveux. Grosse déception pour le petit déjeuner. Sur les 2 jours, on nous a donné un sac avec une banane et un \"croissant\" à l'intérieur.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Finger weg von diesem Hotel","lang":"de","publishedDate":"2023-06-08","publishedPlatform":"MOBILE","rating":1,"text":"Der allerletzte Laden. Arrogantes und schroffes Personal. Hat man eine Beschwerde wird man angeblafft. Beschreibung des Zimmers eine Verarsche. Runtergekommen und ungepflegt. Für den Preis erwartet man anderes. Frühstück in Tüten.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Beautiful Hotel","lang":"en","publishedDate":"2023-06-02","publishedPlatform":"MOBILE","rating":2,"text":"The hotel is a very nice hotel and in an unbeatable location, close to several metro stops and very well connected. The room was very nice, comfortable and clean. The cleaning and reception staff are spectacular!!! What is VERY VERY VERY BAD is the BREAKFAST!! It is literally crap, a piece of bread, a muffin and sometimes they put a croissant there (counted on the fingers) the attention of the BREAKFAST staff is VERY BAD! dirty tables, you are going to sit down and you have to clean the table yourself because nobody does it!! The truth is a very nice hotel, it hurts that the breakfast dirty the entire stay !!!","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Can’t beat the location","lang":"en","publishedDate":"2023-06-02","publishedPlatform":"MOBILE","rating":4,"text":"Location was perfect for us, that is why I have given 4 stars. So easy to get to subway, or to walk along the water, so much quieter than midtown, which was better for us…we don’t enjoy the hustle and bustle 24\/7.\n\nWe had some communication issues when checking in, I’d double checked prices prior to arrival but when I paid it was more expensive.  Having said this, the manager was very helpful and I did get a refund.\n\nA couple of slight negatives, not detrimental to our stay though, cleaning in bathrooms is questionable, deluxe double were small doubles, breakfast in Skinos was a bonus but staff not overly welcoming and I don’t understand why they didn’t open up the second floor, especially as it was so busy on memorial day weekend…it did improve after this.","travelDate":"2023-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"My trip to New York","lang":"en","publishedDate":"2023-05-25","publishedPlatform":"OTHER","rating":5,"text":"Wonderful but I would suggest to have a coffee machine inside the room or in common area of the hotel. I wake up very early and I had to wait until 7 am to have my first coffee. The rest of the hotel's services was excellent: housekeeping, front desk,","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"Money thieves","lang":"en","publishedDate":"2023-05-25","publishedPlatform":"OTHER","rating":1,"text":"I made a cancellable booking with them via booking.com months in advance but had to cancel a few weeks before. But they took my payment right away and now it has been more than a month and they still have not issued me my refund back. I have messaged them several times and they keep saying it may take up to 30 business days! Ive also contacted bookings  customer service and both times they said I would get my money back within 10 days. Absolutely ridiculous! I will never consider staying with them after this experience. ","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":23719753,"title":"Pessima esperienza","lang":"it","publishedDate":"2023-05-22","publishedPlatform":"MOBILE","rating":1,"text":"Pessimo servizio, ACCATTONI!  Pagato in anticipo e sono 2 mesi che attendo il rimborso,  pagando in anticipo(solo così vendono le camere) se provate ad annullare la prenotazione(annullamento gratuito) non vi rimborsano\nTRUFFATORI ATTENZIONE","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Bien situé mais sinon horrible. Personnel super désagréable et décoration vielle et sale","lang":"fr","publishedDate":"2023-05-20","publishedPlatform":"MOBILE","rating":1,"text":"L’hôtel est bien situé mais c’est déjà tout. Il n’y a pas de restaurant ou bar et la décoration est plutôt vieille et sale et rien à voir avec les photos du site web. Le personnel est très désagréable et on vous traite vraiment comme de la …. (Le door man nous a accueilli avec “Check-in is on the 5th floor buddy”, puis la receptionist nous a répondu “it’s this room or nothing” quand nous avons demandé de changer la chambre pour une sur un étage plus élevé. Le petit déjeuner est une catastrophe et servi dans le bar lounge à l’entrée de l’hôtel et vous avez droit à un café dans un gobelet et un muffin. Lors du check-out nous avons eu la dernière surprise qui était de payer 105$ comme Resort Fee pour 3 nuits et pour garder des valises il aura aussi fallu payer. Bref, je ne recommande pas de rester dans cet établissement. L’hôtel Riu Plaza Manhattan Times Square était moins cher et beaucoup beaucoup mieux.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Avoid at all costs","lang":"en","publishedDate":"2023-05-15","publishedPlatform":"OTHER","rating":1,"text":"Booked a  six night stay and due to the condition and poor service, left within 2 hours of checking in \nAside from the location and view I have absolutely nothing positive to say about this hotel. Stayed on 22nd floor in corner view room. Run down and dirty room as can be seen in pictures. This included broken furniture, screw sticking out of bed, damaged bed corner, broken shelf not replaced, poorly fitted and dirty carpets, stained bedding. Also a damp mouldy smell within the corridor and room. When staff were addressed were told the manager would call the room to discuss and heard nothing more. Made the decision to just check out move to another hotel. Classing this as a 4 star hotel is a joke, it is a 2 star at best and the nightly rate needs adjusted to reflect as much. If looking for a super hotel in downtown in this area recommend the Cloud One across the street which we moved to. Lovely clean rooms with identical views over the Hudson and World Trade Memorial and at a similar price point. Don't be fooled by any pictures of the hotel showing lovely clean white modern rooms. They are nothing of the sort. AVOID The Washington!","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Just a very good hotel","lang":"en","publishedDate":"2023-05-12","publishedPlatform":"OTHER","rating":5,"text":"After a few emails back and forth with the friendly people of the reservation team stayed for 9 days from may 1 till may 9 in a great room with a view of the 9\/11 memorial and One World Observation. Every day cleaning was done and everything looked neat. When I come back to New York I will definitely come to this hotel.. Well located (for me) within walking distance of the Subway, Brooklyn Bridge, 9\/11 memorial, Battery Park, Ferry to Staten Island, Brookfield Place etc.","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23719753,"title":"Great place to enjoy downtown Manhattan!!! ","lang":"en","publishedDate":"2023-04-18","publishedPlatform":"OTHER","rating":5,"text":"Amazing location walking distance to all a tractions around lower Manhattan and 1 min from WTC.\nFront of house team super friendly.\nRooms are very clean and refreshed on daily basis.\nBreakfast a bit crowding and food ends very soon but over all nice continental breakfast.\nI reccomed this hotel! ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Good hotel, best location","lang":"en","publishedDate":"2023-04-06","publishedPlatform":"MOBILE","rating":5,"text":"Good hotel, good breakfast, nice staff and perfect location !! Room was very clean and nice views. I totally recommend this hotel for couples staying in Ny. In the financial area , in downtown , far from the crowed midtown vbut very good connected by underground. I’ll repeat in my next trip to NY.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"charging whole amount directly , also for a free cancellation room","lang":"en","publishedDate":"2023-03-27","publishedPlatform":"MOBILE","rating":1,"text":"On booking, it says free cancellation up\nto the date of arrival for this hotel but then the hotelcharges you the whole amount on the day of reservation and tells you that it will take 30 days to get your money back!!!!! That's definetely not a room with free cancellation, very misleading!!!!","travelDate":"2023-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23719753,"title":"The best experience with The Washington Hotel","lang":"en","publishedDate":"2023-03-27","publishedPlatform":"OTHER","rating":5,"text":"This hotel is in a great location . We had a corner room with big windows looking out at the World Trade Center. \nThe front staff are all so nice and friendly . \nHouse keeping could not have been more helpful and nice . \nMy hubby and I did not want to leave .\nOne corner across the street from us was Morton’s steakhouse best steak I have had in a long time .\nAcross the street at the other corner was O’Hara’s pub great for bar food and good drinks . \nI highly recommend this hotel you well not regret it . \n","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23719753,"title":"Oltre le aspettative","lang":"it","publishedDate":"2023-03-27","publishedPlatform":"MOBILE","rating":5,"text":"Abbiamo alloggiato in questa struttura a metà marzo 2023 e ha soddisfatto pienamente ogni nostra aspettativa.\nPosizione ottima nel financial district, a pochi passi dal memoriale 11\/09 e dalla Freedom tower. Inoltre ben collegato con diverse linee della metro.\nBuonissimo rapporto qualità\/prezzo con colazione inclusa.\nCamere spaziose e pulite, magari farei manutenzione ad alcune camere ( per esempio nella nostra la porta del bagno non si chiudeva bene).\nOttima la possibilità di rifornimento d’acqua alla reception.\nColazione buona, non con ampissima scelta,  ma nel complesso soddisfacente.\nPossibilità di deposito bagagli\nFerro da stiro nelle camere","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Birthday trip","lang":"en","publishedDate":"2023-03-26","publishedPlatform":"MOBILE","rating":3,"text":"We have stayed there for 4 nights,we came to celebrate my son 30th birthday \nHotel is good perfect location close to Wall Street, ferry to Statue of Liberty and Brooklyn Bridge. The rooms average but do the job for few nights . Very downside is beds they are double beds but very small double I actually had thinks they gave us room with 2 single beds for 4 ppl.\nBig thank you to housekeeping,room clean every day with fresh towels .\nNot nice staff to be honest only one lovely and friendly man (tall one ) in front door .\nBreakfast included we had what a joke it was OMG.  We have been able to had breakfast only in first dayafter that no chance,around 9am there was nothing left and they not bring anything else. \n","travelDate":"2023-02","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":23719753,"title":"They don’t refund your money eventhough it is fully refundable!!!","lang":"en","publishedDate":"2023-03-21","publishedPlatform":"MOBILE","rating":1,"text":"Booked this hotel in January 27th through agoda with fully refundable rate. The next day I cancelled the booking. Nevertheless they have charged the amount onto my credit card. I emailed the hotel and requested for my refund. They told me to wait for 30 business days. It has been more than this. I wrote back 3 more times to the hotel asking why is the refund taking so long. They just told me that the refund request has been escalated but did not tell me when I shall expect to receive it and the reason for the delay. Apparently this has happened to many people. VERY VERY BAD EXPERIENCE. PLEASE BEWARE. NEVER BOOK THROUGH THIS HOTEL GROUP. UP UNTIL TODAY I HAVE YET TO RECEIVE MY REFUND!!!","travelDate":"2023-01","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23719753,"title":"No customer Relationship","lang":"en","publishedDate":"2023-03-20","publishedPlatform":"OTHER","rating":1,"text":"I made a reservation for February 9 to 12 and I canceled on January 30 and I never received a refund. I have no contact from the hotel and nobody can handle my claim by phone. The Custer relationship is horrible","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Nice Spring break stay ","lang":"en","publishedDate":"2023-03-14","publishedPlatform":"OTHER","rating":5,"text":"I was reading all the reviews, and I was getting second thoughts as it was mixed reviews. However, everyone has different opinions, but I can tell you hands down, the staff was very friendly and helpful. They were accommodating, always smiling- they were dancing and singing to the music that was playing. Not once did we feel like we were an inconvenience. The lobby was beautiful- modern decor! The view we had of the freedom tower was incredible. Yes, they need some touch ups with the paint in the bathroom- big deal. I have been to other places with worse things to do. One thing I do have to say is the shower window facing the beds were a little awkward. I had to shower in the dark so the boys won’t me- maybe frost the glass for privacy. \nThe restaurant for breakfast skinos is so beautifully decorated. The breakfast- continental was perfect for us. Nice bagel with cream cheese, croissants fruits, yogurt. Perfect! \nWe can’t wait to come back again! Thank you","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23719753,"title":"Nice hotel for the price and location is perfect","lang":"en","publishedDate":"2023-02-13","publishedPlatform":"MOBILE","rating":4,"text":"Pros: \nComfy bed and pillows\nNice & helpful staff\nVery quiet neighborhood\nWell equipped with iron, ironing board, hair dryer, USB slots, plugs\nNice window seat to chill \n\nMain Pro: LOCATION LOCATION LOCATION\nWithin a 2-5ish min walk of 4 train stations\n15ish min walk to Battery Park, Roosevelt Park, East River, Hudson River\nAmazing food within walking distance - The Tin Bldg (a foodie heaven), Indian, Irish, Uzbekistan\/Kazakhstan, Steak, American, Mexican, Greek\n20min train ride to Times Square & Broadway\nAcross the street from WTC & Oculus\n7-11 & Duane Reed (Walgreens) super short walk\nWall St is a few blocks \n\nCons\nNo DND marker for door\nSuper heavy pocket bathroom door that could break a hand if closing wrong way\nNo fart fan in bathroom\nIf you're a make-up wearer the bathroom lighting is horrible \n\nSide con: if you have a sweet tooth and want dessert DO NOT get it from Skinos downstairs. Threw away 2 barely eaten desserts cause they were awful. Instead walk around the corner to Zaza. \n","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23719753,"title":"Great location with a modern vibe","lang":"en","publishedDate":"2023-02-01","publishedPlatform":"MOBILE","rating":4,"text":"Great location within a 2 min walk to the Wtc cortland subway station which can get you almost anywhere. The hotel room was modern and nice with everything you would expect from a hotel room. Only slight negative was the the privacy in the bathroom(no lock on the door and shower was abutted to opec glass with a clear strip so if you were using the toilet or the shower you could almost perfectly be seen by someone on the bed) We stayed on the 19th floor which was 2 quick elevator rides, one bonus about the floor was the view of the world trade centre and the night view of the city lights which were insane. Continental breakfast wasn’t great, there was a choice if coffee, tea, bananas, apples and muffins, so we opted to go out for breakfast everyday.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23719753,"title":"Avoid This At All Cost","lang":"en","publishedDate":"2023-01-23","publishedPlatform":"MOBILE","rating":1,"text":"I have a booking that I cancelled within the free cancellation period but until now they have not processed the refund. It’s been 3 weeks already and they are ignoring my messages. I tried to call but the receptionist keeps saying she doesn’t know anything about it. I was instead advised to email them so their refunds team can investigate.","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Very good rooms poor service","lang":"en","publishedDate":"2023-01-22","publishedPlatform":"OTHER","rating":3,"text":"I stayed at the hotel for 7 nights . The rooms are clean and well decorated with great view of World Trade Center. The down side are the mini bar was empty and no complimentary water at all . If you need water wether cold or hot you have to go to the lobby and take it from a machine . The front desk is awful specially at night i called them several times no one answer i called from my cellphone still no answer .and it happened again .The young girl jeanmarie also is not friendly and helpful at all . People work in the morning are much much better and friendly.\nAlso the complimentary breakfast is also a problem you have to go to the first level the bar near the entrance always bad smells and the way they put foods on the counter looks they are feeding poor people .the atmosphere was really bad . I needed to print something which was an emergency the printer didn’t work so i told the reception please try and let me know . She didn’t even call me . And i tried from the building next door.\nOverall , i could say the room is very good but the service is really poor .","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23719753,"title":"Great location","lang":"en","publishedDate":"2022-12-06","publishedPlatform":"OTHER","rating":3,"text":"Great location and the room was clean.  Free Wifi was great.  Staff was super nice!  I wish there had been vending and room service, but there were enough convenience stores and restaurants nearby to make up for it. ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23719753,"title":"Trop bien placé !!","lang":"fr","publishedDate":"2022-12-05","publishedPlatform":"MOBILE","rating":5,"text":"Pour notre huitième séjour,nous avons séjourné au financial district,et qu'elle vue!! Chambre au 22 ème étage,très calme. Bien équipée, ménage tous les jours : rien à dire ! Café et thé à volonté de 7 à 11h au 2 ème étage,et bagagerie disponible ! Top ","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23719753,"title":"Great Hotel!","lang":"en","publishedDate":"2022-12-04","publishedPlatform":"MOBILE","rating":5,"text":"We all enjoyed our stay at this hotel. Staff were so friendly and attentive. Hotel had Christmas decorations up which were very pretty. Free coffee on 2nd floor till 11am. A special thank you to the lovely Victor who helped two struggling English ladies with their bags and the lady who booked us in and thought we were sisters. \nThanks for a great stay!","travelDate":"2022-12","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23719753,"title":"Turism","lang":"en","publishedDate":"2022-11-06","publishedPlatform":"MOBILE","rating":1,"text":"Excep few people very friendly trying to help you really very bad the check-in after I payied a lot of money for 3 nights just because a problem with my credit card they almost denied my accommodations if somebody would\nPay for me the account of 75 American dollars when I could pay by cash.... the director I think he doesn’t even care about.... very noise the rooms the cleaning is ok... many problems with the lift... really to much expensive for what they give even not breakfast ... now I know a bit better the very expensive New York you pay just the name","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23719753,"title":"Good for the price","lang":"en","publishedDate":"2022-11-06","publishedPlatform":"OTHER","rating":4,"text":"I was on the hunt for the right balance of price to amenities in the financial district, and I found it at The Washington. The rooms are clean, check-in was crisp. It’s in the running to be my new regular spot in NYC.","travelDate":"2022-11","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":23719753,"title":"Lost the W Vibe","lang":"en","publishedDate":"2022-11-06","publishedPlatform":"MOBILE","rating":3,"text":"Pros:\nGreat location, close to 911 Memorial and museum, Battery Park, One World, Oculus, shopping.\nGreat views. High floors have awesome views of 911 Memorial and One World.\nFriendly staff, only if you can find someone to help you\nPrices reasonable by NYC standards, about 100 dollars less than anything around.\nComfortable beds. \nGood air conditioning\/heating. \nLarge rooms by NYC standards.\n\nCons:\nLimited staff. No valet, no bell person,no concierge, minimal front desk staff. No front desk staff early in the morning.\nNo rooftop bar; don’t let the booking sites fool you. \nThere is a bar in the lobby, but no bartender and no liquor of any kind. \nWorn W Hotel vibe throughout the hotel, dirty lobby carpets, worn lobby furniture. \nElevators constantly breaking down, long waits, and loud squeals when they open and close. \nRoom decor ok, but definitely signs of wear on the walls, floors, doors, and bathrooms. \nLots of short dark hairs in shower, definitely not mine (automatic one star deduction)\n\n359\/200 minimum","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Amazing view","lang":"en","publishedDate":"2022-10-24","publishedPlatform":"OTHER","rating":4,"text":"The staff was very nice and so helpful with accommodating us. We wanted to switch rooms and they did their best to do so. Gave us a perfect view room. The hotel is very impressive and cool looking. Location is perfect. ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23719753,"title":"great place to stay","lang":"en","publishedDate":"2022-10-23","publishedPlatform":"OTHER","rating":5,"text":"this was a welcome change having previously stayed in the Times Sq area for 3 nights.  It was quiet and very clean, function and not over fussy.  Staff were very helpful and the area generally was lovely and less crowded.  We walked a lot whilst in NY and this hotel lent itself nicely to great restaurants and the southern part of the island, could recommend","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23719753,"title":"Great Staff. Great Location.","lang":"en","publishedDate":"2022-10-17","publishedPlatform":"OTHER","rating":5,"text":"Wonderful place. \nNice sized, clean rooms. \nGreat bar, desk and housekeeping staff. \nLoved the location. Walked everywhere!\nWe had a beautiful view of Tge Freedom Tower. \n\nLower Manhattan is the place to visit. \nMolto Bene!","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23719753,"title":"Meh. Fine for the price.","lang":"en","publishedDate":"2022-10-09","publishedPlatform":"MOBILE","rating":3,"text":"The room was fine. It used to be nice. But they’ve let the whole place go. For the price, it was fine. Only one elevator working; they clearly don’t care. Most people buying through Hotwire or similar. The elevator issue is just not acceptable. Will not come again. Great location if this is the area you want.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Super Hotel direkt am One World Trade Center","lang":"de","publishedDate":"2022-10-07","publishedPlatform":"OTHER","rating":5,"text":"Ein wirklich gutes und bezahlbares Hotel, direkt am One Word Trade Center. Sauber, gute Zimmer und freundliches Personal! Das Hotel hat einen direkten Blick auf das ONC und liegt in unmittelbarer Nähe zur Metrro.","travelDate":"2022-10","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23719753,"title":"High Expectations, below average experience!","lang":"en","publishedDate":"2022-09-30","publishedPlatform":"OTHER","rating":3,"text":"The location of the hotel is awesome and the concept is innovative, but the experience is a completely different thing. The rooms were small, low quality mattresses, dirty bathrooms, lack of customer service, you can feel a weird bad vibe in the staff and the people that stays in the hotel. This is not a “4 stars hotel”","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23719753,"title":"ABOVE and BEYOND","lang":"en","publishedDate":"2022-09-28","publishedPlatform":"OTHER","rating":5,"text":"We were staying in a Suite Room! Great Views and amazing room! Bed And living room is amazing!!! For sure will come back again and will recommend it to my friends and relatives👏🏻\nThe location is close to shopping and to the memorable place of World Trade Center and an amazing One Observatory !","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":23719753,"title":"Love NYC!","lang":"en","publishedDate":"2022-09-26","publishedPlatform":"OTHER","rating":5,"text":"Great location, had a great view of the 9\/11 Memorial and WT1. Walked to the bars, and restaurants in the financial district as well as the Hudson to see the Statue of Liberty and to Trinity Church. Very close to the Rector Street subway also. They let me check in early and check out late at no additional cost. Overall a great experience and I would love to stay there again. Really couldn’t beat the view, and the window opens up about 5 inches so you can hear the sounds of the city. There was a safe in the room also, which was awesome to have!","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":23719753,"title":"Glad I picked this place. What's with the negative reviews?","lang":"en","publishedDate":"2022-09-20","publishedPlatform":"OTHER","rating":4,"text":"I think the negative reviews must be older as there is a LOT to like about this hotel\n\nThe Good:\n- Staff is very helpful \n- Checkin process was fast\n- Awesome location next to Freedom tower, Brookfield Place, Pumphouse, water front view across the Hudson of Jersey City and statue of liberty\n- Clean well lit room\n- Gym was clean and decent equipment\n- AC that actually works\n- EZ access to multiple subway stations\n- Quiet room. Maybe I just got lucky with lack of neighbors\n\nThe  Negative:\n- You always need to switch elevators going down or up to your room\n- toilet makes a loud dying animal sound when you flush\n\nThe last two are pretty minor all considering. Give this place a try.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23719753,"title":"Good stay","lang":"en","publishedDate":"2022-09-16","publishedPlatform":"OTHER","rating":4,"text":"Nice Vibe. Quality rooms. Great staff. But of course you can hear everything outside your room door and only 1 out of 3 elevators were working so the wait to just go to the main lobby was about 15mins. ","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23719753,"title":"Good experience ","lang":"en","publishedDate":"2022-09-12","publishedPlatform":"MOBILE","rating":5,"text":"So at first I kinda hesitated to book this hotel after looking at a few reviews but I'm glad I stood here  The location of the hotel is in the perfect area. Elevators worked perfect the room was clean and Makia was very helpful with everything and kind. I will be coming back to visit.","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"Great place to stay","lang":"en","publishedDate":"2022-09-08","publishedPlatform":"OTHER","rating":5,"text":"Staff was awesome and accommodating, room was very comfortable with an awesome view and very close to everyth8ng. Room cleaning service was on point every day. My only critique would be better lighting in the hallways and bathroom and the hallways could use a bit of updating. Other than that we would totally stay there again. ","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23719753,"title":"Beautiful and Great Location","lang":"en","publishedDate":"2022-09-06","publishedPlatform":"OTHER","rating":4,"text":"The Washington is located close to the 911 Memorial and pretty convenient if you want to go around Manhattan or take the boat to Staten Island or the Statue of Liberty. Hotel is also a walking distance to Brooklyn Bridge. hotel is also a walking distance to Brooklyn Bridge. The room amenities were great. The Molton Brown lotion provided by the hotel gets our thumps up. Skinos restaurant was also good.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":5,"locationId":23719753,"title":"CARINO MA ATTENZIONE ALLA CARTA DI CREDITO","lang":"it","publishedDate":"2022-09-03","publishedPlatform":"MOBILE","rating":2,"text":"Hotel carino , ma attenzione alla carta di credito. Senza alcun avviso e ricevuta, al rientro in Italia ci accorgiamo di una trattenuta di 321 dollari dalla cauzione. Dopo molti  tentativi di metterci in contatto con reception e direttore, finalmente rispondono, ammettendo l'errore e promettendo la restituzione della somma. Peccato che il giorno dopo  \" L' ERRORE \"si trasforma in una lista di tasse e \" destination fee\" , nuova costosa tassa di cui l'hotel non ci aveva messo al corrente. Avendo subito disservizi come lavandino del bagno otturato, allarme antincendio della stanza in tilt e ascensori guasti  una mattina, questo comportamento non lo trovo corretto da parte di una struttura dj questo tipo.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"Excelente hotel!","lang":"es","publishedDate":"2022-09-01","publishedPlatform":"MOBILE","rating":4,"text":"En hotel  tiene una vista muy buena de  la ciudad. \nLas habitaciones son espaciosas con un  buen colchón. Todo muy limpio.\nNo tiene calentador de agua. Eso el algo negativo. Para preparar un té o un café estando ahí. \nTiene varias cajoneras y roperos par guardar ropa. Plancha y tablero de planchar.","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23719753,"title":"W become flop pad","lang":"en","publishedDate":"2022-08-25","publishedPlatform":"OTHER","rating":2,"text":"No services. Minimal staff. Abandoned lounge and amenities. Not a bottle of water on the property but you can get a tiny plastic cup of water in the lobby. Dirty rooms stripped to only the necessities. If you want a cheap place to stay that used to be a W, you found it. If you want a welcoming hotel, look elsewhere. ","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23719753,"title":"Such a wonderful find","lang":"en","publishedDate":"2022-08-19","publishedPlatform":"OTHER","rating":5,"text":"I was traveling for work and landed on this place because it was within my cooperate travel budget. But it  turned out to be SO MUCH MORE THAN AFFORADABLE. Friendly staff, clean, gorgeous rooms. Perfect location to Battery Park and the 911 memorial. I ate at the hotel bar, Skinos, the food was delicious. I mean come on, the hits just kept playing here!. This is my go to place from now on when  I Travel to New York. And you need to make it yours too. ","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Hotel magnifico ","lang":"it","publishedDate":"2022-08-18","publishedPlatform":"MOBILE","rating":5,"text":"Ho prenotato questo albergo su booking dove avevo letto recensioni ottime. Non capisco davvero come su TripAdvisor siano così basse. Resta un mistero! \nInnanzitutto la posizione è fantastica: downtown è un quartiere tranquillo, pulito e molto sorvegliato per via della vicinanza con ground zero (c'è sempre polizia). Si trova di fronte al sito delle torri gemelle, a due passi da wall street, al world trade center, parecchi negozi come H&M, negozi di souvenir, Louis Vuitton, Gucci, e a due passi dalla zona in cui si prendono i traghetti per la statua della libertà ed Ellis island. Ci sono diversi ristoranti (consiglio Bill's burger fra tutti proprio all'angolo o il pub Hoara), posti buonissimi in cui fare colazione come dunking donuts e Starbucks. La vista dalla camera è indescrivibile (allego foto per farvi capire ma dal vivo rende molto di più)... Personale gentile, al nostro arrivo ci hanno omaggiato con un drink da consumare al bar che si trova accanto. Al quinto piano, dove si trova la reception, troverete un distributore di acqua: per noi è stato molto utile, oltre che per la sera, anche per riempire le bottigliette prima di uscire. Letti comodissimi, ferro e asse da stiro, frigorifero e phon, oltre che tutti i tipi di sapone, bagnoschiuma, shampoo e crema per il corpo. Tornassi a NY tornerei senza alcun dubbio al Washington hotel. Ci siamo sentiti davvero a casa. \nGrazie!!! ","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23719753,"title":"I Would NOT Stay Here Again","lang":"en","publishedDate":"2022-08-17","publishedPlatform":"OTHER","rating":2,"text":"The room we stayed in (1109) fell below my expectations, and they weren't very high to begin with. There was a huge spot on the wall that had peeling paint. There were dirty handprints on the bedroom and bathroom walls. Upon taking a shower, I realized that someone's hair was tangled in the shower head, and strands of hair throughout the rest of the bathroom. There were no washcloths in the bathroom. The iron and ironing board had a purple gooey like residue (probably from a previous burn) that transferred onto my clothes. Although these issues made my stay very uncomfortable, I tried to look past them because I was only staying there for one night. \n\nOn the day of my departure, the room was without hot water for hours, and I needed to leave for a meeting. I expressed the issue of the hot water to staff several times and I don't feel like they acted fast enough to assist, given that I had somewhere to be. They kept saying the hot water was back, but that wasn’t the case for my room, so I asked for another room to shower in. The manager finally came an hour after my first complaint, which was well after checkout time, offering to take me to the 20th floor. At that point the hot water was starting to come back, and I needed to leave, so I didn’t have time to move to a different room. She took 50% off the room rate. \n\nI think this hotel uses pictures of their lobby to sell rooms, but there is nothing pleasing to the eye once you are beyond that point. The room I stayed in was very small. I always hear people say New York City hotel rooms are small, but I’ve stayed in spacious rooms in the city plenty of times. The hallways are very dark and very dated. Not to mention, all the conversations and noises we could hear coming from other rooms. I will not stay at this hotel again, and will not recommend it to family and friends.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Holiday in NYC","lang":"en","publishedDate":"2022-08-09","publishedPlatform":"MOBILE","rating":5,"text":"Excellent location, near subway, World Trade Centre and Occulus centre. Rooms were fab with great views of New York. The reception area is unusual and there’s no bar or coffee dock but there are plenty of seats and a water fountain. The terrace was open at this level and I saw people bring food snd drinks out that they had purchased elsewhere.  My husband availed of the complementary coffee on floor 2  There is a sign at ground level stating reception is on 5th floor (Although having read the reviews I knew this!) We had breakfast in some of the many diners nearby - we would particularly recommend the stage door diner. All in all we would recommend this hotel to others.","travelDate":"2022-08","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":23719753,"title":"Excellent location, Friendly staff and amazing views for a value price","lang":"en","publishedDate":"2022-07-09","publishedPlatform":"OTHER","rating":5,"text":"Wow! Where to start, after reading so many mixed reviews I had low expectations. This hotel exceeded them all! The view from our deluxe double 10th floor was amazing! The beds and shower were so comfy. The staff was very friendly and helpful. The location is right in the middle of any subway line you need and close to the seaport areas for Ferrys and things. \nMy only slight disappointment was that our fridge never got as cold as it should. It did “cool” our drinks barely but not safe to store leftovers in. A microwave would be nice too but really not necessary. \nOverall I would totally recommend this hotel to anyone who wants to have a safe and convenient place to stay while on business or just visiting NYC! This comes from a family that travels all the time. We stayed 7nights. ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":4,"locationId":23719753,"title":"At best a low end 3-star hotel","lang":"en","publishedDate":"2022-06-28","publishedPlatform":"OTHER","rating":1,"text":"On arrival, after a 12h travel, we were greeted by no one. After some looking around, I found the entrance and the fifth floor of a building of this hotel. It was around 3pm afternoon.\n\nElevator stopped and I looked around at what seemed to be a hotel lobby. Dark, entrance, just like the everlasting mood of the receptionists of this hotel.\n\nI awkwardly moved to the end of the room where there was one person behind the counter. \n\nNo hi, no welcome, no are you here for the checking?, no I'll be with you in a moment, no eye contact. Just deafening silence. \n\nI checked in, they added the usual surcharge crap I always get in the states, and got 2 complimentary drinks (beer, wine, cocktails) vouchers for the restaurant. View from the room is a lie. Balcony is a lie. Usually, you would expect hotels to angle their pictures a bit and add the lights, but this is pushed to a point where it's annoying. \n\nThe receptionist informs me that I can choose the only left room on the 8th floor or on the 20th floor “but that's small so it's not really an option”. I disregard the idiotic statement and move on. At this point I should have probably cancelled the whole thing and move to a new hotel, but my fatigue wins the argument.\n\nI get to the restaurant a couple of days later they blew me off and said we only give complimentary beer or wine. What a joke. \n\nTheir rooms are old and rugged, likely they weren't touched (renovated) for the last 20years or so. The shower smells like mold.\n\nGeneral Manager “tries” to get in touch with me via phone call to the room. I get down to the reception, asking if the General Manager Brian is around, the receptionist blows me off and says that she is busy with the other clients at the moment.\n\nGM “tries” calling me again on the last day of the trip. \n\nThe positive things is the older woman that did room service every day and warmly welcomed and said hi. Price should be even cheaper for this level of service, and the location is satisfactory apart from the smell of the neighbourhood.\n\nIf I were you I'd pay a bit less and get a three star or a bit more and get a real 4 star hotel instead of risking being treated like I was.\n\n","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":3,"locationId":23719753,"title":"This is not the W Downtown","lang":"en","publishedDate":"2022-06-16","publishedPlatform":"OTHER","rating":1,"text":"I've had an amazing experience with this hotel and one of its partner websites Traveleuro. Let me explain.\n\nI went to make a reservation for a high-quality hotel downtown, and saw from my search on Google hotels that the W Downtown was available at a decent price.  Trusting from the listing this was actually the W Downtown, I made a reservation.\n\nAfter making the reservation, I wanted to connect my Marriott awards account to my reservation get points for my stay.  It was then that I found out that the hotel was sold and is fraudulently trading on the W name through the various travel websites where it is listed.\n\nMy next thought was, ok, its a boutique now... let me see what the reviews are like under new management and maybe I'll keep the reservation, and boy were the reviews bad as evidenced on this and other review sites.\n\nSo I thought, fine, if this is the case, I'm getting a refund as I was sold the hotel room under false pretence.\n\n I get in touch with Traveleuro (Splitty), they tell me they don't know the hotel changed hands (Sure...) and they have a no cancellation policy, but they'll escalate. I said I'll escalate too if I have to and dispute this charge as my credit card company has a no fraud policy and its an easy win.\n\nFrom there, the latest is that I get a message from traveleuro\/Splitty stating they indeed confirmed with the hotel it changed names and is under new management, but when they asked for an approval from the hotel for a cancellation they denied it (wow).\n\nThey are going to, they told me, get in touch with one of their \"other travel partners\" to see if they can resolve this in my favour. Good for you.\n\nTo which I replied I'm not only disputing the charge, but also contacting Marriott (I did) to let them know these companies are trading on the W name fraudulently, and if I don't get a refund, I'll contact AMEX and dispute this charge and post a negative comment on every major travel site.\n\nSo the moral of this story is, don't be fooled by this hotel being listed as the W Downtown - it isn't, and based on the review, it's gone way downhill since it was sold.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23719753,"title":"Fuyez","lang":"fr","publishedDate":"2022-06-14","publishedPlatform":"OTHER","rating":1,"text":"La vue est incroyable, mais les chambres sont vétustes ... beaucoup de mobilier abimés, les murs sales, poignée cassée, le lavabo était fendu,  dans le frigo il y avait de la nourriture des client précédent... Le wifi ne fonctionne pas, Le bar n'est pas ouvert, pas plus que la terrasse. La chambre n'étais pas nettoyée tous les jours ( malgré l'écriteaux le demandant ) ENORME déception concernant votre établissement.  L'accueil était en revanche chaleureux est sympathique mais c'est le seul point positif.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":2,"locationId":23719753,"title":"Pleasant, quiet and a stunning view","lang":"en","publishedDate":"2022-06-04","publishedPlatform":"MOBILE","rating":4,"text":"I liked this hotel for its view and a good location. I missed a lot a water boiler (to make tea) in the room but appreciated for coffee and tea between 7-11 am each day. I liked that there is TV with Netflix ( log in with your own account). Staff is friendly, Molton Brown mini cosmetics are vey nice.","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23719753,"title":"UNA MARAVILLA DE HOTEL","lang":"es","publishedDate":"2022-05-15","publishedPlatform":"OTHER","rating":4,"text":"Una maravilla de hotel tanto las instalaciones como todo el personal. Nosotros fuimos tres, y la habitacion con dos camas grandes y amplia. la limpieza muy buena, la situacion al lado del memorial 11 S. No le pongo cinco estrellas por dos detalles, en la recepcion no hablan casi español solo una recepcionista que hablaba un poquito. y que no te guardan el equipaje el ultimo dia cuando sales del hotel y tu vuelo sale de noche. Por lo de mas extraordinario. Tambien es bueno saber que te cobran 20 dolares diarios por el wifi y otras instalaciones, y es abligatorio.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":4,"locationId":23719753,"title":"Scam","lang":"en","publishedDate":"2022-05-11","publishedPlatform":"MOBILE","rating":1,"text":"Me and my sister stayed in this hotel for more than a week. Upon arrival, the procedure at the reception desk was quite messy. Right after I had paid, the system shut down, as we were told by the lady at the desk. After a reset she confirmed the amount was paid and I could see on my bank account that it indeed had been charged. We also paid a resort fee of 25 dollars per night, which seemed a crazy amount to me. The short system shutdown though obviously got things messed up, since two weeks after my return home (!) I was again charged for our stay.\nI thought I was dealing with a serious hotel that would correct this mistake, but I've tried to reach out to them several times and until now I haven't received a solution at all. Or, better said: not even a reply to the emails I sent them. \nAbout the hotel itself: the only positive thing is the location. The complete hotel has kind of a creepy vibe and it smells like marijuana, we even changed rooms because in the first one the smell was unbelievable. Very dark at the reception and in the hallways, two of the three elevators were out of order for a couple of days. \nDefinitely not the boutique hotel it claims to be. Wouldn't recommend this place to anyone.","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":5,"locationId":23719753,"title":"Disappointing and eyebrow-raising.","lang":"en","publishedDate":"2022-03-30","publishedPlatform":"MOBILE","rating":2,"text":"My partner and I visited at this hotel for a total of 7 nights in late March 2022. I booked this hotel primarily due to the cost, as I had booked it in part with a redemption of air miles so I managed to obtain a drastically reduced price. The hotel’s location and online photo gallery also seemed pretty attractive. Sadly, however, my expectations were not fully met upon arrival.\n\nWhat I very quickly learned is that The Washington seems to be a fairly young hotel, and occupies the building of the old W Downtown hotel and residences. This is fine - the decor has remained from when it was a W Hotel so the lobby and rooms are decorated to a very modern standard and are kept looking nice. However, everything else surrounding the ethos of a W Hotel is gone: service is non-existent, claimed amenities do not exist anymore, and the hotel is more reminiscent of an apart-hotel. Rather than being the “boutique hotel” that they claim to be, The Washington provides a bed and that is about it. Nonetheless, I provide here a comprehensive review of The Washington, highlighting both the positives and negatives of my stay.\n\nThe Washington is in a very attractive location. It’s across the street from the World Trade Centre, and we had an outstanding view of the 9\/11 Memorial Pools and the One World Trade Centre\/Freedom Tower. It’s only a few minutes away from many local transport connections including the subway and PATH trains over to New Jersey. Local facilities in the area are somewhat limited and expensive, given its proximity to the financial centre of New York - though convenience stores, coffee shops, cafes, and the like are no more than a few minutes away. The building of the hotel itself is a fairly nicely presented skyscraper, still baring the signs of it formerly being a W Hotel and still flying the W flag above the door - which was strange to say the least. It is beginning to look a little rundown, so a good clean of the exterior would not go a miss.\n\nWe arrived at The Washington at around 14:00 on the day of our check in. The reception is located on the 5th floor, and there are no staff on the front doors guiding guests to the reception or anybody available to help with luggage. We were able to check in almost immediately, which was much appreciated. I was charged a ridiculously expensive deposit on the room and a $20 per night “resort fee”, the purpose of which I am still confused about. The lady who checked us in was friendly enough, though my positive experience with staff at the hotel stopped at this point. On all of the other occasions when I passed through the lobby or asked reception a question, I was frequently met with a rude member of staff who was typically sat lounging about and on their mobile phone, not even stopping to look at me or greet me. On more than one occasion there was nobody even on the reception but they were rather lounging on the few sofas in reception. It was also notoriously hard to reach the reception and I couldn’t work the in-room phone at all. \n\nThere are three elevators which operate between the ground floor and the reception: these worked well consistently. The other elevators which operate between the reception and guest rooms were not as consistent. On two days we had to use the service elevator as they seemed to be out of service. These elevators are also showing signs of age: one of them has had a panel screwed onto the ceiling, indicating damage, and another is simply very dirty. The service lifts were also unpleasant and generally not a nice experience.\n\nThe halls to the guest rooms are incredibly dark. They are decorated nicely enough, but they almost have a sleezy look to them. There are no windows in the halls and I did not particularly enjoy walking around these areas. Many of the guest room doors are also scratched or showing signs of strange damage. \n\nOur room was located on the 17th floor. I was surprised at the size of it - it was definitely larger than other New York hotels in the area and boasted, as outlined above, a very nice view. The bedroom was cleaned to a high standard. In-room amenities were present, but limited: there was a safe, a mini-fridge, an iron, an unnecessarily large TV and an in-room phone. The TV worked well, though it had limited channels and the Netflix option did not work. I could not manage to work the in-room phone either. \n\nThe bathroom featured a large rainfall shower, sink, and toilet. When we arrived, Molton Brown miniature toiletries were in the bathroom though this was not maintained consistently throughout our stay, as I will outline in a moment. The bathroom was not as clean as I would expect: there was a notable amount of black mould around shower ceiling and tiles, and the toilet seat had been scratched or damaged.\n\nThe room that we were provided with had an inter-room connecting door, and as such the noise levels in the room were at times a nuisance and troublesome. The two groups of people who checked into the room next door during our stay were obnoxiously loud, and the thinness of the walls as well as the inter-room connecting door only further amplified this noise. When I complained to the reception, they sent security to the room but were otherwise unwilling to help.\n\nHousekeeping was present in this hotel and I mostly commend the housekeepers. They consistently serviced our room each day, providing us with fresh towels and new toiletries though they were often mismatched and not always Molton Brown as advertised. The room was vacuumed daily. As for the bed linen, these were changed only once during our week long stay. While housekeeping did make our beds, I noticed that the sheets were simply put back onto the bed and not refreshed. The two women who serviced our room throughout the week were friendly, and I commend their service.\n\nThe hotel, seeming to cling onto the old W Downton vibe and online photo gallery, claims to provide services that do not exist. There is apparently a terrace on the 5th floor. The outdoor space is indeed there, but it is inaccessible. Similarly, photos show a bar in the reception. The bar is there, but it is dilapidated and unused. Photos indicate that there is a rooftop area with loungers, though these were again not accessible. \n\nAs such, catering was essentially non-existent at the hotel. While there is a bar\/restaurant at street level, it did not particularly intrigue me enough to try it and I instead had to venture out for basics even such as breakfast and bottled water.\n\nOne final event which gave me a bad impression was that when we checked out, we asked to leave two small bags at the hotel for a few hours until our flight. This was swiftly rejected, claiming initially that it’s because of COVID-19, before the man then simply said there is no storage room. I don’t understand either of these claims. \n\nAs a whole, The Washington could be a lovely hotel. It occupies a nice building in a good area and has inherited W Hotels’ vibe to it. However, the hotel management should decide whether they want to be The Washington - the “boutique hotel” they claim to be - or W Downton 2.0. If they want to maintain W’s vibes, they should therefore also maintain or surpass W’s service. Otherwise, the hotel needs to become a lot more transparent in its advertising and stop claiming to have certain facilities and features that it simply does not. \n\nI am unsure as to how the hotel claims to be 4.5 stars. I would rate it more a 3 star budget hotel based on its inadequate service. The Washington could indeed be a 4.5 star hotel, but it is nowhere near that level at present.\n\nSince I did not pay a full cash price for this stay, I am not as bitter as I otherwise would be. Nonetheless, I still do not think that the air miles that I redeemed, the cash surplus, the deposit, and the resort fee were justified in cost. I am somewhat resentful of how much I ended up paying for this room, as I know that I could have gotten much better service from another nearby hotel for roughly the same cost.\n\nAt present, I would not recommend this hotel and I would not return to it. That being said, I hope that the hotel will increase its standards in due course.","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":6,"locationId":23719753,"title":"SUPER BAD EXPERIENCE","lang":"en","publishedDate":"2022-03-21","publishedPlatform":"OTHER","rating":1,"text":"Very upset with this hotel I get there late on check in when I get there the first room smell like marijuana them the concierge transfer me to other room them on the second room tv was not working at all them I call gets services them he inform me the IT will be working on reset the room but that was not the case I wait for 2 hours them I went down stairs to speak the concierge she was very sorry them she upgrade me to other room. \n\nA Manager call on on the morning to apoligieze them he make the statement sorry we will refund you one day for all this I was very upset because I move my self from two different rooms and I honestly don't recommended this hotel at all even do concierge over night she was adorable and sweet \n\nThe agency who I I make a reservation inform me  that was never issue a refund at all. \n\nVERY LACK OF COMMITMENT FROM THIS HOTEL.","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":23719753,"title":"Recycled W","lang":"en","publishedDate":"2022-03-17","publishedPlatform":"MOBILE","rating":3,"text":"This is the old W.  Whoever bought it did not make edits, so it has the W feel, but it needs maintenance. My room was clean, but needed some TLC. Thin walls. I heard my neighbor’s alarm go off and a lot of elevator dinging (my room was a couple rooms down). 20$ resort fee for a couple waters. Staff was helpful and pleasant. It’s near the world trade so I would return when I have to be down there although not enthusiastically.","travelDate":"2022-03","tripType":"SOLO"}
{"helpfulVotes":6,"locationId":23719753,"title":"Terrible","lang":"en","publishedDate":"2021-12-20","publishedPlatform":"MOBILE","rating":1,"text":"We had to go to the front desk if we needed towels, our room to be serviced, or anything else.  Our room was covered in dust, the bathroom had hair and some dried fluid (who knows what) on the toilet and sink. The fridge had black mold in it. The shower had not been cleaned. We had to use the service elevator during our 5 day stay. We wanted to leave our bags the day we checked out since we had a later flight, but they couldn’t accommodate us. It’s weird because they said it was because of Covid, but we stayed at the Hotel right across the street in July of this year and they were fully staffed, cleaned our rooms, brought us towels and let us leave our bags. I believe the owner is taking advantage of the staff and Covid situation here. They seem overworked and underpaid. I expect so much more from a hotel with this rating. They even charged us a resort fee with no amenities. Our floor smelled of smoke for half of our stay. Do yourself a favor and find somewhere else to stay. To the owner, hire some bellman and more housekeeping staff. Fix your phones.","travelDate":"2021-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23719753,"title":"Zimmer mit Ausblick","lang":"de","publishedDate":"2021-12-11","publishedPlatform":"MOBILE","rating":5,"text":"Sind als Familie zu viert für 3 Nächte in dem Hotel gewesen. Beim Einchecken hat alles super geklappt. Die Leute waren sehr freundlich und hilfsbewusst. Hatten unser Zimmer im 15 Stock mit einem atemberaubenden Blick auf Ground Zero und das World Trade Center. Das Zimmer war für New Yorker Verhältnisse groß. Es war sauber und wurde jeden Tag gemacht, was leider für New York nicht selbstverständlich ist. Weil wir am Abreisetag das Gepäck wegen COVID nicht deponieren konnten durften wir bis um 16:00 auf dem Zimmer bleiben. Wir können das Hotel nur empfehlen.","travelDate":"2021-12","tripType":"FAMILY"}
