{"helpfulVotes":0,"locationId":23887495,"title":"Fantastic hotel, stellar service","lang":"en","publishedDate":"2024-04-09","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea is an absolute gem. Skillfully updated very recently, yet they've managed to preserve the history and quirkiness in a completely sophisticated manner. The staff is uniformly excellent--helpful, polite, and efficient. The rooms--ah, the rooms! The two bedroom pied-a-terre is breathtaking and wonderfully appointed. The Lobby Bar is fantastic--great craft cocktails. The Cafe Chelsea is charming and the food is delicious. Despite being very crowded, the service was top notch. We have stayed in at least 10 other hotels all over NYC (including The Plaza) and The Hotel Chelsea is the only one we are sure to revisit!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":23887495,"title":"Xmas vacation","lang":"en","publishedDate":"2023-12-12","publishedPlatform":"MOBILE","rating":5,"text":"We came to NYC for Xmas holiday and stayed at hotel Chelsea because it’s a little far from the crowd . We were amazed with this hotel , location , staff, decor and everything . We have a 4 year old and the staff provided us with an additional bed and they were vey very nice and welcoming . The room is spacious and lots of additional closet space and bathroom is big . It was very quiet as well . The room is also clean and staff always\nMade sure of that !  Very close to subway station . We loved it !!!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Best.","lang":"en","publishedDate":"2024-04-04","publishedPlatform":"OTHER","rating":5,"text":"My 3rd stay since the renovations. Each stay tops the last. The attention to detail, respect for the original structure and history of the hotel are evident. The staff are wonderful and seem to share the same appreciation. This is a special place with a special kind of charm. Great neighborhood and location. Subway 1 block away but centrally located easy walk to Downtown, Chelsea Galleries, Greenwich Village, MSG\/Penn Station.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Our New Favorite - will always stay here","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":5,"text":"Rooms and renovation are beautiful without losing the charm and bohemian vibe .  Linens , furnishings , staff , food and drink options all first class .  In Midtown in no time \nbut come  back and relax in Chelsea .  Had a balcony room , next time will get one with bath tub .  Can't say enough great things !","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Amazing stay","lang":"en","publishedDate":"2024-04-01","publishedPlatform":"OTHER","rating":5,"text":"Super atmosphere.  Friendly staff.  Location was great to walk to so many neighbourhoods and great restaurants.  Cafe was delicious and cozy atmosphere - we were repeat guests.  Hotel is charming and the rooms are large and comfortable. \nLarge bathroom for New York hotel.  Would definitely come back and stay here again.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23887495,"title":"Rock & Roll all Grown Up","lang":"en","publishedDate":"2024-03-29","publishedPlatform":"OTHER","rating":5,"text":"Hip• Sexy•Swanky•Classic\nChecked into the hotel late after a long flight and was greeted with the warmest welcome.  Joanna at the front desk made sure that our stay would be delightful. We were in our lovely room within minutes and having drinks and appetizers at the fabulous Lobby Bar shortly thereafter.\nThe energy is real- a vibe born from decades of the artists that graced this super sexy landmark. \nIt’s a must stay!!!!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Most charming.","lang":"en","publishedDate":"2024-03-27","publishedPlatform":"OTHER","rating":5,"text":"I have never been to a hotel with such charming rooms. The staff was courteous and friendly. It was a great experience. As a former New Yorker I appreciated the history of the hotel that housed so many artists, many of which became famous.  The Hotel Chelsea will be my choice stay whenever I visit the city.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Vibes !!!","lang":"en","publishedDate":"2024-03-22","publishedPlatform":"OTHER","rating":5,"text":"The renovation of the legendary Hotel Chelsea is incredible . you can feel the vibes of creativity there . All of the attention to details are spot on. In a great Neighborhood ! Highly recommend it . tons of art in the hotel and in the Chelsea neighborhood . all in walking distance","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Stunning and comfy","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"OTHER","rating":5,"text":"This place is awesome. My husband and I were visiting to see an off-broadway noir-themed production and I wanted the place we stayed to continue that mysterious, alluring vibe. It worked out beautifully. The desk and door staff were very friendly and helpful. The room was stunning and comfortable (clean, of course). We had an interior room (which was nice and quiet) with a bay window. There are several complementary items available upon request. I asked for a yoga mat, scale, loofa and white-noise machine, all which appeared within 20 minutes. Check-in and out can be done online so all you do is grab or return the old-school room key. We're going back again in April and are staying here again. It's pricey, but totally worth it for a more romantic feeling stay.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Always a great time at The Hotel Chelsea!","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea is the best iconic place to stay in Manhattan. So beautiful, the art and the history and the people, always brings me back. Everything and everyone was excellent. The staff were very friendly and extremely helpful. The room was beautiful, clean and I had a balcony view. I highly recommend the Hotel Spa, Cafe and the Lobby Bar. It’s always a fun time! Thanks, I’ll be back! ⭐️⭐️⭐️⭐️⭐️","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"The BEST IN NYC!","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"MOBILE","rating":5,"text":"We really enjoyed staying at the Hotel Chelsea. They upgraded our room on their own, with no prompting, only a great attention to the customer. Then, they gave my husband a bottle of wine for his birthday. We have stayed at dozens of nice hotels over the past twenty years, but we have never been treated with such respectfulness and attentiveness. With other places, we often felt that they were maybe nice until you have any sort of problem or need. This place made us feel so supremely respected, something that sets the standard for all hoteliers everywhere. We only wish we had a way to thank the staff at the front desk. They were always eager to treat the guest with utmost consideration. Joanna, at the front desk on March 7th, was so genuine and so nice to us. Everyone was nice and professional. Our room was well maintained throughout our stay. We will definitely return. We highly recommend this fine NYC hotel!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Magnificent! A must stay","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":5,"text":"Magnificent! The service, staff, amenities, location is fabulous. Luxury bedding and decor, we have selected this hotel as our go to. \nCafe Chelsea is also something not to miss. Also, the spa is now open and they are amazing! \nWe have always had superb and seamless service from the reception to room service.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"A WONDERFUL HOME IN NYC","lang":"en","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":5,"text":"Is a wonderful remake of what the HOTEL CHELSEA is and was. I love the way it has been remade in all its quirks and wonder. SPA is now open. GYM is now open.  All is well at HOTEL CHELSEA I can report. \n\nHaving lived in NYC for 30 years, the HOTEL CHELSEA is the home away from home now for work, play and exploring NYC in 2024.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Wonderful time, can’t wait to come back!","lang":"en","publishedDate":"2024-02-29","publishedPlatform":"OTHER","rating":5,"text":"My husband and I stayed here in late February and it was wonderful. The hotel is lovely and the staff are so friendly and helpful. Our room was awesome and the huge bathtub was worth it. Can’t wait to come back! Ps visit the lobby bar, the cocktails are great.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23887495,"title":"Great stay in February","lang":"en","publishedDate":"2024-02-28","publishedPlatform":"OTHER","rating":5,"text":"Comfortable and clean, friendly and good vibes at the front desk. Enjoyed our stay of 2 nights and would happily return. Cafe and bar are terrific. Loved the art on the stairway walls. Expensive but enjoyed ourselves. Very quiet rooms. Took baths.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Michael G at front desk went above and beyond to make our stay memorable","lang":"en","publishedDate":"2024-02-27","publishedPlatform":"OTHER","rating":5,"text":"Super clean comfortable and fantastic ambiance \nThe best hotel we have ever stayed\nHighly recommended \nComfortable beds fantastic rooms and decor takes you back to old New York \nMichael G made our stay extremely relaxed and comfortable  \nThank you Michael G","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"In short- go!","lang":"en","publishedDate":"2024-02-21","publishedPlatform":"MOBILE","rating":5,"text":"We could not have enjoyed our stay more. From the moment we arrived, to celebrate a significant birthday over from the UK, we were made to feel welcome and every special.\nThe history of the hotel really adds to the allure, and the renovations have been completed sympathetically but clearly with a knowledge of what the modern guest will need.\nThe bar is a very cool place, no doubt too cool for me, but we were made to feel like we belonged and were well looked after.\nOverall we couldn’t have asked for a better hotel - it was the hotel staff that really made this place sing.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Best time in NY","lang":"en","publishedDate":"2024-02-21","publishedPlatform":"OTHER","rating":5,"text":"We had a wonderful time at this hotel and having a clean and cosy escape from the city. The bed was exceptionally comfortable, rooms beautifully decorated, quiet, and excellent service being able to get into a very sought after restaurant and bar. We will be back!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Such a beautiful place","lang":"en","publishedDate":"2024-02-18","publishedPlatform":"OTHER","rating":5,"text":"The fabled Hotel Chelsea, famous (or infamous) for so many reasons.\nA historical hotel that fell into decay for many years, BUT after investment and regeneration, now resembles what it was intended for.\nI took some photographs from outside and the incredibly friendly concierge invited me inside to take more photos!\nI was able to take quite a few photographs of this beautiful interior with nobody querying which was really nice. Staff were all pleasant and guests seemed totally at ease in this historic building.\nI took a menu as a souvenir.\nLovely place, fantastic interior.......but above all, friendly and helpful staff.","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Perfect NYC Hotel","lang":"en","publishedDate":"2024-02-16","publishedPlatform":"OTHER","rating":5,"text":"This is such a special hotel. It retains all of the charm that you expect from New York's most iconic hotel, but with the updates and luxe feel that make it modern and deeply comfortable. It's great for a quick work trip or a leisurely long weekend. I travel to NYC a lot and have finally found my hotel.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"A total gem","lang":"en","publishedDate":"2024-02-13","publishedPlatform":"OTHER","rating":5,"text":"Been travelling to nyc for 20 years staying at dozens of hotels.  This is the best.\n\nFrom the chill community vibe at the door to the gorgeous renovation of a historic place.  To the history. And the updated spa and gym.  Also superb (but expensive) food (nyc prices- ug!).\n\nOnly quibble is the 23rd Street vive. But it's a fantastic location for going everywhere..\n\nBeen back twice and booked 3rd stay.\n\nLove this place.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Unique and Superb Hotel!","lang":"en","publishedDate":"2024-02-06","publishedPlatform":"OTHER","rating":5,"text":"Thoroughly enjoyed our stay at the Hotel Chelsea. The recent renovation has successfully revived a classic, historic building with an amazing history. the rooms are unique and comfortable. the staff superbly friendly and helpful and the location is terrific. Hghly recommend!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23887495,"title":"Great hotel!","lang":"en","publishedDate":"2024-02-02","publishedPlatform":"OTHER","rating":4,"text":"Great hotel!  The combination of terrific value, tasteful and thoughtful renovation, great location, nice staff and interesting buzz make it my favorite hotel in NYC.  It is also worth noting that the south side of the hotel is very quiet - this is largely due to the very solid construction techniques used when it was built in 1884.  The fact that the.south facing rooms are not on 23rd street also helps.  This is my second visit in 4 months and I look forward to going back in March for business.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23887495,"title":"The Hotel Chelsea a home away from home","lang":"en","publishedDate":"2024-01-31","publishedPlatform":"OTHER","rating":5,"text":"The hotel is charming, it is located in the center of Chelsea. The front desk staff is very helpful. The room was impeccable. The art work throughout the hotel was fun to look at. I did not feel like I was in a hotel but rather a home away from home. I would definitely repeat.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23887495,"title":"A magical stay","lang":"en","publishedDate":"2024-01-29","publishedPlatform":"OTHER","rating":5,"text":"From the moment I walked in the door, I felt like the most special guest at The Hotel Chelsea. They have a way of making you feel like you’re both at comfortably at home but also like royalty. The staff was incredible from check in, to housekeeping, to the spa, to the lobby bar. Seamlessly excellent, efficient, attentive and kind. The room was absolutely dreamy, we had a beautiful balcony and a soaking tub. The room and the entire building are just gorgeous. You can see the attention to detail and craft that went into this restoration. And it’s been maintained in such a way that you feel like you’ve gone back in time but are in the most beautiful present moment.  This was everything I wanted for my 40th birthday and more. I will definitely be back, I honestly didn’t want to leave. Definitely treat yourself to this experience, visit the lobby bar for an iconic cocktail(s), get a facial at the spa, and bask in the beauty of this fantastic place, surrounded by the best people.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Impressive hotel!","lang":"en","publishedDate":"2024-01-25","publishedPlatform":"MOBILE","rating":5,"text":"A beautiful, clean hotel with beautiful rooms that are also quiet. The staff is friendly and helpful. \nI appreciate the historical aspect of the property!  Plenty of good places to eat within walking distance. Would definitely stay there again on my next visit to NYC!","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23887495,"title":"Glad we made the choice","lang":"en","publishedDate":"2024-01-24","publishedPlatform":"OTHER","rating":5,"text":"They did a great job making the hotel feel quaint and classic even though everything was new and updated.\n\nStaff was very friendly. Room was very well appointed. Overall everything about the hotel was excellent.\n\nWe forgot a whole bunch of random things in the forest was able to give us all we needed. \n\nIt was also nice to see the artwork from some of the residents along the stairwells and corridors. It was such a unique experience.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Great Stay, Highly Recommend","lang":"en","publishedDate":"2024-01-24","publishedPlatform":"OTHER","rating":5,"text":"LOVED the Hotel Chelsea. The staff are amazing, from the doormen through to room service. Rooms are great, bed super comfortable, nice bedding and cleaned to a very high standard. The bathroom are amazing, huge and great shower. I paid extra for a tub and it was definitely worth it. Breakfast at Cafe Chelsea was good, tried a number of dishes, and would highly recommend the burger also! We never made it to the Lobby bar but heard great things, and will definitely try the Spanish restaurant next time.\nWill definitely stay here again next time in NYC, love the history of the place, and the renovation is sympathetic and done well.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23887495,"title":"Writing the review as I’m staying here…","lang":"en","publishedDate":"2024-01-23","publishedPlatform":"OTHER","rating":5,"text":"I am a former hotel consultant and New Yorker who travels a lot and is very selective about the hotels I stay at. There’s got to be something beyond standard five star fare to pique my interest. Therefore the bar was high when I decided to do a staycation here in my hometown no less. And all I have to say is wow. They did a great job of honoring the soul of the old Chelsea Hotel while bringing it back to life in a more vibrant way, reviving a stretch of 23rd street and a neighborhood I’ve taken for granted. The standard Chelsea room where I am staying is small but well considered: a generous and comfy king bed, beautiful  bathroom and period furnishings that give you a sense of the hotel’s rock star pied a terre days. Hotel prices have become exorbitant and for the rate they charge they really didn’t skim on any of the details, from turn down service to the little Marvis toothpaste in the bathroom amenity kit.  The dining is not terribly imaginative but assuredly delivers the classics, and perhaps more importantly brings back a buzz and people watching element that is so rare in the city these days.  Overall a great homage and addition to this our beloved town.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Amazing hotel, they really knocked it out of the park!","lang":"en","publishedDate":"2024-01-22","publishedPlatform":"OTHER","rating":5,"text":"This was my second time staying at the hotel, I had been waiting for it to open since renovations started back in 2010. I cannot recommend this place more. Came in and stayed with my friend. I had booked the Premier and was upgraded to the pied de terre. Let me just say it was amazing. Between the history of this hotel and the design it's my new favorite spot. The only thing that was disappointing was that the bar was closed for a private event. I had been planning to go to it for the evening but I am coming back in April for a few days so I will get to hang there then. I didn't think I could love any hotel more than the Bowery Hotel but  I do. The Chelsea is the best!","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23887495,"title":"Everything and more, just stunning!","lang":"en","publishedDate":"2024-01-22","publishedPlatform":"MOBILE","rating":5,"text":"Absolutely amazing hotel, everything and more!\nFrom walking through the front doors of ‘The Chelsea’ to checking out, everything was perfect!\nSuch a stunning hotel with staff to match.\nThe lobby is warm and welcoming, stylish and charming.\nThe ‘Superb Balcony’ room was stunning and sumptuous.\nWonderful huge comfy bed and linens.\nFurnishing were luxurious and carefully thought out.\nRoom was spacious with a super king bed.\nThe room overlooked West 23rd St and had two French doors opening onto the balcony.\nThe original fireplace was a beautiful focal point.\nBathroom was roomy with exquisite fittings, massive towels and fluffy bathrobes.\nMarshall amp and Nespresso machines in the rooms are cool extras.\nThe artwork throughout the hotel is fabulous as is the magnificently restored staircase and lobby bar.\nStaff were friendly, helpful and very welcoming.\nTurn down service with handmade chocolates was a treat.\nThis hotel oozes charm, has all mod cons but respects its past.\nSimply the best hotel I’ve ever stayed it, just wonderful!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":23887495,"title":"A Stay at The Hotel Chelsea (with a side of honey and lemon)","lang":"en","publishedDate":"2024-01-20","publishedPlatform":"OTHER","rating":5,"text":"I stayed at The Hotel Chelsea the last weekend in October 2023. Like most reviewers have mentioned, I too was excited to step into history...and while my trip didn't go as planned...the hotel and the staff exceeded my expectations and made it a trip I would never forget.  \n\nI had been in NYC for a week doing some work before checking into the Chelsea for a three-day stay. At some point during the week, I must have touched the wrong subway pole because within two hours of my stay...I was down for the count. Lucky for me, the staff upgraded my room when I checked in, which worked out considering I didn't leave it for three days. The hotel staff got word that I was sick after a hilarious room service call I had with a gal named Mercedes. Soon after, there was a knock at my door...and when I answered I saw a tray of hot water with lemon and honey waiting for me. This continued throughout my stay.  I'll say one thing...if you're gonna be sick in New York City, be sick at The Hotel Chelsea.\n\nWhen I wasn't taking Benadryl-induced naps or soaking in my giant tub, I would walk out onto the balcony and watch the city work. Steps away from that iconic sign, I realized that no amount of sickness could ruin this moment. That being said, I'm looking forward to my next visit to the Chelsea, which I've already booked for early March 2024. I'm excited to see if the sensation I felt while walking to my room was, in fact, the presence of legends and ghosts...or if it was just my fever kicking in. See You Soon!","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Fantastic Birthday Stay!","lang":"en","publishedDate":"2024-01-19","publishedPlatform":"OTHER","rating":5,"text":"My husband and I had the most fabulous birthday stay at The Hotel\nChelsea! While everyone we met - doormen, bellmen, front desk, waiters, housekeepers and bartenders - were extremely helpful and friendly, Cedric at the front desk went above and beyond to ensure my husbands birthday was absolutely fabulous. Thank you, Cedric!! Aside from one of the most wonderful hotel staffs we have ever encountered - and we travel extensively - the hotel itself is chic and gorgeous. The high level of design and finishes runs throughout all the public spaces and certainly to our uncommonly large and beautiful one bedroom suite.  The amenities in the room, which included a large and varied selection of drinks, snacks and sundries, as well as the bathroom and vanity products were top notch.  We so appreciated the birthday card and lovely bottle of wine. I can’t recommend this hotel enough and can’t wait to return!","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23887495,"title":"Highly recommended: comfortable, quiet, friendly, and excellent service.","lang":"en","publishedDate":"2024-01-17","publishedPlatform":"MOBILE","rating":5,"text":"Sweet, clean, and well-appointed, room, lovely, friendly staff who seemed as jazzed to work there and take care of we guests as we were to stay there.\n\nThe only downside was the darkened closet. This is the second high-end hotel I’ve stayed at in the past few months, and the second room that was graced with so little light that you had to guess the color of the clothing you had hung on the almost invisible hangers. \n\nI think there’s some influencer who posted on the PoshHotel website that insists that guests are more appreciative of sepulchral ambience than they are of actually being able to visualize what’s in bureau drawers, on the pole, or at the bottom of the cabinet. \n\nOn the other hand, the coffee was delicious, the bathroom palatial, the bed comfortable, and the window large and operable (to a practical point). The room was also quiet and the dark was not a drawback while trying to sleep. \n\nThe location was fantastic, easily within a short walk from most places we had a mind to visit. The history of the place is astonishing, the café serves tasty food, and if we had more time, we’d be stoked to try the Spanish tapas restaurant and the bar that were on site. \n\nA total treat!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"A gorgeous walk back in time with perfect service","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"MOBILE","rating":5,"text":"The hotel was recommended by a local NYC friend. The location is brilliant for Manhattan, East and West Villages and the high line. The building is historic, impeccably restored with brilliant service.\nIt’s a walk back in time, without any of the old or dilapidated aspects one would find in older hotels. \nThe bar is gorgeous and the cocktails to die for. \nFully recommended!","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"High praise for the Hotel Chelsea","lang":"en","publishedDate":"2024-01-15","publishedPlatform":"OTHER","rating":5,"text":"Chosen place to stay when visiting NYC xx\nThe staff are wonderful, the location is central and the building itself (aside from being historic) is beautifully outfitted. Also love the lobby bar for a work session or lovely late night drink. Highly and warmly recommend ❤️","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Superb in every way","lang":"en","publishedDate":"2024-01-14","publishedPlatform":"OTHER","rating":5,"text":"Superb in every way.   No need to say anymore, but the rooms are beautiful and authentic, the staff is great, and it is an experience in itself.  It is great that they were able to maintain the original ambience of the hotel, while providing all the amenities of a high end establishment.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Not cheap, but actually worth it","lang":"en","publishedDate":"2024-01-13","publishedPlatform":"OTHER","rating":5,"text":"Celebrated New Year’s Eve in the city and stayed at the Chelsea. The suite with the balcony is like having an apartment and it’s awesome.\nIt has real character and charm besides being high-end and well furnished. You can’t get the same feeling in a place made of concrete and glass.\nThe soaking tub was great the bed really comfortable, the staff definitely aiming to please","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Old classic back to town","lang":"en","publishedDate":"2024-01-10","publishedPlatform":"MOBILE","rating":5,"text":"An old classic back to life almost intact. I ve been here several times\nIn the 90,s and it was wonderful to be back and also have a permanent resident near our room.\nRooms large and comfortable staff kind and helpful. The lobby bar which I did not remember is a nice spot.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Most helpful, polite, ready to assist customer needs that I found so far in New York. They make you feel like a king.","lang":"en","publishedDate":"2024-01-09","publishedPlatform":"OTHER","rating":5,"text":"I was impressed by how polite and helpful the staff is. The greet you all the time, the hold the door for you, they come to your room and ask how you are doing, etc. Make you feel like a king. Often in New York people providing service can be rude. Not the Chelsea Hotel staff! Staff are trained to make the customer feel appreciated. Good job Chelsea Hotel!","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23887495,"title":"Fabulous","lang":"en","publishedDate":"2024-01-01","publishedPlatform":"MOBILE","rating":5,"text":"We visit New York City 2-3 times a year and have stayed in many hotels. Most have been ok but we’ve been wanting to find a “favorite”. We finally did. The Chelsea hit all the sweet spots. Fantastic staff. Michael at the front door couldn’t be more personable, helpful and attentive. The front desk staff were friendly and pay attention to detail. I asked for something to be delivered to our room that couldn’t be accommodated before we needed to leave for dinner. I stopped at the desk to cancel the request until later. Upon our return they asked if we still needed the delivery. Remembering the little things is so important. \nThe room was small but well laid out, the mini bar is stocked with fun high end items and it was clean and comfortable. \nThe lobby bar is fabulous. Natasha and Corey were friendly, efficient and fun to talk to. We stopped in every night we stayed. \nSee you in March. Cheers.\n\np.s. \nI was back in the city last month. Couldn’t stay here because I was with a friend and there are no double rooms. 😞  We did, however, come for dinner. Anika took very good care of us. Stopped and said hello to Michael who was just as charming as ever.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Beautiful hotel","lang":"en","publishedDate":"2023-12-31","publishedPlatform":"OTHER","rating":5,"text":"Beautiful hotel which was in a really good position to visit the sights in New York.\nHotel was clean and tidy.\nStaff really helpful and knowledgeable.\nI would recommend this hotel and will definitely stay in it again.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23887495,"title":"An unforgettable Christmas stay","lang":"en","publishedDate":"2023-12-29","publishedPlatform":"OTHER","rating":5,"text":"When I was 18 I watched the somewhat highbrow BBC Arena arts documentary about life at The Hotel Chelsea, it had fascinated me and I'd always wanted to visit. With the refurb finished, and despite some reservations about gentrification, I decided that we should go and stay over Christmas. It was expensive and towards the top of the budget so my expectations were high. But delighted to say I loved my time there and felt really at home. They were kind enough to offer us an upgrade to the Pied a Terre apartments, which really helped us have a great and relaxing stay.\n\nI really have no criticism of the apartments the beds were super comfortable and the apartment spacious and homely, but sone with style and taste. There where a few minor wrinkles that I only mention as to offer scope for making things even better: 1) There are some paint splatters on the grey\/white marble tiles, it just needs someone with a good eye to scrap them of. 2) Some of the bathroom fittings are a little poorly done (loose or away from the wall), and again a component maintenance man could fix these. 3) Brass is a nightmare as it needs polishing, in general I didn't might the patina but around the toilets and in the bathrooms it looked a little unclean. 4) The sealant around the bath in 3E is beyond amateurish, it just needs redoing. 5) The hallways could benefit from some coat storage to prevent clutter in the apartment, especially if the weather is poor you've nowhere to put wet things. 6) The lighting in the closets is a great idea, but the top shelf stops the light illuminating the clothes making it a little useless. None of this impinged on our stay and the uniqueness and history more than made up for those tiny details.\n\nNot sure how I can justify and return visit but I'm working on it. Loved it.Thanks to all the staff in the hotel and Cafe Chelsea for the warmth and hard work.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"While the word is hackneyed it’s “cool”","lang":"en","publishedDate":"2023-12-28","publishedPlatform":"MOBILE","rating":5,"text":"Only an overnight stay en-route ex the QM2 to Maine.\n\nWhat a fabulous place.  Superb staff, extremely comfortable and the room (upgraded) was an absolute belter. \n\nThe bar quite literally blew my socks off - it was rammed and had a really great NY “feel” \n\nI absolutely loved it (darling)","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"One year anniversary holiday trip","lang":"en","publishedDate":"2023-12-27","publishedPlatform":"OTHER","rating":5,"text":"We picked The Hotel Chelsea for our one year anniversary trip to NYC. The hotel did not disappoint and was very accommodating of our needs. Picture perfect stay for the holiday season. The neighborhood had great shops for shopping. The location was great for getting to the Broadway show in Times Square. We will definitely be back. ","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"My favorite hotel ","lang":"en","publishedDate":"2023-12-22","publishedPlatform":"OTHER","rating":5,"text":"I stayed at the Hotel Chelsea twice this year and I’m staying again in 2024. It’s my favorite hotel. It’s spectacularly clean and comfortable, filled with history, the staff is so kind and helpful. Absolutely worth it.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23887495,"title":"Worth the renovation cost -~it’s outstanding. ","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"OTHER","rating":5,"text":"The most exceptional hotel from top to bottom. The staff are warm, friendly yet very professional. Adhered to my every need whatever I asked for they would get it.  The rooms are gorgeous. What else can I say ~maybe bring a piano in bring the music back I’ll play for free. Love love love. ","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"WONDERFUL!","lang":"en","publishedDate":"2023-12-18","publishedPlatform":"OTHER","rating":5,"text":"The only place we ever want to stay in NYC. The attention to detail in design is outstanding. Thoughtful touches around every corner. The restaurants and bars are elegant, delicious, and friendly. A really special place and worth the money. The location is perfect to get to anywhere in the city and the unique history of the hotel adds a level of mystique and glamour.  A very special mention to Michael and Marissa at the front desk who were so kind and generous during our stay! This hotel should be on everyone's list to try and, as a travel agent, it will be an easy sell to my groups and individual clients. Highly recommend! ","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Amazing Stay","lang":"en","publishedDate":"2023-12-12","publishedPlatform":"OTHER","rating":5,"text":"What a wonderful stay at the Hotel Chelsea. From check-in to check-out our stay was tremendous. The hotel just oozes with character and history. The staff were all wonderful and our room felt like our own mini apartment. All of the amenities were top notch, the bed was comfortable and the mini bar and snacks in the room were the best we've ever seen. This is now our go to hotel for future trips into the city.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23887495,"title":"Lovely hotel in a great location","lang":"en","publishedDate":"2023-12-12","publishedPlatform":"OTHER","rating":5,"text":"We stayed for 3 nights in a Junior Balcony Suite. and loved this place. \nVery large well appointed room with a super comfortable bed and lounge area.\nBar and restaurant both vibrant with good service.\nGreat location on 23rd street, with subway 100yards away and a ten minute walk to Greenwich Village.\nNow our 'go to' hotel in New York","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"My favorite New York hotel!","lang":"en","publishedDate":"2023-12-05","publishedPlatform":"OTHER","rating":5,"text":"The hotel is historic and legendary, old with beautiful architecture.  The renovations to the guest rooms and the interior spaces has restored its elegance, and my room and bed were very comfortable and well appointed. I will stay here again and highly recommend it to others.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"What an Experience!","lang":"en","publishedDate":"2023-12-05","publishedPlatform":"OTHER","rating":5,"text":"Thank you for your hospitality, we truly enjoyed our experience!  The hotel is absolutely beautiful.  The food and drinks were so delicious but it was your team that truly made it special.  We were constantly greeted with a smile and care.  We look forward to returning next time we're in the city and I'll ensure to recommend Hotel Chelsea to others.  Keep up the great work!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Great  stay in every way.","lang":"en","publishedDate":"2023-11-29","publishedPlatform":"OTHER","rating":5,"text":"The hotel has captured the essence of old world luxury while tastefully updating the amenities - everything works and yet the feeling is of a luxury hotel from years ago. The staff is extremely helpful and responsive. \nI am glad we had a chance to experience this restored architectural masterpiece.","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Chelsea Hotel- The Place To Stay and Enjoy","lang":"en","publishedDate":"2023-11-28","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea is an upscale hotel with terrific staff, pristine, full of luxury amenities, with a great locale and an excellent Cafe Chelsea full service restaurant and the Garden food service.\nThank you for the top notch Chelsea room.\nSincerely,\nAntoinette Lucente \nA repeat customer","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23887495,"title":"Beautiful and charming hotel!","lang":"en","publishedDate":"2023-11-28","publishedPlatform":"OTHER","rating":5,"text":"When I walked into the hotel, I felt like I went back in time. The lobby and rooms are beyond charming. Yet, the hotel felt very modern at the same time. From the Nespresso machine to the rain shower, I felt pampered from the moment I stepped into The Chelsea. Super convenient to the Subway. I was into and out of the city quickly and easily. My room was so quiet and super comfortable. I was in New York for business, and I never sleep well on business trips. Except this time. I am already looking forward to another stay at The Chelsea. Wonderful staff. Beautiful hotel. I loved every minute and wished I could have stayed longer.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Beautiful, inviting and cozy - highly recommended!","lang":"en","publishedDate":"2023-11-27","publishedPlatform":"OTHER","rating":5,"text":"Our stay at The Hotel Chelsea was superb. The staff was friendly, helpful and always went above and beyond. The ambience is beautiful and inviting; we ate breakfast in the gorgeous lobby most days and loved it. Our room was impeccably clean, expertly furnished and decorated, and very quiet even though we were directly on the streetside of the building with large windows.\n\nWhen we return to New York for our next visit, we will absolutely be staying at the Chelsea again; the location, charm and comfort was unmatched. Highly recommend for those that don't want to be directly in the mad bustle of Times Square, but still want to be a highly walkable area with quick access to multiple train lines. ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"One of the most charming hotels I’ve ever been to in my very long history of traveling","lang":"en","publishedDate":"2023-11-24","publishedPlatform":"MOBILE","rating":5,"text":"I cannot even begin to explain how amazing my stay was at Hotel Chelsea. There’s so much history and charm in every corner of the hotel. The staff are very friendly and you feel like you’re coming back home which is something very unlikely at most hotels. My room was very cozy and the attention to detail in the design and the service is impeccable. I also forgot to mention how nice and well equipped the gym is and it was a big plus for anyone who likes to get in a work out while traveling. This is definitely my favourite hotel in New York and I am never staying anywhere besides Hotel Chelsea whenever I visit.\n\nI would like to thank everyone from the front desk to the house keeping, restaurant staff, and room service for making my stay unforgettable.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":23887495,"title":"GREAT people, but way too dark and loud for us. ","lang":"en","publishedDate":"2023-11-24","publishedPlatform":"OTHER","rating":2,"text":"To start, I HATE writing anything but stellar reviews, so please understand this is tough, but I want to be honest. \n\nThe people who work the hotel are amazing. Happy, upbeat, great service and willing to go that extra mile. Michael, one of the porters is exceptional as was Tom from the (future to open) spa. THEY, I suspect -along with all of the other great people-are what make the reviews of this hotel so great. \n\nBut for me and my wife it ends there,\n\nThe hotel is old. It has some charm and appeal, but know that it's loud, sound carries and the walls are not thick. You'll hear a lot from outside your room and for me, that really affected my sleep and experience, \n\nThe rooms are small, and while that's expected in NY, for what I paid, I can get much bigger in other parts of the city where I feel there is much more to do. It was me and my wife and there just wasn't enough room to put our clothes away. And nobody told us that the balcony we had on the room was a shared balcony with several rooms, so people could walk right by the room if they wanted.\n\nThe bathroom is big compared to the room, but REALLY wonky. Took forever to get the temp of the water right and even then, if we used the overhead shower, water ended up all over the floor. VERY odd. \n\nThe bar was nice, but the drink was awful and the server seemed like they couldn't care less about us. Not a smile, not any pleasantness. Maybe they were having an off day, but it definitely detracted from the experience. \n\nBut the real reason for writing this review isn't the paper thin walls or the wonky bathroom or even the small room. It was how dark everything was. Like REALLY dark. We turned all the lights up to their fullest and we still couldn't even see into our drawers in the closet. It was very dim and very depressing. So much so that we actually checked out and found another hotel. I've never done this before. The darkness was so depressing. I realized that I like light and airy and fun. Sadly, this hotel was none of those. \n\nSo, I am sure that for many out there reading this, the nostalgia of the old building or the great people or the antique pictures will be the allure. It simply wasn't;t for me and my wife and while I had a hard time writing this, I wanted to be honest for all those out there who may be like minded.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Classic NYC hotel experience you don’t get many places anymore.","lang":"en","publishedDate":"2023-11-23","publishedPlatform":"MOBILE","rating":5,"text":"What a great hotel. Classic, real hotel experience that unfortunately you don’t get many places. Will definitely stay at the Hotel Chelsea again on our next visit to nyc. The hotel is classic in every way, the details in the room from the furniture to the light switch’s make your feel like you are staying in a real classy place.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Our stay at The Hotel Chelsea was the best part of our trip.","lang":"en","publishedDate":"2023-11-22","publishedPlatform":"OTHER","rating":5,"text":"This was my husbands first trip to NYC, we covered a lot of ground. We visited the 911 Memorial, OWTC, The Late Show, museums, broadway show, Highline and lots more and staying at The Hotel Chelsea was the BEST part of our trip! The staff and all the amenities were awesome. Every day we made time to come back and relax in our room, that was not on our agenda :) We can't wait to come back!","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Beautiful stay and exemplary staff ","lang":"en","publishedDate":"2023-11-14","publishedPlatform":"OTHER","rating":5,"text":"Our daughter was married at your hotel this past weekend and the entire stay was a magical and perfect experience. The hotel is so beautiful. The rooms were spotless. Every single employee we encountered during our stay was friendly, kind and accommodating. I was struck by how happy they all seemed to be doing their jobs. I’ve traveled all over the world and this collective staff of employees is the best I have ever encountered. Highly recommend and we will be back in the future. Thanks to all for making this such a wonderful experience! ","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23887495,"title":"Amazing - 5 stars","lang":"en","publishedDate":"2023-11-14","publishedPlatform":"OTHER","rating":5,"text":"We went for a wedding on 11-11 in the hotel. Everything was amazing. When we booked it , I reached out to hotel and they accommodated us like we were vip guests. The hotel is iconic and you feel a part of history. The room was clean and comfortable with all the amenities. We all had a good night sleep !  The staff was incredible . From front desk to the people working the wedding. They smiled and laughed and joked around and it was like being at a friends for a party !  We were given a comp breakfast bc we thought they had a continental and we were wrong but they did made sure we ate anyway ! I can’t wait to go back and stay again ! ","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"A fabulous few days at the Chelsea Hotel","lang":"en","publishedDate":"2023-11-13","publishedPlatform":"OTHER","rating":5,"text":"Everything was about as perfect as it gets.  Everyone on staff was very friendly and efficient.  Our room was gorgeous and so comfortable.  Turn down service in the evening included bottled water and chocolates.  The hotel is beautiful and full of art and history.  I felt special and privileged to be staying in this historic place.  The only negatives were a long wait to be seated in the Cafe Chelsea even though we had a reservation.  But the staff made sure we had champagne and appetizers while we waited.  The air conditioning was not working properly but staff addressed it immediately and we were given a free breakfast.  The neighborhood had some construction going on but other than that, it was pleasant enough and close to some good restaurants and shopping.  Another plus - we could see the Empire State Building from our room.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Surpassed my great expectations!!","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"OTHER","rating":5,"text":"We truly loved our stay at the absolutely sensational Hotel Chelsea. Warm, welcoming,  professional staff, gorgeous rooms and a fabulous location.  Bed was super comfy and the room was quiet. Thoughtful amenities including coffee in the room and if you forget something, the hotel has you covered with anything you might need.  Cool, vintage vibe with lots to take in around every corner. \n\nSo much to do nearby including the Gotham Comedy Club next door, amazing restaurants (Buddakan!) Chelsea Market, The Highline, and the list goes on…for my gym friends, Peloton studios is a 15-20 minute walk, Row House is across the street and Orange Theory is just 300 m away if that’s your jam.","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"Always a memorable stay","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"OTHER","rating":5,"text":"We have been staying at the Hotel Chelsea since it opened. Every stay has been great. The front desk staff are always friendly and helpful. The rooms are designed with great care: modern but with respect for the history of the building. The beds are super comfortable and the bathrooms luxurious. \n\nThis trip we ate at the newly opened Cafe Chelsea. The food and service were exemplary. It is the perfect place for a leisurely breakfast. Also, we always enjoy dinner at El Quijote. Both restaurants are accessible from inside the hotel and perfect for nights when you don’t want to venture too far away. \n\nWe are looking forward to our next stay before the year ends. \n","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"On repeat","lang":"en","publishedDate":"2023-11-09","publishedPlatform":"OTHER","rating":5,"text":"My third? fourth? Solo stay? Feels like a secret (but popular) getaway…\nSo unique, and beautifully restored! The beds are deeply comfortable, the staff is upbeat and ready to assist - both the Cafe & the Lobby Bar are destinations unto themselves .. both spaces are sexy with good lighting and interesting patrons.\n","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Best Hotel Ever","lang":"en","publishedDate":"2023-11-08","publishedPlatform":"OTHER","rating":5,"text":"Simply stated, one of the coolest hotels anywhere. From the oversized suite 1,100sq ft, to the amazing balcony, lobby, bar etc.  Our room (#3-U) had a full fancy kitchen, a giant bathtub a separate shower, and an awesome design overall. Love the artwork throughout the hotel. We even had a washer and dryer.  It definitely put a dent in the wallet but worth every penny.   Major thanks to Michael at the door and Courtney in the lounge, both consummate hospitality pros.  Sadly, no ghost sitings. ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Best Historic Hotel in NYC","lang":"en","publishedDate":"2023-11-07","publishedPlatform":"OTHER","rating":5,"text":"As a history lover, staying at the Chelsea Hotel was a once in a lifetime experience that I hope to repeat one day. I loved it! Everything was perfect! I'm addition to the great ambiance, the bed was very comfortable. I loved having one of the iconic balcony rooms all to ourselves.","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Hotel Chelsea is the coolest new hotel in NYC","lang":"en","publishedDate":"2023-10-31","publishedPlatform":"OTHER","rating":5,"text":"This was my first time staying at the hotel, and I must say that I was thoroughly impressed with every aspect of my experience. Every staff member I encountered was incredibly friendly and helpful. The attention to detail in my room was impeccable, and the hotel itself perfectly embodied the historic charm of New York City. I was thoroughly impressed and can't wait to return!","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Hotel Chelsea is a stunning experience ","lang":"en","publishedDate":"2023-10-31","publishedPlatform":"OTHER","rating":5,"text":"The re-opening of this legendary place has been done with care.  It's a beautiful building.  Nice refreshed spaces lovingly (and slowly!) done.  Some of the long -time residents are still there (though if not gratis, probably could not afford to eat or drink at the pricy restaurants).  Towering over all else - the service - effortless, kind, genuine.  The other guests are hence really down to earth (they talk to you!) and a diverse (though well heeled, to afford these prices) blend.  And while the comfy, clean and cool rooms are dark (small windows, poor lighting) and a bit small for the price - overall, the experience puts it up there as one of NY's best hotels.  I'll be back!   ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Amazing Experience","lang":"en","publishedDate":"2023-10-26","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea always feel like stepping back in time with rock n roll royalty. Once one walks in the front door and is surrounded by artwork that was traded by many of the past residents for rent they know this will be a different hotel experience. The charming front desk staff are knowledgeable and efficient. The rooms are decorated in a manor that are elegant in an old world\/rock way. I love the “burn” holes in the curtains, the brass finishes and the abundance of marble in the bathrooms.  I highly recommend this for lovers of art, music and unique interior design.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Wonderful Stay","lang":"en","publishedDate":"2023-10-25","publishedPlatform":"OTHER","rating":5,"text":"The experience was truly magical.  We had read some of the articles and books about the hotel and its renovation and the hotel and staff delivered.  The decor in the suite we had was par excellence, and although our stay was only one night, it will be remembered always.  This will work for future business stays for me as well because of proximity to subway.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"High quality, unique experience, full of character and history","lang":"en","publishedDate":"2023-10-24","publishedPlatform":"OTHER","rating":5,"text":"High quality, unique experience. The renovation is a masterpiece and still holds and honors the essence of the Chelsea while elevating it even further. Everything was perfect and with so much rich history and character. Lively and fun atmosphere in all of the hotel cafes and bars, never sleepy in the city that never sleeps. The staff was attentive and warm. Walking in felt like coming home and it's partly because the Chelsea is still home to actual tenants who have lived in the building for over 40 years. \nThere is original artwork by former tenants everywhere. There are original castings and architectural details from the 1800s. \nA highlight of the trip was having a private tour of the hotel from William, hopefully that will continue as it really enriched our experience of the hotel and solidified our decision to come back for another stay as soon as January. \nThe bed and pillows were very comfortable. The balcony doors and windows surprisingly blocked out the street noise, and we had a room on the 23rd Street side, but we didn't hear any street noise. The lighting is perfect and all have dimmers. The walls are thick and we didn't hear any neighbors from any angle. It was quiet, peaceful, comfortable, romantic and wonderful. \nThe only negative would be that our fridge had a divider that only allowed it to hold drinks and not any take out boxes, but all of the rooms in the hotel are different, so other rooms probably have a different fridge. \nOtherwise a perfect stay and cannot wait to come back again and again! ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Hotel Chelsea - One of a kind, and now ultra luxe ","lang":"en","publishedDate":"2023-10-24","publishedPlatform":"OTHER","rating":5,"text":"A legendary property now updated to perfection; history, style, comfort and service in equal measure. Easily my favorite place to stay in New York now. The design update is flawless. The bar is one of the best in New York. Rooms are spacious and appealing. Restaurants are fabulous. ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Ecstatic to check in, reluctant to leave! ","lang":"en","publishedDate":"2023-10-23","publishedPlatform":"OTHER","rating":5,"text":"A dream come true to stay at the Chelsea. From the moment you walk through the door, you're treated like the stars who lived here and created so much art here. The staff are fantastic, the atmosphere is such a vibe and the rooms are fantastic. The Chelsea is one of the best hotels I've ever stayed in and the only disappointment I felt during my stay was when I was packing my case to leave. A must-visit hotel in New York city. 10\/10. Thank you to the team for such a welcoming, brilliant stay. ","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Ett andra hem","lang":"sv","publishedDate":"2023-10-23","publishedPlatform":"MOBILE","rating":5,"text":"Att bo på Chelsea Hotel är som att komma hem. Rummet var väldigt vackert inrett och sängen var otroligt skönt. Det fanns allt som en gäst kan behöva. Minibaren var mer att se som en maxibar. Och badrummet var utrustat med allt som även den mest kräsna kan behöva.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"The best hotel in New York","lang":"en","publishedDate":"2023-10-19","publishedPlatform":"OTHER","rating":5,"text":"We had our wedding here and stayed for a few extra days. I can't say enough good things about the service of this hotel, the quality of the food or drinks and how nice everyone you meet there are. The renovation has been done meticulously well.  ","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"A PERFECT STAY","lang":"en","publishedDate":"2023-10-07","publishedPlatform":"MOBILE","rating":5,"text":"Our stay at the Hotel Chelsea was absolute perfection. From our beautiful and immaculate  room to the friendly and helpful staff to our wonderful meals and drinks at Cafe Chelsea and the Lobby Bar to wandering the halls and admiring the art — we loved it all. We definitely felt we were part of something special and historical and magic.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Fantastic stay","lang":"en","publishedDate":"2023-10-03","publishedPlatform":"OTHER","rating":5,"text":"The story of the Hotel Chelsea is what drew us there. It didn’t disappoint. So much history!\nThe staff were exemplary and the comfort and attention to detail in the room was excellent, including the umbrella in the room to use during your stay. \nWe’d love to return some day. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Best NYC hotel","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"OTHER","rating":5,"text":"Best NYC hotel experience we’ve ever had. The details from decor to the cafe are exceptional, and the beds are incredibly comfortable. Highly recommend getting a room with a tub, and also ordering the chocolate soufflé at the cafe, as well as everything else on the menu.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Great Experience","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"OTHER","rating":5,"text":"Everything was great.  The people working here are very nice and helpful, the lobby is large and comfortable, the decor throughout the hotel is very nice, the room was clean with a large closet and large bathroom, the soap\/shampoo were very nice, the cocktails in the bars were creative and strong, the location was very convenient since most subway lines have stops on 23rd st.  Will definitely stay here again. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Book a place in history","lang":"en","publishedDate":"2023-09-30","publishedPlatform":"MOBILE","rating":5,"text":"Favourite Hotel in NYC 🥰 My husband booked this place for us in August to stay. The rooms are stunning and immaculate throughout. The staff are welcoming and friendly. The whole place has got so much history and tales to tell, you felt you had a connection to the place. We didn’t eat here and only used the bar once. The room bar is overstocked from a chocolate bar to something for the weekend!!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Magic Chelsea Memories","lang":"en","publishedDate":"2023-09-29","publishedPlatform":"OTHER","rating":5,"text":"The service at the hotel was exemplary and we were made to feel welcome and all our questions were answered patiently and politely. The bar was amazing and I have to mention the delicious cocktails, shout out to the mixologist! I loved the room, the decor was respectful to the hotel´s heritage but also cosy and fashionable at the same time, and the room had all the modern amenities you could wish for. The bathroom was divine and I could have stayed in the huge shower for hours. The bed was so comfortable, I should have checked what kind of mattress it was as I want one! We stayed in a balcony room and so got to pose under the sign which was another great memorable moment for me. I´ll be back one day and for longer next time! ","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"We loved everything about Hotel Chelsea!","lang":"en","publishedDate":"2023-09-26","publishedPlatform":"OTHER","rating":5,"text":"The hotel has struck the perfect combo of fresh while nodding to it’s storied history. The rooms are gorgeous (nespresso maker!!!) with beautiful bathrooms and the service was fantastic. Great location, too.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Less than memorable","lang":"en","publishedDate":"2023-09-23","publishedPlatform":"MOBILE","rating":3,"text":"We were interested to stay here having read about the reopening of the hotel and its history. But our experience was rather disappointing. \nWe had one of the larger rooms on 10th floor which was a nice size  and I quite liked the furnishings though my husband was less enamoured. The big problem though was the lack of light. When it was dark outside the level of lighting in the room was far too low. Even worse there were no proper reading lights beside the bed so reading in bed was impossible. How was this overlooked in the refurbishment?\nBreakfast was ok but not brilliant. I thought the fruit was tainted on our first morning but my avocado toast was better another morning. \nMost of the staff were nice and friendly with a couple of exceptions. On our first morning the hostess continued talking to a colleague and left us standing at the door so in the end we seated ourselves. And finally when we left at 5am and the hotel was otherwise deserted, the two receptionists  left us to struggle with our luggage through the front door as we left rather than help us. \nOverall: a somewhat dreary experience.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Williams Tour","lang":"en","publishedDate":"2023-09-19","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea  has been richly renovated  with elegance and warmth. We enjoyed a really fine dining experience and to top off a stay that exceeded our expectations Williams historical knowledge of The Chelsea created a spellbinding tour that Is not to be missed . \nThank you for your time William and the unique touch you bring to this iconic NYC Hotel\/Destination .","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Unique New York Experience","lang":"en","publishedDate":"2023-09-16","publishedPlatform":"OTHER","rating":5,"text":"A beautiful and stylish restoration of a historic hotel but with all expected comforts and with artworks (and reputedly a few ghosts) everywhere. Young and enthusiastic staff. Excellent service in bar and restaurants. Great location handy to subway and neighborhood restaurants.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Unbelievably amazing","lang":"en","publishedDate":"2023-09-16","publishedPlatform":"OTHER","rating":5,"text":"What a wonderful place to stay and the friendly, kinda staff were superb! The hotel has such amazing charm and history it truly felt like a museum we stayed at! We even got a tour guide from the hotel named William- and he gave us such a special tour to add to the excitement of that place! It was wonderful - the hotel room was sooo spacious and beyond cozy! Cleanliness was at its finest!!!!! The food was impeccable and delicious - every bite was remembered! Thank you to William and the entire staff for such a great stay at CHELSEA HOTEL! My mom, sister and I had a very memorable week! \n\nLove, \nChelsea","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Magic is Still There","lang":"en","publishedDate":"2023-09-16","publishedPlatform":"OTHER","rating":5,"text":"The magic of the Chelsea still exist. Now completely updated but not an ounce charm was lost. The old bones of the building stand strong but now highly polished as they deserve. The new staff compliments the original tenants that were allowed to stay. Great respect was given to the building and its people. I was truly treated as one of them making it a memorable experience. This is not a typical hotel stay. It is special and you deserve it! ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Rock n roll hotel gem in the heart of the city","lang":"en","publishedDate":"2023-09-14","publishedPlatform":"MOBILE","rating":5,"text":"I stay here all the time exclusively. I love the staff, rooms, the pillows are the fluffiest. I appreciate the historical significance, art work. Great to have meetings at and crash at. Lobby bar is great and the cafe is one of the best in all of New York.","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Bday fun in NYC!","lang":"en","publishedDate":"2023-09-11","publishedPlatform":"MOBILE","rating":5,"text":"So this hotel was a perfect fit for our three nights of fun in NYC!\nFirst of all the hotel itself was just beautiful, rich in history, beautiful rooms and every staff member really gave us that nice warm feeling of “it’s great to have you here”\nCentrally located for all things NYC …. Uber was always 1 minute away! And the subway too is just right there!\nThe bar and also the breakfast at the bar had lots of “wow!”\nHistoric and beautiful! We really loved it and had a great time! Definitely would return!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Wonderful Iconic Hotel","lang":"en","publishedDate":"2023-09-11","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea is in the heart of Chelsea and has been restored to an extremely high level.\nIt is such an iconic and historic building and is festooned with the artwork of the residents who used to pay their rent by giving the hotel pieces of art.\nThe bars are beautiful and the bar staff, and all the other staff are exceptionally attentive and professional.\nThe rooms are very well equipped and very comfortable.\n\nIt was an absolute pleasure staying here.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Love this Hotel","lang":"en","publishedDate":"2023-09-11","publishedPlatform":"OTHER","rating":5,"text":"We loved our stay at the hotel. We had a balcony which was super and sitting in the lobby for people watching during Fashion Week was tremendous.  Joanna at the front desk was especially accommodating and we appreciated that. Highly recommend this hotel.","travelDate":"2023-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"A Gem of a Property","lang":"en","publishedDate":"2023-09-07","publishedPlatform":"OTHER","rating":5,"text":"Hard to top this experience I'd say! We traveled up for the US Open with some friends and collectively had an amazing time! We felt welcomed, extremely well cared for, property was beautiful and staff was so attentive to every detail!!! I've found my new go-to when we need to stay in the city. Short walk to Penn Station as well, which never hurts, but that was far down the laundry list of things that made the Hotel Chelsea impressive.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"A magnificent place to stay and play","lang":"en","publishedDate":"2023-09-05","publishedPlatform":"OTHER","rating":5,"text":"After reading the stories and history of the Hotel Chelsea for years, we finally visited and stayed for 2 nights, and what a joy it was!\nAll the rooms are lovely, and they so thoughtfully upgraded us too,  which was absolutely gorgeous. So, so comfortable and with everything you could need. All the staff were wonderful, so  friendly, relaxed and incredibly helpful with information about where to go in New York. The Lobby Bar and El Quixote restaurant served fabulous food and cocktails in beautiful surroundings. Loved that all the old ( and still) residents art works were throughout the hotel, and so enjoyed going up and down the beautiful historic staircase and around the corridors listening for echoes from its glorious colourful past.\nStill smiling a week after returning, wishing we were still there, and already plotting a return for a longer stay next year. Thanks for making a dream become a gleeful reality.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Wonderful historic hotel","lang":"en","publishedDate":"2023-09-03","publishedPlatform":"OTHER","rating":5,"text":"I stayed in the most modest room at the hotel. It was small, as expected, but everything was very nice. Clean. Comfortable. Ornate bathroom. The literary and artistic history alone is worth the stay. Recommended hotel. ","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"Fabulous!","lang":"en","publishedDate":"2023-09-02","publishedPlatform":"MOBILE","rating":5,"text":"From the “Welcome to the Hotel Chelsea” to the “ Thank you so much for staying with us and come stay with us again soon”,  our journey at the Hotel\nChelsea was incredible. This hotel deserves the highest ratings  given to a property. Tracy who checked us in gave us a complementary upgrade to an even more fabulous room than we had booked. We opened the door to our very spacious, meticulously clean , totally fashionable,  and over the top luxurious room. From there, our stay continued to be 5 star. The lobby bar is a throwback to an era when  cocktails were king and they have fully revived the experience. A Glamorous, exclusive feeling yet still totally welcoming. Climbing into bed we snuggled in our Italian linen sheets and woke up refreshed and ready to\nenjoy the grand marble bathroom . 4 nights of absolute bliss. I can’t recommend this hotel enough and look forward to our upcoming stay in November.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Exquisite!","lang":"en","publishedDate":"2023-09-01","publishedPlatform":"OTHER","rating":5,"text":"Um.  The Hotel Chelsea is EVERYTHING! It was our anniversary and we had an incredible experience!  We did not want to leave.\nThe staff is genuinely caring, super attentive to everyone that walks in the front door.  I can go on and on about the front desk staff, housekeeping, bell captains (persons) but am allowed so many character counts! \nOur room was a complete design inspiration, When we returned home, I spent some time searching on-line where to find the rooms window coverings! All the hues in the room are beautiful jewel tones.  \nRoom service seemed more affordable than other places we have stayed at in the past. \nWe are still on a happiness high from our stay and do not want the feeling to end!","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"Chelsea Hotel... If only these walls could talk !","lang":"en","publishedDate":"2023-08-30","publishedPlatform":"OTHER","rating":5,"text":"An amazing stay at the iconic Chelsea Hotel, wow... what a privilege ! Fabulous staircase with great artworks in each floor. Beautiful, clean and spacious room. We had a balcony facing the 23rd street on the second floor and the windows\/doors are so well isolated that you can't hear the buzz outside. Love the lobby bar for drinks\/cocktails.\n Very friendly and helpful staff. Simply magnificent...","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Favorite & Coolest Hotel In New York!","lang":"en","publishedDate":"2023-08-30","publishedPlatform":"OTHER","rating":5,"text":"We stayed at The Hotel Chelsea last week for the third time in the past year & it was once again splendid! The hotel is a magical place, updated to with a gorgeous historical opulence without losing any of its rock & roll charm. We love roaming the halls & imagining the incredible creative figures that resided in the Chelsea over the years. Walking up & down the stairs, viewing the art created by various residents, really brings the ghosts of Chelsea past to life.\n\nOn this visit, we received a fantastic upgrade to a balcony suite that was huge! It was on the 4th floor, the very place where Leonard Cohen & Janis Joplin once lived and where Andy Warhol shot the film \"Chelsea Girls\" with Nico. We also took some memorable photos on the balcony that recalled some of the famous shots of Patti Smith & Robert Mapplethorpe in the 1970's.\n\nEveryone who greeted us & assisted us at the Chelsea was incredibly welcoming & friendly. We felt like we were hanging with a friend every time we spoke to someone from the hotel.\n\nThe Hotel Chelsea has quickly become my favorite hotel in New York and one of my favorite places to hang out. Everything from the rooms, the lobby and the bar are awesome. We cannot wait to visit again!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Five Star Service, Rock Star Cool","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":5,"text":"From the warm and welcoming check-in to the beautiful rooms and the overall ambience of the place, this is my new favorite hotel, hands down. The staff are amazing and they are what make staying at HOTEL CHELSEA  such a great experience. All 3 restaurants are excellent. The Lobby Bar is a great place to sit and meet friends, work or simply people-watch. This is quintessential New York City. The coolest hotel in the world.\n","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Super 4 stelle","lang":"it","publishedDate":"2023-08-27","publishedPlatform":"MOBILE","rating":5,"text":"Hotel rinnovato in stile\nBellissimo\nAtmosfera magica, sembra di entrare in un film\nPosizione perfetta \nMeraviglioso anche solo per bere qualcosa o cenare\nPersonale gentilissimo \nMi avevano consigliato di andare dopo la recente riapertura \nEro scettica perchè online ha ancora il rating da 2 stelle, invece è stata una bella sorpresa\nConsigliatissimo","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Hotel Chelsea","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":5,"text":"This was my first stay at The Hotel Chelsea but, it will not be my last. I loved everything about the hotel. Walking in, the lobby is very inviting. I cannot say enough about the staff. So kind, so helpful. The room was beautiful yet comfortable. I highly recommend this hotel.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Perfect Birthday Getaway","lang":"en","publishedDate":"2023-08-25","publishedPlatform":"OTHER","rating":5,"text":"My husband and I loved our quick getaway to the Hotel Chelsea. Though we live nearby in NJ, we decided to head stay the night to celebrate my husband's 40th. The friendly staff, clean and thoughtfully decorated rooms, convenient location, and diverse onsite dining options didn't disappoint. In our 'Deluxe' room, we loved the seating area, city view, Marshall speaker, Nespresso machine, comfiest bed, and gorgeous bathroom. El Quijote for dinner, The Lobby Bar for drinks, and room service breakfast were fantastic as well. Love the blend of old school and modern touches throughout, and as a lover of history, art, and exploration—this hotel had it all. Thank you for making our stay surprisingly memorable in the best way, Hotel Chelsea!","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Gorgeous piece of history.","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"OTHER","rating":5,"text":"Gorgeous piece of history. Great staff. Food a bit pricey and bathroom, while well appointed, has 19th century square footage. Be prepared to lay towels on the bed if you are two or more. That said, I love it. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Just like I imagined but so much better!","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"OTHER","rating":5,"text":"The hotel is beautifully preserved! We were very early and stopped to see if the front desk would hold our bags and without asking we’re told our room was ready! The room was beautifully decorated, comfortable, clean, and exquisite taste. The bed was very comfortable. Front desk staff very pleasant. I will definitely be back. I loved everything about my stay. ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Historic Gem","lang":"en","publishedDate":"2023-08-22","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea is a historic gem among NYC hotels. I've stayed in many, and none are as charming. The rooms are spacious - especially for NYC - and well decorated. Appliances and amenities, sheets, pillows, etc. are all high end. you can tell the place is well managed because the staff are all incredibly friendly. Like, genuinely nice and helpful. Highly recommend. Worth the money. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Gorgeous Boutique Hotel","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":5,"text":"This is my second time staying at this adorable hotel right in the heart of Chelsea.  From the moment you arrive at the door, you are greeted with a friendly welcome and smile, and offered assistance with your luggage.  Check in is a breeze and instantly you feel like you've gone back in time to a charming boutique hotel somewhere in the middle of Paris.  But it's NYC!  Even better.  The rooms are perfect and well-appointed with upgraded towels, robes, slippers and bath products.  The bedding is divine and ensures a great night's sleep.  The courtyard facing rooms are super quiet and there was no issue sleeping in.  The first time (back in March, 2023) I was upgraded to the Pied=a=Terre and it was amazing!  I could have stayed for a month.  This time, we were in a Deluxe King and it was lovely as well.  The bathrooms are large with oversized showers (unexpected in NYC). The Lobby Bar is a must as it's great for drinks and for people watching.  We also had dinner in the Cafe and everything we had was wonderful.  I can't say enough about the service as everyone we encountered was genuinely caring and eager to ensure our stay was perfect.  And it was!  I will be back again and again. ","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Wonderful stay!","lang":"en","publishedDate":"2023-08-19","publishedPlatform":"OTHER","rating":5,"text":"This hotel was wonderful! From the doormen to the concierge, to the amazing room. Everything was beautiful and everyone was extremely friendly and helpful! The view from the balcony of the room was spectacular! This is a fantastic place to stay! ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Meraviglioso hotel","lang":"it","publishedDate":"2023-08-19","publishedPlatform":"OTHER","rating":5,"text":"Hotel storico ristrutturato da poco, un tempo era un posto per artisti bohemien ed ora risulta gentrificato ma con intelligenza: il restauro ha rispettato l'anima e la storia del posto in ogni dettaglio. La location è fantastica per visitare Manhattan, stanza confortevole personale gentilissimo. Consigliato per palati raffinati dove il lusso non è necessariamente ultra moderno. Letto ottimo. Abbiamo sentito la mancanza di una piccola scrivania e del necessario per preparare il caffè ma ne è valsa la pena abbiamo vissuto in una atmosfera newyorchese straordinaria.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"More Than A Hotel","lang":"en","publishedDate":"2023-08-19","publishedPlatform":"OTHER","rating":5,"text":"We were excited to stay at the newly renovated and iconic Hotel Chelsea and I’m thrilled to report that my expectations were exceeded! The renovation is miraculous and the hotel looks beautiful. The staff is extremely helpful, courteous, friendly and professional. Our room was perfect, the bar and lobby rooms are gorgeous and bustling with activity. A throwback to hotel lobbies of the past. And yet the Chelsea is completely modern. I highly recommend this incredible hotel for your next trip to NY. It’s more than a hotel, it’s an experience.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Must be the best hotel in NYC ","lang":"en","publishedDate":"2023-08-14","publishedPlatform":"OTHER","rating":5,"text":"Absolutely loved our stay at this hotel. Stayed 4 nights while we eloped to NYC and the Hotel Chelsea provided the perfect base. The room was amazing with a huge, comfy bed. The staff were really friendly and helpful. And the hotel itself was incredibly unique and beautiful. 10\/10 experience. Can’t wait to stay again next time we visit. ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Our go-to Manhattan hotel.","lang":"en","publishedDate":"2023-08-13","publishedPlatform":"OTHER","rating":5,"text":"This hotel checks all the boxes.  Great location on 23d st near 8th Ave so three blocks from Penn Station and a few hundred feet from the subway station.   If you are a walker, Times Square and the theater district are slightly over a mile.  The room was spacious for Manhattan.  The room was clean, the bed comfortable, the air conditioning quiet and efficient.  The staff was friendly, professional and informative.  This will be our go-to hotel from now on. ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Gem of a hotel","lang":"en","publishedDate":"2023-08-04","publishedPlatform":"OTHER","rating":5,"text":"A fabulous hotel. We stayed last weekend and thoroughly enjoyed our stay. We were lucky to have a street view ina very spacious room with a very nice bathroom. Breakfast has great options and is served in the Lobby Bar. The bar was buzzing on the Saturday night with a great atmosphere. Staff are very helpful and friendly. We would definitely stay again. ","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"WANT TO FEEL LIKE HOME?   STAY AT THE HOTEL CHELSEA!!!!!!","lang":"en","publishedDate":"2023-08-03","publishedPlatform":"OTHER","rating":5,"text":"This was our first time staying at The Hotel Chelsea but our second time in beautiful amazing New York City.\n\nWe are planning on visiting again for New Year's Eve (my fiance doesn't know yet but he will see the visa statement.)\n\nALL of the staff were truly amazing!!!!  The day of our check out I asked one of the doorman if he wanted to trade passports....he said NO.  I tried and then I CRIED!\n\nI felt like we were at home for our 10-day stay at this amazing hotel.\n\nBecause of all the artwork in the hotel, I decided to paint the view from our balcony and left it in our room.\n\nThere is an art supply store directly across the street from our room so I thought \"Why not!\".  I'm NOT an artist but I tried!!\n\nGorgeous bedding, perfect pillows, and the best part....a balcony!!!! which I found very difficult to find in New York.\n\nThe Hotel Chelsea went well over and beyond my expectations. \n\nThe very best part of The Hotel Chelsea is how much the staff makes you feel at home.  Professional yet personable at the same time.\n\nThe Hotel Chelsea is a win-win; 10 out of 10!!!!\n\nThank you to the management and staff for an amazing stay! \n\nI honestly wouldn't change one thing.\n\nPerfect........Just perfect!!!\n\nLooking forward to our next stay!\n\nPenelope Wheeler & Jonathan Ross\n\nROOM #:  5X\n\n","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"What a stunning hotel","lang":"en","publishedDate":"2023-08-03","publishedPlatform":"MOBILE","rating":5,"text":"What an amazing hotel. Everything about our stay was first class. Staying here had been a lifelong ambition for my wife, and it did not disappoint. The staff were so friendly and helpful, and our room with the balcony was amazing. Better than I'd even expected. Even with the recent renovation, walking down the halls, you still get a feel of the history of the place. Without a doubt, it is the best hotel we've visited. We will definitely be back.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Wonderful stay","lang":"en","publishedDate":"2023-08-02","publishedPlatform":"OTHER","rating":5,"text":"They have done a fantastic renovation and the hotel is absolutely beautiful and full of character--no longer just the funky kind of character that's a nice way of saying grunge (it had been that way back in the day, with all the writers, artists and musicians from its history amidst the physical decline of the building).  Now it's the history but with a refined, old-New-York classy kind of character that takes you back in time, perhaps closer to how the place was in its physical prime.  The staff is great--very helpful, very nice, just perfect.  I don't really want to say how wonderful it is because we won't be able to get in if everybody knows, but this is now our new favorite hotel in NY.  We had a balcony room with a fireplace and french doors below stained glass -- gorgeous.  Comfortable bed, lovely little table and chairs, huge marble and brass bathroom.  We'll be back!!","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Romantic, luxurious and a bohemian dream","lang":"en","publishedDate":"2023-07-31","publishedPlatform":"OTHER","rating":5,"text":"I wanted to take a moment and congratulate the team at The Hotel Chelsea. I was so impressed by the renovations, my luxurious room, the attentive and professional staff, and the bohemian history of the hotel. The room was spacious and well appointed and my partner and I found our 4 night stay to be one of the best experiences we've had in a long time. NY is always magical but even more so when you find an incredible hotel to love. ","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"A Must Stay in Chelsea","lang":"en","publishedDate":"2023-07-31","publishedPlatform":"OTHER","rating":5,"text":"Hands down the best hotel experience in NYC - staff was friendly and accommodating, amazing location and the rooms\/property itself is perfection! The quality of the finishes were unmatched - unlacquered brass hardware, La Cornue stove, huge cast iron tub, gorgeous light fixtures all on dimmers and a heavenly king bed. Slept so well and will definitely be back.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"An experience to remember","lang":"en","publishedDate":"2023-07-29","publishedPlatform":"OTHER","rating":5,"text":"On my recent trip to the US I stayed in 21 different hotels. Some I don’t even remember, but the Chelsea is unforgettable. It is more than just accommodation, it’s an experience. And while the location and accommodation are excellent, it is the people drawn to this hotel, residents, guests, staff,  bar and restaurant patrons, and the stories they have to tell  that make staying there such an enjoyable and memorable experience. This is my favourite place in New York.","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Astounding Remake Of The Past","lang":"en","publishedDate":"2023-07-29","publishedPlatform":"OTHER","rating":5,"text":"I truly cannot say enough nice things about this hotel. From the moment we stepped out of our cab we were greeted with incredible service. All the bus boys we met during our stay were so kind and helpful. We stayed for my birthday and originally booked the king suite, but were upgraded complimentary to the one bedroom pied a terre. The renovations to the room were stunning -- the stained glass, the thoughtful fabrics on the bed frame, the gorgeous window panels. The bed was extremely comfortable and the bathroom, the shower pressure, all fabulous. We had no idea a real draw here would be the downstairs lobby bar. We really appreciated that guests have priority (a rarity for NYC hotels!!) and while the prices were high they matched the level of service and, again, the gorgeous design and layout of the space. We had a night to remember getting dressed up and having cocktails and fries. The only potential draw back is that it does have a faint smell of cigarette smoke, but we found it charming and a reminder of all the amazing history this hotel has to tell. I will be making this my new work hotel and absolutely cannot cannot wait to return. Thank you to everyone at Chelsea!! ","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Bucket List Stay","lang":"en","publishedDate":"2023-07-28","publishedPlatform":"OTHER","rating":5,"text":"This was a bucket list stay at The Chelsea. I've always been fascinated with it and when I had the opportunity to stay, I was thrilled. The staff is friendly and efficient. The rooms were great, the bed was comfy, the bathrooms extremely nice, and the history of the hotel, the artwork, the famous staircase were all wonderful to see. The bar was very nice and El Quijote restaurant was a highlight of our stay. Definitely worth the price. I can't wait to get back to my favorite city.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Staying at Hotel Chelsea - Dream come true","lang":"en","publishedDate":"2023-07-25","publishedPlatform":"OTHER","rating":5,"text":"My stay at Hotel Chelsea was a dream come true. Absolutely\nthe best hotel experience I have had so far.  The hotel is very beautiful, the recent refurbishment has been incredibly well done. If like me you are hoping to experience elements of the iconic original hotel you will not be disappointed.  My room was extraordinary, great view of 23rd St I was lucky enough to have a balcony beneath the iconic sign! The room was very luxurious, extremely vast and comfortable bed and the most beautiful rugs & curtains. The furnishings are classic and elegant. Amenities included essential coffee machine and lovely bath\/ shower products. Chelsea  Hotel staff are extremely warm and helpful. Anything I needed arrived quickly, any issues resolved graciously. Breakfast room was great, food excellent and service very good.  I had the best experience ever here.  I highly recommend this hotel to anyone planning to stay in NYC. 23rd Street is an excellent location, 10 minutes to Greenwich Village & Union Sq. I look forward to returning to the Chelsea at the first opportunity. ","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Historic, comfortable, fun and cozy","lang":"en","publishedDate":"2023-07-19","publishedPlatform":"OTHER","rating":4,"text":"This hotel is so very lovely. Feels very warm and cozy and like a second home. I was always curious about the hotel's storied history but it's just a beautiful place to stay in the here and now. The doormen and the desk staff are kind and helpful.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"A great experience at a legendary hotel!","lang":"en","publishedDate":"2023-07-18","publishedPlatform":"OTHER","rating":5,"text":"Staying at the legendary Hotel  Chelsea was a wonderful experience. The rooms are decorated with a vintage aesthetic. The bed was very comfortable and the bathroom was gorgeous. The entire hotel retains the original character, including the artwork on the walls. Loved the vibe of Lobby Bar,  where I enjoyed some delicious cocktails. \n\nAnd, I must mention the staff…everyone was friendly and helpful. My stay at the Hotel Chelsea delightful and memorable. I would definitely stay at the Chelsea again. ","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"The perfect stay in NYC","lang":"en","publishedDate":"2023-07-14","publishedPlatform":"MOBILE","rating":5,"text":"Amazing in every way! We enjoyed every minute of our stay in this legendary hotel. SO beautyfully restored, so much to look at and enjoy and the most wonderful staff - very freindly, very helpfull and very cool also :-) We loved that there is still some residents living there, giving the hotel a feeling of both hotel and a residence builing. Without question the best of many stays in NYC.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Great Place Rich in History","lang":"en","publishedDate":"2023-07-12","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea is steeped in Literary and Musical history. The recent updates have made this already iconic location a comfortable and luxurious stay. The heavy curtains and sheers in the room not only create a total blackout of light but evoke the rock n roll attire of legendary guests that stayed or lived at the hotel. It is New York so the rooms are not all large but they are carefully considered with lovely wool rugs, crisp pressed sheets and thick towels. The bathroom products are top notch. The Staff is ready to help with requests. The hotel bar has a great list of drinks and wines. My one wish is that the bar would have a soundtrack that would delve into the music of the greats that created some of their best work in those walls. The absence of music seems a bit out of step with everything else. I am working on list to play in my earbuds for the next trip. \nRebekah","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"We’ll be back!","lang":"en","publishedDate":"2023-07-11","publishedPlatform":"OTHER","rating":5,"text":"The atmosphere is lovely and romantic, the beds are very comfortable, and the shower is amazing! We loved our stay at The Hotel Chelsea!! The staff was friendly and very helpful in making sure we had everything we needed.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Gorgeous and comfortable","lang":"en","publishedDate":"2023-07-05","publishedPlatform":"OTHER","rating":5,"text":"Though I live in NYC, I'm a writer and occasionally take a week or so to cloister up at a hotel around the city for some distraction-free writing. The Hotel Chelsea has been on my nerdy little \"hotel bucket list\" for some time now, and I finally had the opportunity to spend some time there in July 2023.\n\nEverything was spectacular. The prices for my visit were totally agreeable, despite being one of the most storied hotels in the city. The staff were brilliant (I sincerely hope they're paid well for the terrific service they provide).\n\nThe room I stayed in did not have a coffee maker, but I was provided one by the front desk with a quick call. From the moment I hung up the phone to the moment the coffee maker arrived must have been a speed record; I can't imagine a full minute went by.\n\nThe hotel itself is gorgeous. If you stay here, I beg you take a moment to explore the building a little. Everywhere you look is a detail waiting for you to notice it.\n\nThe bed, linens, towels, robes, pillows, were all perfectly comfortable. \n\nThough I still have other hotels on that aforementioned nerdy bucket list in my head… I will probably just stick with the Chelsea for my personal writing retreats from here on out. ","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Hotel Chelsea is Royal","lang":"en","publishedDate":"2023-07-05","publishedPlatform":"OTHER","rating":5,"text":"A rebirth of a rebellious hotel that still holds a clash of punk rock, art and poetry. Stunning original art, famous staircases and spectacular views in rooms. I stayed on 2nd floor was perfect, can’t hear traffic, was right under the Hotel Chelsea sign. Had a tour from William which was super cool. A must stop and stay, you won’t get a better friendly staff!  I can’t speak to before the renovation but this vintage aesthetic art deco punk elegance is my favorite spot in NYC!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Feeling pampered","lang":"en","publishedDate":"2023-07-04","publishedPlatform":"OTHER","rating":5,"text":"Very comfortable room, with exceptional historical and reproduced details. The photos don’t do it justice. We found it by accident (didn’t know it had re-opened), and have already booked an additional stay for another trip to the city.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Chelsea is the Coolest","lang":"en","publishedDate":"2023-07-02","publishedPlatform":"OTHER","rating":5,"text":"I was drawn to the hotel for it's historic significance and it didn't disappoint.  The hotel is beautiful, having preserved the craftsmanship of yesteryear with renovations of old world class and artistic funk.  The hotel is spotless and the staff is wonderful.  ","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Amazing hotel","lang":"en","publishedDate":"2023-07-01","publishedPlatform":"OTHER","rating":5,"text":"My curiosity about this culturally referenced iconic hotel led to booking a room and discovering more than history. From warm welcomes at the front door, desk and lobby bar, to an impressive staircase and walls decorated with true artwork (created by legendary residents), I felt as though I  was transported in time.  While hotels now trim amenities, charge “resort fees” and provide small nondescript rooms with generic fake wall hangings, the Chelsea defies these trends. \n\nMy room was spacious, with exquisite appointments of a bygone era,  plush bedding, a seating area to entertain guests, and a marbled bathroom.  Even the flooring and the inside of my closet were elegant.  Add in 21st century updates; a large wall mounted flat screen TV, primo A\/C, and dimmer lights, their prices are comparable to other Manhattan hotels.  And instead of tooting their own horn on their website, they merely include a link to their Wikipedia page.\n\nWhen I couldn’t figure out how to work the espresso machine (a charming red Nespresso, not a Keurig knock-off), a member of the desk staff escorted me to my room and provided a detailed tutorial….and refused to accept a tip.  \nI could go on and on, but will end this review stating that while this was my first stay at the Chelsea, it isn’t my last.\n","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"More than just a hotel, an experience!","lang":"en","publishedDate":"2023-07-01","publishedPlatform":"OTHER","rating":5,"text":"A very well restored piece of history, vey confortable and with a great friendly staff. The bed was confortable, the bathroom (with a bath tube included) huge snd the staff friendly and helpful. \nGood value for money.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Outstanding stay","lang":"en","publishedDate":"2023-06-28","publishedPlatform":"MOBILE","rating":5,"text":"Outstanding.  Beautiful renovation. They upgraded us to a lovely spacious room. It was quiet and dark at night (not easy to get in NYC) so we slept very well.  All the public areas are artsy and cool.  Be sure to check out the bar and breakfast cafe. Would definitely stay here again.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"THE ONLY HOTEL FOR ME","lang":"en","publishedDate":"2023-06-27","publishedPlatform":"OTHER","rating":5,"text":"There is no better hotel. The renovation is masterful! The beds are like clouds. The parquet floors and thick carpets calm you. The huge tub melts all stress, aches and pains away, All the amenities you would want are handled. And the Lobby Bar is where all the action is- the guests and servers make this place extra special not to mention the insanely gorgeous ambiance in each chamber. I love waving my tassel key when I stroll into the bar to get seated right away. And I am enchanted by the resident's art that dons the hallways and staircase- worth slowly touring to take in all the amazing vibes of this place. ","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Fantastic stay at this stunning and historical NYC hotel.","lang":"en","publishedDate":"2023-06-25","publishedPlatform":"MOBILE","rating":5,"text":"@hotelchelsea love our weekend stay at your stunning and iconic hotel. Newly renovated, but if the walls could talk. Best hotel stay. Amazing location. #NewYorkCity #IconicHotels. The staff, decor, beds, art, food all AMAZING! The hotel made our NYC weekend for us.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Hotel Chelsea is my new favorite place to stay in NYC","lang":"en","publishedDate":"2023-06-20","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea is such a lovely place to stay. The renovation retained the history and charm, and added modern amenities and comfort. The location is central to the city, with the train, a coffee shop and market within a block. The staff is excellent, the hotel bar and restaurants are delicious and hip, and the rooms are very comfortable and quiet. We  loved everything about our stay.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Excellent.","lang":"en","publishedDate":"2023-06-14","publishedPlatform":"OTHER","rating":5,"text":"Gorgeous hotel, all top quality fixtures and furnishings - very impressive.  Location in Chelsea can't be beat. High Line is two blocks away on 10th Ave, you can walk up it to Hudson yards, or down it to the 14th St and the very fashionable meatpacking district.  ","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Best","lang":"en","publishedDate":"2023-06-13","publishedPlatform":"OTHER","rating":5,"text":"My daughter and I had the best experience at the Chelsea! Skip the boring, room-in-a-box hotels for timeless charm, character, interesting staff, and top-notch accommodations. Centrally located and everything you would want. Our favorite hotel! We'll be back.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Outstanding hotel experience in the heart of Manhattan!!","lang":"en","publishedDate":"2023-06-13","publishedPlatform":"OTHER","rating":5,"text":"Chelsea is indeed a Fantastic Hotel. Great rooms, pretty much bigger than manhattan standards, very kind staff and a great location. To highlight the cleanliness of the rooms and the predisposition of the staff at all times. Absolutely recommendable!","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Do Yourself a Favor and Stay at The Hotel Chelsea","lang":"en","publishedDate":"2023-06-13","publishedPlatform":"OTHER","rating":5,"text":"You will not regret staying in this truly remarkable historical place that has been carefully renovated to let its history and beauty show through and a wonderful staff to boot! Don't miss the Lobby Bar and the El Quijote restaurant to complete the experience!","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Wonderful stay, ideal location","lang":"en","publishedDate":"2023-06-10","publishedPlatform":"OTHER","rating":5,"text":"The finishings are wonderful and lush, the bed is comfy, the staff is friendly and helpful. We loved our stay and all of the amenities. The building is full of history and has been updated while keeping true to the character and history of the site. ","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Hotel Chelsea — a creative energy vortex","lang":"en","publishedDate":"2023-06-09","publishedPlatform":"OTHER","rating":5,"text":"I'm a New Yorker. As a frequent visitor of the hotel and its restaurants, I decided to stay for a couple nights to experience the full magic. It was all I imagined, and then some.\n\nThe Chelsea is one of the oldest, long-standing masterpieces of NYC. If you plan to stay here, respectfully understand that you are staying in a creative energy vortex, rich with layers of remarkable history. Bring your best self.\n\nThe hotel is undoubtedly beautiful, with several staples of the original space maintained including the iconic iron-marble staircase, fireplace, balconies, and many original art pieces adorning the walls. I stayed in the Superb Balcony Room which was extremely spacious, clean, and tastefully furnished. The lovely elements of French décor pay homage to the French-American origins of the Chelsea. A lot of care has been put into the charming details and thoughtful amenities from the moment you walk through the front doors to the moment you rest your head on your pillow. \n\nAt the end of the day it's the people who make the place, and the staff\/management is absolutely incredible. Everyone is warm and welcoming, eager to make your stay a memorable one. Make sure to check out the gorgeous Lobby Bar and century-old El Quijote restaurant for a delicious meal or drink. \n\nThe avant-garde, eclectic, rock n' roll spirit is still alive, and the Chelsea has soul — no question. That said, it's up to us as her humble guests, to contribute to it.","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Fantastic in every way","lang":"en","publishedDate":"2023-06-09","publishedPlatform":"OTHER","rating":5,"text":"Stayed in the Hotel Chelsea from 28th May to 1st June. From the moment I arrived at the front door I knew I would enjoy my stay. The atmosphere in the hotel is welcoming, unpretentious and fun. \nMy room was spacious (Chelsea King) with large comfortable bed and good size bathroom. Nice view south also. \nLoved the bar, with great service and excellent cocktails. I only had one breakfast in the hotel (Avocado Eggs) which was gorgeous. The hotel staff were also extremely accomodating when I realised I had left my wallet on site after leaving. They couldn't have been more helpful.  Dave Quinn \/ Dublin","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Breathtaking historic hotel","lang":"en","publishedDate":"2023-06-09","publishedPlatform":"OTHER","rating":5,"text":"I have been waiting for years to visit the Hotel Chelsea. We stayed for two nights, in an accessible king room . The room exceeded all our expectations. We loved all the small architectural touches - the inlaid floor with the hotel name, the wall cutouts, the closets and the fireplace. The decor also gave it a bit of a rock and roll vibe. The variety of artwork on the stairs was impressive and the lobby bar was perfect (we went there for lunch).\n\nWe didn’t see the cleaning crew until late afternoon, but assume that is due to staffing shortages.  \n\nI can’t wait to visit again.","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Great Stay; Avoid the Bar","lang":"en","publishedDate":"2023-06-07","publishedPlatform":"OTHER","rating":4,"text":"Just finished a seven-night stay at the Chelsea.  Our stay was pleasant and the staff was outstanding, except for our two visits to the bar. Both nights we had the same bartender. The first night we were ignored for ten minutes as she seemed to be doing, well, nothing. We were finally served but in a very perfunctory manner. We decided to give it a second chance a couple of nights later. First, we found that the bar doesn't stock Jameson, which seems blasphemous. Then, the same bartender from the previous visit was unable to make several different cocktails - such as a Brandy Alexander - because she either didn't know how or didn't have the ingredients. The final straw came - and it is the only reason I am posting this - when the bartender said to my wife in a condescending tone, \"Why don't you just read the menu.\" Of course, my wife had already gone over the cocktail menu several times at that point.  But, that was the only negative of our stay at the Chelsea. Everything else was wonderful. Just avoid the bar.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23887495,"title":"Beautiful Hotel for a Slice of NYC History","lang":"en","publishedDate":"2023-05-28","publishedPlatform":"OTHER","rating":5,"text":"I had been dreaming about being in the Hotel Chelsea since reading 'Just Kids'. So much history in this building...Allen Ginsberg, Arthur Miller, Iggy Pop, Patti Smith, Edie Sedgwick...countless notable residents. This hotel is beautifully restored and has an amazing energy that is palpable as soon as you walk in the front doors. It's a slice of NYC history, and the hotel did not disappoint. We were upgraded to a gorgeous suite and all of our experiences were so special. The staff were friendly, the rooms and bathrooms were beautifully curated, and we did not want to leave! I lived in NYC for ten years before getting the opportunity to stay at the Hotel Chelsea and have recommended it to all of my friends. 10\/10! Cannot wait to return. P.S. the Lobby Bar is excellent for drinks! ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Fabulous hotel with spacious rooms!","lang":"en","publishedDate":"2023-05-22","publishedPlatform":"OTHER","rating":5,"text":"The renovation at The Hotel Chelsea is a top notch.  Our room (5Q) was spacious with a large dressing area and bathroom.  We couldn't believe how quiet it was - we couldn't hear any road noise.  Check-in was fast and easy and front desk staff were friendly and helpful.  We will definitely return!","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"DIFFERENT","lang":"en","publishedDate":"2023-05-20","publishedPlatform":"MOBILE","rating":4,"text":"We stayed for 3 nights, selecting the hotel because of its history and anticipated vibe. First impressions were a little disappointing; as we got out of our cab the doormen were unresponsive, and the reception staff were polite but not friendly. At 2.00pm our room was not yet ready (really? - no one seemed to check) so we explored the local streets and returned at 3.00pm, when it was. The lobby area is unfortunately small, quite dark and a bit depressing.  \n\nThings improved dramatically when we stepped out of the lift on the 10th floor, bathed in light and just as we had imagined. Our room (Deluxe Atelier grade) was a large suite, eclectically and expensively furnished. The rugs in both the living and bedrooms were particularly stunning. All usual amenities for this grade - beautiful linen, towels and robes, Nespresso, a super king size bed, a large bathroom with a vintage-style bath and a large rain shower, a dressing room, a well stocked fridge and 2 smart TVs. Housekeeping  was efficient both during the day and in the evening, and when we got to know the doormen during our time there they were helpful and informative.\n\nIn summary a good stay and a different experience from the chintzy or the stylish minimalist which is the norm for New York upmarket hotels. And we were not disappointed by the eccentricity of some of our fellow guests. It’s not normal, but it is fun.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"So much fun to stay here with all the history it contains.","lang":"en","publishedDate":"2023-05-20","publishedPlatform":"MOBILE","rating":5,"text":"Rooms are large and well appointed.  Beds are extremely comfortable.  Service is great and everyone is very helpful and friendly.  We will be back again and again and totally recommend anyone to stay here.  Chelsea is a great part of town with so much within walking distance.","travelDate":"2023-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"It as great!","lang":"en","publishedDate":"2023-05-20","publishedPlatform":"OTHER","rating":5,"text":"Chelsea Hotel is a very interesting building, especially because of its history but also because of what it is now.  NYC is my favorite town (I live in Amsterdam, a very nice town but actually more a village) and last April I was there for the 10th time (to be honest: in 50 years). On my gallery-walk in Chelsea I started with a coffee latte in the Chelsea Hotel. What a marvellous environment! Then, at the desk, I asked if I could have a tour of the hotel. They gave me the email adress of a employee, William Benton. A few days thereafter he offered me a wonderful tour of the hotel. He knows a lot of the history and could answer all my questions.   It was great! ","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"10\/10","lang":"en","publishedDate":"2023-05-19","publishedPlatform":"OTHER","rating":5,"text":"Hotel Chelsea treated my mom to a weekend she will never forget on Mothers Day. Service was 10\/10, upgraded room was spectacular, and no detail was left unlooked. Highly recommend for friends, family, and yourself. ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"I had a great experience at the Hotel Chelsea","lang":"en","publishedDate":"2023-05-19","publishedPlatform":"OTHER","rating":5,"text":"I typically stay in midtown when traveling to New York, and had never stayed at the Chelsea.  I stayed four nights and had a great experience.  The staff was welcoming and professional without being White Lotus smarmy.  The room was unusual and unique, but very comfortable - laid out in the European model with a hall separating the bedroom from the hotel hallway.  My room was quiet and the highly styled (by my standards) furniture was comfortable and nicely done. I faced 23rd, and the french doors and heavy curtains meant that I wasn't bothered by street noise at night.  I ate breakfast every day and had dinner twice in the lobby bar, which is great: limited menu but good food and drinks and more good staff. I had some New York friends in for drinks one evening and they loved it.  It was a pleasure to stay in an unusual, historic hotel that seems to have been really throughtfully redeveloped. ","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"This hotel is an experience. You feel like you’ve gone back in time. ","lang":"en","publishedDate":"2023-05-17","publishedPlatform":"OTHER","rating":5,"text":"The  room we stayed in was so romantic. We stepped through curtains and double doors out to a balcony that overlooked the street.  The attention to details and the retro design made the room very special. The bed was very comfortable.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Most iconic and beautiful hotel in New York city !","lang":"en","publishedDate":"2023-05-17","publishedPlatform":"OTHER","rating":5,"text":"Chelsea Hotel is the most iconic and beautiful hotel in New York.\nEverything is perfect. Room is «chic», mattress and linen very confortable, bathroom has all you can dream of. All employes are polite. The cafe Chelsea offers a nice menu in a nice environment. \nAlso, knowing you are at the same hotel Leonard Cohen and Janis Joplin met adds a magic touch !","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Room spectacular, history beyond belief.","lang":"en","publishedDate":"2023-05-17","publishedPlatform":"OTHER","rating":5,"text":"Just spent 4 nights at the Chelsea Hotel and loved it! This hotel is filled with so much beauty and is an historical legend. The architecture is stunning with the internal metal staircase, the high ceilings, and the wood trim details everywhere. Upon entering at the lobby, you feel transported into a different time and place. Viewing the artwork on the walls (love it or not) from past residents makes real the many creative people who shared time here together. Walking down the central staircase displays the huge array of artwork and is like a vertical museum. \n\nOur room was exquisitely decorated in the period of the building with all the modern conveniences and in our case, a full kitchen and washer dryer! (Note: the gas is still not connected on the stove top due to permitting delays). The bed and bedding were perfect. \n\nThe front desk was very friendly and helpful throughout our stay. One area to be aware of... a glass of wine at the bar on the first floor can be pricey! The bartender recommended a white wine and the cost was $25 + tax and tip came to $30! I will definitely check the prices in advance next time! \n\nIn summary, I recommend you read all about the Chelsea Hotel in advance of your stay to bring alive the incredible history of the building and the creative people who lived here. We will definitely return on our next visit to NYC!","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Great Stay - Can't Wait to Return!","lang":"en","publishedDate":"2023-05-16","publishedPlatform":"OTHER","rating":5,"text":"I have been wanting to stay at the historic Hotel Chelsea once I heard that it had reopened after its extensive renovations.  As I finally had a trip planned to NYC, I just had to stay there, and I had a wonderful experience from start to finish!  My balcony suite was beautiful, well-appointed and and very spacious!  Staff was super friendly and knowledgeable.  The bar was great too!  I really can't recommend this hotel enough, and I definitely look forward to staying here again! ","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Amazing NYC weekend in a historic hotel!","lang":"en","publishedDate":"2023-05-08","publishedPlatform":"MOBILE","rating":5,"text":"We had a fabulous weekend at this hotel. I called the hotel twice before arriving - once to inquire about their fitness facility and the second the morning we were arriving to ask if it were possibly to have an early checkin. Both were helpful and pleasant. When we arrived, the gentleman at the front desk remembered my earlier call. We had our lunch in the bar (amazing burgers!) and our rooms were ready once we were finished and they had already arranged for our bags to be delivered upstairs. Additionally, they put our rooms down the same passage so we could be next door to each other and that small hall had a separate door to close off any noise from the main hall. \n\nLoved my room!! I booked a Chelsea room and it had a sitting room with a couch and coffee table, ample closet space, mini bar, safe, suitcase stand, extra towels and slippers. The bedroom had a king bed and beautiful fixtures including what appeared to be an old style radio. The alarm clock was also a phone charger. Incredibly comfortable mattress and bedding, perfect temperature with absolutely no street or hallway noise, it was two nights of some of the best sleep in a long time. The bathroom was spacious with robes and any toiletries one would need including toothpaste and the marble and brass was gorgeous. I had requested the Nespresso machine in room ahead of time and it was there upon arrival. \n\nThey’ve done a beautiful job of upgrading the hotel while keeping a sense of its history. One of the long term residents lived across the hotel and we enjoyed a fantastic conversation with him when we were coming back Saturday afternoon. He gave us a tour of his apartment and talked of what it was like many years ago. Additionally, my friend was speaking to one of the staff members who gave him a walk of all the floors and the history of who stayed where. \n\nI can’t wait to come back - I’m planning to request the same room, I enjoyed it so much.","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23887495,"title":"If you like NYC, add this stay to your bucket list","lang":"en","publishedDate":"2023-05-08","publishedPlatform":"MOBILE","rating":5,"text":"This is a must see\/stay in NYC. The location. is Chelsea and very walkable with great food and coffee shops nearby. Stop in the Westside market and pick up some snacks so you don’t have to go more than a few minutes without eating in NYC. Then take the elevator to your room. We were in 10 E which blew us away from the moment we entered. Floor to ceiling windows in the living room, couch, chairs, table, modern mini-bar and a separate bedroom with (decorative) fireplace. Decor surpasses expectations. So refreshing from all gray or beige. (I would love to know where the area rugs are from.) Bathroom was huge with tub and shower and gold fixtures. Windows from bathroom to living room were odd, but made for great lighting in bathroom. Staff was lovely and added to a great stay.  Make sure to read up on the hotel’s history that you will become a part of if you choose The Hotel Chelsea for a stay!  Highly recommend.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Long live The Hotel Chelsea!","lang":"en","publishedDate":"2023-05-03","publishedPlatform":"OTHER","rating":5,"text":"This was my third time staying at The Chelsea since you re-opened, and each time just gets better and better. The people at the front desk could not have been more welcoming and courteous, and the three gentlemen at the main entrance during my stay were always efficient, welcoming and friendly. The hand-written note welcoming me back and complimentary bottles of water I found on the fireplace mantle in my room upon check-in were a superb touch. My room was extremely clean and comfortable and had all that I needed. And sitting one night at the bar in El Quijote, sipping a superbly crafted Martini and reminiscing was great. You have a done an incredible job with the renovations as well as polishing up this gem on West 23rd, all the while maintaining some of the old vibe and atmosphere. I look forward to returning for another visit. \nPeter A. Deysenroth, Cooperstown, NY ","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Perfect iconic stay","lang":"en","publishedDate":"2023-04-21","publishedPlatform":"OTHER","rating":5,"text":"When I found out that the hotel that I took pictures of the plaques in front of a few years ago was reopening I knew I was going to try to stay there and it happened last week.\nWalking in the lobby is like walking back in time. I definitely knew the importance of walking in the hotel where Leonard Cohen, Andy Warhol, Arthur Miller have stayed, to name a few, gave me chills.\nThe details are exquisite, from the fireplace to the couches to the mail slots behind the front desk and the keys that open the doors.\nI had arrived early and was happy when they cleared a room for me 2 hours before check in time.\nThe corridors are clean and small but smell good.\nMy room was small (petite queen) but so well decorated with such attention to details that I loved it. The bed was firm, just the way I like it. There was plenty of electrical plugs close to the bed (I usually find that there is not enough in hotel rooms).\nThe water pressure in the shower was very nice with a rain shower head. I also appreciated the lighting next to the mirror.\nThe closet had everything I could need from the minibar, to large soft towels, to enough hangers and much more.\nAs for the staff, what can I say, every staff member I came in contact with from the person at the door, to the staff at the front desk to the host\/hostess at the lobby bar were so very nice, courteous and ready to help.\nI go to New York often and so far this has been my best hotel experience.\n","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Perfect","lang":"en","publishedDate":"2023-04-21","publishedPlatform":"MOBILE","rating":5,"text":"I loved the way the Chelsea Hotel is giving low-key reverence for the past without sentimentality. On one hand, it’s obviously iconic for those who know, but on the other hand it’s also a beautifully unfussy Sean MacPherson property that’s making the space relevant for new generations who don’t care who Lou Reed is.\n\nI stayed with my 6 year old daughter and we loved both sides of the hotel. Our room was beautiful, spotless, and smelled great. The bathroom was small and efficient with an excellent shower. When we closed the balcony doors, all the street noise vanished. In fact it was one of the quietest rooms I’ve stayed in—except for the neighbor we heard practicing opera one night, which, we’re at the Chelsea Hotel so it was perfect. The rooms and public spaces were serene but also authentic—a hard balance.\n\nStaff was excellent, especially Mike who graciously made friends with a stuffed skunk.\n\nWe loved breakfast and we loved the lobby bar for ice-cream at night. \n\nThanks for having us—we look forward to coming back soon.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Beautiful venue steeped in history (great cocktails)","lang":"en","publishedDate":"2023-04-19","publishedPlatform":"OTHER","rating":5,"text":"Beautiful Hotel steeped in history and pop culture. Wonderful cocktails (the Edie is a standout) in the lobby bar. Stephen from Derry was a wonderful host, the service was impeccable. THANK YOU Stephen we will return. ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"Only 35 reviews - Avoid this tourist trap at all costs.","lang":"en","publishedDate":"2023-04-13","publishedPlatform":"OTHER","rating":1,"text":"Avoid at all costs. Firstly, note that while the star rating is high, I missed the fact that there are only 35 reviews. The hotel is old, dingy, smells of mold, and there was a homeless man passed out on the lobby as I walked in to check in. That should've been my first warning sign. They charge 4-star hotel rates ($500\/night) but the experience is anything but. It was worse than checking into a motel. I spent 2 minutes in my room and decided to check out immediately. Unfortunately the Manager (Tasha) was incredibly pretentious, condescending and room and insisted on charging me for the night. There are so many incredible hotels in New York especially at this price point. Avoid this tourist trap at all costs.","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Sleep in history","lang":"en","publishedDate":"2023-04-11","publishedPlatform":"OTHER","rating":5,"text":"Come for the history, stay for the...everything. The lovely, unintrusive staff. The old-school charm combined with modern conveniences. The rooms are comfortable, with a perfect combination of classic fixtures and charming updates. The room bar is fantastically appointed, and the tub (not all rooms have tubs) is European length. After a perfect night of delicious cocktails downstairs, enjoying quiet conversation, hit the button to close the blackout curtains and drift away. I can't wait to come back - I'm checking prices now.","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"I loved it SO much!!!","lang":"en","publishedDate":"2023-04-06","publishedPlatform":"OTHER","rating":5,"text":"I absolutely loved The hotel Chelsea and the entire experience! They helped us to celebrate a milestone 60th birthday with every single special treat that you could imagine a hotel to do-without even asking! \nI felt, safe, cared for and truly important here. Everyone really went above and beyond from the absolutely perfect door staff to the amazing host at the restaurant. \nThe room was a suite. Had a fabulous sitting area with a couch and 2 chairs. So comfortable, clean and new!!\nThe bathroom huge-a bathtub and a beautiful shower. Bath salts for the tub, old fashioned adorable toothpaste. I took a video and sent it to all my friends and family because I was amazed and it’s an NYC hotel!! :))\nThe pillows were even great and you can’t find that anymore! Ever!\nI almost hate to give this great review because I don’t want to share. Lol!! And I can’t wait to go back!! Lol!!!\nBut it’s worth it, for sure! They deserve the recognition, it’s the least I could do for our experience and how well we were treated! I intended to send a personal thank you note but just haven’t gotten to it. \nA million stars!! Go-you won’t regret it. And eat at Mels (close by) if you can too! Amazing!!! ","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Very clean rooms. Very unpleasant staff.","lang":"en","publishedDate":"2023-04-02","publishedPlatform":"MOBILE","rating":3,"text":"Super clean rooms, great history, EXCEPTIONALLY UNFRIENDLY STAFF. Like they cannot be bothered. Restaurants are sub par. $7 for a cup of coffee at breakfast and it was cold. Was told they were brewing more and it took about 20+ min. The property could do more to share about the history and art. When asked staff on different occasions (and different staff members) they knew nothing. And could barely make eye contact. Your biggest selling point is getting completely left behind. Ultimately this place just isn’t ready and based on what we experienced likely never will be.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"I wish we could have stayed longer","lang":"en","publishedDate":"2023-04-01","publishedPlatform":"OTHER","rating":5,"text":"Our stay at The Hotel Chelsea was mesmerising . There is no other way to describe it. For those familiar with the history of the building – it remains a living and immersive tribute to a bygone area. No other destination in New York can match its uniqueness. \n\nNot only has the hotel stayed true to its roots since its re-opening but its current reincarnation is nothing short of remarkable. Everything from the furnishings through to the art was exceptional. The moment you enter the building there is a ‘feeling’ you get - that you are walking into something special, something historic.  \n\nThe customer service was exceptional. Every member of staff was attentive and really made you feel at home.  A very special mention to Alexis at reception and Jacob in the breakfast room. They really went out of there way to add to the experience – thank you both. \n\nAlex & Naty","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"A GEM!","lang":"en","publishedDate":"2023-03-24","publishedPlatform":"OTHER","rating":5,"text":"As soon as I stepped foot in this hotel, I knew it would be a special stay.  The door man, Michael, immediately made us feel at home with his warm welcome and most helpful demeanor. Our suite, was nothing short of exquisite. From the lighting fixtures to the nightstand tables, down to the unique bluetooth speaker, the thought and attention to every lux detail was not missed.  Beyond the suite walls, was our second home- the Lobby Bar. Not only are the renovations beautiful, but they managed to keep the integrity and artistic history of this hotel.  In addition to the beauty of the lobby bar, Courtney (the host) and Claire (the sommelier) are one of the warmest and most fabulous people. Being there truly makes you feel like you are part of something special.  In the words of Patti Smith, \"...with a hundred rooms, each a small universe\". I am hoping to be back to this home away from home as soon as possible.","travelDate":"2023-03","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23887495,"title":"Can't wait to return!","lang":"en","publishedDate":"2023-02-20","publishedPlatform":"OTHER","rating":5,"text":"What a special place. My husband and I had stopped in at the lobby during our visit last year to NYC to see our daughter, and were greeted so warmly and loved the interior decor so much we decided to give it a try for our next visit to her. \n\nWe were lucky enough to score a luxury suite - GINORMOUS! So beautiful! A fully appointed and spectacular kitchen, newly renovated huge bathrooms - what a great shower!!! Between the suite and the fabulous bar downstairs, it was hard to have to leave the hotel to go see New York! A real treat to be spoiled this way, and a stay we won't soon forget. Thank you so much to the young man who checked us in Saturday afternoon! So friendly and helpful - I'm sorry I didn't get your name!\n\nThank you also to Michael, also at the desk, who very kindly and graciously helped us switch rooms when we had an electrical problem in our first.\n\nWe had breakfast one of the days in the beautiful bar area. Such a pretty setting, and the food and service were great, too.\n\nThe hotel allows dogs, which makes the lobby a very fun place to pass through! \n\nCan't imagine staying anywhere else next time we visit our daughter! ","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":3,"locationId":23887495,"title":"Hotel  Chelsea EXCEEDED My Very High  Expectations","lang":"en","publishedDate":"2023-02-04","publishedPlatform":"OTHER","rating":5,"text":"For years I have imagined myself staying at the Chelsea Hotel and this past week I achieved that dream\n\nI grew up listening to Leonard Cohen and Joni Mitchell and reading multiple articles, books and blogs on the hotel. \n\n11 years ago, our daughter moved to the Chelsea neighborhood and every time I passed by, I said “some day…”  \n\nThat day finally happened this past week after retiring from my job of 40+ years\n\nIt did not disappoint. Both my husband and I agreed it is by far our favorite over the multiple Chelsea hotels we’ve stayed in over the past decade\n\nThe (most recent!) developers maintained the charm and character while updating amenities that we require in the 21st century\n\nWhen you walk into the hotel after being greeted by the doorman, you are welcomed by smiling faces at that iconic front desk framed by the spectacular staircase adorned on every floor by the art work of early tenants of the hotel\n\nThe rooms have such beautiful touches like the antique-designed closets, the window table and the beautiful wood floors with the hotel logo subtly engrained\n\nThe bathroom is spacious (by NYC standards) and again provides interesting and comfort design touches\n\nI’ll stop here\nI’m still savoring our stay and still reading books on the hotel\n\nThank you Hotel Chelsea\nSally K from NH","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Wonderful anniversary weekend stay","lang":"en","publishedDate":"2023-01-29","publishedPlatform":"OTHER","rating":5,"text":"I took my wife here for our anniversary here and the hotel was wonderful. We first heard about The Chelsea from recent CBS Sunday Morning story. It's historic, beautiful, incredible bar, and staff was helpful & friendly. The General Manager Duke even treated us with a bottle of wine when we met him. I recommend it highly.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Gorgeous new and stylish hotel","lang":"en","publishedDate":"2023-01-26","publishedPlatform":"MOBILE","rating":4,"text":"I stayed at The Hotel Chelsea for 3 nights while on a business trip to NYC. Very satisfied with the overall experience.\nThe hotel has been recently renovated and is gorgeous. The staff was particularly friendly everywhere, from reception to the bar, room service etc. \nThe rooms are large for NYC and very clean. The bathrooms are beautiful and great views from the balconies.\nThe breakfast options were decent, quite overpriced but takeaway drip coffee is FOC. \n\nAs it’s a new hotel some elements need fine tuning. The corridors need better interior design - they’re very large and empty. \nNo coffee machines in the rooms - this is a big issue considering the nightly rate. Even a kettle would be helpful… \nThe gym was under renovation still - this will be a great add on when it opens.\nThe hotel is on 23rd St, a large street which is always busy. It can get noisy even late at night.","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Sid and Nancy","lang":"en","publishedDate":"2023-01-19","publishedPlatform":"MOBILE","rating":4,"text":"It was so awesome staying in this Hotel Sid and Nancy died in Room 100, corridors look the same just restored and more . That is the reason I stayed a couple of nights. \nI would stay in this location as it is close to transportation in New York City.\nWicked","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23887495,"title":"Boutique Hotel with a Historic Rock-n-Roll Vibe.","lang":"en","publishedDate":"2023-01-18","publishedPlatform":"OTHER","rating":5,"text":"The Hotel Chelsea, for more than a century, has been destination hot-spot for celebrities, rock and rollers and the high and mighty. This landmark building, recently opened after 11 years of closure, is now a luxury boutique hotel.\n\nI relished my Premier Balcony room with wrought iron balcony overlooking West 23rd Street. The chamber was bright and airy with an original fireplace and stained glass. An animal print chair was funky item, no doubt in keeping with the ambience of the hotel. The bath was marbleized with brass fixtures and a deep soaking tub.\n\nThe goto restaurant in the Chelsea is the El Quijote known for its Spanish classics, the likes of tuna, beef cheeks and others, but my fav was squid and blood sausage washed down with red sangria. Rumour has it that Jimmy Hendrix, Janis Joplin and other musicians had a meal here before driving to Woodstock. I wonder what they talked about.\n\nSo, for totally unique accommodations, embedded with a rock-and-roll spirit from the past.........then try the ......Hotel Chelsea.....Boutique Hotel with a Historic Rock-n-Roll Vibe.","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Terrible start, comfy bed","lang":"en","publishedDate":"2023-01-17","publishedPlatform":"MOBILE","rating":3,"text":"The decor, location, bed, vibe…all great.  HOWEVER, the visits started us off really irked.   We were put in a lower category room ( facing a wall, 250sq ft, no side table) than i booked and paid for.    When i called them out on it, they “transferred me to a manager” only to hang up on me, and when I finally reached someone, they told me I was wrong.  I 100% wasn’t.  Once shown the proper category room -   They again tried to make it seem like they were doing me a favor when i was simply trying to get what i had paid for.    Plus l, the keys repeatedly didn’t work.  No acknowledgement of or apology for our inconvenience, their deception\/mistake, or the loss of an entire half hour dealing with the situation.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Great experience, amazingly historic hotel","lang":"en","publishedDate":"2023-01-15","publishedPlatform":"OTHER","rating":5,"text":"What a wonderful experience! Upon arrival we walked through a cozy living room lobby to a charming front desk with a wall of tassel keys. You could see all the way up the winding staircase above the desk to the top skylight roof. Our room was better than expected with 3 sets antique glass doors that led to a catwalk balcony.  So many antique details made this hotel unique and beautiful. Staff were warm and friendly and genuinely kind to us and our 7 yr old daughter. We would definitely stay here again!","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":3,"locationId":23887495,"title":"Loud loud noise every week at night","lang":"en","publishedDate":"2023-01-06","publishedPlatform":"OTHER","rating":1,"text":"Horrible experience! They had oil truck came at 1:30am to suck the grease for the restaurant downstairs. The loud noise lasted 33mins and worst it came every Friday morning. So the bottom line is don’t spend Thursday night.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"If the Chelsea is for you, don't miss it!","lang":"en","publishedDate":"2022-12-02","publishedPlatform":"OTHER","rating":5,"text":"My wife and I stayed 5 nights in November 2022. The Hotel Chelsea is wonderfully eclectic and charming.  It has a storied history which is worth checking out on Wikipedia. One example from our stay, we were jus a few doors down from the room Janis Joplin lived in. We loved the Chelsea's location with subway stations a half block away in either direction, and easy walking distance to many of the most interesting areas and neighborhoods in New York.  The accommodations themselves are great.  Very comfortable bed, very spacious room by NYC standards, wonderful bath and shower. Our room also came with breakfast included which mat not still be available, but if it is, I would recommend adding it, it was so delicious.  The staff were excellent to work with, as was the room service, and the bar is incredible. Its rare for us that the place we stay is one of the best memories of a trip, but the Hotel Chelsea is for us.","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"The Return of an Icon","lang":"en","publishedDate":"2022-10-28","publishedPlatform":"OTHER","rating":5,"text":"After a lifetime of reading about this legendary property we finally had the opportunity to visit. The newly renovated rooms highlight the respect and love the hotel has for the building and its history. The spaces are comfortable, full of personality, yet surprisingly modern. The massive bathtub connected to the living room was a fun detail and the balcony let us take in all of New York City's energy. At the same time, once we wanted to rest, closing the windows created a little sanctuary in the middle of Chelsea. The front desk and Quijote staff were the friendliest, and I would definitely recommend coming down for a drink at the bar and then jumping over for some paella and pan con tomate! Can't recommend it enough!","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Outstanding experience.","lang":"en","publishedDate":"2022-10-28","publishedPlatform":"OTHER","rating":5,"text":"Absolutely First Class all the way. Staff were wonderful and accommodating, The decor was really cool and let a kind of retro ambiance that made it a truly magical experience. House restaurant was really exquisite. I would whole heartedly recommend this to anyone. I will definitely be coming back.","travelDate":"2022-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Worthwhile just for a drink ","lang":"en","publishedDate":"2022-10-28","publishedPlatform":"MOBILE","rating":5,"text":"Wanted to visit this historic place and couldn't possibly afford to stay so had a drink in the bar. Very expensive compared to the rest of our budget trip but a totally worthwhile experience. It was very busy, filled with ' bright young things', the wait list for just a drink was 90 minutes but the gorgeous staff managed to find us a spot at the bar. Really enjoyed my $22 margarita- sipped very slowly to maximise  the precious sense of those who had sat there before me.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Give the Chelsea a few months.","lang":"en","publishedDate":"2022-10-27","publishedPlatform":"OTHER","rating":3,"text":"What a disappointment the Hotel Chelsea was. We arrived after a 2 week trip to Europe, looking forward to nice retreat in the city. When we arrived, there was no one to help with our luggage and we were placed on the backside of the hotel, after asking for a city view. Neither 1 of the doormen made us feel welcome, not like attendants in the reception. \nThe cocktails were crazy expensive and the service in the bar was poor. I believe we arrived in between shifts, but it still took quite a while before we received service. The service for breakfast in the other hand was superb, never mind we paid $22.00 for a plate of mediocre scrambled eggs.\nI will  say the accommodations in the room very  nice. I would suggest restocking the complimentary water, daily, though. The Nespresso machine was lovely, but we had to move it to a wall that had an electrical outlet.  Poor planning !\nI would wait a month or so to try this hotel until they get the kinks worked out. ","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"A dreamy hotel","lang":"en","publishedDate":"2022-10-27","publishedPlatform":"MOBILE","rating":5,"text":"I had been longing to visit the renewed Chelsea Hotel, having been around for some of its bohemian heyday and its sad decline.  Can say that all of the work and money and aesthetic travail that have been poured into the Chelsea was worth it.  It’s truly beautiful.\n\nI spent one night night in a tenth floor room facing 23rd Street.  It was quiet, no noise from the street or the hall.  The bed and linens were comfortable;  the bathtub was magnificent, no problem filling it with nice hot water; there was a Nespresso machine and an imaginatively stocked minibar. For me, the real delight was in the style: green velvet portieres, wallpaper with dainty maidens and garlands, little side chairs with tiger stripes.  It’s not the Chelsea of Leonard Cohen, but it’s a really, really beautiful old lady with very good taste.\n\nEveryone I ran into, at check-in, housekeeping, the waiter who brought up my perfect club sandwich, was courteous, charming and\/or welcoming, as appropriate.  Looking forward to my next stay.","travelDate":"2022-10","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23887495,"title":"Not quite up to the hype","lang":"en","publishedDate":"2022-10-25","publishedPlatform":"OTHER","rating":3,"text":"We had 3 rooms for 8 nights.\n\nThey certainly had guts taking on this huge and formerly decrepit monster, and having stayed at The Bowery last time we were in NYC (that shares some ownership), period fakery is their forte. There is little to no originality left room-wise, though the public spaces retain a great deal. Generic it is not, which along with its history, is its main USP. \n\nThe rooms are a decent size (for NYC anyhow), but the basic room shares the same huge kingsize bed as the others, which takes up the vast majority of the space. I had a Chelsea King with tub, and it was lacking in too many areas. Some are standard shortfalls in American hotels, like the lack of decent lighting. Impossible to read in bed. Illogical light switch layout. Serious lack of clothes storage. No large drawers at all, so I lived out of my case for the duration. No stand for the case either. No beverage facilities in the room, which I always think is downright mean. \n\nIt is also very much work-in-progress. Some of the issues we experienced:\n\nThe hot water was a murky grey. Once run, the tub did not look very welcoming. Very hard, and no bath salts to soften it. I mentioned this on the first day. The guy said it shouldn't be like this and would send up an engineer, but this was never something that was going to sorted in a couple of days. And it wasn't.\n\nInstead of printed holders for the key-card, the room number was written on in metallic sharpie, which rubbed off on my partner's treasured wallet when in his pocket.\n\nOn return after a night out, my partner had no power at all in his room. They found another room for him to sleep in, and it was restored in the morning. They comped the night and gave us $75 credit in the bar - which we appreciated.\n\nI returned to find my AC off with an error code. The control was unresponsive, so I had a stuffy night. It came on of its own accord the next morning.\n\nI had 2 very small cartons of water in my room, which were drunk and not replaced for the duration.\n\nWe all had problems with intermittent hot water in the showers, and why they had to put such a big step into the shower I know not. Could easily have been a walk-in.\n\nWe understand that it's on a semi soft opening, and that teething troubles are inevitable, but the question comes as to what one should expect from a $625 a night room. They may be \"preview\" rates, but they're hardly a bargain. Whilst they give nothing away in the rooms (and the smellies were pretty lo-rent - nothing like as nice as The Bowery), they do provide a basic Continental Breakfast in the main bar. It's more than usually provided, but there's something a bit begrudging about it. Croissants, scones, three types of berries and yoghurt. Self serve (weak) coffee, and bizzarely, a sole electric kettle that has to be asked to be filled, then boiled by customers wanting tea. No fruit juice and not even iced water (again, on request). The room is wonderful, but freezing cold and with zero atmosphere. Like eating in a library. Put some cool music on, please. \n\nThere's plenty to like. The art is great, as is the general taste of the refurb. Staff were mainly very helpful, with a special shout out to the ever cheerful Jake (who should be modelling, really) and William, who has great knowledge and passion for the building. I'm glad we stayed. It's a special place with a special vibe. I'm not likely to be returning, as the rates will go up and no doubt to more than I'm willing to pay. This place will need forever maintenance, as we say in the UK, like the Forth Bridge. Once finished, it will need starting again. Whether they can provide the experience than justifies even higher prices remains to be seen. It's certainly not \"average\" in itself, but I can't give it more than 3 stars.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23887495,"title":"Le seul et l’unique","lang":"fr","publishedDate":"2022-10-19","publishedPlatform":"MOBILE","rating":4,"text":"Quel bonheur d’avoir enfin pu séjourner dans cet endroit mythique du XX siècle où tant d’artistes ont vécu. La rénovation a  été menée de façon spectaculaire et l’âme du lieu est toujours intacte. Certains anciens locataires vivent d’ailleurs toujours ici et nous avons pu en croiser quelques-uns. Une étoile en moins cependant pour le service: accueil glacial, attribution d’un faux numéro de chambre, plus d’eau chaude pour se doucher, café servi froid… Le restaurant El Quijote et son ambiance survoltée est cependant incontournable.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23887495,"title":"Beautifully restored hotel","lang":"en","publishedDate":"2022-10-11","publishedPlatform":"MOBILE","rating":5,"text":"We had a fantastic stay at this historic hotel. It was on soft opening so I’m going to go easy on the service which did lack in some areas. There is a grumpy old fellow in breakfast service that shouldn’t be there and a couple of requests for ice during our stay never eventuated. But the hotel is beautifully restored and the rooms are extremely spacious for NYC and I thought the price was more than reasonable also. I would definitely return to this hotel.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23887495,"title":"Wanted to like the new reno, was worried I wouldn’t, but I loved it !","lang":"en","publishedDate":"2022-10-10","publishedPlatform":"OTHER","rating":5,"text":"I had not been to the Hotel Chelsea in 20 years.  I have a kindred connection to this property.  I like many waited patiently for its reno to be completed for the last 15 years.  I wanted to like it, I was worried I wouldn’t; but I really do love it.  They have brought back its original charm, didn’t try to make it something it wasn’t or isn’t.  The new hotel blends well with the long term residents and the new bar\/restaurant expanded space is first class.   ","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"Beautifully updated","lang":"en","publishedDate":"2022-09-10","publishedPlatform":"MOBILE","rating":5,"text":"Beautifully appointed. Stayed for 4 nights in 6f, which is a small studio king room. The bathroom is spacious and the shower’s water pressure is nice along with the hot water. Lighting was nice but not tons of natural light because it looks into an interior courtyard. Does not have a seating area or table.\n\nBreakfast was included and is hosted in the lobby bar with plenty of seating and morning papers. Fresh berries, croissants, yogurt, milk, tea, and coffee.\n\nThe lobby itself is a bit of a thoroughfare, but the lobby bar is a restful place to sit.\n\nI toured one of the one bedroom pied a tierre rooms - it was spacious and overlooked 23rd.\n\nHotel service overall was nice and prompt. Some visible construction still going on but not disruptive at all.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Iconic Hotel \/ Perfect stay!","lang":"en","publishedDate":"2022-09-08","publishedPlatform":"MOBILE","rating":5,"text":"We loved it!! Our rooms were wonderful -  we had an amazing balcony overlooking the street with views forever!  The remodel was thoughtfully  done - new and updated yet still  keeping the original architectural details. The staff was lovely and we enjoyed Speaking with michael as we checked out!  Couldn’t recommend the Chelsea enough!","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23887495,"title":"The times have changed","lang":"en","publishedDate":"2022-09-06","publishedPlatform":"OTHER","rating":3,"text":"After my second stay and Im still not sure I will return after the rates go up. The staff was great and the bar was mostly fun. The prices are attracting a not typical Chelsea clientele which is expected but these people looked like they were dressed for a golf tournament. Of course I miss a lot about old NY so I will skip a lot of gripes because they would apply to the city overall. \nBut Its weird to hang out in the lobby or bar when it feels like a library and everybody is afraid to talk very loud until they drink enough to not care. My rooms have been nice and have a timeless feel. I hope people who feel it is a meaningful and important place will be able to afford some of the room types. Rather than just the dbags and rich kidults that they are likely trying to cater to. Lobby William was an encyclopedia and very sincere in his love for the hotels history and tenants, even finding a positive slant on my take (gripe) on how lame NY's creative cla$$ currently is. His warmth and sincerity was appreciated by a few people I talked to. Cedrick was very helpful and kind. The bar staff also. \nI hope we can meet in the middle Chelsea Hotel.","travelDate":"2022-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23887495,"title":"Utter class from superb staff","lang":"en","publishedDate":"2022-08-23","publishedPlatform":"OTHER","rating":5,"text":"I didn’t stay here, but my adult sons and I popped in for a drink in the bar, as I’m a big Leonard Cohen fan, and this is an iconic venue.\nWe received a genuine and very warm reception, and then entered the stunning bar area where we we were met by the lovely bartender who served us our drinks (at a reasonable price, I might add).\nAfter our drinks, I cheekily asked if there was any way to look around, given the history of the place.\nMinutes later we had a printed room history in hand, and were shown around by the lovely Jake. He was cool, friendly and knowledgeable.\nIt was a great experience. Places with true class are unpretentious, treat people with great respect, and are a pleasure to visit. Hotel Chelsea is one such place.\nIf I ever come into money, I know where I’ll be staying next time I visit New York.\nThe wall art is stunning, by the way…\nThanks everyone for a great afternoon 😊","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":23887495,"title":"Mixed feelings on this one","lang":"en","publishedDate":"2022-08-16","publishedPlatform":"MOBILE","rating":3,"text":"I have mixed feelings about this hotel and there are a few reasons why:\n\nSome Pros \n- Cute (small room) \n- Great Sheets & Bed \n- Slept well\n- Very cute bar for an evening drink\n\nCons \n- I am not a fan of this area and the street the hotel is on. It’s very busy and just not great. It’s a bit “no man’s land”\n- August 16 - they are still not finished. There are workmen around \/ and many floors are still under construction. I got a “discounted” rate but I would not pay more even if they were finished. \n- The hotel has a strange energy. I can’t quite put my finger on it…. I think it feels more like an apartment building than hotel - Reasons for saying this : staff were lovely but had a very unprofessional feel to them. Feel more like doorman? Also When eating breakfast in the morning the staff just stand around talking very informally. At one point they were discussing how they hope there won’t be table service for breakfast as they didn’t want to serve. Thought that was strange in front of a guest. \n- Corridors have other apartments on them \/ and their normal doors. They say very boldly “Tenant Occupied”. I also smelt gross cooking smells \n\nIf it’s your first time going to NYC I would not recommend this hotel. I would look elsewhere as much better options out there for the price. \n\nI would only recommend this spot if you need to be in this neighbourhood and no other options. Or if you have nostalgia about this hotel.","travelDate":"2022-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23887495,"title":"Amazing Re-Birth of a Cultural Landmark","lang":"en","publishedDate":"2022-08-11","publishedPlatform":"OTHER","rating":5,"text":"It had been a dream of mine to stay at the Hotel Chelsea to savor its rich history and that dream more than came true last night. Finally open once again to hotel guests after many years, the hotel positively radiates warmth, charm and history. The decor and furnishings are plush, the renovated rooms are huge and the newly opened lobby bar is gorgeous and welcoming; They even serve a tasty continental breakfast along the bar top! \n\nFinally, the staff is amazing. In particular, I have to salute William, who greeted me when I arrived and at my urging shared just a bit of his knowledge of the history of this amazing hotel.\n\nI cannot wait to visit the Hotel Chelsea again on my next trip to NY and highly urge others to do the same.","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":8,"locationId":23887495,"title":"Your Staying in History","lang":"en","publishedDate":"2022-07-25","publishedPlatform":"MOBILE","rating":5,"text":"There are few hotels that can offer so much pop culture history from famous writers to dramatic deaths.  This hotel has done a credible job with its redo.  Even the lobby is a blast to the past with paintings adorning the walls.  You will also find period furniture and a special lobby bar.","travelDate":"2022-07","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23887495,"title":"The best experience ever","lang":"en","publishedDate":"2022-05-26","publishedPlatform":"MOBILE","rating":5,"text":"My Mother and I absolutely loved our experience at the Hotel Chelsea. We travel quite a bit but this hotel is now our favorite place. The history, decor, architecture and most importantly the staff were amazing","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23887495,"title":"Beautiful and full of charm","lang":"en","publishedDate":"2022-05-23","publishedPlatform":"MOBILE","rating":5,"text":"Great and very friendly staff. Attention to detail in the guest rooms is immaculate. Extremely comfortable bed and furniture in addition to being beautiful and full of character. The bathroom is gorgeous and very spacious. Simply loved it and enjoyed my stay. Very unique hotel.","travelDate":"2022-05","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23887495,"title":"Wonderful renovation!","lang":"en","publishedDate":"2022-05-22","publishedPlatform":"MOBILE","rating":5,"text":"Beautifully appointed and spacious for an historic hotel.\nEnjoyed the artwork throughout.\nLove the Bold rich colors. The lobby is comfortable and inviting with historically appropriate scale furniture decorated with wonderful samples from the artists who called the Hotel Chelsea home.\nEvent space is extraordinary… Bravo!","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23887495,"title":"Perfection","lang":"en","publishedDate":"2022-03-05","publishedPlatform":"OTHER","rating":5,"text":"I am on the last night of my ten day stay at the Hotel Chelsea. Giving reviews is not something I really do but my experience has moved me to write this tonight before I leave tomorrow morning. \nThe Hotel Chelsea is perfect in every way.\nMy room has very high ceilings with crown molding like cake icing. There is a decadent marble bathroom with a grand tub so lovely that I took a bath every night. My room is decorated with such deep style as only the legendary Sean MacPherson knows how to create.\nVelvety Art Deco carpets, a lusciously chubby mohair sofa and a Victorian bed that I considered shoving into my suitcase, I wanted for nothing during my stay. The staff is exceptional. In all my comings and goings, I met them all from housekeeping to the front desk even one brave man who was navigating the scaffolding on the façade of the building on the 10th floor outside my window. All of them willing to go out of their way to make my experience better. \nThere are not enough stars in the rating system to reflect the score I give this hotel.\nIt is excellent.","travelDate":"2022-03","tripType":"NONE"}
