{"helpfulVotes":4,"locationId":23817306,"title":"Vergüenza","lang":"es","publishedDate":"2024-04-12","publishedPlatform":"OTHER","rating":1,"text":"Una vergüenza, ayer nos anularon el hotel para una semana en septiembre 2024 ya pagado desde noviembre del 2023, el hotel no contesta y Booking no se quiere hacer cargo, nos piden un documento del banco y haber que pasa. Para que sirven estas plataformas si no hay ninguna garantía de nada? Ni de buscarte hotel con las mismas condiciones y precio? Ni devolverte el dinero de inmediato? Y la poca fiabilitat de ahora volver a hacer una reserva con ellos. Te puede pasar a días de marchar de vacaciones!!!!  Que se tiene que hacer?","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23817306,"title":"Booking.com SCAM...BEWARE","lang":"en","publishedDate":"2024-04-12","publishedPlatform":"OTHER","rating":1,"text":"WARNING ABOUT BOOKING.COM!    Like the other recent reviews, Booking.com had taken my reservation and FULL PAYMENT IN ADVANCE  7 months ago and just cancelled my reservation that was to be in the beginning of May.  j\n\nThey blame it on the hotel and the hotel said that booking.com cancelled it.  Meanwhile, I am at a loss of reservation, $1700 missing and now have to find another for a rate MUCH more than when I originally booked.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23817306,"title":"Customers not welcome","lang":"en","publishedDate":"2024-04-12","publishedPlatform":"MOBILE","rating":1,"text":"Our fully pre-paid  reservation was cancelled out of the blue without any reason, the hotel is not fully booked....we confirmed everything back in November 2023. It  a complete fraud and disrespectful treatment. Phones are conveniently out of service, impossible to reach anyone....I do not recommend this establishment","travelDate":"2024-04","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"Cancelaram minhas reservas e nada de reembolso dos valores cobrados no meu cartão de crédito","lang":"pt","publishedDate":"2024-04-11","publishedPlatform":"MOBILE","rating":1,"text":"Reservei em dezembro\/2023, dois quartos para 6 hóspedes no Hotel The Blakely by Luxurban, NY, para o período de 12 a 20\/07\/2024, e no dia 11\/04\/2024 recebi um e-mail informando que minhas reservas foram canceladas pelo hotel. Não consigo falar com o Booking.com e nem com o hotel! Não tem informação sobre a devolução dos valores cobrados no meu cartão de crédito. Total descaso! NÃO RESERVEM NADA NO HOTEL!","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23817306,"title":"Incassano la somma totale e poi cancellano prenotazione senza nessuna assistenza!","lang":"it","publishedDate":"2024-04-11","publishedPlatform":"OTHER","rating":1,"text":"Abbiamo prenotato questo hotel un mese fa. Oggi mi è arrivato il messaggio da booking.com che la prenotazione è stata annullata! Ne' l'hotel,  né booking rispondono, e dei nostri soldi nessuna traccia!!!NON PRENOTATE ASSOLUTAMENTE QUESTO HOTEL!","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Estafada","lang":"es","publishedDate":"2024-04-11","publishedPlatform":"MOBILE","rating":1,"text":"Acabo de recibir por mail la cancelación de mi reserva realizada en Booking.\nLa misma la hice en noviembre de 2023 y fue pagada en su totalidad ese mismo mes.\nQuiere decir que me cobraron y me cancelan, diciendo que es el hotel quien solicitó la cancelación.\nAhora, quien me devuelve lo abonado????\nBooking dice que llame a la tarjeta o al banco. Que el hotel ya no existe!!!!\nEntro a internet y sigo viendo ofertas del hotel.\nQuien estafa? Booking o el hotel?\nYa vi varios comentarios negativos, lástima que no los leí antes.\nEsto es para que a otras personas no les pase lo mismo.\nAún sin respuesta….","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23817306,"title":"Total scam","lang":"en","publishedDate":"2024-04-11","publishedPlatform":"OTHER","rating":1,"text":"They canceled my reservation through booking.com out of nowhere, I tried to call the hotel and the phone is disconnected, then I called booking.com and they told me to fight it with my bank. Seriously?! I’ve been waiting for over an hour to talk with a supervisor. AVOID THIS HOTEL! They stole over 1k just like that.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"voleurs !!!","lang":"fr","publishedDate":"2024-04-11","publishedPlatform":"OTHER","rating":1,"text":"DES VOLEURS !!! \n\nL’hôtel vient d’annuler notre réservation sans raison !! \nOn a dû retrouver un hôtel mais plus cher ! \nEt aucun remboursement !! \nInadmissible ! \nDu vol de leur part et Booking qui ne fait rien !! Honteux !! Je vais déposer plainte !","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Disgusting treatment from this hotel","lang":"en","publishedDate":"2024-04-11","publishedPlatform":"MOBILE","rating":1,"text":"Absolutely disgusted with the treatment we have received from this hotel and booking.com. Myself and 12 other members of the choir booked this hotel months ago in order for us to sing at Carnegie Hall in June, just tonight emails were sent out to each of us cancelling our bookings without any explanation and no mention of any refund of payments which have been paid in full. Nobody answering the phone either, how strange. What a wonderful New York welcome! Don't touch them with a bargepole ","travelDate":"2024-04","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"AVOID THIS HOTEL - booked & paid 12 months ago. Hotel cancelled just before arrival with no explanation or refund","lang":"en","publishedDate":"2024-04-11","publishedPlatform":"MOBILE","rating":1,"text":"Booked and paid in full 12 months ago. Weeks out from arrival the hotel has cancelled the booking. No explanation and no word about a refund. Hotel doesn’t respond to emails or messages. Just avoid this hotel, no way to run a business, shocking customer care.","travelDate":"2024-04","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"Daylight Robbery","lang":"en","publishedDate":"2024-04-11","publishedPlatform":"OTHER","rating":1,"text":"DO NOT BOOK THIS HOTEL!\n\nWish I’d read the reviews here before we booked.\nTook our payment despite us choosing and paying more for the option to cancel.\nHotel have now cancelled our booking and are not responding to messages. Waiting on booking.com to get back to me.\nTried calling the hotel and no answer. How they are allowed to appear on the site is beyond me. If I do make it to NYC, think I’ll be paying them a visit 🤬","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"A great value hotel in a superb location","lang":"en","publishedDate":"2024-04-11","publishedPlatform":"MOBILE","rating":4,"text":"I was a little apprehensive about staying at this hotel after some very negative reviews but I have to say that the 3 of us thoroughly enjoyed our stay. Yes the decor and furniture is a little outdated but this gives the hotel character. We had a very spacious king suite with a very comfortable kingsize bed that my daughters shared and a sofa bed in another room. A good sized bathroom with a decent shower & plenty of mirrors including a full length one which is missing in many hotels. Very handy to have a small kitchen area with sink, some crockery and cutlery, small fridge and microwave. We were missing a set of towels and a kettle on arrival but front desk sorted this very quickly. All the staff we met were polite and helpful. The best thing about this hotel is that it’s incredible value considering its location: walking distance to Central Park, MOMA, Times Square and many other key sights, and many others easily accessible by subway, there’s one subway station at the end of the street and another one a block away. Lots of delis and diners close by too. I’d definitely stay here again if I was back in this amazing city.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23817306,"title":"Stole money from booking!","lang":"en","publishedDate":"2024-04-08","publishedPlatform":"MOBILE","rating":1,"text":"The took my money for a booking (over £2000), cancelled the booking and not refunded me. Completely stole the money.\nLoads of people in similar circumstance with no response from hotel or booking.com. \nTotal thieves. Ruined ability to go on trip and now left with nothing","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Ideal price and location","lang":"en","publishedDate":"2024-04-08","publishedPlatform":"OTHER","rating":5,"text":"This is the first review I’ve written, and am doing so because the reviews on here about the Blakely had me so freaked out days before our arrival I almost booked another place. The hotel is old, but clean, ideal location, great price. Three blocks from Central Park, block from Carnegie, easy subway access, perfect location. There was loud construction the first night on the street, but that’s out of their hands. The bath products are minimal, so if you want more than a tiny bar of soap and tube of generic shampoo, bring your own bath products. You can ask for a hair dryer, one is not in the room automatically. Staff mostly nice, upon check in one lady (who seemed like a manager) was short on words and not friendly. However, the lady who appeared to be a general staff member was very friendly. All staff thereafter were very friendly. Housekeeping came early, we requested no service the first day, but the second they cleaned up. Towels, sheets were all clean. Furniture was worn, shows its age, but nothing broken or offensive. I’m a smells person, and found nothing offensively odorous. Mini fridge, freezer, microwave were helpful for left overs! Did not ask about gym, enjoyed runs in the park (safe and easy access). They had small snacks by front desk, which was a surprise, did not expect and food. Will update once $150 deposit is returned for room, we left room acceptable, so should be returned. Would stay again, if the best price. Very satisfied with accommodations.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"ATTENTION!!! Sudden cancellation by hotel","lang":"de","publishedDate":"2024-04-07","publishedPlatform":"OTHER","rating":1,"text":"ATTENTION!!!\nWe booked this hotel on December 23 for October 24. This week our room for October was suddenly cancelled on the grounds that accommodation was no longer possible. This category is still available on the usual booking portals and also on the booking.com platform we use, but at a higher price. We have already made the full payment, which was debited from our credit card immediately after the booking was completed. It is not possible to send a message to the hotel via the booking.com booking platform, as the response \"sending failed\" always appears. We have already sent an email to the email address provided, but have not received a response for 5 days. We are therefore very annoyed and hope that we will be refunded the amount we paid for the 5 nights we booked.","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23817306,"title":"Ashamed","lang":"fr","publishedDate":"2024-04-06","publishedPlatform":"OTHER","rating":1,"text":"To flee we booked from September 29, 2024 to October 5, 2024 on the booking.com website our reservation was canceled due to an end of collaboration between booking.com and the hotel and to this day we have still not been reimbursed of the 2000€ we paid!","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Warning about The Blakely if you love your money or want value for money!","lang":"de","publishedDate":"2024-04-03","publishedPlatform":"OTHER","rating":1,"text":"Stay away from this hotel! I booked 6 nights there for myself and my husband in October 23 for September 24. Due to the many negative reviews (short-term cancellation by the hotel) and the fear of suddenly being left without accommodation in New York, we canceled the hotel. The entire booking was made through Booking.com, but unfortunately they are no help!!!! I can't contact the hotel through Booking.com, nor booking.com itself. For Booking.com, the cancellation is successful. The only problem is that we as customers still haven't received any money back.\nThe hotel already charged the full amount of 2100 euros without breakfast shortly after booking (not a bargain for a room with two beds), but we haven't received a refund. I have now found a supposed email address for the hotel on Google, because there is no contact address on the homepage.\n\nThe Blakely and the entire Wyndham group will definitely no longer accommodate us as guests. I can only warn you. Booking.com no longer has the hotel in its program, but unfortunately it is now too late for us.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Buyer Beware - They Take Your Money","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":1,"text":"Booking.com just canceled my stay for late Sept. 2024 with no reason.  I pre-paid as required at time of reservation and now having to submit verification of charge\/statement to Booking.com for a refund.  Tried calling hotel but number is out of service.  Disputed with Visa just now after reading reviews of the same issue.  This is horrible and never had this happen before.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Don't book you will be caught short","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"MOBILE","rating":1,"text":"Booked October 23 for October 24 via Booking.com.\nHotel just cancelled our booking - no explanations nor option to discuss.\nThe first time ever this has happened to us, and now we are back to the drawing board with fewer options available.\nIs this really a hotel or a scam?\n","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23817306,"title":"Thieves","lang":"fr","publishedDate":"2024-04-02","publishedPlatform":"MOBILE","rating":1,"text":"Hotel booked via booking.com 6 months ago for a stay next October. The hotel has just canceled our reservation for no reason and is not refunding us!!!! When will our money be returned so we can book a new hotel! 2600€ pending!! Ashamed !","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"TAKE YOUR MONEY IMMEDIATELY","lang":"en","publishedDate":"2024-03-30","publishedPlatform":"MOBILE","rating":1,"text":"This is a disgusting property. As soon as you book a reservation…even for 10 months ahead…THEY CHARGE YOUR CARD AND YOU HAVE GREAT DIFFICULTY GETTING THE MONEY BACK!!!  They do not tell you this when booking. They just say you can cancel anytime!!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Another Unhappy Customer - Money taken and booking cancelled","lang":"en","publishedDate":"2024-03-30","publishedPlatform":"OTHER","rating":1,"text":"Terrible situation. We made our booking via booking,com at the The Blakely Lux for a 4 night stay in December 24. Full amount of money taken within days of booking, first week of February 24, Then we got a notification that our booking was cancelled, Trying to get an answer on where our refund is, a lot of money. No number for the hotel, found a number, thy wont answer, Tried booking.com. Got through to Wyndham group very unhelpful, basically getting fobbed off. Not good enough - we have paid for 4 nights, money taken, now it’s been cancelled and we have nowhere to sty and am out of pocket for nearly 3000.00 Shocking situation!!! Fraud.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Horrible experience at the Blakely Hotel","lang":"en","publishedDate":"2024-03-29","publishedPlatform":"MOBILE","rating":1,"text":"This old hotel is dusty and musty and the management is horrible and inexperienced.  Do not even consider staying at this hotel. There are so many great hotels in New York City, unfortunately the Blakely is Not one of them.  We canceled our reservation, requested a refund and the manager never even responded.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23817306,"title":"Wyndham should be ashamed of this","lang":"en","publishedDate":"2024-03-26","publishedPlatform":"OTHER","rating":1,"text":"My daughter stayed  with her friends one out of three days booked at this hotel before moving elsewhere. Trashed moldy rooms, rude staff, phone number out of service, If you check out 2 days early because you just can't handle the overall crappiness of this dump, they give you an invoice for the entire stay, which would have ended whatever number of days later. Stay away from this place.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"To flee!","lang":"fr","publishedDate":"2024-03-25","publishedPlatform":"OTHER","rating":1,"text":"To flee! Dishonest management and employees, seeing the reviews we had doubts but it's ultimately true. Platform B. has stopped the collaboration with this hotel and they refuse to reimburse us for the stay which was taken in full + costs. There are several dozen of us in this case... Cheap but dishonest.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23817306,"title":"Réservation","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"OTHER","rating":5,"text":"Thank you very much to Scott who maintained our reservation following Booking's cancellation and at the same price !! The number of the hotel was unavailable but after asking the group on Messenger someone quickly gave me Scott's number to solve our problem. He was able to answer my questions and reassure me so thank you very much. We look forward to staying with you.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Where is my refund - Scammers","lang":"en","publishedDate":"2024-03-23","publishedPlatform":"MOBILE","rating":1,"text":"Booked two rooms in February 2024 through Booking.com for January 2025. The hotel took full payment at the time of booking and then a few days ago I received emails from them via Booking.com to advise that they had cancelled the bookings. There was no mention of a refund being made to me for the cancellation.  Have tried contacting via Booking.com and have received no response. Do not book with this hotel!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Not recommendable","lang":"es","publishedDate":"2024-03-23","publishedPlatform":"OTHER","rating":1,"text":"The staff's attention is terrible. Our room had a kitchen, we did not have cups or glasses. The microwave didn't work. They don't change your towels. We asked for the replacement more than 2 times. The cleaning of bathrooms, carpets, hallways leaves a lot to be desired","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Scammer!!","lang":"en","publishedDate":"2024-03-23","publishedPlatform":"OTHER","rating":1,"text":"This property cancelled my family trip (booked 2 room for 3 adults and 2 children) for Jan 25, full payment was taken when booked from my debit card! Then i get an email a few weeks later to say they can no longer accommodate us for this stay! Booking.com is not giving me any answers, so i feel they are also in on this scam! They said they ‘ceased their contract with this property’ but they still have it advertised on their site!! DO NOT BOOK WITH THIS HOTEL OR CHAIN!!! I will not let this go until i get a full refund!!!!!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"THIS PROPERTY TAKES YOUR MONEY, CANCELS YOUR RESERVATION FOR NO REASON, AND DOES NOT HAVE A WORKING PHONE NUMBER.","lang":"en","publishedDate":"2024-03-22","publishedPlatform":"OTHER","rating":1,"text":"THIS PROPERTY TAKES YOUR MONEY, CANCELS YOUR RESERVATION FOR NO REASON, AND DOES NOT HAVE A WORKING PHONE NUMBER.\n\nI made reservations 1 year in advance through Booking.com.  This morning, they emailed me stating that \"The Blakely by LuxUrban, Trademark Collection by Wyndham is no longer able to welcome you\".  There are no additional details as to why they cancelled.  Their front desk phone number has been disconnected (see other reviews about this as well).  The main Wyndham properties reservations line was unable to help since I made the reservation through a 3rd party.  Bookings.com stated the property cancelled my reservation because their contract with Bookings.com has been cancelled. When I asked why, I was told that it was due to this property no longer meeting their \"quality standards\".  I was charged the full amount the stay up front, but I am not having any luck receiving a refund after numerous requests.  \n\nBased on all of the other reviews, this place continues to rip people off without explanation and NEVER issues a refund.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Fraud????","lang":"de","publishedDate":"2024-03-22","publishedPlatform":"MOBILE","rating":1,"text":"Danger!!!!\nI booked AND paid via booking months ago, today my booking was canceled by the hotel!\nThey “couldn’t accommodate us”… However, the room is still offered on the homepage.\nI hope I get my money back!!!","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"TOTAL SCAMMERS","lang":"en","publishedDate":"2024-03-21","publishedPlatform":"OTHER","rating":1,"text":"DO NOT go near this hotel!!!!! They are SCAMMERS. They took a full payment from my credit card then CANCELLED my reservation after they got the money. They do not answer emails or calls. We are still waiting for our $800 that they have stolen from my account and we have no idea how or when we will get our money back. Because they will not reply to our emails.\nSTAY AWAY AT ALL COSTS!!!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"This hotel won’t give you your refund back. Don’t book!","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"OTHER","rating":1,"text":"Would not recommend this hotel! I canceled my stay and still haven’t got my refund back. It’s been 2+ MONTHS. The team is very unprofessional and won’t answere where or when the money Will be refunded. Do yourself a favour and don’t book this hotel.","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"Beware ! Do not book this hotel","lang":"en","publishedDate":"2024-03-13","publishedPlatform":"OTHER","rating":1,"text":"Do not book this hotel ! \nMade a reservation on 26th January via booking.com with free cancellation policy\nFull payment was deducted immediately which I wasn’t expecting \nDue to a change in travel plans I had to cancel this reservation a few days later and have been chasing a refund since via booking.com and via the hotel directly \nSame story as others saying it can take up to 30 business days to process a refund. It is now well beyond this date and I am still casing the refund owed to me \nThe communication has been awful !","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Bad customer service AVOID","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"MOBILE","rating":1,"text":"Bad customer service, avoid!!!\n\nWe booked this hotel well in advance of or stay, it was fully refundable and after we cancelled or stay the money was due to go back on the card it was booked with 30 days later…it has been well over 30 days and we have received nothing back. I have emailed 3 different emails about this and it is taken over a week for anyone to get back to me each time I email,telling me they will look into it..I don’t understand how it is taken so long to ‘look into it’. Have also made 2 phone calls from Ireland to try get my money back only to be told there was no one at the front desk…what an absolute joke!!! DO NOT BOOK!  Such bad customer service. I would appreciate my money back asap…such a joke.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Room infested with bedbugs and horrible treatment","lang":"es","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":1,"text":"Not recommended. A horrible experience. We stayed at the hotel a week ago and we found bed bugs in the beds. They changed our room but to a lower one than the one we had paid for.\n\nAll the staff were rude and did not help us at all, arguing and speaking badly. We couldn't make a formal complaint to the hotel, we chatted with Scott, the \"responsible\" and very unprofessional one. They questioned the animals we had seen at all times, they had stung us and we had killed them. We asked for financial compensation, which they gave us the OK but they are liars and they told us no by email, after returning from there.\n\nThe room with old and dirty carpet and curtains. Absolute disgust and shameful treatment. I attach a photo","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"AVOID","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"OTHER","rating":1,"text":"Do not book this hotel if your plans are not concrete! And in general, if their customer service is anything to go by, just don't book it period!!!\n\nWe booked this hotel in early January and cancelled it a week, ten days later., a month in advance of when we were due to travel\/stay. We had booked a rate that was fully refundable if cancelled within 48 hours of arrival date, which it was.\n\nWe have made numerous attempts to obtain a refund however, to date have been unsuccessful. We have emailed at least three different email address , have made numerous phone calls from Ireland, at our added expense, always get a reply that someone will come back to us or call us back later, however no call has been received!\n\nWe want our overdue refund and would appreciate it be dealt with ASAP.","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"DIRTY AND UNPRESENTABLE. THERE ARE CHICNHES","lang":"es","publishedDate":"2024-03-11","publishedPlatform":"MOBILE","rating":1,"text":"VERY IMPORTANT. THERE ARE BEDBUGS IN THIS HOTEL.\nFor naaaaada recommendable. It is the worst I have ever been to, better to pay a little more and be in better conditions.\nIn addition to the noise at night that makes it impossible to sleep (I had to buy some earplugs), the shower broke because everything is so old and THE WORST IS THAT THE HYGIENE SHINES BY ITS ABSENCE, in addition to having a disgusting carpet that has not been cleaned for a long time. , we found BEDBUGS in the bed (attached photos) and their response was to change our room at 11:00 p.m. to one much worse than the one we hired from the beginning.\nWe quickly notified the reception and in addition to changing the room, their solution was for us to go in the morning to talk to the manager. The next morning the manager did not appear and they only told us to write an email. We spoke with the manager, a certain Scott, from whom we obviously asked for financial compensation for the damages caused as well as for the cleaning of all our clothes in a laundry, since we cannot go to our homes with possible eggs or bedbugs and infect others. all our families. Also, my friend who was sleeping in the bed of the bedbug we found was bitten on the back. We passed these photos to Scott as well.\nAt first he replied that he was very sorry blah blah blah, we were not very satisfied with what he offered us for the damages and dry cleaning (65% of what we paid) but we accepted so as not to leave empty-handed. There at reception when we checked out we told them what Scott had told us and they didn't give us any problems, they told us that in a week we would have the money in our account along with the deposit that we had to leave. As soon as we returned home Scott stopped answering us and after a week we know absolutely nothing about our money.\nWe have obviously contacted Booking because it is a serious issue, in addition to possibly having an infestation in one of their hotels, we need someone to give us a solution.\nIn short, please don't come to this hotel, New York is very big and you will surely find a much better one, because they are NOT serious at all.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"Beware - Will not issue refund","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"MOBILE","rating":1,"text":"Booked hotel but had to cancel in January.  Still waiting for refund and it is 1.5 months later.  Had to write email after cancellation to request refund. Have never had to do this. Sent email and was just told they would get to it one day - when they feel like it.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Horrible","lang":"en","publishedDate":"2024-03-08","publishedPlatform":"MOBILE","rating":1,"text":"Scam hotel. Paid 1378,87 usd but cancelled. Like other people waiting for the refund. It’s been almost a months. Booking.com is not really helping, just telling me to wait. When I was in New York I visited the hotel, asked for the manager. The manager was not in, they gave me a number. Phoned but didn’t answer. Had to mail Scott, some kind of manager, replied he cant do anything. Mailed to refund’s mailadres, they say that I just have to wait.\n\nThey scammed me. Don’t book here, you will loose your money and get nothing in return when you cancel.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"Awaiting refund ","lang":"en","publishedDate":"2024-03-06","publishedPlatform":"MOBILE","rating":1,"text":"I am having the same issue as a lot of other people where I am having to chase up my refund.\nI had a room booked with free cancellation but checked the prices again a few weeks later and was delighted to discover that it was £300 cheaper for the same dates. \nI booked the new rate non refundable and cancelled the original booking but after three weeks and countless attempts to get a resolution I feel that I am being stonewalled through booking.com, the refund department and now waiting to see if I get an email reply from the general manager .","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Typical hotel from the 80s for the decor, well in its time to woo the tourist...","lang":"fr","publishedDate":"2024-03-05","publishedPlatform":"OTHER","rating":4,"text":"A hotel in its original style, American decor from the 80s. At least we weren't in a soulless hotel. On the other hand, the thermal and sound insulation are also of the period. Ideal location for hanging out in Times Square in the evening and metro station across the street. Weak point, all services are payable, 12 dollars for the concierge between the release of the room and the arrival of the taxi, after a week in the hotel. It's expensive for the last walk in Central Park, also a 4-minute walk away.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Waiting for my refund","lang":"en","publishedDate":"2024-03-05","publishedPlatform":"OTHER","rating":1,"text":"I booked two fully refundable rooms with the Blakely Hotel in early December 2023 for a stay in September 2024.  My credit card was charged the full reservation amount the day after I reserved.  I canceled my reservation in early January 2024. It has been two full months since my cancelation.  I have contacted the refund email several times and received a response that their refunds are back logged.  Totally unacceptable.  The email that I was instructed to use was: refunds@luxurbanhotels.com.  Hopefully Victoria@luxurbanhotels.com will be more helpful.","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":23817306,"title":"NO REFUND RECEIVED","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"OTHER","rating":1,"text":"Please DO NOT book this hotel unless you are 100% sure that you will stay there. In December 2023 I made a reservation on Booking.com for mid of March, paid extra for free cancellation. I was charged immediately in full. Unfortunately, my travel dates changed, the hotel didn't respond to amend the reservation, therefore i cancelled it. And now It's been more than a month and I still haven't received any refund. On my follow-ups, I just receive standard template emails. Ms. Victoria who handles negative reviews, never replied to my email. BE AWARE!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Our great weekend stay at The Blakely","lang":"en","publishedDate":"2024-03-02","publishedPlatform":"OTHER","rating":5,"text":"I booked this hotel at a very good off-season rate for a long weekend.  After reading the negative reviews, I was concerned but went ahead with the reservation because of the great location and reasonable price.  I'm so glad I did because it turned out to be a great stay.\n\nFirst of all, the location was perfect, close to theaters and shopping, which was the main focus of the trip.  The area had all kinds of eating choices from takeout to mid -price restaurants to grocery stores.  We never had to walk more than two blocks to find just what we wanted.    \n\nAs for the room, we booked a King 1-bedroom suite and it exceeded expectations.  Yes, some of the furniture was dated but it was clean and so spacious, with a separate sitting room with couch and television so you could relax in the room without having to sit on the beds like the typical smaller NYC hotel room. The microwave and fridge plus some flatware and dishes made it easy to store and reheat leftovers.  This was another nice change from more modern pricier hotels that load up the fridge with minibar items that can't be removed without incurring a charge, thereby making the fridge unavailable for your own use. I only had minimal interaction with the front desk staff but everyone was friendly and accommodating and made me feel welcome.  Another nice change from more expensive hotels.\n\nI rarely leave reviews but wanted to post this one because it was so much better than I expected, based on reviews I read earlier.  Since a lot of the negative ones deal with not getting refunded for cancelled stays and I didn't have to cancel, I can't speak to that aspect.  But if you keep your reservation, I hope you have as great an experience at this hotel as we did.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23817306,"title":"Scam bookings, failure to follow through on refunds after early cancellation","lang":"en","publishedDate":"2024-02-19","publishedPlatform":"OTHER","rating":1,"text":"My friend and I are both having the same problem with the Blakely as other reviewers. We cancelled our bookings in December for a trip originally beginning January 5th (well ahead of the required 24 hour cancellation window). We were charged in full for the entire stay. It's Feb 19th and there is no refund in sight. I contacted the Wyndham chain to be told that the individual hotels handle their own billing, and the rep gave me a number to call, and I confirmed on Google that it's the correct number. So I call -- and it is out of service! I've opened a dispute with my credit card company. Luckily I have the cancellation email as proof. This is all a huge waste of my time and I should not have had to do it. If I had known that Wyndham takes no responsibility for the hotels in their \"collection,\" I would not have reserved. Today I also discovered that this hotel is also (?) an UrbanLux hotel. UrbanLux has an F rating with the Better Business Bureau. And for good reason. The majority of the complaints are about failure to refund. Don't book here!","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":23817306,"title":"2 months with no refund! Terrible service","lang":"en","publishedDate":"2024-02-17","publishedPlatform":"OTHER","rating":1,"text":"Terrible hotel! I accidentally booked them, 24 hours later noticed the booking and cancelled immediately, and it’s been over 2 months with no refund!! \n\nDo not book with them! They don’t answer via mail, they don’t have a chat service, and they don’t refund!!! I have been running after them for 2 months and still no money! \n\nStay away!!!","travelDate":"2023-12","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":23817306,"title":"Never refund after cancellation","lang":"en","publishedDate":"2024-02-07","publishedPlatform":"OTHER","rating":1,"text":"2 MONTHS after cancelled my reservation because it was not possible to change date, no refund has been processed.\nBad customer service, no answer received!! DONT BOOK THIS HOTEL, they just take your money and never refund if you cancel or if you want to make a modification to your date.","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":23817306,"title":"Refundable reservation NOT refunded 1 month after timely cancellation","lang":"en","publishedDate":"2024-02-02","publishedPlatform":"OTHER","rating":1,"text":"BEWARE. I booked a fully refundable room and then changed my travel plans. They charged all 3 nights of the original reservation when I made it (without telling me), and although I cancelled 3 days ahead of the first night, my card has still not been refunded 1 month later. I will have to dispute the charge. I see this is a common complaint, so watch out if your plans aren't set in stone.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":23817306,"title":"Poor staff & customer service","lang":"en","publishedDate":"2024-02-01","publishedPlatform":"OTHER","rating":1,"text":"Really bad attitude from the reception staff. We called to explain our flights had changed and to have our rooms ready for the next morning earlier that we had already paid for the night before. Meaning we were happy to pay for the night we missed but wanted to check in early after long travel. On arrival we found our rooms had been booked out. The attitude was just so poor from the staff. Leaving us wandering around on our first day in the clothes we’d been in for 24 hours. Everyday we were promised the manager would be available. They weren’t. \nThe room was absolutely fine, location great but the staff really ruined this place for us. Came home to be chasing the refund for weeks. Really wouldn’t recommend this place purely on the attitude and lack of customer service from the staff","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Really bad service","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"OTHER","rating":1,"text":"Bad service, not clean room, not clean sheets, not enough soap, no shampoo, the front desk doesn’t explain very well nothing, you feel like you are bothering the employees in the hotel when you ask them for something, in the room you can hear all the noise through the night.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Not luxe, but friendly.","lang":"en","publishedDate":"2024-01-19","publishedPlatform":"MOBILE","rating":4,"text":"This is not a high-end choice; rooms are quite clean but noticeably tired (especially drapes, upholstery, soft furnishings); don’t forget your own charging cubes because there’s not a USB port in sight. But the staff is friendly, warm, old-school familial, and special thanks to Denis at the front desk who was particularly helpful and patient. Recommended based on location (ideal), and the human, non-corporate atmosphere.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23817306,"title":"The worst customer service experience ever!!!","lang":"en","publishedDate":"2024-01-16","publishedPlatform":"OTHER","rating":1,"text":"The worst customer service experience ever!!!\nI have booked the hotel and cancelled, unfortunately, due to health issues 2 days after. It's almost 3 weeks that I am trying to get reimbursed either from the hotel, which charged the fees, or from Booking.com, which I used to book the rooms.\nI paid more to have the free cancellation for 1 month and I cancelled within 2 days.\nThe Hotel is not willing to reimburse and they don't provide any kind of information nor answer to me or to Booking.com.\nI don't know the hotel, but if they treat their properties as they treat their customers-to-be, then I am very concerned about the quality of this Hotel!\nBad. Bad. Bad.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"I recommend it - great and close to everything.","lang":"pt","publishedDate":"2024-01-15","publishedPlatform":"MOBILE","rating":5,"text":"Hotel with excellent location. Close to everything. 5th and 6th Avenue, Central Park, Rockefeller Center, subway, Times Square, Broadway, good restaurants and theaters. Good service. Good arrangement of the rooms and bathrooms and price. I recommend.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Worst stay in NY","lang":"en","publishedDate":"2024-01-12","publishedPlatform":"MOBILE","rating":1,"text":"The room wasn’t cleaned when we took the room it wasn’t worth the amount we paid at all . The road is noisy we couldn’t sleep a single night we were there . When it was raining the roof started leaking. . I complained as soon as we got here that the room is not good but they didn’t have a replacement. When we complained about the water Leak from the roof a guy from maintenance came and asked us to give him a bucket to keep to collect the water . That was the only solution he gave . His manager called him and shouted at him to handle the issue we over heard from our phone in the room . Finally after an hour or two they gave us  another room option but that room had a leak too  . We have video recordings of the noise from the room at night and the water leak . The day we were to check out we were charged 80\/= dollars for getting late .?we over slept because we were awake the whole night from the noise ! We told them to excuse us but they didn’t care ! We left at 12.30 but they charged us 80\/= for the extra 1.5 hours . I’m writing this review while sitting in their lobby . Will take a picture for evidence . \n\nMust say the receptionist was helpful . And the people shifting luggage up and down were kind and helpful. \n\nThe house keeping on certain days don’t come on time and do a bad job . The people who were to clean the room today didn’t come in to clean even after insisting to come in . All the bags were out but they didn’t come inside .","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Nice but can be better!","lang":"en","publishedDate":"2024-01-10","publishedPlatform":"OTHER","rating":3,"text":"The hotel is in an excellent location but the structure is now feeling the weight of its age and would need to be renovated. But beyond this I feel like making some suggestions.\nThe room was not very clean: in particular under the sofa bed at the entrance there were snack papers and there was a lot of dust; the plaster on the shower ceiling had cracks and in fact it peeled, falling into the tub, which was also very old and chipped. The toilet had some blocking problems and furthermore, the filling of water did not stop due to the cap not being completely watertight (the intervention of the very kind ADAM, however, was decisive!). In any case, the fridge and the entire kitchen hallway are really comfortable and the spaces of the room themselves are really large and well organised. The linen is always clean. A little attention would be enough to improve a lot. In any case, advantageous quality\/price ratio!","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Fantastic location and spacious rooms.","lang":"en","publishedDate":"2024-01-03","publishedPlatform":"OTHER","rating":5,"text":"Stayed here the week before Christmas 2023 and can't fault it. The location is FANTASTIC and in my opinion perfect for the price. Close to a subway walking distance to Central Park and Times Square but far enough away that you are not in the craziness but lots within a 5 minute walk. Yes it is a little dated but that adds to the charm. The staff were friendly and helpful and we had the suite which suited our family or 4 (2 x adults + 2 x teens) PERFECTLY !! I also travelled with my niece and her friend in their 20's and they also loved the location - Would 100% choose The Blakely again if I am lucky enough to return to NYC","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Full of falsehoods.","lang":"en","publishedDate":"2024-01-03","publishedPlatform":"OTHER","rating":1,"text":"Avoid this place , the website is full of falsehoods. It is run like a  cheap roadside motel in the country.\nNo coffee machine , no coffee mugs no hair dryers.You have to go down to the reception desk and ask for all these things like you are a begging for handouts....\nThey claim to be a trademark Luxurban Collection property......\nFor a positive....the staff are positive but have limited resources.......Corporate greed hiding behind the excuse of the pandemic.......wake up - it is 2024 and the pandemic has long gone.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23817306,"title":"Good location in the central NYC with big room for family. ","lang":"en","publishedDate":"2023-12-21","publishedPlatform":"OTHER","rating":5,"text":"We stayed in Superior Suite which is big and enough room for my family of one daughter, my wife, and myself. The building and rooms are old but I like that. \n\nGOOD 1 : Location\nGOOD 2: Hot shower works 24\/7 with good strong water pressure\nGOOD 3: Price\n\nBAD 1: Internet drops from time to time\nBAD 2: Noisy from outside because of the location and old building, such as tracks and cars. \n\nI will pick Superior Suite again when I visit NYC again. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Not the best! ","lang":"en","publishedDate":"2023-12-17","publishedPlatform":"OTHER","rating":2,"text":"Disappointing considering the cost. No tea or coffee making facilities despite advertising a kettle and mini kitchenette. No hairdryer. Asked for both and eventually after 12 hours received them. Checked in on the evening of Tuesday 12th December - front desk staff very helpful. Came down to ask for missing items the next morning to be met with front desk staff member who quite frankly made it clear we were disturbing her morning! Room was comfortable but don’t expect things like shower gel or soap and shampoo because again these are few and far between despite our room being serviced each day. Location wise the hotel is brilliant just be ready to have to ask for your kettle and hairdryer and take your tea and coffee with you!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Best location and nice\/large rooms","lang":"nl","publishedDate":"2023-12-15","publishedPlatform":"OTHER","rating":5,"text":"Nice employees, really American and big rooms, good cleaners and the perfect location! 3 minutes to the subway, 5 minutes to Central Parks and only 15 minutes to Times Square. Had a really fantastic holiday and for a good price","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Have not refunded","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"MOBILE","rating":1,"text":"I have booked this hotel through Booking.com since we are planning to visit NY in June. But after I found out that they deducted the full amount for the stay directly, I canceled my booking. This was over a month and I’ve still not received my refund yet! I have been in contact with the hotel several times but they have not paid any amount back. I’m in contact  with Booking.se instead and I really hope they can help me. I strongly advise against booking with this hotel and I will never try to book this hotel again as it feels very unsafe and unprofessional","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Superb location, clean and comfortable","lang":"en","publishedDate":"2023-12-11","publishedPlatform":"OTHER","rating":4,"text":"If you’re looking for a hotel in midtown that offers easy access to all touristy sports, then you can’t go wrong with the Blakely. It’s right by Central Park, walking distance to Times Square and depending on how much you like walking, much much more. We enjoyed walking down 5th Avenue all the way to Greenwich Village but if you don’t feel like walking, then there are several subway stations within really easy access. There are also lots of bars and restaurants nearby, making this a great spot for anyone who likes to head out in the evening and doesn’t want to be bothered with cabs.\n\nThe rooms themselves are pretty generously sized compared to other hotels in the same price point that I’ve stayed in in NYC, and were very comfortable. They’re a touch on the old-fashioned side and quite dark but this is in keeping with the aesthetic of the hotel – it’s not supposed to be super modern or minimalist. Having said that, I could have happily done without quite so many mirrors in the bathroom!\nWe had a problem with a dropping pipe in the toilet on our first night but it was late when we arrived so we shut the door and reported it the next morning. It was sorted quickly and efficiently while we were out for the day, so no complaints there at all. The room was clean and kept clean throughout our stay. We didn’t really use the small kitchenette, other than to keep some beers chilled in the fridge but it was handy for that if nothing else! \n\nWe had a late flight home but couldn’t get a room for late checkout but the hotel kept our bags (for a fee – unusual for us who are used to hotels in Europe and Asia where this would be complimentary but I believe more common in NYC) and they had a small shower room for us to use before we left for the airport.\n\nFor a great location, without breaking the bank, I’d highly recommend the Blakely. It’s clean and pleasant and offered us a great base to get out and see the city.\n","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Old school charm in great location","lang":"en","publishedDate":"2023-12-06","publishedPlatform":"MOBILE","rating":5,"text":"Brilliantly located hotel for walking to Central Park, Times Square, broadway with easy transport links from the airport and to other areas of the city.\nLovely old school New York charm. Our room on the 16th floor was brilliantly spacious with a sofa and tv area for chilling out after a long day!\nSuper comfy bed and lovely warm room. Clean and tidy bathroom, plenty of closet space and fridge and microwave very handy.\nCouple of amenities missing but were supplied when we asked (kettle and a second mug) some basic tea and coffee supplies would have been helpful too but we went shopping in anycase so not a major problem.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"YOUR RESERVATION HAS BEEN CANCELLED!","lang":"en","publishedDate":"2023-12-05","publishedPlatform":"MOBILE","rating":1,"text":"We arrived at the Blakely and were told our reservation had been cancelled. They said that there were no rooms but we were eventually offered a sister property. We had no options!  They proceeded to blame Hotels.com. We had had the reservations , paid in advance, for 6 months! We were told by the Blakely that the transportation would be paid for( it was not) and were told that it would be nicer. I have nothing to compare it to, but it was 20 blocks  south and no where close to any of our planned activities. Hotels.com helped us find another place, paid the difference, and is reimbursing our transportation.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"Pleasant hotel. Warm & Cosy","lang":"en","publishedDate":"2023-12-05","publishedPlatform":"MOBILE","rating":5,"text":"Firstly when we arrived I was informed we had no reservation.  I was then advised to contact Urban Lux by email. No phone number was available and after travelling for 15hours I was feeling very stressed. I felt at first the hotel didn’t want to no even although I had proof of emails and receipts. Eventually the receptionist Juliette began speaking to the Reservations Manager at Urbanlux.  They couldn’t trace my booking or my money. It looked as if they were going to move me 20 blocks away. I spoke with Juliette and advised this was not possible. She was very nice and she managed to keep us in the hotel and we were then given a suite.  This took an hour to be sorted. We had originally booked a king so we were given  an upgrade.  The hotel is very warm. Room good size and clean. Plenty of storage. The hotel is 2 blocks away from Central Park, 13 from Times Square which walking takes about 15 minutes.  I block away from 5th Avenue.I would recommend the hotel. Even after the hiccup we had. Staff were great.  Costs 6 dollars to store your luggage on check out.  No bar or restaurant in hotel. 2nd floor has 2 vending machines with snacks.  Has fridge and microwave in room. No kettle.  Can get a hairdryer from reception. Plenty of eating places round about","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Reservation Canceled!","lang":"en","publishedDate":"2023-12-03","publishedPlatform":"MOBILE","rating":1,"text":"We arrived in NYC and went immediately to check in our hotel. We  were told that our reservations were canceled the day before. We quickly called Hotels.com and they said our reservations were still valid on their end. After much back and forth we were offered a sister property and we couldn’t check in until 3:00 PM. After we took a $50 taxi with all of luggage, we immediately decided that the hotel location was not were we would have ever booked. We then went back to Hotel.com  and after many suggested properties, we took another expensive Uber back to midtown to our new hotel. Needless to say this is not how we planned our first day in New York to  go. If you read reviews in Yelp there are others who have had similar experiences. We appreciated the help and support we got from Hotels.com and our new hotel was perfect.","travelDate":"2023-12","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"Perfect location, great hotel would definitely recommend","lang":"en","publishedDate":"2023-12-02","publishedPlatform":"MOBILE","rating":4,"text":"Just returned from a five night stay with my son. Hotel is in a great location, staff extremely helpful.\nRoom was dated but this did add to the character, very spacious with a lovely powerful shower, comfy beds and free safe. Cleaned to a good standard every day. \nJust think the rooms were missing a couple of things; hairdryer, kettle and an extra cup.\n\nI would definitely recommend answering stop here again.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great stay!","lang":"en","publishedDate":"2023-11-29","publishedPlatform":"MOBILE","rating":5,"text":"We had a fabulous stay at the Blakely hotel. They were so nice especially Betty. She was so sweet and accommodating. It was peaceful and quaint and the location was just perfect. The lobby had a beautiful Christmas tree set up. Would stay here again.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Awesome","lang":"en","publishedDate":"2023-11-29","publishedPlatform":"OTHER","rating":5,"text":"Very welcoming on arrival and having a great stay. John and Betty helped us so much after traveling with a 2 year old and made our arrival to NYC for a cruise so smooth.  Very close to rockefeller center, central park, and times square.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Awesome NYC Hotel","lang":"en","publishedDate":"2023-11-28","publishedPlatform":"OTHER","rating":5,"text":"Awesome hotel.Great location.\nFront desk super friendly.\nThank you Betty and Vanessa.\nWe will return.\nCloser to Everything. Closer to Central Park. Times Square. Radio City. Microwave. Refrigerator too.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great central hotel to stay in!","lang":"en","publishedDate":"2023-11-28","publishedPlatform":"MOBILE","rating":5,"text":"Great early check in to hotel with Vanessa & John! Very central hotel and would stay again! Close to lots of attractions like Central Park and many eateries. Will stay again next time we are in town. Highly recommended and very friendly hotel team!","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Amazing staff","lang":"en","publishedDate":"2023-11-23","publishedPlatform":"OTHER","rating":5,"text":"This was one of the best customer service experiences I’ve ever had. Not even speaking to all the help we had during our stay with amenities or housekeeping (also great), but just the staff was out of this world. Denise specifically. We came back from dinner with my nephew in full meltdown mode because his mom had traveled in another car and he really wanted her. I could not calm him down and he was screaming in the lobby (which I felt awful about). Denise came over, started talking to him and CALMED him down by talking about books and shoes. She was a lifesaver. I wanted to hug her. Stay here because the staff actually CARE and want to help. What an amazing hotel. Will definitely be back.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great Option with Great Location!","lang":"en","publishedDate":"2023-11-23","publishedPlatform":"OTHER","rating":5,"text":"We had an incredible experience with LuxUrban and this hotel. \nOur experience began by booking in advance based on location and price. While lesser known than some of the big chain hotels, this hotel looked to fit our needs.\nUpon arriving and sharing our reason for our trip (our daughter was in the Macy’s Day Parade), the hotel manager Vicki was called, and she explained the sister hotel, the Herald, overlooks 6th Ave. She was generous in suggesting a number of various options, all of which meant more work for her and the staff. \nOne option was to relocate to that hotel for no additional cost. We ended up switching for 2 nights and remaining for 2. Their staff was completely accommodating. It was very impressive how hard they worked to suite our personal situation.\n\nThis hotel:\nWhile older in style, it holds a classic look and feel with spacious rooms and great location. It’s a good fit for the price, and I’ve already mentioned the staff.\nAll amenities were adequate.  \n\nIf we return, we will heavily consider the LuxUrban chain again.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Great","lang":"en","publishedDate":"2023-11-23","publishedPlatform":"OTHER","rating":5,"text":"Excellent location half way between Time Square and Central Park, spacious room and comfortable bed. There's a mini kitchen with microwave and fridge in the room.\nThe stuff members were very friendly. ","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":23817306,"title":"Awesome customer service","lang":"en","publishedDate":"2023-11-22","publishedPlatform":"MOBILE","rating":5,"text":"Victoria and Vanessa were beyond helpful! They made our Thanksgiving trip to New York City absolutely perfect! Without a doubt the best customer service we have received in all of our travels. I Highly recommend the Blakely and the Herald.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Broken Toilet","lang":"en","publishedDate":"2023-11-21","publishedPlatform":"OTHER","rating":2,"text":"Stayed here for 3 nights in early November.\nStay was OK apart from a toilet that wouldn't flush and ran all night during our stay.  Issue was reported on numerous occasions, and on one evening had the maintenance guy visit 3 times.\nConcierge staff are neither friendly, welcoming or problem solvers.  No apologies, no nothing.  All care but no responsibility.  The only time I got any prompt attention was when I received an email from Scott (standard response) after completing a survey honestly and openly.   A direct reply to Scott has yet to generate a reply (obviously Scott's busy attending to other grievances).\n","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great Location!","lang":"en","publishedDate":"2023-11-21","publishedPlatform":"OTHER","rating":5,"text":"Betty is very friendly! We arrived early but they were able to store our luggage and even got us checked in early. Perfect location and great value! Definitely check out this location when you are in NYC!","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Very professional and accommodating","lang":"en","publishedDate":"2023-11-16","publishedPlatform":"OTHER","rating":5,"text":"Great please to stay. The staff were very professional specially the front desk. I will recommend this place to anybody visiting NYC and wants to stay close to restaurants and bars. The hotel was also very flexible.","travelDate":"2023-11","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23817306,"title":"Great location. Great staff. Great value.","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"OTHER","rating":4,"text":"Our group was very impressed by our stay at The Blakely! The staff was friendly, suites were spacious (especially for Manhattan!), facilities were clean, and the location can’t be beat! Our rooms were made up each day along with fresh towels, which was lovely after a long day in the city. The hotel is definitely dated, but that can be charming. Every little thing does seem to cost you extra (holding bags, late check outs, etc.). But overall, there was nothing that would deter me from staying here again! We found this to be the perfect spot at a great value!","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"Mauvais choix ","lang":"fr","publishedDate":"2023-11-08","publishedPlatform":"OTHER","rating":3,"text":"Nous avions une chambre pour deux alors que nous étions 4\nHotel très vieux et cher, pas de petit déjeuner de prévu \nSalle de bain vétuste, le robinet de la douche m'est resté dans les mains. \nLa climatisation est très bruyante, les fenêtres ne s'ouvrent même pas. \n","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Perfect location for easy exploring ","lang":"en","publishedDate":"2023-10-28","publishedPlatform":"MOBILE","rating":5,"text":"Was apprehensive about staying here after reading the reviews but no need to have worried. The hotel is a little dated but the staff were friendly and the rooms were clean, a very good size with an extremely comfortable bed. Microwave and fridge in room too. The bathroom was a good size too with a good shower. The location was fantastic, with central park, times square, Broadway and other attractions in easy walking distance. ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23817306,"title":"Great location, spotless hotel","lang":"en","publishedDate":"2023-10-19","publishedPlatform":"MOBILE","rating":5,"text":"Excellent location close to times square and central park. Friendly staff. Rooms are a bit on the  old side but are kept spotless. Cant fault the hotel, very reasonably priced. If I was coming back to New York would definitely stay here again.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Das perfekte Hotel mitten in Manhattan!","lang":"de","publishedDate":"2023-10-15","publishedPlatform":"OTHER","rating":5,"text":"Das Hotel liegt mitten in Manhattan, wir hatten vom Zimmer in der 9. Etage Blick auf das Empire State Building.\nDie Anbindung an das U-Bahn-Netz ist hervorragend, die U-Bahn liegt direkt vor der Tür!\nDas Zimmer war sehr gut eingerichtet und immer sehr sauber!\nWir können dieses Hotel hundertprozentig empfehlen und bei unserem nächsten Besuch in New York kommen wir wieder!\nVielen Dank und olle Punktzahl von uns.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Top City Hotel","lang":"de","publishedDate":"2023-10-08","publishedPlatform":"MOBILE","rating":4,"text":"Top Hotel an sehr guter Lage,Time Square in ca 10 Minuten zu Fuss erreichbar. Hatte eine Suite gebucht,an dieser gab es nichts auszusetzen. Einziger Nachteil Hotel ist ein bisschen in die Jahre gekommen,aber ansonsten alles perfekt geklappt.","travelDate":"2023-10","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"Downward Trajectory","lang":"en","publishedDate":"2023-10-05","publishedPlatform":"OTHER","rating":2,"text":"This hotel is on a downward trajectory. Super tired and in need of care. Amenities have disappeared, carpet is horrible, paint chipped on all doors, beginning to fall apart. Maintenance also thin, shower valves coming out of wall, mildew on shower curtain, toilet stained seat...taking it off my list despite the good price...get what ya pay for I guess.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":4,"locationId":23817306,"title":"Scam hotel don’t stay here","lang":"en","publishedDate":"2023-10-04","publishedPlatform":"MOBILE","rating":1,"text":"I booked this hotel in Jan2023, 9 months before , my travel date. When we arrived to the hotel the receptionist was very rude, in addition she was telling us that she didn’t find our reservation that they were fully booked no rooms where available, I had messaged them a day before that my flight was delayed and I was going to be arriving late , apparently to them they never received my msgs but I have prove that they were messaging me very quick and they were aware of it ,but they didn’t save our room . I booked through hotels.com they didn’t want to give us a refund due to “ cancellation “ how am I going to cancel a reservation they didn’t have ? Please be aware of this hotel.I’m out $1028.00 for a room that I booked 9 months in advance. I was really looking forward to my stay I had planned my entire trip around this location. Hotels.com accommodated us in another hotel , but the hotel rate was  less than what we paid here.. & they didn’t offer us an taxi to take us to the hotel we needed pay out of pocket around 11pm rude experience here !","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":4,"locationId":23817306,"title":"Dreadful hotel service. STAY AWAY!","lang":"en","publishedDate":"2023-09-27","publishedPlatform":"MOBILE","rating":1,"text":"Utterly rude receptionist. Booked my reservation 9 months in advance at about 200USD a night which was a good deal and a total of 1200USD for 6 nights, but just to find out they overbooked me on the day the i arrived. They said they dont know why there is no room assigned and they are fully booked. They also said there is nothing they could do just want to give a refund. Hotel prices were at 600 a night already in Midtown. I wanted to speak to the manager but the receptionist said the manager does not take calls. And they basically left us with no place to sleep that night. Luckily booking.com offered an alternate accommodation at the Courtyard but was in Downtown and was 500USD a night. We gratefully accepted it knowing that the hotel would be penalized a total of 3000USD and would have to pay for our alternative accommodation. Happy to have stayed with the Courtyard by Marriott than this dreadful place!\nTip! Do not book this hotel direct, book through a booking channel like booking.com or expedia. If they overbook you, you can demand from the booking channel to penalized the hotel and they have to give you an alternative hotel with greater or equal value. If you book direct, they wont care about you and leave you on the streets.\nPro tip! Stay away from this hotel. They will for sure ruin your vacation!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":23817306,"title":"My Favorite NY Hotel !","lang":"en","publishedDate":"2023-09-21","publishedPlatform":"MOBILE","rating":5,"text":"Wonderful old school NY hotel with spacious rooms and ideal location. Warm, helpful and knowledgeable front of house team led by Betty, and great management behind the day to day with Scott and Vicky at the helm. Speak to John the doorman for NY tips! Stay here for a quintessential NY experience - recommend 👍","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":23817306,"title":"Great room, great price, great location ","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"OTHER","rating":5,"text":"This place is a real find. It’s close to everything….10 minutes to Times Square, ten minutes to the park etc. everything within walking distance including plenty of eating choices. It’s a great price for a large comfortable room. The staff and check in were smooth and easy. Bed comfy and AC worked great! Will definitely be back.","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23817306,"title":"Needs some love","lang":"en","publishedDate":"2023-09-20","publishedPlatform":"OTHER","rating":2,"text":"We booked this hotel knowing that reviews seemed all over the place. I did not expect 5 star but do expect a clean decent room with basic amenities. Room 306\nPros: Great location, front desk staff were friendly, quirky Old \nNew York decor. Good size room and bathroom, small clean fridge.\nCons:  Room just did not feel clean. The bathroom ceiling was wet and pieces were falling into tub and it was dirty. The room in general has peeling wallpaper, and scrapes on doors and chairs. No top sheet on beds, only 2 hangers, no Kleenex, no coffee maker or kettle. No hairdryer. The AC could not be adjusted. \nIt really sounds like they have some great rooms and rooms like ours which really need some love. I guess you take your chances when booking. Hopefully you get one of the nice ones.\nNote: We did call and maintenance were told us not to worry about the dripping ceiling. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Fantastic hotel in the heart of Times Square!","lang":"en","publishedDate":"2023-09-19","publishedPlatform":"OTHER","rating":5,"text":"I loved this hotel!  The staff was incredibly helpful and friendly.  We had a mobility scooter and they pulled out the ramp and took care of recharging it for us each day.  Above & beyond.  The room & bathroom was large & very clean, the bed was super comfy and the a\/c worked great... in the middle of a heatwave!  the location is fantastic, very close to lots of interesting things to see and great food to eat.   Now addressing the other reviews that say it's shabby, etc.  It's not a 5 star hotel - but it probably was back in the day.  The price for the area reflects this.  My room was not shabby, but the style is somewhere around the 90's and an old english hunting lodge.  I found it charming and homey and I will stay there again.  ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Very disappointed with the room :( excellent location ","lang":"en","publishedDate":"2023-09-19","publishedPlatform":"OTHER","rating":3,"text":"I was very surprised and not pleased with the fact that there where missing a lot of stuff in the room: hangers, blow dryer, cups. The air conditioner was not working properly, it was stuck at certain temperature and didn’t level down more. We reported on a daily basis and it was never fixed. One day there was not hot water and the frontdesk answer was that there was nothing to do since the technician arrive later. The room needed a little bit of maintenance since the wall looked a little bit dirty and we found under the console some dirty underwear from other guest with lot of dust , seems that the cleaning process is not that deep.\nThe location of the hotel and the rooftop are the only thinks that are worth it.\n","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":23817306,"title":"The hotel is well located and comfortable","lang":"en","publishedDate":"2023-09-15","publishedPlatform":"OTHER","rating":2,"text":"The hotel is well located and comfortable. The only bad thing is that one day they didn't clean the room because they didn't have staff.\nAt night it is a little noisy, being so close to the Time Square area, but the windows close well and you don't hear so much noise. Friendly staff. It seems excessive to me that they charge $2 to store suitcases on the day of departure.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Below Average","lang":"en","publishedDate":"2023-09-14","publishedPlatform":"MOBILE","rating":2,"text":"We booked the hotel for on night as the location was very good.\nThe receptionist was rude and unfriendly.\nThe lobby was dingy and not inviting. The room with noisy air-conditioning and bathroom with bad drainage in the tub.\nNothing in the minibar.\nThere are plenty of hotels in the area. Get something better for 300 Us $ a night.","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great Experience","lang":"en","publishedDate":"2023-09-13","publishedPlatform":"OTHER","rating":4,"text":"Position of Hotel is Fantastic, Room was very good, very helpful staff, reception could do with being a lot more brighter as seemed very dull and not very inviting but don’t get out of by it as the rest is great ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Excellent location in Manhattan","lang":"en","publishedDate":"2023-09-13","publishedPlatform":"OTHER","rating":4,"text":"The best of all is its location in the heart of Manhattan, right behind the Empire State Building, very close to several subway and bus lines. A 10-15 minute walk from Times Square, the New York Public Library or the Summitt.\nThe room was good, with very comfortable beds and pillows. Every day they cleaned the room (except one day due to cleaning staff problems). All the staff were always very friendly (from reception, cleaning, luggage storage). It is a hotel I would go to again","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Bad experience","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":2,"text":" The hotel offers us only the basic things. The receptionists are not kind, the  room cleanness are badly done, the housekeepers only tidy the bed and change the bath towels. They don´t do anything more. There is not a reception in the hotel like they show on the internet. The reception is ugly and doesn´t have any sofa or chair for the guests. It is like a reception from a mechanical workshop. One day, they didn´t clean the room and there was a note from the hotel under my door, apologizing  for not have cleaned the room, because the hotel was crowded and they did not have enough employees to clean all the rooms. I had never seem this in any hotel I have ever stayed. A good hotel knows how many guests they would have in a day or in a week, to plan how many employees it would be necessary to do a good job. Besides these, I saw in my credit card balance, that the hotel charged me a value of $5 in 05 September, without saying thw reason of this, if I did not damage  anything from the room.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Showing her age","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":3,"text":"The hotel is in a great location- close to the subway and Central Park. \nWebsite says gym & restaurant, but they are no longer there since the pandemic. The AC in the room was unable to cool it off,  but it worked well in the lobby. \nThe safe battery died and locked all our cash in it, unfortunately no one was available until the following day to open it. \nThe internet kept kicking us off the wifi but when it worked, it was free.  \nJohn at the front desk was very helpful with directions and recommendations. \nThe beds were comfortable, but Irecommend replacing the tub as it is very cracked and dated. The room was clean- fridge and microwave worked well. ","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"The location is the only positive!","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":3,"text":"Fantastic location and best shower we’ve had in over 10 hotels across the country! In comparison to those other hotels, this one is super basic. No cups, mugs or coffee\/tea facilities in the room. No microwave as stated either. Corridors were like a hospital floor, common area we avoided. Desk receptionist did not look like they wanted to be there (it was dark and dingy…can’t blame them, but they were true to the NYC reputation for abruptness, unlike southern counterparts). TV had constant issues too. Slowest lifts ever!!! If it weren’t for the location, we wouldn’t have stayed! We have travelled across the US and have been staying at numerous hotels of similar rating and budget, hence just comparing apples with apples here!!!","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Very Central in NY","lang":"en","publishedDate":"2023-09-08","publishedPlatform":"OTHER","rating":5,"text":"Very central, friendly staff and good price. We really enjoyed our stay. Aircon in our room, great shower, close to supermarket. Times Square just a quick walk away and Broadway also!! We will be back.","travelDate":"2023-09","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"One week in front of Herald Sq.","lang":"en","publishedDate":"2023-09-07","publishedPlatform":"OTHER","rating":3,"text":"The pillows are so bad I had to buy a decent one at Macy’s. Otherwise a neck pain would ruin my stay. Installations OK, but some confort items missing. \nAlthough a room for a couple, there was just one glass for drinking water. Just one chair in the room.Two seats would be nice. A small coffee machine would be welcome since there is no breakfast at the hotel. \nLocalization very good. \nWaiting room is in the 4th floor, no seating at reception. A small terrace, an old couch where’s someone sleeping, no room to seat. A restroom with shower.\nCleanliness ok. Bathroom and shower good. Friendly staff. Good for a week, not more.\nGood price.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Midtown hotel ","lang":"en","publishedDate":"2023-09-06","publishedPlatform":"OTHER","rating":5,"text":"Hotel has a perfect location. You can easily come back and refresh during the day, and then continue exploring the city. It's clean and comfortable! Rooms are spacious. We really enjoyed our stay. We'll be back for sure!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Favoloso","lang":"it","publishedDate":"2023-09-06","publishedPlatform":"MOBILE","rating":5,"text":"Siamo stati benissimo e mi sento di consigliarlo fortemente a chiunque venga a New York.\n\nLa zona in cui ci trovavamo era centralissima e ci ha permesso di fare tantissime cose.\n\nAppena esci dall’hotel sulla destra c’è l’ingresso della metro che ti porta ovunque. In ogni angolo ci sono negozi, alimentari, ristoranti, fast food. \n\nLe camere sono ampie ( unico neo e che non ci sono armadi il che risulta un po’ scomodo.. ma a noi sinceramente non è pesato per niente considerando che appoggiavamo le cose in valigia ). Avevamo un letto a 3 piazze. Il bagno è super ampio con una doccia in cui c’entrano due persone. L’arredamento e moderno ( anche se c’è la solita moquette ). Ogni giorno ci hanno rifatto la camera.\n\nLa cosa che ci è piaciuta è anche il rooftop ( the monarch ) che si trova nello stesso stabile ai piani alti che ci ha permesso 2\/3 volte ( anche se stanchi ma eravamo già in albergo ) di sorseggiare un ottimo cocktail con vista empire mozzafiato in tranquillità.","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":23817306,"title":"Poor","lang":"en","publishedDate":"2023-09-04","publishedPlatform":"OTHER","rating":2,"text":"Everything was absolutely bare minimum or below. I am not a picky person but I was not comfortable touching anything other than sheets and towels. Even the wall was dirty. The bathroom was acceptable though.","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"A good choice","lang":"en","publishedDate":"2023-09-03","publishedPlatform":"OTHER","rating":4,"text":"Good position and nice rooms, beautiful rooftop with a unique view on Empire. Gym available. A laundry service would be appreciated. Breakfast is not included but there arr many places nearby where to go","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"August stay","lang":"en","publishedDate":"2023-09-01","publishedPlatform":"OTHER","rating":2,"text":"Room is big and clean, has extra sitting area, very convenient location. However, it’s old building with single pane window, noises from air conditioning, garage truck and car honking. Felt like sleeping in the street. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Worst hotel experience ever","lang":"en","publishedDate":"2023-08-29","publishedPlatform":"OTHER","rating":1,"text":"They guy in glasses at the front desk was literally one of the rudest person I've ever met, when I booked my reservation for me and my wife, it was already paid, he wanted $150 MANDATORY deposit, which is fine, I pay everything with Google pay so I never pay or have the physical card with me, he refused to take the deposit from my Google pay linked to my Wells Fargo account, I was the one that had to give options, cause the guys literally just answered me \"dude, this is my second day here, honestly you're not gonna change my mind and I don't care, either you give me a physical card or you sleep in the streets, it's your problem not mine\" and me and my wife were shocked with his attitude, he made me run all the 5th ave to find a cvs to get a damn prepaid card so he can check me in, at this point, we were already waiting for 5 HOURS! We arrived at 6 and by the time he said go and get a prepaid if you want your room, it was close to midnight, so I had to run, in the middle of the night, tired, exhausted, upset, and had to leave my wife alone at the lobby with our stuff, I came back and they switched shifts, and then there was this girl at the front desk, and when I expanded her what happened she said \"that's stupid, you did not needed to go to CVS and get a prepaid, I can take you deposit by just typing your card number\" that was the must unrealistic experience I've ever had, I'm a OM at Hilton, and I do know how the hotel industry works for a long time, and that kind of situations are UNACCEPTABLE! Not to mention the guy took a photo of my card and my id, if I get any fraud charge, I'm gonna make this place responsible.\nI ended get in the room at 1 am, from waiting since 6 pm untill 1 am because the people you hire just don't know a thing about what they're doing, I couldn't stay in any Hilton that night cause they were all booked, but I wouldn't go to that hotel ever again, the only professional and respectful person was the lady in the night shift that helped us, further than that... The housekeeper was rude and wanted to kick me out at 9 am!!! And then we asked to leave our suitcases so we can take breakfast, well... The bellboy or whatever that person was, didn't even suggest a tip, was a MANDATORY tip that he charged himself, otherwise he wouldn't give us our stuff back, it is just unbelievable the kind of service in this damn place, never in all my years in the hotel industry I saw such a despicable place.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Love It","lang":"en","publishedDate":"2023-08-28","publishedPlatform":"MOBILE","rating":5,"text":"Really liked and enjoyed staying at this place :)\nThey were very attentive and If needed towels or anything in less than 2 min were delivered :) \nI definitely recommend this please , it’s so close from Times Square and other places :) \nWould recommend to family and friends :)","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":23817306,"title":"Som estafadores! No reserven! Dont book! Please dont book here!","lang":"es","publishedDate":"2023-08-24","publishedPlatform":"OTHER","rating":1,"text":"Son estafadores. Me cobraron 1000 dolares que no correspondian. Tienen la pagina para estafar gente. Y despued no te responden por booking. No se les ocurra reservar. Te roban. Es una estafa.\nDomt try to book with them they will steal your money. Dont do it.","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Nice hotel..","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"OTHER","rating":4,"text":"Nice hotel..clean and near lot of thing..\nStaff really friendly..comfy bed..\nSubway around the corner,food shop and little market near..not too much traffic..\nI will deffinitly go back to this hotel..","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great room for a great price","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":5,"text":"Pretty awesome price for such a great hotel. In the middle of everything, very clean, staff was very nice, and has a rooftop bar with amazing views! We were very happy with it and would come again for sure. One of their elevators was down when we checked in and was fixed the next day. Our only tiny complaint is that when the AC unit kicked on it sounded like our door opening so it was jarring at first but we got used to it pretty quickly.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Good but street noise","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":3,"text":"Good room for four, well equipped and comfortable. Very good location in NY. But noise from the street woke us at 6am. I would highly recommend to install a double-glass (if no noise, I would have rated a five)","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"First time in the city","lang":"en","publishedDate":"2023-08-21","publishedPlatform":"OTHER","rating":4,"text":"We enjoyed our stay! We really liked the separation between the sitting area and the bedroom. It was very quiet and easy to get to. Our only complaint is that the 9 button on 1 of the elevators didn’t work, so we would have to go up or down a floor and take the stairs to the 9th floor. ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Ottimo hotel","lang":"it","publishedDate":"2023-08-21","publishedPlatform":"MOBILE","rating":4,"text":"Hotel in pieno centro a pochi metri da time squadre. Pulizia eccellente effettuate tutti i giorni con il cambio di asciugamani e prodotti da bagno nuovi ogni giorno. Al quarto piano dove c'è la palestra poi c'è il dispencer dell'acqua che a new york non è poco. ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Good value choice in a prime location","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"OTHER","rating":5,"text":"For the location and price, I doubt you can do better.  We had four comfortable nights at the Blakely in a 2 queen room (rare in this part of Manhattan).  Beds were comfortable, room was clean, staff was friendly, and location cannot be better steps to Central Park, Times Square, and every metro line you may need.  We made good use of the microwave\/fridge.  It was surprisingly quiet given the key location (since it's off a side street) and very safe.  I think the 4 star rating may be a stretch given the 'faded' luxury but if you set your expectations right you should be pleased with your stay.  Note that we did pay in advance to get our rate but everything was smooth and the hotel seems trustworthy.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Due notti a New York","lang":"it","publishedDate":"2023-08-18","publishedPlatform":"MOBILE","rating":3,"text":"Hotel in stile moderno situato in centro in zona molto trafficata e vivace. Camere mediocri e nessun tipo di servizio. Per lasciare in deposito i bagagli il giorno della partenza chiedono un costo di 2 dollari a bagaglio. Abbastanza pulito","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great location!","lang":"en","publishedDate":"2023-08-17","publishedPlatform":"OTHER","rating":4,"text":"The hotel is situated perfectly with a view on the Empire State Building and near Times Square, the room was nice, the service was great! Must see the rooftop bar Monarch ( over 21 yr). Would absolutely recommend it.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Not what I expected.","lang":"en","publishedDate":"2023-08-16","publishedPlatform":"OTHER","rating":3,"text":"The pillows were too soft, and, when I requested a harder one, the one bought was not much better and they would not allow me to keep an extra one to give me extra support. There was only one chair in the room for two people booked and they did not have another one to give us. This made watching TV a pain for one of us. There was no bench for the luggage to be laid out. ","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great place to call home for 4 nights","lang":"en","publishedDate":"2023-08-16","publishedPlatform":"OTHER","rating":4,"text":"All in all the hotel was great.  Minor issue with the A\/C but all was fixed and taken care of.  The beds are comfortable the staff is very friendly.  Location is great.  Just a few blocks away from Times Square.   I would recommend staying here to anyone.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"A very well located hotel with friendly stuff","lang":"en","publishedDate":"2023-08-16","publishedPlatform":"OTHER","rating":4,"text":"The location of the hotel was fantastic \nVery helpful people working at the hotel\nSpacious rooms\nCleanliness good, clean towels every day\nHad to ask for shampoo and shower wash as they would not give us otherwise ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Really good ","lang":"en","publishedDate":"2023-08-15","publishedPlatform":"OTHER","rating":5,"text":"Really good hotel is great location. This isn’t luxury but it’s really decent. We had a double bedroom, living room. Small kitchen and bathroom for £200 a night. That’s amazing for NYC.\n\nIt’s in a great location. Between Times Square and Central Park. \n\nThere’s amazing hotels all around if you want to pay a lot more. But this was perfect for us.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Ubicación ","lang":"es","publishedDate":"2023-08-13","publishedPlatform":"OTHER","rating":4,"text":"Excelente ubicación, la entrada es fea pero las habitaciones no. Puedes dejar tus maletas si llegaste antes\/después del check in.no tuvimos ningún problema, todo muy bien. Camas y almohadas cómodas, la laptop cabe perfectamente en la caja fuerte ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great Location","lang":"en","publishedDate":"2023-08-13","publishedPlatform":"OTHER","rating":3,"text":"The front desk staff was fabulous and helpful and the location could not be better.   But the hotel in general needed a refresh and looked a bit tired.\nElevatos were small and stuffy and hallways a little dark.\nRooms were nice though. Maybe a coffee maker in the room would have been nice.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Central location","lang":"en","publishedDate":"2023-08-10","publishedPlatform":"MOBILE","rating":4,"text":"Missing the 5th star as one of the two rooms booked was not matching the description as it was quite smaller than expected and with no place such as a wardrobe or anything to hang clothes. Deserve anyway 4 stars as rooms were clean, bathrooms were newly refurbished and the location is definitely 10\/10.\nWould choose it again","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"DO NOT BOOK HERE","lang":"en","publishedDate":"2023-08-10","publishedPlatform":"OTHER","rating":1,"text":"STAY AWAY \n\nThis hotel is the worst hotel I have ever had the displeasure of booking with.  The hotel does not have a phone center, so there is absolutely no way to call anyone. This is unsafe for any person staying at the hotel. Not knowing this, because their website promises someone will be available to speak on the phone 24\/7, I  tried to call hotel over and over again, with no response. I was then informed that there is no call center whatsoever for this hotel . This is completely unacceptable and unsafe for people staying there. I could not, and still cannot, get anyone on the phone. \n\nI was sent an email saying that I had to provide the hotel with pictures of my state identification card, and a lot of other personal information. I was very uncomfortable with that, but after calling multiple times, and not getting a hold of anyone, I filled it out. The authorization was actually declined, meaning that the hotel had no authorization to charge the credit card, but \n (via a short email) the hotel told me that they are still going to charge the credit card. At this point, I had a very bad feeling about this hotel and asked them to cancel the reservation (that I made just an hour beforehand). They responded (by email, because there is no phone), that they are charging the card (despite not being authorized to do so), and there is nothing I can do about it. Their website broadcasts \"FREE CANCELLATIONS\" up to 72 hours before the stay, and it also promises that the customer can reach someone on the phone 24\/7. Both of these are blatant lies and are misleading. I spoke with my bank, and they are removing the charges, and were shocked by how unprofessional this hotel was acting. Frankly, they thought it was a scary situation as well and did not think I would be safe staying there.\n\nThis hotel's practices violate so many basic consumer protection\/false advertising laws. I will be submitting complaints to NYC consumer protection agencies and the BBB, among others. \n\nI have never seen a hotel (or any type of company for that matter) operate this way. It truly has to be some kind of scam.","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":23817306,"title":"Great location","lang":"en","publishedDate":"2023-08-08","publishedPlatform":"OTHER","rating":4,"text":"This hotel is dated but has large rooms that are very comfortable-the best thing we found is that the location is fantastic close to restaurants and subway \nLuggage storage for late checkout is $2 per bag, staff we helpful and friendly ","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Best thing about the Hotel","lang":"en","publishedDate":"2023-08-08","publishedPlatform":"OTHER","rating":2,"text":"The only good thing about this Hotel is the location, right next to a subway station and only 5min by foot to the Times Square or Empire State building, so if you want to do some sightseeing and all you have to do at the Hotel is sleep and take a shower, feel free... But for everything else, I hardly recommend another Hotel!\nRoom service is not worth the name, all they did while we stayed (6 nights) was trading the towels 3 times and make the bed...\nThe sheets are dirty, it's loud and there is just a too small curtain to keep the light out... The bath is pretty dirty, the television doesn't work at all ( I called the reception 3 times, and it is always the cable and a technician is working on it).\nThe main entrance is shared with the rooftop bar that doesn't belong to the Hotel (but definitely looks like while booking) and so you have strangers standing next to the entrance all the time and you, while a guest and trying to get to your room, are asked for a reservation all the time... Not that bad I know, but with all the other facts, a combination of a hotel that I would definitely not book again.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":23817306,"title":"Absolute rare gem in New York!","lang":"en","publishedDate":"2023-08-07","publishedPlatform":"OTHER","rating":5,"text":"Excellent location. Room with a great view of the 6th Avenue and Empire State Building. Very spacious room with a large king sized bed. Extremely clean room. Sheets and towels changed everyday. A subway literally below the hotel which has excellent connections to most places. Very helpful staff. Excellent value for money and definitely recommend.","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":23817306,"title":"Terrible experience at The Blakely by Luxurban","lang":"en","publishedDate":"2023-08-07","publishedPlatform":"OTHER","rating":1,"text":"We were expecting a package from Amazon before our checkout but it got delayed, so we left a note at the reception to not receive any package in our name after the checkout. A day later the package was delivered and the hotel received it despite of our note. We communicated with them to return it and they said they would but it took time and nothing happened, so we started communicating again but they never responded. We feel deceived. Please don't go there","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":23817306,"title":"Good experience","lang":"en","publishedDate":"2023-08-05","publishedPlatform":"OTHER","rating":4,"text":"The location and price point were great. Reservations were easy.The staff was very friendly and helpful. The room was clean and spacious. Decor is dated but who goes to NYC to hang out inside anyways. Would definitely stay again. ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":23817306,"title":"Trying out \"The Blakely\" in New York","lang":"en","publishedDate":"2023-08-03","publishedPlatform":"OTHER","rating":5,"text":"It was my 1st time in New York and I thought this was the perfect hotel to get the NY experience.  Staff was very friendly, centrally located to shops, restaurants, subway stations, Radio city, Rockefeller Center etc. Rooms had a fridge, little microwave, plates, utensils & cups  The only negative was that the elevators are slow, no coffee pot in rooms and the building was going through some maintenance outside but that was it. Also, my flight home was delayed and they  held our luggage all day for only $2 a suitcase. I will definitely stay here again and tell my friends\/family.","travelDate":"2023-07","tripType":"FAMILY"}
