{"helpfulVotes":0,"locationId":1177864,"title":"Very Nice Stay","lang":"en","publishedDate":"2024-04-08","publishedPlatform":"OTHER","rating":5,"text":"We came out for a week and had a great stay in the roof top suite.  Decent size and very clean room, particularly by NYC standards.  The patio deck we had to ourselves was really a great space with a nice view, only problem was the weather !!  Not the hotels fault.   Really a great location, super clean in the lobby, nice place to sit and have a coffee while you plan the day, and the help up front was great.   The cleaning staff was very friendly.  The maintenance guy when my wife dropped her ring down the sink was great..  Front desk with Anaise and Destiny was very, very helpful with tips on best ways to get around  and local spots for restaurants, bagels, pizza and a drink.    Place was spotless.   \n\nOne thing we really liked was the lobby was small but really useful with a coffee bar, pastries, wine\/beer, etc..   ice on command..   open 24 hours.   Much more useful and nice than a large hotel lobby or lounge space.\n\nOnly small nit was it would be nice if the rooms had a mini fridge.  You can use the fridges downstairs 24 hours but not nearly as convenient.  Other than that the room had all the necessities so you don’t have to bring them from home.  \n\nThanks again to Anaise and Destiny for all the help.    We’ll be back.","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Lovely stay","lang":"en","publishedDate":"2024-04-05","publishedPlatform":"OTHER","rating":5,"text":"I loved staying at the Moore and cannot recommend it enough! The location was great and close to everything I needed. The interior design is beautiful and the room was clean but a bit small. Also loved that there is a gym and a 24\/7 bar!\n\nOverall, I had a great stay much thanks to the lovely Anaise and Destiny who really went above and beyond to make my stay as comfortable as possible! \n\nWill definitely come back here next time I’m in NYC!","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Can’t really ask for moore…","lang":"en","publishedDate":"2024-04-05","publishedPlatform":"OTHER","rating":4,"text":"During our recent stay at The Moore Hotel in Chelsea, NYC, my girlfriend and I were happy about the great service. Anaise and Destiny were absolute gems especially, making us feel right at home from the get-go with their warmth and attention to detail. \n\nOur room was comfy and cozy, albeit on the smaller side. However, the door\/walls to the room were quite thin, and noise from people talking in the corridor woke us up one night. \n\nThe hotel’s spot in Chelsea was ideal for checking out the city. We would definitely recommend The Moore Hotel for a fantastic NYC stay!","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great Stay - Destiny is Superb!","lang":"en","publishedDate":"2024-04-04","publishedPlatform":"OTHER","rating":5,"text":"My girlfriend and I stayed here last weekend and all I can say is - we will be back!! Destiny at the front desk treated us amazingly. We had many questions since this was our first time staying in the city but she answered all of our questions without making it feel as if we were bothering her. She gave us the rundown of how to access the hotel and elevators and later on during our stay gave us some great recommendations for food that we thoroughly enjoyed. The rooms were nice and the bathroom\/shower are superb. We’ll be back!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great location, nicely decorated rooms, and great service","lang":"en","publishedDate":"2024-04-02","publishedPlatform":"OTHER","rating":5,"text":"The Moore was in a very convenient location in midtown\/Chelsea. It was easy to catch rideshares and walk to local restaurants. My room was well decorated, but small with a small window and not a surprise for NY. All the normal amenities were available in the room, plus the hotel offered nightly tokens for a drink or coffee, and the coffee came with a pastry and water (a nice touch). The most notable aspect of the Moore was definitely the receptionists. They were very friendly and welcoming. Anaise was in particular helpful. I had candy delivered via grub hub while I was out and Anaise collected the delivery and left it in my room. Thanks Anaise!","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great customer service.","lang":"en","publishedDate":"2024-03-29","publishedPlatform":"OTHER","rating":5,"text":"I had a great stay with this hotel. I definitely would stay here again. What really made this experience exceptional was the customer service we received from Destiny. She was amazing! Very welcoming and took care of our every need. I’ve never had such a seamless check in like The Moore. Highly recommend staying here. Staff is incredible!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"good energy at the moore","lang":"en","publishedDate":"2024-03-28","publishedPlatform":"OTHER","rating":5,"text":"you’re staying in the moore  and don’t want to get ripped off talk to (princess)\nComing from Seattle, I was ready to give up then she helped me a lot  im new to the city but at the moore, i was taken care of :) p.s the wine is fine if your new you got to try the nyc coffee :)","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Really good hotel and really good staff. This is about the good staff at the mooore","lang":"en","publishedDate":"2024-03-28","publishedPlatform":"OTHER","rating":5,"text":"Princess helped me guide through my whole experience here at the Moore thank God she was here I was  everywhere in my mind worried about it. She’s honestly an angel without princess here at the Moore I don’t know if if my would be the same I’m gonna be coming back soon.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"Beautiful hotel and staff!","lang":"en","publishedDate":"2024-03-27","publishedPlatform":"OTHER","rating":5,"text":"The experience at The Moore started pretty nice with the angelical receptionist girl (Destiny). \nAll the hotel structure is very nice and the location is fabulous. \nAbsolutely recommend and will stay again next times at NYC.\nNote: Coffee and pastry are delicious 😋","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"My favorite hotel in Chelsea","lang":"en","publishedDate":"2024-03-27","publishedPlatform":"OTHER","rating":5,"text":"My stay at the Moore is always convenient, comfortable, and quiet when I come to town for work. I appreciate the hotel’s ambiance, gym, and nearby transportation. Anaise checked me into my room this past check in and made my stay even nicer and my day a bit warmer with a complimentary glass of wine. She was hospitable, knowledgeable about the area, and was my go to host when I had any questions during my stay.  I look forward to returning next time I’m here.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Best front desk ever !","lang":"en","publishedDate":"2024-03-27","publishedPlatform":"MOBILE","rating":5,"text":"Top hotel! Too check in and even better, Anaise at the front desk! You really want to have your check in and warm welcoming by her :) she has been so loveable, so grateful and made our entire stay amazing! Kudos on that recruitment process on having her :)","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"A very cute gem in Chelsea","lang":"en","publishedDate":"2024-03-27","publishedPlatform":"OTHER","rating":5,"text":"I enjoyed my short stay at The Moore thoroughly. The property’s charm lies in its design and location, as well as in its great staff.\nI enjoyed the décor and art, which were of very nice quality. While I was concerned my room might be too small (165 sqft) it ended up being very comfortable as was mindfully appointed. Also the cappuccino was delicious! I will most definitely stay there again.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Easy check in","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"OTHER","rating":5,"text":"Check in was fast and friendly service. Destiny and Anaise were very helpful and answered all of our questions. They even let us check in a couple hours early! The room and bathroom were very clean. Hotel is in a nice neighborhood and has easy access to the city.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"First time!","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"OTHER","rating":5,"text":"Anaise, Destiny and Krystal are the absolute best! My first time in NYC and I couldn’t have asked for a better experience. So friendly and helpful! The location is the BEST. Give these girlies a raise! Even have free umbrellas for a rainy day! The rooftop is great!","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":1177864,"title":"amazing!","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"OTHER","rating":5,"text":"Destiny and Anaise were lovely hosts, checked in right away. staff is lovely and the neighborhood is beautiful. highly reccomend !! the lobby is warm and inviting and the whole experience was more than exceptional. if you're ever in new york, check this place out !!","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Dreamy Weekend in NYC","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"OTHER","rating":5,"text":"This hotel was an absolute dream in NYC! The perfect neighborhood with a gorgeous, modern design. The Moore is city luxury, with the most wonderful staff! Destiny, Anaise, and the rest of The Moore Team were so helpful & accommodating — perfect hospitality! \n\nI can’t wait to return soon, and I cannot recommend this place enough!","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Anaise is great!","lang":"en","publishedDate":"2024-03-23","publishedPlatform":"OTHER","rating":5,"text":"Great hotel! Beds are super comfy! Within walking distance to a lot of cool little places. 24 hour coffee service downstairs! I was blown away by this! Anaise is super sweet! And she made me the best latte. We came all the way from Seattle and it's very welcoming.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great hotel","lang":"en","publishedDate":"2024-03-22","publishedPlatform":"OTHER","rating":5,"text":"The hotel is comfortable and has excellent service. Destiny at the front desk was particularly helpful and displayed wonderful service. The location is excellent and very convenient to several popular destinations. I will be back for another visit.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":1177864,"title":"Our new go-to New York weekend hotel","lang":"en","publishedDate":"2024-03-20","publishedPlatform":"OTHER","rating":5,"text":"My wife and I spent three nights at The Moore over a weekend in March 2024 and are hooked. The Moore has three key things going for it. First, location. A 10-minute walk from Penn Station and a block from two different subway lines, The Moore is also perfectly placed for exploring Chelsea and Greenwich Village. Second, the staff. From our first interaction, the staff literally could not have been more friendly and helpful. So much for the old cliche about New Yorkers being rude! Third, the rooms. As other reviewers have noted, the rooms are definitely on the small side, but they are smartly furnished and perfectly designed to maximize use of every square inch of space. And we don't go to New York for the weekend to hang out in our room anyway. Our room, overlooking 22nd Street just steps from 8th Avenue, was also unbelievably quiet for a New York hotel room. Our only complaint on that front was that the other rooms' doors made a loud sound when they closed, but all of The Moore's other plusses more than made up for that.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Recent stay","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"OTHER","rating":5,"text":"Recently stayed at The Moore and my experience was amazing from the second I walked through the door. Hannah and destiny were so welcoming and helpful and the hotel was beautiful. All of my needs were met! Such a pleasant stay and I can’t wait to return!","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":1177864,"title":"NYC business trip","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"OTHER","rating":5,"text":"Very nice hotel in a great area. Walked in and was greeted by two very nice ladies and they got me into my room right away. This hotel is close to basically everything and the room is super nice. I will definitely be making the trip back to stay here.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":1177864,"title":"Calming enjoyable stay","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"OTHER","rating":5,"text":"Stayed here for work, overall clean and enjoyable. Highlight was a lovely cappuccino made by Hannah, the person at the front desk, who was very kind and made my solo experience extra serene. I would recommend to anyone looking to stay in the city.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Nice hotel","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"OTHER","rating":5,"text":"Great hotel in a nice location, complemented by the front desk friendliness and helpfulness of Hannah and Destiny. The room was nice and clean, adding to the comfort and overall positive experience of the stay. It is a good choice if you visiting the city","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Thank you","lang":"en","publishedDate":"2024-03-19","publishedPlatform":"OTHER","rating":5,"text":"Made me feel so comfortable and at home, couldn’t have asked for a better stay! The lovely front desk person Hannah helped me sort out my room mixup and even carried my (very) heavy bags for me. I will definitely be coming back next time I’m in New York, thank you!!","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Funky and good atmosphere!","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"MOBILE","rating":5,"text":"Super funky hotel with great location. Staff was super friendly. The lady that checked us in(don’t have her name) and Destiny and Anaise were super friendly this morning at checkout. Generally a good atmosphere!\nSubway is close by and the area itself also has a lot to offer.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"We love The Moore!","lang":"en","publishedDate":"2024-03-18","publishedPlatform":"OTHER","rating":5,"text":"Anaise and Destiny are wonderful immediately when walking in the door! The service at The Moore is unmatched. The beds are super comfortable and everything is up to date, modern and chic, and clean! Highly recommend when staying in the Chelsea area.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"Impeccable Experience","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":5,"text":"One of the cutest hotels in the best area of Chelsea. While the rooms are small, the service is impeccable. Anaise at reception was incredibly helpful and made the experience a pleasure, from booking an airport taxi to complimentary wine and being welcoming and friendly.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Amazing!","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":5,"text":"The place was beautiful. Anaise’s customer service and attitude was top notch. Will definitely be back. She provided us with poker chips for our complimentary items in the morning. Also provided red wine to the room. This type of service is hard to find & will bring be back to The Moore.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Amazing stay!","lang":"en","publishedDate":"2024-03-17","publishedPlatform":"OTHER","rating":5,"text":"The place was clean and beautiful! \nAnaise was absolutely amazing and made our stay so enjoyable! She was super sweet and made our check in process seamless. She provided all of the recommendations for restaurants and bars and gave great advice!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Girls trip 2024","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":5,"text":"The staff at the Moore was amazing! We loved our stay. Very clean and upscale.  The beds were great and loved the bathroom amenities.  Also enjoyed being able to control our own room temperature.  Will definitely be back! Anaise was amazing and helped us with making our stay comfortable! The","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"Quite and relaxing, excellent customer service","lang":"en","publishedDate":"2024-03-16","publishedPlatform":"OTHER","rating":5,"text":"This is my first time to NYC, coming from Australia - I was a bit daunted by the fast paced city but finding The Moore was easy and close to the train station. When I arrived, I was warmly greeted by the two front women (Destiny + Anaise) who checked me in, told me all the things I needed and really just calmed me down as I was a bit flustered. \nThe rooms are nice, clean and it’s a lovely quiet hotel + the cafe and bar downstairs is open 24\/7 (which if you’ve got crazy jet lag after 30 hour flights is a blessing!). \nI was recommended by a colleague in Australia to stay at the Moore and I’m very glad I did!","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Simply the best experience","lang":"en","publishedDate":"2024-03-14","publishedPlatform":"OTHER","rating":5,"text":"The staff! Holy cow, the staff. Everyone from desk to housekeeping was gracious, professional and incredibly accommodating. They really made the difference between a hotel stay and feeling like we were looked after and cared for. I cannot say enough about Anaise, who was the kindest soul I’ve ever come across in my travels. Destiny and Serenity were incredible and really helped my partner and I feel at home while we used the hotel to crash and burn after days filled with walking and sight-seeing. \n\nThanks everyone!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great spot","lang":"en","publishedDate":"2024-03-13","publishedPlatform":"OTHER","rating":5,"text":"Great location. This is a clean, comfortable, and convenient hotel with great service. I was in town to meetup with friends in the area and the Moore provided just what I needed.   The staff was very helpful and friendly, too. Thank you, Anaise and Destiny.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"10\/10 reccomend!","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":5,"text":"This was our second time staying at this hotel, and we definitely came back for a reason. It’s such a beautiful and clean hotel, with an intentional and aesthetic design. It’s in the perfect location, walkable to so many of our favorite things we like to do when visiting the city. And the staff is always so kind and helpful (on this last trip, we stayed 4 nights and Destiny at the front desk was so welcoming and kind, she took great care of us). I am extremely picky when it comes to hotels, and this is a true boutique hotel, meaning you get friendly care and 10\/10 service at every turn. As now a 2x guest I can confirm that this is our go-to hotel in NYC.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Just Lovely","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":5,"text":"The water pressure is to die for, the bedrooms are chic, the lobby is incredibly comfortable and the staff, especially Destiny, was so  kind and helpful. Really enjoyed the coffee and pastry breakfast, too. Overall, a great experience all around.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great stay in NYC","lang":"en","publishedDate":"2024-03-12","publishedPlatform":"OTHER","rating":5,"text":"The hotel is charming, well-designed, and centrally located. The staff is super friendly, especially Anaise, who was extremely helpful and greatly assisted us with our organization for the fair we were participating in. The room is super comfortable, very well-designed, and definitely a place to stay for next time.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Would not stay again","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"OTHER","rating":1,"text":"Dark, claustrophobic rooms and corridors. The TV doesn't line up with the bed, which makes watching it awkward. Given how expensive this place is, I would not recommend.\n\nThe location is good though - it's easy to walk to Chelsea Market from here.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Perfect Weekend Trip","lang":"en","publishedDate":"2024-03-11","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is centrally located in Chelsea with quick access to the subway and a grocery store right next door. Walking distance to Chelsea market. The lobby + rooftop were our favorite parts. The rooms were clean & the beds were comfortable. Perfect for a weekend trip.","travelDate":"2024-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Two nights at The Moore","lang":"en","publishedDate":"2024-03-10","publishedPlatform":"OTHER","rating":5,"text":"Had a lovely time at The Moore! I stayed two nights in March 2024 as a solo traveler. The lobby is very stylish and the room has everything you need. The bed was very comfortable and the was room quiet. Also in a great part of Manhattan. Thank you Destiny and Anaise!","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Excellent stay every time","lang":"en","publishedDate":"2024-03-10","publishedPlatform":"OTHER","rating":5,"text":"Marvelous stay, and not our first. We know NYC well -- we lived here for over 14 years. When we come back, we want to stay somewhere non-touristy and that feels like we're back living in the city. The Moore is wonderful -- elegant design and good service and comfortable rooms in a neighborhood we love. Highly recommend.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Perfect for a Staycation!","lang":"en","publishedDate":"2024-03-10","publishedPlatform":"OTHER","rating":5,"text":"This hotel is a hidden gem!!! The front desk attendant, Anaise, made us feel so welcome and was a delight to walk by each morning. The room was beautifully designed and the DS & Durga toiletries partnership is a huge plus. Highly, highly recommend!","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Cute!","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":5,"text":"Such a cute little boutique hotel right in Chelsea! Destiny at reception was great and accommodating, very cute lobby and rooms. We had a corner room facing the street but it was still quiet. The bed was comfortable and the bathroom and beautiful. Storage is good.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Very Welcoming!!!!","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"OTHER","rating":5,"text":"Destiny and Anaise greeted my friend and I with so much warmth. Very sweet girls. We had booked online for a room that we had to check in later but they were able to have accommodate for another room when we came in much earlier than expected. Gave us so much information about the place and about New York in general since we are visiting here. Much love to these girls.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great stay at The Moore","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"MOBILE","rating":5,"text":"The location is wonderful, the facilities were outstanding and the staff is so helpful. A special thank you to Anaise and Destiny who are the embodiment of \"customer first\" - they made me feel very welcome and massively contributed to my positive experience. Thank you!","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Greattt","lang":"en","publishedDate":"2024-03-09","publishedPlatform":"MOBILE","rating":5,"text":"I stood at the Moore for one night and it was one of the most comfortable stays I’ve had recently. My room was super clean and my bed was very comfortable. All of the staff are friendly especially Destiny which she’s very personable, friendly, and attentive!","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Beautiful hotel, friendly staff, well located","lang":"en","publishedDate":"2024-03-06","publishedPlatform":"MOBILE","rating":5,"text":"Hotel is amazing, clean and very tidy. Very nice atmosphere as well. The staff was very kind in assisting me during my travels. Anaise was particularly helpful during my checkout and while storing my luggage. If wanting to stay in Chelsea, this is definitely the place to go.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great vibe and staff","lang":"en","publishedDate":"2024-03-06","publishedPlatform":"OTHER","rating":5,"text":"Wonderful staff, especially Anaise, in this quaint, well located, and casually chic hotel. I’ll definitely stay again. \n\nThe place is simple, but modern and classic at the same time. \n\nI also really felt like a local Chelsea resident. \n\nAs a former New Yorker, it is great to stay at a place that itself doesn’t feel touristy.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Very comfortable, Friendly, touch of Luxury, great location","lang":"en","publishedDate":"2024-03-05","publishedPlatform":"OTHER","rating":5,"text":"The entire staff is very friendly and accomodating. The hotel is extremely clean, comfortable, with touches of luxury. Rooms could be a tad bigger, but the bathrooms are more than adequate with high end touches,  and the shower\nexcellent. I requested the top floor, 22nd street view exterior room, at the time of my reservation. I was given that exact room, it was quiet and as nice\/better than pictured online. The rates are\nreasonable. The location of the hotel is perfect for a weekend stay downtown. Next time we will book the penthouse.","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Charming Boutique Hotel","lang":"en","publishedDate":"2024-03-04","publishedPlatform":"OTHER","rating":5,"text":"Very pleasant experience. Destiny provided excellent customer service, she was very welcoming, resourceful and helpful. \n\nThe room was very clean and chic.  Prime location, walking distance from Chelsea Market and MTA.  I would recommend and stay here in the future.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Decor\/ Coffee \/ Pastries!","lang":"en","publishedDate":"2024-03-04","publishedPlatform":"MOBILE","rating":5,"text":"Staying at this hotel in Chelsea, New York, was seriously awesome! The vibe was super chic and cool, like walking into a trendy Instagram feed. Plus, the coffee and pastries in the morning? Absolute game-changer. They were so good, it made getting up early way easier.\n\nThe location is convenient and I could walk to all my destinations around lower manhattan for the most part.\n\nThe shower was really great esp compared to my home. perfect amount of water and temp. And the staff were all really nice, but Analise was the best. She was super helpful and kind, always had answers to my questions. She made me coffee at 4am too when starbucks was closed.\n\nDefinitely planning to stay here again next time I’m in New York. It just made the trip so much better, and I felt super comfortable the whole time. 10\/10 would recommend!","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Nice place to stay!","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"OTHER","rating":4,"text":"This is a very clean, calm, and pleasant place to stay. The rooms are definitely on the small side and but I definitely appreciated the room upgrade from Princess at the front desk, who was very helpful and gracious. Robes and slippers always a nice perk!","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Gorgeous thoughtful boutique hotel in Chelsea!","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"OTHER","rating":5,"text":"This is just the perfect place to stay when I need a stylish, comfortable, easy place in town. Love the towels, amenities, decor and tasteful finishes. Princess at the front desk was so gracious and even upgraded me to a queen room with a view on a higher floor. My place to stay in NYC hands down.","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great stay at the Moore Hotel","lang":"en","publishedDate":"2024-03-03","publishedPlatform":"OTHER","rating":5,"text":"We had a lovely stay - the room was super clean- coffee was great and Destiny at the front desk was very  friendly and helpful.  We highly recommend trying this in your next trip located near parking and easy access to tunnels and restaurants   Beautiful roof top area ❤️🤔","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Excellent option","lang":"es","publishedDate":"2024-03-02","publishedPlatform":"MOBILE","rating":5,"text":"Excellent hotel, magnificent location, the cleaning girls are the best, the service is wonderful, I would definitely return, exit to the subway on a street, the coffee and bread in the morning is exquisite, and the girls and boys at the front desk are very friendly","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"I even received an upgrade","lang":"en","publishedDate":"2024-03-01","publishedPlatform":"OTHER","rating":5,"text":"Stayed for 4 days: good service, nice room, beautiful interior. Good coffee in the morning. Had an amazing view on the Empire State Building. 8th avenue is busy but w22nd is idyllic and quiet. There is an amazing Chinese restaurant across the street (Joy Love Club).","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great property in a convenient part of town","lang":"en","publishedDate":"2024-02-29","publishedPlatform":"OTHER","rating":5,"text":"The Reception team is wonderful, particularly Anaise, who offered a lovely welcome to the property. The rooms are well appointed and comfortable. Comfortable vibe in the lobby as well. Great location. Will certainly return on my next trip.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Amazing and exceptional service","lang":"en","publishedDate":"2024-02-28","publishedPlatform":"OTHER","rating":5,"text":"The ambience of the hotel is amazing,  the pillows are soft and welcoming.Housekeeping snd Anaise on front desk was amazing she helped me explore the city and had answers to most of my questions.  I would stay here, again and again, just for this exceptional service 👏","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Recommend if in NYC","lang":"en","publishedDate":"2024-02-25","publishedPlatform":"OTHER","rating":5,"text":"Really great staff! especially the person who helped me book, named Princess. The bed was comfortable, great bathroom, a nice gym, etc. i would recommend ordering a bottle of the wine as well. The Chelsea neighborhood is home to great cafes and restaurants. There are also art galleries to spend the day hopping in and out of. Gotham Comedy is right down the street.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"No Hot Water","lang":"en","publishedDate":"2024-02-25","publishedPlatform":"MOBILE","rating":3,"text":"The curb appeal of the hotel is very lacking.  It basically looks shut down. Upon entering the lobby is nice but basic (reception\/coffee bar combo). The hallways are narrow. The room is small but nicely appointed.\n\nFirst night was nice. Second morning wakeup we had no hot water! Took an uncomfoetably cold shower and mentioned it to the hotel manager Susana to.make sure she knew the boiler wasnt working. She was not only unapologetic but downright beligerent about it. This is not the person you want to manage a hotel. She offered me free coffee, but that comes with the room, so that was insulting. She acted like the cold water was the guests' fault. A simple, we are sorry would've sufficed. A few hours later, I received a message that the hotel was offering 1 glass of wine from 5 to 6pm as compensation. That is not adequate. Part of lodging isna functional bathroom and no hot water is not functional. Part of a good hotel experience is hospitality and Susana is not hospitable.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"The Moore is a gem!","lang":"en","publishedDate":"2024-02-23","publishedPlatform":"OTHER","rating":5,"text":"The Moore is a find!  Perfect location with a neighborhood feel.  I have stayed in the Chelsea area before, this is by far the best. Princess checked me in, she was professional and helpful to make sure I had an excellent stay. Room was very clean and well appointed with a roomy bathroom.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great stay!","lang":"en","publishedDate":"2024-02-23","publishedPlatform":"OTHER","rating":5,"text":"This hotel is a great value. Princess checked me in, and was very kind\/helpdul. The room was clean and spacious for nyc. I had a nice view and it was fairly quiet. The bed was comfortable and the bathroom was large. Also enjoyed the decor. Would stay here again.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Princess is the best","lang":"en","publishedDate":"2024-02-23","publishedPlatform":"OTHER","rating":5,"text":"\"Princess at The Moore Hotel truly exceeded all expectations with her impeccable hospitality! From the moment we arrived, her personalized touches and genuine care made us feel like honored guests. Her attention to detail and warmth transformed our stay into an unforgettable experience. The combination of Princess's exceptional service and the hotel's charming ambiance created a magical atmosphere that we can't wait to return to. Five stars without a doubt!\"","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great stay","lang":"en","publishedDate":"2024-02-23","publishedPlatform":"OTHER","rating":5,"text":"Excellent service and hospitality from Princess. I was given a room upgrade and felt very welcomed on arrival. Highly recommend to anyone wanting a nice stay with great transport links in New York. Very cool and chic vibe in hotel. Highly recommend","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Quiet, clean, extremely nice - coming back","lang":"en","publishedDate":"2024-02-23","publishedPlatform":"OTHER","rating":5,"text":"I spent a week here on a business trip - 5 work days and 2 personal days on the weekend. This was my first trip to NYC, so I wasn't sure what to expect.\n\nThis hotel is a hidden gem that absolutely nails the basics. It's a small hotel, but extremely well-run and quietly luxurious (I was pleasantly surprised by the heated bathroom floors, soft sheets, and comfortable mattress). It's also super quiet - I was originally going to go with an internal-facing room, but the thick windows and blackout curtains muffled most of the morning noise (to the point where I didn't even notice). I had a 5\/5 stay here and I'll definitely be coming back for future business trips.\n\nThe location is great - some of the best restaurants in Chelsea are within a 10-15 minute walk, and there's a Brooklyn Bagel just around the corner, which I'd highly suggest checking out for breakfast. There's also a well-connected subway stop basically next to the front door - I had no problem going all over Manhattan on my days off.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Exceptional Hospitality and Stylish Comfort at The Moore Hotel NYC","lang":"en","publishedDate":"2024-02-21","publishedPlatform":"OTHER","rating":5,"text":"We had the pleasure of staying at The Moore Hotel NYC during a recent project launch in the city, and we couldn't have been more impressed with our experience. From the moment we arrived, Krystal and the entire team went above and beyond to ensure our stay was comfortable and seamless. Krystal's assistance in organizing our long stay was invaluable, and her professionalism and warmth made us feel truly welcomed. The level of service provided by Princess, Destiny, Anaise, and Hannah was exceptional – their attention to detail and dedication to ensuring our needs were met did not go unnoticed. We felt right at home thanks to their hospitality.\n\nMoreover, we loved the design and aesthetics of the hotel. The lounge area provided a cozy environment for working, and we appreciated the taste and decor throughout the property. The cold and hot drinks bar was wonderful; every morning started with coffees and lattes from The Moore.\n\nThank you, The Moore Hotel NYC team, for making our time away from home feel like home. We look forward to returning in the future.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"A great birthday stay!","lang":"en","publishedDate":"2024-02-20","publishedPlatform":"OTHER","rating":5,"text":"So happy I chose The Moore for my quick birthday stay in New York. The Moore is located near lots of great food and shopping. The hotel staff was super welcoming and friendly. Destiny and Anaise were absolute darlings! They gave lots of recommendations for things to do and how to get there. They greeted us with smiles every time we saw them. The property is very well decorated, the rooms are small but comfortable and clean. I'd recommend this property to anyone looking to stay in the Chelsea area. ;)","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"BIG thumbs up!","lang":"en","publishedDate":"2024-01-28","publishedPlatform":"OTHER","rating":5,"text":"Highly recommend. First time staying and look forward to staying again!  Friendly, helpful staff. Small yet sophisticated room. Great location in Chelsea. Coffee bar in elegant lobby. Destiny & Anaise even gave me a lovely umbrella to use on this rainy NYC Sunday. 5 stars.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Fin beliggenhed","lang":"da","publishedDate":"2024-01-23","publishedPlatform":"MOBILE","rating":5,"text":"Fin beliggenhed. Venligt personale. Vi boede på hotellet i en uge. Tagterrassen var desværre lukket. Lille, men ok fitness rum i underetagen. Rengøringen  var også helt ok.\nVender h’erne tilbage en anden gang. Så må vejret dig gerne være lidt bedre!","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":1177864,"title":"great experience","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"OTHER","rating":5,"text":"I had a wonderful stay at the hotel. Rooms are clean, and well designed. The staff is very friendly, especially Destiny at the reception was very friendly, professional  and helpful with extra requests! The hotel is also perfectly located.","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Impromptu stay at The Moore in NYC","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"MOBILE","rating":5,"text":"Wonderful hotel at 22nd and 8th Ave. We made an impromptu trip into the city and found this lovely gem. Room are cozy and sumptuous. The rooftop offers a lovely view.  Great staff, welcoming and friendly. Anaise helped us coordinate with friends prior to our departure! ","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"amazing staff","lang":"en","publishedDate":"2024-01-19","publishedPlatform":"OTHER","rating":5,"text":"the room was perfect for a solo traveler, great shower, very comfy bed and not too expensive! the staff were lovely, especially Anaise who went above and beyond to make sure I was taken care of so thank you!!!","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Perfect","lang":"en","publishedDate":"2024-01-11","publishedPlatform":"OTHER","rating":5,"text":"The Moore was a great hotel! So happy with our last minute decision to book it.  It is so nicely decorated, and it looked newly renovated and very clean. Staff were very accommodating and pleasant. Love the area! I will definately come back to stay again and again......","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"LOVED this hotel","lang":"en","publishedDate":"2024-01-02","publishedPlatform":"OTHER","rating":5,"text":"LOVED this hotel. Great vibes, very well decorated and a great location too.\nStaff were very friendly and helpful (shout out to Anaise who was so helpful when we checked out).\n\nNot sure why some people are complaining about the size if the rooms: if you unpack your case (there was a big wardrobe in our room) and store the cases under the bed then the room is absolutely fine!\n\nThe only negtive, was the cleaning in the room which was NOT upto standard. We stayed 7 nights and the room was not properly cleaned once (only bins emptied and fresh towels added).\nThat hasn't put us off coming back to the Moore though :)","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great experience!","lang":"en","publishedDate":"2023-12-27","publishedPlatform":"OTHER","rating":5,"text":"This is a lovely boutique hotel in a great location. The hotel is immaculate throughout with excellent customer service particularly from Anaise! Highly recommended. We have been to NYC ten times and this is the nicest hotel we have stayed in. Rooms are small but that’s Manhattan for you!","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Lovely boutique hotel in a great area, staff wonderful and so helpful especially Anaise. Anaise always helpful.","lang":"en","publishedDate":"2023-12-23","publishedPlatform":"MOBILE","rating":4,"text":"This hotel is in a great location, clean and good atmosphere. All of the staff were so nice and helpful. The ladies that cleaned the rooms were very patient as my daughter and I were late risers. The rooms nicely decorated and comfortable. \n\nWe were particularly happy with Anaise one of the staff always helping with anything and everything while we stayed during the last 6 days.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"amizing","lang":"en","publishedDate":"2023-12-19","publishedPlatform":"OTHER","rating":5,"text":"The hotel is amazing. Good place to stay, with The BEST staff and well located. My third time here and Wish to come Back soon! A special tranks for Anaise, who helped me a lot with everything i needed. ","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"NYC to see the Rockettes","lang":"en","publishedDate":"2023-12-19","publishedPlatform":"OTHER","rating":5,"text":"This is the 2nd time my wife and I stayed at The Moore.  The facilities were immaculate and well maintained.  The staff is very kind, helpful and professional.  Everyone who is employed there greeted me with a smile and kind salutation.  The rooms, although small like any NYC hotel, were comfortable, clean, and cozy.  And this time my wife was in a wheelchair and the staff was very accommodating with storing and securing her wheelchair.  We look forward to our next trip to the Chelsea district and staying at The Moore.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":1177864,"title":"Great stay and great staff at the Hotel","lang":"en","publishedDate":"2023-12-08","publishedPlatform":"MOBILE","rating":5,"text":"We chose the Moore for our stay in Manhattan in early December, and we were super happy with the experience in this nice, clean and cozy hotel. \n\nWe are especially grateful for the wonderful welcome and the hospitality we received from both ladies at the reception: Destiny and Anaisa. \n\nThey really made sure that our stay was excellent, and are the reasons that we will be coming back to this hotel again.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":1177864,"title":"Perfect","lang":"en","publishedDate":"2023-12-03","publishedPlatform":"OTHER","rating":5,"text":"Lovely hotel. Spotlessly clean. Comfortable bed. Great shower.Staff all very polite and helpful. Quiet in hotel. Good position near subway station but we walked most places. Plenty of places nearby for breakfast. Lovely stay","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Moore, Moore, Moore!","lang":"en","publishedDate":"2023-12-01","publishedPlatform":"OTHER","rating":5,"text":"I had an amazing experience at The Moore hotel in Chelsea during my recent visit to NYC. The welcoming staff, particularly Anaise from the front desk, made our stay exceptional. Anaise went above and beyond, ensuring we got our room early and remembered small details to assist us throughout our exploration of the city. The warmth of the hotel, coupled with impeccable service and great amenities, made our stay truly memorable. Highly recommend The Moore for a delightful NYC experience. (Only regret is that it was far to cold to enjoy the rooftop lounge…sigh)","travelDate":"2023-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":1177864,"title":"I really enjoyed my stay.","lang":"en","publishedDate":"2023-11-27","publishedPlatform":"OTHER","rating":5,"text":"I really enjoyed very much my stay and the employees were always available to address all my inquiries (they were very helpful and attentive). The Hotel location and cleanliness exceeded all my expectations (it was my 1st time visiting NYC).\n\nKudos to the front desk staff and house keeping team.  Keep up the good work!  \n\nRecommended 100%.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"Nos quieren triplicar el precio de la reserva.","lang":"es","publishedDate":"2023-11-21","publishedPlatform":"OTHER","rating":1,"text":"El hotel nos cancela la reserva de manera unilateral aludiendo que la tarifa reservada era un error por su parte. Una reserva confirmada por dos veces, con tarjeta de correcta. Booking no hace nada al respecto.","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"Visiting kids and new grandbaby in NYC","lang":"en","publishedDate":"2023-11-19","publishedPlatform":"OTHER","rating":5,"text":"Very nice clean and tidy boutique type hotel.  Staff was very friendly, and housekeeping did a nice job tidying up room while we were out.  I liked that you could hang a sign on your door letting them know you were out so they could clean.  Cute little coffee bar with pastries in lobby- did not get to see the rooftop as we were told it was closed for the season.  Room was quite small but have been in smaller in NYC and desk\/chair were nice touch.  Good location for our visit in Chelsea. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":1177864,"title":"reservation canceled by the hotel","lang":"en","publishedDate":"2023-11-12","publishedPlatform":"OTHER","rating":1,"text":"This hotel canceled my reservation on Booking because of an error made by them, and decided to simply no longer respond to my messages. Result: a canceled trip and completely absent customer service. Thank you.","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Excellent choice for a post wedding stay","lang":"en","publishedDate":"2023-11-04","publishedPlatform":"OTHER","rating":5,"text":"My wife and I had an amazing time at The Moore. We needed a clear and quiet place to wind down, which was centrally located, and we're so glad we found this hotel. The staff were super helpful and accommodating to our needs\/wants. Special shout-out to Serenity who was the first person we met. She caught wind of the fact that we had just gotten married and promptly gifted us a nice bottle of bubbly rosé accompanied by a sweet card on behalf of the staff. Unfortunately, we were too busy to enjoy their rooftop bar, so if we're ever looking for a place to stay in Chelsea, The Moore will be our first choice.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Disappointing ","lang":"en","publishedDate":"2023-10-25","publishedPlatform":"OTHER","rating":2,"text":"I loved the location and staff and that’s about it. My room was so tiny and poorly designed  I couldn’t cross in front of the bed without scooting sideways. Hit my leg a few times on the wooden bed platform and the corner of the TV mounted on the wall could easily leave a bruise in the middle of the night if you’re trying to get to the bathroom. Trying to unpack and simply exist in there was annoying and the opposite of relaxing . Nowhere to sit and not rack to unpack your suitcase. Not one outlet in the bathroom and no mini fridge. Small is okay, but this room was frustrating and felt like a hazard at times. Like a glorified dorm room. ","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Tolles Stadt Hotel","lang":"de","publishedDate":"2023-10-17","publishedPlatform":"MOBILE","rating":5,"text":"Tolles Hotel im schönen Chelsea. Wir mochten die Lage mit super U-Bahnanschluss und haben uns dort sehr wohl gefühlt. \nMega bequeme Betten, gute Akkustik und sehr nette Mitarbeiter.  Die Zimmer waren klein, wie oft in NYC, aber gemütlich und sauber. Die Dusche war ein Traum. \nMan kann auch fussläufig vieles erreichen. \nWir würden wieder hier buchen.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Small, comfortable hotel in great and safe area. Lovely, helpful,reception staff. Felt very safe for solo female guest. ","lang":"en","publishedDate":"2023-10-16","publishedPlatform":"OTHER","rating":5,"text":"Great hotel in a nice, safe area. Good for walking to attractions and getting the nearby subway. Lovely, friendly and helpful staff at reception. Good security at front desk and in lift. Comfortable room and bed, with good ensuite shower room. Small room with dble bed was OK for one - might be a squeeze for 2 people. Loved the roof terrace for chilling out and views. Will definitely stay here again. ","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Quiet Spot in Chelsea","lang":"en","publishedDate":"2023-10-13","publishedPlatform":"OTHER","rating":5,"text":"Excellent hotel.  Nice Location convenient to subway, Chelsea attractions and Greenwich Village.  Staff is excellent.  Many restaurants and shopping nearby.  Modern decor and comfortable bed.  Nice shower and water saving features.","travelDate":"2023-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Sehr weiterzuempfehlen!","lang":"de","publishedDate":"2023-09-25","publishedPlatform":"MOBILE","rating":5,"text":"Das Hotel ist in einem tollen Stadtteil der viel zu bieten hat & zentral gelegen ist. Die Metro ist mit mehreren Linien in 2 Min zu Fuß erreichbar. \nDie Mitarbeiter waren sehr freundlich, hilfsbereit & haben super Kaffee gemacht! Die Dachterrasse ist auch sehr sehenswert & man kann einen Drink mit Blick auf das Empire State Building genießen.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Amazing ! We'lll be back!","lang":"en","publishedDate":"2023-09-25","publishedPlatform":"OTHER","rating":5,"text":"Amazing Design & Art throughout the Hotel. Great Coffee Downstairs. Great location and the friendliest staff. The bed and pillows are very comfortable. I loved the bathroom design with black tiles and bronze fixtures. Top notch!","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Nice and modern hotel in Chelsea","lang":"en","publishedDate":"2023-09-24","publishedPlatform":"OTHER","rating":4,"text":"A modern and very nice hotel situated in Chelsea very close to highline park! Clean and neat rooms, a bit small but very quiet! The roof top bar is awesome, even if it’s not a high floor you can still see a perfect NYC view and that’s really cool! ","travelDate":"2023-09","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":1177864,"title":"Amazing staff and location!!","lang":"en","publishedDate":"2023-09-11","publishedPlatform":"OTHER","rating":5,"text":"The staff were all amazing!! We interacted with several different staff members and they were all super friendly, helpful and knowledgeable. We arrived very early and they accommodated us for an early check in with no problem. We simply went to a neighborhood cafe for breakfast and they texted us when the room was ready. Communication throughout our stay via text was helpful and appreciated. There are tons of amazing restaurants and bars within just a couple of blocks. The neighborhood is safe and has access to transit and anything else you need within a block. Easy walk to the theatre district and to the west village as well. The rooftop patio was an amazing bonus. Unfortunately, we were never there when the bar was open, but we just purchased drinks from the lobby bar\/café and took them up for a nightcap every evening - most evenings we had the place to ourselves!! Room design was great, super comfortable and very clean. Hugely impressed by the service, location, value for money....we found our new favourite place to stay in NYC! ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Perfekte Lage","lang":"de","publishedDate":"2023-09-02","publishedPlatform":"MOBILE","rating":5,"text":"Perfekte Lage in Chelsea, nahe genug zu Midtown und village aber nicht so extrem touristisch überlaufen oder überkandidelt. Nur ein Block von der Subway Station 23rd street. Von JFK super angebunden mit der A Train mit einmal Wechsel zu C oder E an der 14.\nFrühstück gibts im Viertel überall. Unsere Tipp Brooklyn Bagel & Coffee Company. Ein paar hundert Meter die 8. hoch. Perfekter Start in den Tag.\nNachdem viele Bewertungen die Zimmergrösse beklagt haben, kann ich feststellen, dass unser Zimmer (queen mit Fenster zur 22nd absolut groß genug war. Wir haben nichts vermisst. Alles ist perfekt sauber und der Empfang war immer extrem freundlich besetzt.\nAlles in allem voller 4 Sterne Komfort zu für Manhattan verhältnismäßig bezahlbaren Preis.\nKlare Empfehlung.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Clean, comfortable, top quality","lang":"en","publishedDate":"2023-08-27","publishedPlatform":"OTHER","rating":5,"text":"Friendly staff. Rooms are small of course, it’s NYC, but they we’re really nice with top quality bedding, feather pillows, nice fixtures, and clean. Out of all the hotels we’ve stayed at in NY this is best for price range. ","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great experience - will go back","lang":"en","publishedDate":"2023-08-23","publishedPlatform":"OTHER","rating":5,"text":"The Moore offers great accommodation in the heart of Chelsea. While the rooms are snug they offer everything a traveller needs - bed is very comfortable and the bathroom is well appointed.\nDefinitely recommend to others","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":1177864,"title":"`Very Good.! Perfect spot to stay...","lang":"en","publishedDate":"2023-08-22","publishedPlatform":"OTHER","rating":5,"text":"The hotel is perfect in a quiet spot in the Chelsie neighborhood. \nThe rooms are very clean, a bit small but have everything and the beds are very comfortable.\nThe stuff was excellent and very helpful with every question.\nI will definitely prefer to stay again on a future trip to New York.","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":4,"locationId":1177864,"title":"Yes, this is where to stay. Here’s why…","lang":"en","publishedDate":"2023-08-16","publishedPlatform":"MOBILE","rating":5,"text":"This is a very nice, very modern and very clean hotel which is located in a really lovely neighbourhood. \n\nI stayed at the Moore for a work project but had plenty of downtime so made the most of it. \n\nIt’s so clean and the staff are lovely, it also feels really safe which is exactly what you need in NYC. \n\nIf you’ve never been to NY before, some helpful things to note…give this a screenshot. \n\n1. Taxis and Ubers are bloody expensive! Walk if the weathers nice, or, get the subway. The subway takes some getting used to but after a couple trips you soon get used to it. Use the maps feature on your smart phone, the iPhone one is genius. It gives you all the information you need and even tells you when to get off the subway as you have full signal on it. (Select your location and then select ‘Public transport’). \n\n2. The poverty & seriously poor health conditions means there are a lot of people on the streets, on the subways and out and about. It’s a deeply upsetting sight. I say this as someone who has spent a lot of time in a lot of cities. NY is by far the worst for it (in my experience). \n\nBecause of this, there are many weird and wonderful characters constantly trying to catch your eye. If they catch your eye they’ll be onto you. Money, questions and whatever else. Do your absolute best to make zero eye contact. It feels odd and rude but you’re less likely to be approached or have any issues. \n\n3. Places to know about: \n\n- Times Sq is the most overrated location in NY. It’s uncomfortably busy & it’s full of scammers and pick pockets. Unless you’re desperate to go, just avoid it. It’s bloody rubbish. (If someone asks you to support them and buy a CD…say NO THANK YOU).\n\n- If you want to watch Sport whilst you’re there, there’s and amazing place called ‘Smithfield Hall’ a 10 minute walk from the hotel. It is an amazing bar with 20+ screens and they show EVERYTHING sport related. The place is run by an Irish family and a Londoner runs the door called ‘Fitzy’. He’s a lovely man who’s accommodating and helpful.\n\n- If you’re coming from the U.K. I can guarantee you for the first few days you will be waking up at the crack of dawn, or earlier. Not a lot is open until 10ish in New York. Chelsea Market is a 10 minute walk from the hotel and has some little cafes open for breakfast from about 08:30\/0900. It’s also an amazing place for dinner in the evening, the buzz about the place is terrific.\n\nLastly, generally, the food in America isn’t great. However, an Italian restaurant which is outstanding. The absolute best food I’ve had in the states in all my times visiting is ‘Salumeria Rosi’ 283 Amsterdam avenue. It’s not cheap but it is worth it. I promise you. \n\nI hope all of that helps and you have an amazing trip. It’s a bit nerve racking going to NY but it’s worth it, a truly magnificent city.","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"lovely little nook in Chelsea","lang":"en","publishedDate":"2023-08-08","publishedPlatform":"MOBILE","rating":5,"text":"Nice little hotel in Chelsea, great staff, quiet, lovely beds and hotel has a rooftop for drinks. Clean! Recently remodelled, although the rooms are small there is space enough! Feels also safe, so all good for a lovely stay! Also away from all the big crowds 😀😍","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":1177864,"title":"Will definitely come back","lang":"en","publishedDate":"2023-07-31","publishedPlatform":"OTHER","rating":5,"text":"All staff were extremely friendly and helpful. The corridors are a little dark and gloomy but apart from that the hotel is stylish and kept immaculately clean. The rooftop bar is a perfect place to relax after a long day of sightseeing and exploring. Can't wait to come back.","travelDate":"2023-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Prettig","lang":"nl","publishedDate":"2023-07-26","publishedPlatform":"MOBILE","rating":5,"text":"Prettig hotel. Alles was netjes en schoon. Verder erg mooi van binnen. Kamers redelijk klein maarja je bent daar toch alleen om te slapen. De buurt waarin het ligt is ook top en overal dichtbij. Wij zouden er in ieder geval zo weer heen gaan. Aanrader","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"10\/10 Experience! ","lang":"en","publishedDate":"2023-07-17","publishedPlatform":"OTHER","rating":5,"text":"The Moore Hotel is absolutely incredible! We had the best time celebrating both an Anniversary and a Birthday. We going the King Suite which features a massive outdoor private terrace, hot tub, huge day bed and outdoor shower which was a magical touch. The lobby, upstairs rooftop bar and the staff are all amazing! Everyone who we interacted with from the Moore Hotel were all extremely helpful and kind. Great location as well - if you are looking for a boutique like spot, book the Moore! We will be back for sure!  ","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"My new favorite boutique hotel in NYC","lang":"en","publishedDate":"2023-07-14","publishedPlatform":"OTHER","rating":5,"text":"This is a wonderful boutique hotel in a great location of Chelsea. Comfortable, quiet and decorated super cute! The cafe in the lobby for an iced coffee and a pastry was great. Staff were friendly and efficient. Will definitely stay here again. Subway close by and just one\/two stop to Penn Station.\n","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"Cute hotel in great location!","lang":"en","publishedDate":"2023-07-13","publishedPlatform":"OTHER","rating":5,"text":"I had a wonderful time at the Moore. The hotel is quaint and cute, and even though it’s rated at three stars, it does feel a little luxurious with heated  marble floors in the bathroom. The bed was comfortable and the staff (Destiny, Anaise, and Hannah) were especially friendly. The rooftop is also a nice touch. The location was excellent, close to the metro and located in Chelsea.  Would recommend! ","travelDate":"2023-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"New York break","lang":"en","publishedDate":"2023-07-09","publishedPlatform":"OTHER","rating":5,"text":"Really friendly and helpful team. As a solo traveller I felt safe in the place. Also the rooms were very nicely decorated and stylish. The bed was very comfortable. It was also in a Great location to get around. ","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Would recommend!","lang":"en","publishedDate":"2023-06-28","publishedPlatform":"MOBILE","rating":5,"text":"Lovely hotel, small rooms but really nice decor, bathroom as well was really lovely and clean. The reception does really great ices coffees too and a nice supermarket right next door which is convenient. Cute little rooftop bar! Great spot. Would recommend!","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Living La Vida Local (not loca)","lang":"en","publishedDate":"2023-06-28","publishedPlatform":"OTHER","rating":5,"text":"This is a boutique hotel for people who want to feel like they're at home, but with full time staff at your beck and call.\nIt's not for the rowdy, rambunctious crowd. The location is close to everything, e.g., Chelsea Market.  If it's not close to something, catch the subway. It's only a couple of blocks from the front door.\nAll of the employees are consummate professionals with endearing personalities and a desire to please.\n","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Horrible no curtains in bathroom  window  small room","lang":"en","publishedDate":"2023-06-26","publishedPlatform":"OTHER","rating":1,"text":"Awful experience here. paid about $500 to stay on a Wednesday night. We get to the room and it is so small my boyfriend ( who is a regular sized man). Could not fit to get past the bed or walk around it in order to get to the bathroom. He had to roll over the bed every time he needed to get to the bathroom.  There was also NO CURTAIN OR BLINDS  in the bathroom. We were located on the second floor so everyone in surrounding buildings was able to see right in. I felt so unsafe I was not able to shower.  We asked for a refund and the hotel said we had to go through Expedia( the way we booked) I contacted Expedia and they said the hotel refused a refund. Completely Unacceptable. A waste of $500 and unable to shower!!!!","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"What a delightful small hotel in Chelsea!","lang":"en","publishedDate":"2023-06-21","publishedPlatform":"OTHER","rating":5,"text":"I was pleasantly surprised by this little gem of a hotel. I value cleanliness above all else and it was exceptionally clean. The queen room is on the smaller side but it is NYC after all and I liked it's coziness. The bathroom was fabulous--shiny black tile with brass fixtures with a really neat rain shower. There is an intimate relaxing rooftop area with a bar which I enjoyed so much that I visited twice during my one night stay- once before dinner and later after dark. The views were wonderful and I enjoyed chatting with the bartender. I tried 2 of the alcohol-free cocktails, both of which were delicious. This was a perfect place for a solo traveler and I can't wait to return. ","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Cute Spot, Loved It!","lang":"en","publishedDate":"2023-06-20","publishedPlatform":"OTHER","rating":5,"text":"I had the absolute best time at The Moore, felt like I found a hidden gem. I booked the suite - it was absolutely perfect. Huge patio with seating areas and felt very private. The patio was perfect for coffee\/cocktails, lounging and working on laptop. If you have friends in city would be a great spot to host pre-dinner cocktails for ~(6) people.\n\nRoom was a good size + the bathroom amenities were very nice. Loved that they had a steamer.\n\nI loved the rooftop patio\/bar area very cute + comfy seating.\n\nThe front desk staff was wonderful for directions, coffee or cocktails.\n\nEasy walk to a lot of things in Chelsea including Chelsea Flea Market, Soul Cycles, Equinox, Hudson Yards...etc.\n","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Will Be Back","lang":"en","publishedDate":"2023-06-11","publishedPlatform":"OTHER","rating":5,"text":"Had a great stay at the Moore for a long weekend.  The staff was helpful and attentive, the room was comfortable, and we enjoyed the rooftop bar.  We will look to stay again next time we have a weekend in NYC.","travelDate":"2023-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Very nice lovely hotel","lang":"en","publishedDate":"2023-06-07","publishedPlatform":"MOBILE","rating":5,"text":"Great hotel that we loved!\nRooms are small but high quality furniture, good mattress and bathroom is lovely and clean! \nLobby is also nice. Only some small food to eat (mufffins, pastries), no real breakfast possible.\nStaff is kind and helpful!\nWe really recommend that place!\nShared bicycle station just in front of the hotel, supermarket nearby, subway one block away!","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Charming gem in Chelsea","lang":"en","publishedDate":"2023-06-05","publishedPlatform":"OTHER","rating":4,"text":"I was in town for Frieze Art Fair and finding a hotel seemed impossible, until a New York local told me about The Moore. The rates were good, the location was perfect, and the room was well-appointed and comfortable. My room had no view whatsoever, but there was a lovely rooftop patio I could work from. As a night owl, I appreciated that there was coffee and tea available in the lobby at literally all hours.\n\nThe nonexistent view and lack of restaurant might have bothered me more if I'd been travelling for leisure. (The rooftop wine bar was advertised as being open for the season, but there was no food service yet, which caused a minor inconvenience.) But for a solo work trip, The Moore was everything I needed it to be and surpassed my expectations. I would definitely stay here again.","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Ideale a Manhattan!","lang":"it","publishedDate":"2023-06-05","publishedPlatform":"OTHER","rating":5,"text":"Hotel situato nel quartiere di Chelsea, in una zona residenziale, signorile e tranquilla, ma in posizione ideale per poter visitare Manhattan. Una stazione della metropolitana si trova nelle immediate vicinanze, e consente un collegamento rapido e puntuale con la rete dei trasporti pubblici. Molte attrazioni si trovano però a poca distanza, ed è possibile arrivarci a piedi.\nL'albergo è di recentissima ristrutturazione, elegante e curato; nella nostra stanza il pavimento era in parquet, il bagno spazioso e assai funzionale, e le dotazioni di elevata qualità. L'unico elemento negativo è il fatto che le camere sono relativamente piccole, ma questa è una caratteristica comune agli alberghi di New York (e comunque in camera ci tornavamo solo la sera per dormire). C'è anche una palestra a disposizione degli ospiti (ma non l'abbiamo mai usata), e un roof garden gradevolissimo. Nelle stanze, almeno nella nostra, il rumore del traffico serale è stato relativamente contenuto, e non l'abbiamo avvertito più di tanto.\nLo staff è gentile e cordiale, sempre disponibile per qualsiasi esigenza.\nCi siamo trovati benissimo, lo consigliamo e se possibile ci ritorneremo.","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Best experience!!","lang":"en","publishedDate":"2023-06-03","publishedPlatform":"OTHER","rating":5,"text":"Nice and very clean little hotel in the heart of Chelsea. We visited many landmarks easily because the subway was very close. We also visited many restaurants in the area that were so good. The room was very comfortable and taken care everyday.  The staff was very welcoming and accommodating!!! They keep your luggage after you check out.  They have delicious coffee available for an extra charge. I will definitely come back!!","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Moore is less","lang":"en","publishedDate":"2023-05-20","publishedPlatform":"OTHER","rating":2,"text":"The Moore is a typical new business model of hotel: few amenities;  online interactions of little value; no fridge (you’d think there’d be one given theres’s no room service); just one or two front desk staff who do everything at once - serve drinks from the adjacent bare, tiny ‘cafe’ while checking you in (the staff was nice and doing their best). But the Moore is especially ‘less’ in room space. Small rooms are the norm in major city hotels but this one was TINY. Let’s just say careful side-stepping was required to negotiate the one foot space between bed and wall without banging shins against the bed frame or shoulders against the wall mounted tv, and the desk chair could not be pulled back without colliding with another side of the bed. Also walls are very thin and you can hear everything in adjacent rooms. If shoebox chic is your thing, great; the interiors look good..The location is good. Many reviewers clearly love this hotel, but I’ll be staying somewhere else next time.","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":1177864,"title":"Horrible customer service post visit","lang":"en","publishedDate":"2023-05-15","publishedPlatform":"OTHER","rating":1,"text":"Location for the hotel is actually pretty nice. Stayed here in April of 2023 and it’s in a relatively well lit and central area in Chelsea. But that’s all it has going for it. \n\nThe rooms are some of the smallest you’ll encounter. The bedroom is just the bed, an area to walk past and a closet. The bathroom is also very small. It’s good for sleeping in and that’s about it. There was also small hair shavings in the blankets and on the bathroom counter tops (assume previous guest that wasn’t cleaned properly). \n\nAll of that was probably still around 3 stars since the location is so nice. Especially if you’re visiting for business or specifically interested in the Chelsea area.\n\nThe largest issue was after I checked out and flew back home. I was charged with a $160 fee for a charging port that they didn’t see in the room. I have no idea what charging port they’re referring to and have no idea where it would even plug into the wall. But to be falsely accused and then have no response when I emailed and called back is horrible customer service. I spent over $1,600 for 5 nights, why would I care to take a charging port that wouldn’t even be compatible with my devices. ","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Elegant and Charming Boutique Hotel in Chelsea","lang":"en","publishedDate":"2023-05-14","publishedPlatform":"OTHER","rating":5,"text":"The room was small but efficient with a generous armoire to store our suitcases and clothes. Handsome finishes, especially in the bathroom, loved the huge shower head. Nice towels, the soaps smell good and didn't dry out our skin, and the robes are soft. I was doing some remote work while I was there and the wifi is fast whether you're in your room or the lobby, which is a pleasant place to sit (the whole place is tastefully decorated). For nights in, there's Chromecast. For nights out, check out the rooftop bar. Immaculate vibes and delicious cocktails (the One Night Stand is so refreshing!). It's open to the public so we had some friends stop by and they were stoked on the view of the Empire State Building. The lobby bar also serves wine, beer and nice coffee (coffee and tea 24\/7 actually). Staff is so friendly and helpful and you really can't beat the location. 22nd is also a particularly beautiful street. If you can, stay here! ","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Brilliant experience.","lang":"en","publishedDate":"2023-05-05","publishedPlatform":"OTHER","rating":5,"text":"This hotel was simply brilliant ! Mi wife and I truly enjoyed the hotel and the service from the employees. The were very supportive when I need to receive some packages (Lori) The hotel had a wonderful atmosphere of New York and it was calmed and near by all the places. Definetly will come back here. ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Perfect hotel, Great staff","lang":"en","publishedDate":"2023-04-28","publishedPlatform":"OTHER","rating":5,"text":"The staff here super friendly and available 24\/7. We stayed here for one night and had a great experience. The rooftop bar was a huge bonus and we enjoyed a pre dinner drink up there. Great location in Chelsea. Would absolutely come back!","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great stay at The Moore! Cosy, clean and great location!","lang":"en","publishedDate":"2023-04-26","publishedPlatform":"MOBILE","rating":5,"text":"I had the best time at The Moore. Where do I start.. The staff were super friendly, location is great, easy access to many local places to eat or hop on the subway. There are a couple of lines 5 minutes away. Yes, the rooms are small and I was a solo traveller so wasn't a problem for me. I found the  room  so cosy, clean and serviced every day. I can imagine it might be a squish if there are two of you or if you are tall. I found the room so cosy after a long day of sight seeing. I'm so so glad I found and choose The Moore and would 100% stay here again. \n\nNote that there isn't a kettle in the room or a fridge but to be honest it got me out exploring earlier and there are two very good bagel shops close by that do coffee or you can get a coffee\/tea from the lobby. I think you can request a kettle for your room though. \n\nI also enjoyed the gym, which again is small but modern, clean and has everything you need  Thanks for making my stay so enjoyable!!","travelDate":"2023-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Our home in Chelsea","lang":"en","publishedDate":"2023-04-22","publishedPlatform":"MOBILE","rating":5,"text":"All checks on what you need in a hotel in the city: cozy, clean, modern room: extremely comfortable bed and pillows and guess what: you get a robe for the shower! \nBest part tho is the  staff: smiling, caring, professional Anaise and Hannah made us feel like we were real New Yorkers living in the city.\nBest stay in Chelsea.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Excellent staff and stay","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":5,"text":"The staff really make this hotel. They were a delight and incredibly helpful. The rooms are small, well designed, clean and perfect for a busy NY schedule. \n\nThe location is fabulous. Good walking distance to the High Line, Chelsea Market, Greenwich Village and Soho (a little further). The street it is on is beautiful with lots of brownstones to admire.\n\nLittle Island is also close by and midtown is a reasonable walk too. \n\nWe upgraded our room to one with a view and the staff were very honest that it would be noisier than an internal room. We’re both light sleepers and we didn’t find the noise an issue at all. I’d highly recommended a room with a view - we could see the Empire State from our window on the fifth floor.\n\nA fridge would have been a really nice addition and a shower cap too! The cleaning staff were also lovely and polite.\n\nWe would definitely visit again. ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"En chansning som blev ett bra val.","lang":"sv","publishedDate":"2023-04-09","publishedPlatform":"MOBILE","rating":5,"text":"Ett trevligt litet hotell, behaglig atmosfär, rent och snyggt, lugnt område med bra läge till det mesta i New York.\nPersonalgruppen var ung, hjälpsam och diskret, skapade en fin och välkomnande stämning i receptionen.\nVi väljer gärna detta hotell igen vid nästa besök.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"What a gem of a hotel!","lang":"en","publishedDate":"2023-04-07","publishedPlatform":"OTHER","rating":5,"text":"Such a great hotel! My wife and I spent 8 nights at The Moore and we couldn't be happier!\n\nModern building, super clean rooms and common areas and amazing staff!  The rooms are a bit on the small side but that is the case everywhere in NYC.\n\nI can confidently recommend it to other visitors and we'd definitely choose it again on our next visit to NYC","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Perfect location, lovely hotel","lang":"en","publishedDate":"2023-04-07","publishedPlatform":"OTHER","rating":5,"text":"I adored my stay here - I had picked the hotel for a week-long business trip. The location is unbeatable, and the staff is so friendly and helpful. The design of the hotel is lovely, and the rooms were quiet (even the ones facing the street!). The water pressure was great, pillows were wonderfully squashy, and the bed comfy.  Like almost all New York hotel rooms these rooms were very small, but I felt like I had everything I needed and never felt cramped. Next time I'm in New York I will stay here again!","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"worth it - clean Chelsea room","lang":"en","publishedDate":"2023-04-03","publishedPlatform":"OTHER","rating":4,"text":"just a nice bed and a bathroom perfect for a weekend for the two of us - excellent location- clean and friendly - not super $$\n\nwould have liked a fridge\n\nvery much recommend for basics - if you want more, you’ll spend much mire","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"A warm and cozy home base for working in or exploring Chelsea and beyond","lang":"en","publishedDate":"2023-03-17","publishedPlatform":"OTHER","rating":5,"text":"Great hotel experience. Super friendly and warm staff. Great location. Well appointed, very clean rooms with super comfy beds and showers and just enough desk space to get some work done. A calm and peaceful retreat from the buzz of NYC. The rooms are quite small, as can be expected in NYC. It's not a room you'd want to hang out in for long hours, but it is perfect as a home base. The lobby had a nice table and multiple couches for hanging out or working on your laptop or with a colleague. The food and drink service in the lobby was a nice convenience. I might look for a place with more space if I needed to be working out of the room for hours or if I was staying for more than 2-3 days, and certainly I would look elsewhere if traveling with my entire family of 3, but this was perfect as a solo traveler and would be fine for a quick getaway trip with a spouse as well as long as you were mostly planning to be out on the town. ","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"nice clean and comfortable hotel with charm","lang":"en","publishedDate":"2023-03-03","publishedPlatform":"OTHER","rating":5,"text":"this is a great place to stay. nice design, welcoming staff and coffee bar. small but very comfortable rooms with excellent shower and nice products. Overall very clean. I liked the relaxed vibes. No one is trying too hard, because not necessary: it is simply the best value for money around town.","travelDate":"2023-02","tripType":"SOLO"}
{"helpfulVotes":5,"locationId":1177864,"title":"Great Chelsea location for a busy NYC stay","lang":"en","publishedDate":"2023-02-27","publishedPlatform":"OTHER","rating":5,"text":"I'm a traveler who reads ALL the reviews, makes notes to compare properties prior to booking and spends MUCH more time than I should choosing a place to stay.  After all of my reserach, we chose the Moore and were very plesed with our choice. \n\nWe were looking for a hotel in Chelsea as we wanted to walk the High Line, visit the Whitney and catch a train to Rhode Island to visit friends.  The location was perfect for us.  An easy 10 minute (or less) walk to Penn Station\/Moynihan Train Hall for the train, a few blocks to the High Line and one block to the 23rd Street Station.  The neighborhood was quiet for NYC and we felt very safe, no issues walking back at night from Korean BBQ on 32nd Street.  It's an easy walk to the Meat Packing district (don't miss Chelsea Market but go early!), Little Island and Greenwich Village, we continued down to Ground Zero.\n\nThe first night we ate at Dim Sum Chelsea right across the street which was fantastic!  Gristede's (a grocery store) is right next to the Moore, convenient if you want to grab some snacks\/drinks (although only beer, no wine) and for a classic NY breakfast, we highly recommend Zucker's Bagels just across the street.  My husband also enjoyed the option of grabbing an early morning coffee in the Moore Lobby.  The cups provided were too small for my required large morning breakfast tea dose but it was easy to find it at one of the two Starbucks within two blocks either direction on 8th. \n\nThe Moore staff were very friendly, welcoming and helpful. As many reviewers have noted, the rooms are small.  We booked a queen room with a view which provided some nice light for the small room which we found otherwise somewhat dimly lighted.  The room was clean and functional, with an outlet\/USB charger on each side of the bed. There was a desk across the length of the window wall  but the desk lamp had no easily discernable switch (so never worked for us ) and there was no easily visible outlet for a laptop, which was odd for a desk area.  We found the outlet after getting down on our knees and looking underneath the desk behind the curtain.  \n\nThere was limited room around each side of the bed and the bathroom, while very mordern and clean, was small as well, limited \/no space to put your toiletries\/clothes.  Lighting was somewhat dim with no lighting option on the mirror...not an issue for us.  We found the bed a bit small for a queen (I'm 5' 11 and my husband is 6' 2) as our feet hung off the end. But it was firm and comfortable with firm pillows.\n\nAs there was no room to lounge other than the bed, we made use of the cheerful lobby and there was always plenty of space at the tables, chairs and sofas even with the other guests.  We didn't check out the rooftop but am sure that would be a lovely place to lounge in good weather.  As we had a full schedule to cover in three days, we hadn't expected to hang out in our room so the space was fine for our needs.  For a longer stay or if you need to lounge a bit in your room you'd probably want a larger room with a sofa\/chair. \n\nBottom line for us is that It's a great boutique hotel, safe area, reasonable price for the area, easy walking distance to many things and great food options nearby.  We'd defintely stay at the Moore again.\n\n","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Great location and staff","lang":"en","publishedDate":"2023-02-11","publishedPlatform":"OTHER","rating":5,"text":"We spent 2 nights here.   This is a charming boutique hotel.  Very European. \n Room was described as facing an inner courtyard, but it faced a small, dark  space between two of the hotel towers. \nThe staff was wonderful and the location was terrific. \nWine, pastries  and cappuccino at the lobby bar were a nice touch.  The bed was supposed to be a queen, but felt very small to my husband who is quite tall. We have a queen, so he was pretty spot on in the comparison. \nOnly one complaint:  \nThe towels need to be changed.  They were stiff and scratchy.","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great hotel and staff","lang":"en","publishedDate":"2023-02-07","publishedPlatform":"OTHER","rating":5,"text":"My regular hotel closed after 25+ years of service, so I needed to find a new place to call home when in NYC. The Moore Hotel was great ! Staff was helpful and friendly, room was very clean and location in Chelsea was perfect for me. Yes, I would recommend this hotel to friends and family.","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Cute and convenient hotel in Chelsea","lang":"en","publishedDate":"2023-02-06","publishedPlatform":"MOBILE","rating":4,"text":"I have a positive impression of my stay at The Moore. Online check-in was easy and smooth. Upon arrival, the room felt quite small (we were in room 407, we booked an “accessible queen”) but once we stashed our suitcases under the bed (a convenient feature), the room felt less tiny. Though the bed did not seem to be queen-sized…it felt more like a full. We asked for a tea kettle, so we were able to make hot drinks in our room (I recommend traveling with a collapsible  pour-over coffeemaker if you need coffee as soon as you wake up), but the coffee & beer and wine bar downstairs was perfectly convenient. The elevator could be heard from our room, but it was not terribly loud, if you are a light sleeper, earplugs should take care of that problem. The gym was nicely equipped for weight training or cardio workouts. For the deal we got, I think the Moore was super convenient and comfortable and we appreciated the simple decor and modern design touches. I think if I were on a work trip, it would be 10\/10, though a couple small surfaces would improve the space.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Clean, comfy, great location, but small!","lang":"en","publishedDate":"2023-02-04","publishedPlatform":"OTHER","rating":5,"text":"I got the Queen room facing inner courtyard, although it's not really a courtyard? I was on the 4th floor. \n\nAnyway, it's a great little hotel! Good location. Super clean, fixtures and everything look brand new. Loved that they had a coffee bar and pastries in the lobby in the mornings, plus a large table, chairs, and couches so you can work from there if you wanted to. \n\nStaff was really friendly and helpful. The front desk is staffed 24\/7. \n\nJust note that the rooms are very small. Think Tokyo small. When I first walked into my room, the front door blocked the entrance to the bathroom so I was like, wait...is there no bathroom??? Plus the bed was *right* there once I walked in. So yes, small. Once I shut the door, I saw the bathroom, which is pretty good-sized!\n\nBed was comfortable, linens were comfortable. Great water pressure in the shower. I'm thinking really hard about something to complain about, and honestly, nothing comes to mind. I do recommend bringing earplugs if you're a light sleeper though. Because the rooms are so small (or the walls are thin), you can def hear your neighbor. I was waiting for the elevator in the hallway and a woman was on a call in her room, and I heard every word she said, very clearly. I bring earplugs with me when I travel, and I slept fine. \n\nTL;DR: If you're looking for a hotel where you could hang out in your room for hours on end, The Moore likely isn't the best choice. But if you're in the city for work or sightseeing and won't be spending much time in your room, it's a great choice. ","travelDate":"2023-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Wonderful Staff and HEATED FLOORS!","lang":"en","publishedDate":"2023-02-02","publishedPlatform":"OTHER","rating":5,"text":"Absolutely perfect for a solo business traveler or couples that are planning to be out exploring most of the time. Room was small but all amenities are clean and comfortable. A true gem in the heart of the Chelsea district with great access to public transportation.","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great stay at The Moore","lang":"en","publishedDate":"2023-01-15","publishedPlatform":"OTHER","rating":5,"text":"We had a great stay this weekend at The Moore.  The entire staff was friendly and very accommodating.  The room was clean, comfortable, beautiful, and had the amenities we needed.  The  rooftop wine bar was closed for the season but we were able to check out the space.  Lovely furniture, lovely view.  We will definitely return in season so we can enjoy that as well.  Great location in Chelsea.  Thank you!","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"My new favorite hotel in NYC","lang":"en","publishedDate":"2023-01-15","publishedPlatform":"OTHER","rating":5,"text":"The Moore hotel is a gem! Excellent location, helpful staff. The room is on a smaller size, but everything is new. Bed is super comfortable. Hardwood floors, no carpets. Clean, modern and quiet. We will definitely return! ","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Très bel hôtel, calme, propre, et idéalement placé","lang":"fr","publishedDate":"2023-01-10","publishedPlatform":"OTHER","rating":5,"text":"Nous avons passé 6 nuits au Moore entre Noël et Nouvel an. Son emplacement idéal (très bien desservi au coeur de Manhattan), son calme et sa sérénité côté quartier, sa propreté, et son personnel très à l'écoute (notamment pour nos fiançailles sur leur joli rooftop) sont autant d'éléments qui nous feront revenir !","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":1177864,"title":"Terrific Chelsea Location","lang":"en","publishedDate":"2022-12-04","publishedPlatform":"OTHER","rating":4,"text":"Room are a little small, but very smartly designed. No fat, but great bed, small but very nice and modern shower, love location and access to subway system to uptown and downtown, easy walking distance to Highline and Chelsea market.  Nice change from starting in Midtown. Will definitely stay here again. Quiet and ver few “tourist “ hangouts.","travelDate":"2022-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":1177864,"title":"We'll be back!","lang":"en","publishedDate":"2022-11-26","publishedPlatform":"OTHER","rating":5,"text":"The reality is, so much of what many reviewer say is true.  The rooms are small and prices are high, but the other reality is, that this is NYC!  As far as hotels go in Manhattan, this is an ideal boutique hotel.\n\nFurnishings, fixtures, amenities, decor are all done with a perfect sense of comfort and style.  Everything works well.  We stayed during the Thanksgiving holiday weekend, when the potential for staff to be extra stressed is assumed.  Not so, here!  The staff at The Moore were gracious and receptive.  I offer special praise to Essence and Hagar, who offered smiles with every interaction.\n\nIt was helpful to have access to the refridgerator as we had some food.  The coffee   and pastry in the morning were divine.  The rooftop was a bonus, as we indulged in time to relax, both at night and in the morning.  Though in the heart of Chelsea, the building was very quiet.  It was perfectly located for access to sweet walks to restaurants and the theatre.\n\nWhat a great place all around!  We will be sure to be back.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Good, not great","lang":"en","publishedDate":"2022-11-15","publishedPlatform":"OTHER","rating":3,"text":"A bit of a mixed experience with this place. Staff were generally friendly and helpful. Very calming stylish decor on the lobby where they offered coffee for a fairly reasonable price. Nice that they had a small gym too. The rooftop is a great asset but is under-utilised and seems like a forgotten area of the hotel, contrary to the social media images. On the few occasions we went up it was empty and felt a bit eerie. There is a bar, which isn't stocked or staffed.\n\nAs for the room - it was too small. My feet were hanging off the bed and we had to tiptoe around our cases due to lack of floor space. Within 5 minutes of coming into the room it turned into a sweatbox due to the small space. The only alternative was to put the A\/C on which then made it freezing. On the plus side we didn't have any problems with noise from other guests.\n\nAnother disappointment was the area. I appreciate this isn't the doing of the hotel but I just didn't feel entirely comfortable. 22nd is in the middle of Chelsea which still has that dodgy vibe that carries down from the Penn Station area. I think Chelsea is way overrated in general. There were a number of suspicious characters hanging around the corner from the front door. One morning we witnessed some guy abusing and threatening to beat up his girlfriend a few blocks uptown from the hotel. We also saw another tourist being harassed by a street hustler outside Joe's Pizza, which is a 2minute walk from the hotel. It was only a few blocks further towards Greenwich Village that the area felt safer. Not necessarily the hotel's fault but still worth bearing in mind.\n\nAll in all, it was a decent experience. Nothing more. We had looked at a lot of the social media uploads by the hotel prior to arriving. If I'm being honest we almost felt catfished, but not quite.","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Quartier super, très bien desservi, propre et calme. Super accueil.","lang":"fr","publishedDate":"2022-11-04","publishedPlatform":"MOBILE","rating":5,"text":"Hôtel franchement au top, rien à redire. Vous n’avez pas la vue des films mais vous avez le calme pour dormir pas de lumière des rideaux le matin. Alors c’est pas « à l’américaine » mais franchement c’est idéalement situé metro partout à côté, pharmacie, Starbucks en bas. Si je devrai donner un point négatif c’est le fait que la chambre soit très petite mais en soit on y est tellement peu… sdb trop benne, hôtel très propre. Je reviendrai sans hésiter","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Très bel hôtel, emplacement idéal ","lang":"fr","publishedDate":"2022-10-22","publishedPlatform":"OTHER","rating":4,"text":"Nous avons passé 4 nuits au Moore en août dernier. Hôtel idéalement placé au centre de Manhattan. Nous avons séjourné dans la suite du dernier étage, avec terrasse privative et jacuzzi. Un havre de paix en plein coeur de la ville, entre deux visites. Vue sur l'Empire State building et \"The Edge\". Chambre spacieuse, confortable, à la décoration moderne et épurée. Très beaux matériaux. Très belle salle de bains. Seul bémol, à ce niveau de prestation on s'attend à un niveau de service un petit peu plus élevé (pas de cafetière ni bouilloire dans la chambre, pas de chaussons mis à disposition). Et l'accueil pourrait être un peu plus chaleureux.","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Pleasant stay and hotel","lang":"en","publishedDate":"2022-10-21","publishedPlatform":"MOBILE","rating":5,"text":"Small boutique and nicely designed - quiet and peaceful. Small rooms but then so is everywhere in New York. Decent price reflects this. As many others say - nice staff.\n\nDoesn't have facilities like restaurant and bars - reception doubles up which is fine because it is quiet and comfortable sofas. They do serve drinks and coffee.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Nice Hotel but claustrophobic","lang":"en","publishedDate":"2022-09-17","publishedPlatform":"MOBILE","rating":3,"text":"Nice hotel in a good location, staff friendly and helpful. The only let down was the size of the room, really it was small for one person but for a couple it was claustrophobic, I know in NYC you won’t be spending too much time in your hotel room but this was not a sanctuary after doing the sites!!","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Couple week in NYC","lang":"en","publishedDate":"2022-08-15","publishedPlatform":"MOBILE","rating":4,"text":"Good value for money! If you’re in NYC and not intending to spend your full visit at the hotel, this could be something for you. Small but fresh rooms. The rooftop was very nice and the style of the hotel was very modern. Could be a bit annoying hearing other rooms’ doors slapping or people talking loudly in the corridor. The staff in the reception could have been more engaging with their guests. ","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Weekday stay at the Moore","lang":"en","publishedDate":"2022-07-29","publishedPlatform":"MOBILE","rating":5,"text":"I stayed at the Moore for 3 nights this week on a work trip to NY. The rooms and hotel were clean and very new. The lobby sells delicious coffee and has a good selection of beer and wine, which you can enjoy on the quiet rooftop with really nice views.  But above all, the staff was really great and so friendly and helpful (thank you Anise and Hager!). \n\nThe only downside is the layout of the rooms (I was in 418 and had a basic room). It was small, which is fine and what I was expecting, but the placement of the bed and TV made it tricky to navigate the room as I was getting ready for work and I definitely have a few bumps from running into the corner of the bed. It might get a bit tight with a couple. Not a deal breaker though, and I plan to be back!","travelDate":"2022-07","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great spot in Chelsea","lang":"en","publishedDate":"2022-06-26","publishedPlatform":"MOBILE","rating":5,"text":"First and not last stay in this very clean modern hotel. As expected rooms a bit small with limited amenities but great concierge service in reception area with cheerful and helpful staff. Coffee, teas,  and pastries as well as wines and beers  available in reception 24\/7. Cute rooftop bar in evenings or drink your coffee there in the morning.\nLocation great for Hi Line and art district.\nSpecial mention goes to Anaise in reception so cheerful and upbeat she’s like sunshine in a bottle. Made these New Orleans guests feel right at home.","travelDate":"2022-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Chelsea boutique gem in a perfect location","lang":"en","publishedDate":"2022-06-25","publishedPlatform":"OTHER","rating":5,"text":"June 2022, we spent 5 nights at the Moore and were highly impressed with the friendly and helpful staff. Alberto checked us in and gave us a superior room and good advice about amenities. When we saw him again, he remembered us and provided more useful info. Location is excellent - close to the Highline, Whitney, dining and subway. Rates were very reasonable. We’d stay there again.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Quiet Boutique Hotel in Hip Chelsea","lang":"en","publishedDate":"2022-06-16","publishedPlatform":"MOBILE","rating":5,"text":"Centrally located in Chelsea near High Line, Chelsea Market and The Village. Short jaunt to Theater District. Small rooms but who stays in their rooms with New York City at your feet! Great rooftop terrace with views of the Empire State Building!","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Chillin’ in Chelsea","lang":"en","publishedDate":"2022-06-06","publishedPlatform":"OTHER","rating":5,"text":"Stayed 4 nights with my significant other in May. Hotel is tucked into a cozy corner of Chelsea that’s a short walk from trains, bars, restaurants and more. Rooms and space very clean and modern. Staff was exceptionally kind and accommodating, giving us directions and local recommendations. \nWould definitely stay again!","travelDate":"2022-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Classy and cool","lang":"en","publishedDate":"2022-05-29","publishedPlatform":"OTHER","rating":5,"text":"Everything at The Moore is beautifully designed, from the lobby to the lounge to the rooms. I especially loved the sexy black and gold bathroom with luxurious bath products. AMAZING rainfall shower that was a joy to use. \n\nI worked from the hotel room this trip, and I really appreciated the fact you could open the windows and feel like you were a part of the neighborhood. The hotel is walking distance to great restaurants and public transportation. \n\nSuper friendly hotel staff. My flight left really early in the morning and the front desk manager walked out of the hotel with me to make sure that I made it to my Uber safely.  It's the little things! \n\nI really could not ask for anything more - one of the best hotel experiences I've ever had!","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"5 star stay at the Moore for 10 nights!","lang":"en","publishedDate":"2022-05-24","publishedPlatform":"MOBILE","rating":5,"text":"Had an incredible stay at The Moore! Cosy , stylish hotel located on west 22nd street which is close to all subway lines and only walks away from the Chelsea Market, West and Greenwich Village. Stayed for 10 nights in the penthouse which was a beautiful spacious located on the top of the building which included a large private terrace overlooking the Empire State. This hotel is 5 stars all the way from the interior to the customer service. In specific the staff at the Moore really make this hotel a place you want to return too. Manager , Alberto provided customer service to a high level I have never experienced (and I have travelled all around the world) and went above and beyond to make our stay welcome and comfortable. (Thanks Alberto ) Grace , John and Nelson also, however all staff had a friendly smile and the lobby was filled with great conversation and morale. The hotel also has a terrace which is open for all guests which is located on the rooftop bar with a view of the Empire State and they make yummy coffee in the lobby. Would definitely recommend , this is the best accomodation I have stayed in Manhattan and will endeavour to return upon my next visit to Manhattan from Australia. Have an incredible summer team Moore.","travelDate":"2022-05","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":1177864,"title":"Wait for a change of manager to go","lang":"en","publishedDate":"2022-05-17","publishedPlatform":"MOBILE","rating":3,"text":"This hotel has beautiful rooms, even if very small and the location in Manhattan is great. It is quiet from the outside,\nBesides that, avoid it as there is no service. The staff is totally inefficient except the cleaning team who is always nice. \nI didn’t get the room I have paid for… the bed was very small and it was ok because I was alone\nThey let my friend who came to join me wait more than 30minutes, telling her they were not allowed to give my room number, but they didn’t contact me either \nNo breakfast, no kettle, no fridge.. just the minimum… \nThey can’t even help you to find a taxi when you have to go to the airport \nOther small detail : why is there hangers into the shower??\nChange the manager and it might become a nice hotel","travelDate":"2022-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Lovely stay","lang":"en","publishedDate":"2022-05-07","publishedPlatform":"MOBILE","rating":5,"text":"Lovely staff, decor, and location. Every staff member was warm and helpful. Lovely location at the corner of a residential and lively street. Lots of delightful places to eat nearby. The hotel has a bar and coffee shop that came in handy many times.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":1177864,"title":"Little Gem","lang":"en","publishedDate":"2022-04-18","publishedPlatform":"OTHER","rating":5,"text":"Truly an extraordinary place! The newly renovated rooms are quiet and comfortable and really beautifully decorated, as is the lobby. The staff is accommodating and really give off a vibe that they like what they do, something not found so often in the hospitality industry. I'll be back.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Lovely, quiet, small hotel in Charming Neighborhood","lang":"en","publishedDate":"2022-03-12","publishedPlatform":"OTHER","rating":5,"text":"My family gathered in NYC last weekend, and we all stayed at the Moore. The hotel was perfect for us. Our room was small but well thought-out, with a place for everything. The bed was super comfortable, and the room was quiet, so we slept well. We gathered on comfy couches or around the table in the lobby each morning and planned our day over delicious espresso drinks and pastries. It was a quick and easy train ride to Broadway shows near Times Square, and a short walk to Chelsea Market, and the Highline. There are lots of good restaurants near the hotel.  We'll definitely be back!","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"My always go-to","lang":"en","publishedDate":"2022-03-08","publishedPlatform":"OTHER","rating":5,"text":"I’ve had the pleasure of staying at the Moore hotel several times. From their opening in late September until now, I have stayed with them nearly once a month for a week on business. The rooms are clean and chic. As a previous NYer I rarely trust most places, but here feels like home. Alfredo makes the best coffee in the morning and is incredibly kind. Perks are the following, clean and aesthetically pleasing, perfect location for getting around the city easily, catered to you and your stay while you’re there!","travelDate":"2021-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Lovely hotel","lang":"en","publishedDate":"2022-03-03","publishedPlatform":"MOBILE","rating":5,"text":"My husband and I only had the opportunity of spending one night at this hotel. Wish we could have stayed longer. It’s just perfect. Great location, clean and modern room, friendly staff. Ideal for anyone!!","travelDate":"2022-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great find!","lang":"en","publishedDate":"2022-02-21","publishedPlatform":"MOBILE","rating":4,"text":"Beautiful, newly renovated hotel in convenient location with wine and espresso bar in lobby. Room is small, but well-designed and appointed. Bathroom and shower are great! Staff was friendly and helpful. I would definitely stay here again. Loved it.","travelDate":"2022-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Beautiful hotel, perfect location","lang":"en","publishedDate":"2022-01-22","publishedPlatform":"OTHER","rating":5,"text":"My husband and I stayed at the Moore for 9 days and had the best time -- the staff is gracious, friendly and helpful; the decor is gorgeous and tasteful; the cafe and room service offerings are well- executed; and the location is perfect for getting to all of our favorite spots. 10\/10 would recommend and would stay here again.","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"A Chic Gem in Chelsea","lang":"en","publishedDate":"2021-12-14","publishedPlatform":"OTHER","rating":5,"text":"The staff was so gracious and friendly. Shout out to John and Alfredo! The lobby is lovely - very simple and chic with a charming cafe for coffee, pastries, and wine. While our room was NYC-small, it was very well designed with a lovely bathroom and excellent shower. And although it was chilly, we wandered up to the rooftop deck to check out the view. It must be a fantastic spot during warmer months. The location is great as we were close to the subway, walking distance to the High Line, the West Village, and the Whitney. We will return! Loved it.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Quaint, clean and cozy","lang":"en","publishedDate":"2021-12-12","publishedPlatform":"MOBILE","rating":4,"text":"Super quant spot.  Customer service by staff was above most places I’ve stayed in NYC. Very friendly!  \nThe rooms were thoroughly cleaned daily as well as in the hallways. \nThe cafe was perfect for a jumpstart in the morning. \nThe reason for a minus one star is that the rooms are really small even by NYC standards, and the room lighting very dim.  Almost impossible to see in the bathroom. But overall well appointed and comfortable!!!","travelDate":"2021-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":1177864,"title":"Excellent Spot in the Heart of Chelsea","lang":"en","publishedDate":"2021-12-11","publishedPlatform":"OTHER","rating":5,"text":"Perfect spot in a great location, with great 24\/7 coffee bar in the lobby, Forager's Table attached to the building, great food service with The Butler and very friendly, accommodating staff. I'd stay here again.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Suggested Hotel, close to everything","lang":"en","publishedDate":"2021-12-06","publishedPlatform":"MOBILE","rating":5,"text":"The staff was amazing, always ready to help me in everything.\nThe room, a queen interior, was really quiet, clean and confortable, maybe Just a little bit narrow, but for One people It was perfect.\nThe position Is really good: close to the underground and a lot of services. In 30 minutes you can easily reach everything in the city.","travelDate":"2021-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"Wonderful Stay","lang":"en","publishedDate":"2021-11-29","publishedPlatform":"MOBILE","rating":5,"text":"The staff and especially Cristina were welcoming and helpful. Cristina went above and beyond making us feel at home. She also makes the best coffee accompanied by the most charming conversation. Beautiful rooftop terrace with exquisite views. A compact but beautifully appointed room, along with excellent service crew, made for a wonderful experience.","travelDate":"2021-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Room with a view","lang":"en","publishedDate":"2021-11-27","publishedPlatform":"OTHER","rating":4,"text":"If you are visiting NYC and plan to spend most of your time exploring, eating out, and taking in all the amazing things the city has to offer, The Moore is an ideal nest to settle into.  Chelsea is a great neighborhood, and the Moore is located on a classic, tree-lined side street.  Super close to the Highline and the subway.\n\nFriendly staff that were welcoming and warm.  Young and hip atmosphere, with a stylish and small lobby, serving coffee and wine. My room had a view of the Empire State Building.  Small and cozy, it was plenty of space for one.  But, with a sliding door to the bathroom at the foot of the bed, it would be a little too intimate for two.\n\nLGBTQ friendly.  \n\nVerdict: Highly recommended for solo travelers looking for a good value in a stylish, boutique hotel.  The suite would be a great choice for couples or those able to spend a little more for more space, a balcony, and bigger views.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":3,"locationId":1177864,"title":"Great location but very noisy","lang":"en","publishedDate":"2021-11-23","publishedPlatform":"OTHER","rating":3,"text":"Pros:\nLocation is perfect\nRooms are clean\nShower was great\nLoved the Replica shampoo\/conditioner\/lotion\n\nCons\nRooms are very cute but very small even for NYC (felt a bit claustrophobic)\nSlamming of doors (impossible to sleep as you can hear every door close all night long)\nBed was not comfortable \n\nI don't think I would stay again just because of the slamming doors. I didn't sleep for two nights and I'm not a light sleeper. People are coming in and out all night and every time they close their door it can wake the dead!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"A little gem in Chelsea","lang":"en","publishedDate":"2021-11-14","publishedPlatform":"OTHER","rating":5,"text":"What a great find the Moore is. Chic, quiet and friendly, I’ll definitely be coming back. Such great value for money but elegant at the same time. Very clean, rooms are cute and beds very comfy. Thank to all the reception staff who made us feel so welcome. Highly recommend ❤️","travelDate":"2021-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Very (very) friendly place to stay in NY","lang":"en","publishedDate":"2021-11-13","publishedPlatform":"OTHER","rating":5,"text":"From the front desk service and care, the relaxing lobby with the excelent coffee, through the friendly, intelegent and charming hosts (don't miss lovely Christina!!) to the quite, high-end design, very clean and modern rooms, with it's best location (close to every thing but far away from the crowd spots","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Wonderful hotel","lang":"en","publishedDate":"2021-11-12","publishedPlatform":"MOBILE","rating":5,"text":"Wonderful experience at The Moore.  The service was en par to the Four Seasons but in a neighborhood setting.  Everyone was so attentive and helpful.  The young man at the front desk even flagged down a cab for me and loaded my luggage!  The rooms are small but the design is genius!  Every inch of space so intelligently used.  Great location!  Twenty minute walk to Hudson Yards and the Vessel, the Highline, Madison Square Garden, Times Square, SoHo NoHo, the Village.  Bunch of restaurants and grocery stores on the same block.  Subway couple blocks away.","travelDate":"2021-11","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":1177864,"title":"New, Hip and Infectious","lang":"en","publishedDate":"2021-11-11","publishedPlatform":"OTHER","rating":3,"text":"This brand new hotel is in a great location in Chelsea, has very comfortable beds and a lovely rooftop space. However we were quite disturbed at the lack of mask-wearing by almost all of the front desk and cafe staff. This clearly encouraged a good number of hotel guests to also ignore the NYC masked mandate in indoor spaces .We don't consider ourselves particularly anxious about COVID, however in these times of Delta variant, we felt uncomfortable and exposed.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"will recommend","lang":"en","publishedDate":"2021-11-10","publishedPlatform":"OTHER","rating":5,"text":"Super amazing staff, they went out of the way to be helpful.  Love the coffee\/wine bar in lobby.  Rooms are small, but that is all you need for NYC.  Very clean and pretty. Great neighborhood, and no traffic noise at night.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"THE ABSOLUTELY BEST!","lang":"en","publishedDate":"2021-11-10","publishedPlatform":"OTHER","rating":5,"text":"I would highly recommend this hotel to anyone visiting NY. The location is perfectly placed in the city and so easy to get to. We literally walked everywhere or took short Uber trips. \n\n My friend and i had a girls weekend and chose the stay here, the best decision we could have made for lodging. The hotel is chic , super clean and modern. (The rooms are smaller but so is NY lol) THE STAFF ARE PHENOMENAL! My favorite part of my stay. They exceeded my expectations, so polite , warm and professional. Geo and Christina are amazing. But everyone is just the bomb.  5 stars for the staff along. BOOK THIS HOTEL!","travelDate":"2021-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":1177864,"title":"How you imagine a boutique hotel but also warm & welcoming","lang":"en","publishedDate":"2021-11-10","publishedPlatform":"OTHER","rating":5,"text":"This was a last-minute decision to travel (pandemic travel is only last minute). I can only say that the staff--those lovely people--made this hotel stand out from all the other cool, dark interior, hip boutique hotels. Christina who seemed to know everything was amazing & charming & her goal is always to make you feel warm & welcomed. The rooms are tiny--I mean there is no room to exercise & your neighbors are close (& some are loud) BUT the beds are super comfortable and the bathroom stocked with brand toiletries & excellent showers & frette bathrobes. The Chelsea location is perfect. The public spaces make this hotel. There's a rooftop deck and a lounge-like lobby with a coffee\/wine bar and a large gathering table and two curving velvet couches. I met my friends in the lobby that last morning for coffee before I caught the Acela (10 blocks up 8th Ave) and they, born & bred New Yorkers both, kept asking how I found this charming place. Trust me--cosy, warm, welcoming with a dash of hip and personality plus! It's the people who make this place worth it.","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"The perfect hotel does exist!","lang":"en","publishedDate":"2021-11-07","publishedPlatform":"OTHER","rating":5,"text":"Too many positive things to say about this place. I stay in NYC all the time and this hotel is just special. It's set in a cozy neighborhood in Chelsea, very close to the train and some great restaurants. The rooms are wonderful with an overall elevated design and style. The lobby coffee shop is very convenient and the rooftop has great wine, drinks and amazing views. I stayed for an extended amount of time and the staff became truly like friends - they were all so welcoming and helpful. The Moore is now a home away from home in Chelsea. Stay here!!","travelDate":"2021-11","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"The Moore Hotel in Chelsea -a perfect spot!","lang":"en","publishedDate":"2021-11-01","publishedPlatform":"OTHER","rating":5,"text":"We had an incredible time at the Moore Hotel in Chelsea!  It is such a beautifully designed hotel and the atmosphere was warm and friendly thanks to the staff and the special touches.   Our group had two rooms - a view queen and a corner queen.  Both rooms were sophisticated and impeccably clean (seriously, these rooms were so clean and well cared for!)   As is the case in most of NYC, the rooms are smallish  but these were both cleverly appointed with wardrobes, a full desk, and nicely sized bathrooms.  We had plenty of storage for four adults on a four day trip!  We didn't hear a peep from our neighbors at night and the beds were very comfortable.    The rooftop bar and the lobby were charming and so welcoming - we spent hours hanging out in both areas making our plans over  glasses of wine and delicious americanos.  Room service was easy with a  wonderful collaboration for food delivery that had great food.  We ordered a couple of times through their service and it was fast & easy.   Chelsea is a great neighborhood with plenty to see and easy access to all parts of Manhattan.   The clincher for us, and the reason we will definitely go back  is the staff - everyone was so friendly and the recommendations from the front of house team were fantastic. Every place they suggested was a win - from local spots right around the corner to across town.  They have a genuine love for the city that is infectious :)   Thank you for everything - we are already planning our next visit back to the Moore!","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Best location, AMAZING staff, the comfiest beds, updated rooms. This hotel is perfect!","lang":"en","publishedDate":"2021-10-30","publishedPlatform":"MOBILE","rating":5,"text":"If you’re looking to get around all of Manhattan, this hotel is in the absolute perfect spot. It was so convenient to get to and from the airport because it is right by the subway E train, (which also takes you all over Manhattan! We used it a bunch, we didn’t have to take a single taxi or Uber which saved us a ton of money) and the hotel was also right by the High Line, the path along the pier, and is a short walk to Times Square but far enough away where you get a neighborhood feel and not a tourist one. My boyfriend and I seriously were able to cover the entire island in 3 days thanks to the perfect location. We walked basically everywhere and took the train home in the evenings. It has a lot of nightlife within walking distance (Tao, PHD, Somewhere Nowhere, 1OAK, and more are all within 10 minute walking distance) but you didn’t get loud and drunk people nearby. Seriously can’t rave enough about the location.\n\nThe rooms are small but that’s what you get in New York… I don’t know why people would expect anything different. The rooms are super cute though!!! Updated with SUPER cozy beds and really fancy showers! The rooftop area and the little coffee shop downstairs is awesome to have to!\n\nLastly, everyone says New Yorkers are mean but the staff here totally proved that incorrect. Christina in particular was beyond helpful and an absolute riot—my boyfriend and I loved her! Seriously, they did everything to make you feel welcome and right at home. Good vibes all around. \n\nEverything about our stay was amazing. There’s no point in staying anywhere else because this hotel is perfect. Thank you guys for everything!!! 🤍🤍🤍","travelDate":"2021-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"The Moore Hotel","lang":"en","publishedDate":"2021-10-10","publishedPlatform":"MOBILE","rating":5,"text":"Beautiful new boutique hotel in the heart of Chelsea and just a few minutes walk to the meatpacking district! Chic property with brand new rooms and a rooftop outdoor bar and lounge area. The staff is very friendly and accommodating which allows for a personalized experience. Will definitely come back!","travelDate":"2021-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Wonderful stay at The Moore! Chic, clean and convenient","lang":"en","publishedDate":"2021-10-10","publishedPlatform":"MOBILE","rating":5,"text":"We had a wonderful stay of an overall of 4 nights. We started with 2 nights and continued booking an additional 2 nights. The hotel is very new and we are happy to have been part of their soft opening guests :) ! Beautiful interior down to the details. We stayed in a standard room with a view to the street which was very pleasant since one of us needed to work most of the day. Big desk, very comfortable workspace.\n\nThe staff was full of energy and so friendly and welcoming at all times. The hotel has a wonderful cafe\/bar at the entrance which was super convenient (& the coffee and pastries are delicious!). There is a big & great rooftop open to all guests that you can drink your morning coffee from with a nice view of the city, work from or have some sunset drinks. \n\nLocation is super convenient. Down the block you have the C & E subway (3 stops from SoHo); 10 minute walk from Chelsea market area; 10 minute walk to Highline; 15-20 minute walk to Flatiron. \n\nFor those who plan to travel around the city with a Lime motor bike - this hotel is located in a green parking zone which is also very convenient! \n\nOverall, great stay and happy to have found a great spot to recommend to friends and family :)","travelDate":"2021-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":1177864,"title":"Great Staff and Amenities","lang":"en","publishedDate":"2021-10-04","publishedPlatform":"OTHER","rating":5,"text":"The hotel just went thru a thorough renovation. The lobby is gorgeous, the amenities are top notch and the generous bathrooms make up for the small rooms. Overall, it's a great place to base yourself in one of manhattan's more interesting neighborhoods.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"A New Yorker's Review","lang":"en","publishedDate":"2021-10-04","publishedPlatform":"OTHER","rating":5,"text":"The Moore staff creates a second-to-none experience that is polished and comfortable, original and familiar, and relaxing and exhilarating. As an NYCer, I've toured boutique hotels around my city and can confidently say that The Moore delivers on service, aesthetic, location, and feel.\nStay here.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Don’t Miss The Moore in Chelsea","lang":"en","publishedDate":"2021-10-03","publishedPlatform":"MOBILE","rating":5,"text":"Took a chance on the Moore hotel that had just opened about a week before our arrival and had not accumulated any reviews yet. They were just putting the sign up outside when we arrived. It was a great decision. Located in a great part of Chelsea, equal distance to get down to the Village via the Highline or up to see a show.  The staff were fantastic. Everyone we encountered could not have been more friendly and willing to help in any way (shout out to Christina for her recommendations and enthusiasm). One caveat, the rooms are small; but who goes to NYC to hang out in their room. Great bed and great shower and don’t miss the rooftop space for decompressing from your city activities. Check out the Moore on your next NYC visit, you won’t regret it.","travelDate":"2021-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":1177864,"title":"Great Hotel & Great Staff","lang":"en","publishedDate":"2021-10-01","publishedPlatform":"OTHER","rating":5,"text":"I was in NYC on business and heard about the hotel from a colleague. He was right! Great space & great staff. I felt right at home. The staff was very accommodating & kind, always asking how my day was. I recommend this hotel to anyone visiting NYC.","travelDate":"2021-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Home away from home","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"OTHER","rating":5,"text":"I regularly travel to NY and have finally found a hotel I love. My home away from home. The rooms are charming with a great vibe. Perfect for relaxing or working from home. The staff is friendly and accommodating. I highly recommend staying here wether on vacation or a work trip. The location is perfect and I can’t wait to visit again.","travelDate":"2021-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":1177864,"title":"Will definitely be coming back!","lang":"en","publishedDate":"2021-09-30","publishedPlatform":"OTHER","rating":5,"text":"I loved staying here so much! Will definitely be coming back every time I am in New York! Perfect stay, clean, comfortable and gorgeous! The beds are so comfortable and the staff are lovely. I will recommend this place to family and friends in the future","travelDate":"2021-08","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":1177864,"title":"perfect staycation","lang":"en","publishedDate":"2021-09-29","publishedPlatform":"OTHER","rating":5,"text":"Me and my partner needed a break from the everyday routine and escaped to the Moore for a perfect weekend in the city. The staff the vibe the location ... everything was perfect! Will totally be back!","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":1177864,"title":"Best hotel in NYC","lang":"en","publishedDate":"2021-09-25","publishedPlatform":"OTHER","rating":5,"text":"Best staff I’ve encountered at a hotel. Amenities were awesome from a rooftop deck, bar\/cafe in the lobby, and bikes to take right outside. Great rooms and high end appliances\/soaps. Wonderful furniture inside. Picture perfect","travelDate":"2021-09","tripType":"COUPLES"}
