{"helpfulVotes":0,"locationId":13449907,"title":"As advertised - location and clean. The rooms are very functional . . A special mention to Chanel , Andrise and Michael","lang":"en","publishedDate":"2024-04-30","publishedPlatform":"MOBILE","rating":5,"text":"The rooms are functional and clean . The staff is amazing. A special mention to Chanel , Andrise  and Michael . I am sure there are many more behind the scenes . Prime location with many shows and restaurants near by . Chanel , Andrise and Michael are always there to help out as needed.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great stay, wonderful staff","lang":"en","publishedDate":"2024-04-28","publishedPlatform":"OTHER","rating":5,"text":"Just got back from a 4 night stay. Very enjoyable. Clean, quiet room. Comfortable bed. Very nice breakfast. Great location for catching a Broadway show or hitting midtown sites. Staff was very friendly and helpful. Greeted us every time we came back for the night. Set up a car to take us to JFK that was cheaper than Uber. Would like to especially acknowledge Tyler. He was fantastic at finding solutions for any issues we had come up and really made us feel like he enjoyed working with us. Will certainly stay here again next time we are in New York","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Idéalement placé et accueillant","lang":"fr","publishedDate":"2024-04-24","publishedPlatform":"OTHER","rating":4,"text":"Hotel super bien situé à 5 mn de times square.  Chambre spacieuse avec petite cuisine équipée d un frigo, de plaques de cuisson,  four et lave-vaisselle. \nGrande douche.  Shampoing et gel douche à disposition. Ménage quotidien.  Serviettes changées tous les jours. \nPersonnel très agréable, souriant et à l'écoute. \nPetit dej salé et sucré,  café et thé à volonté toute la journée. \nPoints négatifs : salle petit dej pas adaptée,  mauvaise insonorisation des chambres.  Nous avons eu froid. Pour l ascenseur mieux vaut etre patient. \nNous recommandons cet établissement pour sa situation géographique,  son confort et l accueil du staff.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Have a great time in Manhattan","lang":"en","publishedDate":"2024-04-23","publishedPlatform":"OTHER","rating":5,"text":"We had a long stay at this hotel. We received very courteous attention to every detail (even a birthday gift), very grateful especially to Sanda, Chanel, Michel, Tyler, and Andrise. Highly recommended! Its near the Broadway shows and everything you want to do!","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great service","lang":"en","publishedDate":"2024-04-22","publishedPlatform":"OTHER","rating":4,"text":"Though the room left something to be desired, (extremely limited space- bed and half sofa), the personnel was top notch. Chanel, Santa, and Andrise were very personable and fun to talk to. I believe they are an asset in a market with so much competition. Such customer service should be recognized. Would stay again, but in a larger room.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Ideal location and perfect amenities","lang":"en","publishedDate":"2024-04-21","publishedPlatform":"OTHER","rating":5,"text":"I would recommend this property to anyone wanting to stay in the heart of bustling Manhattan. Tucked between Hell's Kitchen and Times Square - perfect for tourists!  Breakfast was lovely (we just took it back to our room to enjoy cuz we had small trays in the room to use to carry food!) and lots of selection (muffins, croissant, oatmeal with SO MANY TOPPINGS!!!, yogurts, hot dishes like eggs and quiche and sausage, english muffins, bagels, 3 typs of juices, milks, coffees and teas!).  Property was clean and the room ideal for staying in NYC - with a small kitchen!!  Perfect.  I have seen reviews that the elevator is slow.... it is!!!      :-D      Who cares?  We are in NY and relaxed and so what if the elevator is slow??  LOL.    Take the stairs if you want!  \nTHANK YOU to Michael, Joel, Tyler, Fidel, Maria !!!  Bravo on taking pride in your property and helping us enjoy our stay!","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"What you need in the theater district, but not more.","lang":"en","publishedDate":"2024-04-20","publishedPlatform":"MOBILE","rating":3,"text":"Good location for theater and central Manhattan. Small room, but what you need. Clean. Comfy bed. Plugs where you need them. Good WiFi. Standard breakfast with fine oatmeal and toppings. Spare lobby. Pleasant and helpful desk staff. Lots of dining options nearby.","travelDate":"2024-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great stay for families!","lang":"en","publishedDate":"2024-04-01","publishedPlatform":"MOBILE","rating":5,"text":"We had a great stay when visiting. We were able to walk to time square, broadway and Rockefeller center. Felt safe and comfortable. Hotel was clean. We were able to get early check in and late check out. Also, the food service workers went out of their way to make sure we were able to get a bagel on the go since we missed the free breakfast. Everyone was so kind and helpful to us. Will definitely stay here again when visiting New York.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Thank you MS Chanel","lang":"en","publishedDate":"2024-03-24","publishedPlatform":"OTHER","rating":5,"text":"My name is Detective Doc aka Det.Doc on IG.    I protect some of the worlds most valuable people.  I've been to just about every hotel in the world. So to say the hospitality of MS. Chanel was far past the norm would not be an overstatement.\nI would personally allow her to speak with any of my clients and in the future bi plan to support this hotel with upcoming travels.  Location was perfect for all local activities.  This hotel is a must stay!","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Meh","lang":"en","publishedDate":"2024-03-23","publishedPlatform":"OTHER","rating":3,"text":"Average hotel. Needs attention to a few things. They advertise a pullout coach in the queen room. It’s non existent. It would only for a new born and it closes off the bathroom. You can’t get in. We had this booked way in advance and had to start looking for a new hotel for the three of us. Santa then came out to the car to offer us another room. Thank you Santa. Much appreciated. So we made it work. Nice location. Close to everything breakfast was horrible one thing on the menu (bagels) my son could eat and they had three and then gone. We were there for five nights. Once the early birds took at the parties back to their room they weren’t replenished. So none for anyone else. Ran out of camomile tea. Just terrible. The same sausages all week. No breakfast eating area. We were  happy not o have to wait a half an hour for an elevator as with the larger hotels.  But this is not really a marriot. Our room was very clean and there was always someone cleaning in the hotel.","travelDate":"2024-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Perfect location","lang":"en","publishedDate":"2024-03-22","publishedPlatform":"MOBILE","rating":5,"text":"Great experience would stay again!\nPerfect location and everyone was great. Stay was for work travel. Able to visit Time Square and enjoy time in the New York Area. \nChanel was excellent and very professional and  helpful! Great customer service.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Outstanding stay other than the SLOW elevator.","lang":"en","publishedDate":"2024-03-22","publishedPlatform":"OTHER","rating":4,"text":"Well priced stay at a very comfortable hotel just a long block and a half off times square. The room I had faced the back so only other properties, which made it VERY quiet. Not sure how it would have been in the front, but this street does seem quieter than most overnight. But all streets have trash pickup on some days which is super noisy and very early. I didn't partake in the breakfast so cannot rate that.  Front desk staff - all three I interacted with over 26 hours, were super kind and helpful. I'm a titanium member for reference on hotel experience. Shower pressure not great but acceptable. Smartly designed bathroom with sliding door to not take up too much space. Oh, and no real desk in the bedroom, but there is a small table you can move to sit in front of the mini-sofa and use like a desk. A little more space is dedicated to the kitchenette than I would have preferred, but someone actually cooking might have appreciated that. \n\nTo my comment in the title, the elevator is one of the slowest I've experienced. I climbed 7 flights multiple times to avoid the wait. This should be addressed.","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"ABSOLUTLY THE beST MARRIOT FROM NEW YORK","lang":"en","publishedDate":"2024-03-10","publishedPlatform":"MOBILE","rating":5,"text":"Wauwwww the rooms are truly AMAZING and i travel a lot, also in Marriot Hotels small and big Marriot Hotels. The staff is SUPER friendly and welcomming and helpful, the receptionist even offered me a piece of her pizza. Beds are super good, super clean and the energy in the hotel is just super good and the rooms are really quitte and cute.\nAbsolutely recommendable!!! Thank you for the amazing stay. 10 PLUS","travelDate":"2024-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"NY on a nutshell","lang":"es","publishedDate":"2024-03-07","publishedPlatform":"OTHER","rating":5,"text":"Muy atentos todos. El desayuno cumplidor. Las habitaciones limpias y la cocina es un 10.\nA solo 30 metros de la estacion de subte q te conecta con todo.\nLa señora Maria espectacular atencion estaba en todo los detalles y te hace sentir muy comodo.\nSuper recomiendo","travelDate":"2024-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Muy contenta con la atención","lang":"es","publishedDate":"2024-03-01","publishedPlatform":"OTHER","rating":5,"text":"Perfecta atención por parte de todos los empleados muy amables y atentos, la habitación muy cómoda, y el desayuno muy bueno y completo, Maria da una atención muy atenta y familiar.\nMuy contenta de haber vivido mi experiencia de New York en este hotel","travelDate":"2024-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Compfy beds!","lang":"en","publishedDate":"2024-02-12","publishedPlatform":"OTHER","rating":5,"text":"I stayed 2 weeks at this hotel, had to experience 3 different rooms (for external reasons) and all 3 were just perfect! Very compfy beds and perfectly clean. The first and second rooms were huge! The staff was super nice with me in all time and the breakfast was good. If I had to add something to make it better, only wish they had a variety of fruits. I definitely will stay in this hotel again. Thank you!","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great staff and location","lang":"en","publishedDate":"2024-02-10","publishedPlatform":"OTHER","rating":5,"text":"The hotel is extremely well located, walkable to everything in theater district & Times Square. Well-stocked kitchenette and nice room size. The management and staff were excellent, so amazing and ready to help, especially Santa at the front desk!","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great staff and location","lang":"en","publishedDate":"2024-02-06","publishedPlatform":"OTHER","rating":5,"text":"My mom and I stayed there for a NYC Broadway weekend. The entire staff (shout out to Santa!) goes out of their way to make sure you have a great stay. \nWalking distance to the Theater district, Times Square and Hells Kitchen neighborhoods. I was concerned that it would be super noisy at night- but we never had an issue. \nWould def come back!","travelDate":"2024-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Experiencia de visita a Nueva York 5 días","lang":"es","publishedDate":"2024-02-04","publishedPlatform":"MOBILE","rating":5,"text":"Fue 100\/100 todo volveré pronto me encantó la atención de Santa muy amable cordial las personas que conforman el equipo de trabajo ahí muy atentas muy serviciales la zona muy segura y cerca de times Square la habitación muy cómoda con cocina y refri para todas tus necesidades el metro a unos cuantos pasos gracias por todo townplace Manhattan 44 y Santa de las mejores experiencias lo recomiendo en absoluto este hotel ya sea para placer o negocios","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great hotel","lang":"en","publishedDate":"2024-02-04","publishedPlatform":"OTHER","rating":5,"text":"I recently stayed at   TownePlace suites for a short weekend getaway and truly felt at home. The facility was extremely  cleaned from the lobby to my room. The lobby offered daily morning breakfast which had a great spread and comfortable couches for lounging.  The staff was pleasant and professional and offered various suggestions on restaurants and activities around the area. I would recommend this hotel to anyone and plan on coming back during my next stay :)","travelDate":"2024-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Nice stay","lang":"en","publishedDate":"2024-02-04","publishedPlatform":"OTHER","rating":4,"text":"After reading some previous reviews, I have to agree with a few points.\n\nFirstly, I must say the folks at the front desk are genuinely friendly, polite, and upbeat, which speaks volumes about their quality of service.\n\nMy room was clean and felt secure, especially since you needed a key for the elevator.\n\nThe hotel is no-frills and quite small, only six floors with a slow elevator, but thankfully, noise wasn't an issue in my room, although I can't comment on street-facing rooms since mine had no view.\n\nFor Broadway enthusiasts, the location is unbeatable, just a minute's walk from shows like Spamalot.\n\nHowever, a downside is the lack of authority at the front desk to resolve issues directly. I had trouble with my booking through the app and had to call the hotel directly to make a reservation. Despite providing documentation and being quoted a certain rate including bonus points, the only solution offered was to contact Marriott. It's surprising given their pro-customer service attitude.","travelDate":"2024-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Muy buena relacion-precio calidad","lang":"es","publishedDate":"2024-02-03","publishedPlatform":"MOBILE","rating":5,"text":"Habitaciones muy limpias, personal muy amable, desayuno bueno, las habitaciones son cómodas, el baño es suficientemente cómodo. Excelente ubicación, con varias estaciones de metro cerca, fácil de ubicar si vas por primera vez a New York ","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Wish I could stay longer","lang":"en","publishedDate":"2024-01-31","publishedPlatform":"OTHER","rating":3,"text":"Chantel and Andrise are very kind! The room was nice and clean. The eggs at the free breakfast tasted kind of sticky but everything else was good. Beverages available all day and staff was super helpful. My one thing was I came to the desk to check out early. I was due to check out the next day. The FD agent said I was all set with my bill. I thought I had time to check out but housekeeping knocked at my door around 6:00pm with no warning. Front desk called after they knocked. I understand you have to clean the room to reuse but I paid for the whole day and didn't appreciate being nicely rushed out. How could I say no to some nice room attendants though, you know?","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Broadway Week Surprised my Girls!","lang":"en","publishedDate":"2024-01-28","publishedPlatform":"OTHER","rating":5,"text":"I read some mixed reviews before booking a quick trip during Broadway week. \n\nI booked a king room with a sofa bed \nI talked with Sandra at the front desk prior to arriving about the room etc. \nshe was informative.   I decided to book\n\nCheck in went smooth. Lobby was small very clean.  Remember this isn’t a large hotel with the big lobby. It clean and well appointed. \nRoom was very nice. Super clean \nBathroom was spotless \nThe room had a small kitchen and was also spotless \n\nThey offer coffee in the lobby and continental  breakfast. My girls did get a snack and we found the food was stocked and fresh. This isn’t full breakfast \n\nI used their fitness center   It had basis gym equipment and treadmills. \n\nWe stored our bags without a fee. They offer coffee and water \nIn their lobby. \n\nLocation.  This is in waking distance of both Penn Station and Port authority\nTimes Square is very close. We were in the city to see a show and we were able to walk everywhere \n\nWill stay again 100%.","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Una opción genial para Nueva York","lang":"es","publishedDate":"2024-01-28","publishedPlatform":"OTHER","rating":5,"text":"Nos hemos alojado una semana en este hotel y todo ha sido perfecto.\nEl personal del hotel es muy amable y hacen todo lo posible por ayudarte.\nLo que más valoramos es la limpieza, comodidad de la cama y un buen baño y este hotel cumple con todo.\nEl desayuno está incluido en el precio y tiene variedad de dulce y salado por lo que puedes ahorrar un poquito en tu estancia ya que Nueva York es una ciudad cara.\nLa ubicación es excelente, muy cerca de todo y con el metro en la puerta.\nPara nosotros ha sido todo un acierto y se lo recomendaremos a todo el mundo.\nMuchas gracias por todo!!!!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Very nice hotel in a perfect location where you have WhatsApp you need yo enjoy of your visit yo NY","lang":"en","publishedDate":"2024-01-27","publishedPlatform":"OTHER","rating":4,"text":"- Very near to Times Square, so perfect location.\n- Big and comfortable bed.\n- Spacious bathroom with everything you need.\n- Kitchen with ceramic hob and microwave, so you can cook if you need it.\n- Breakfast buffet with good food, so you can save some money. I recomend to go early because the room is small and there are few tables.\n-Don't be too noisy because you can hear very clear whatever happens in the aisle.\n\nWe had a really good experience and we would repeat here if we came back to NY.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Wonderful stay in the Big Apple","lang":"en","publishedDate":"2024-01-21","publishedPlatform":"MOBILE","rating":5,"text":"The hotel is extremely well located to visit NYC.  About 10 minutes walk from Times Square and 5 minutes from nearest subway entrance.  It is also just next door to a covered parking.  Also to be noted, the excellent serviced delivered by Joel n the breakfast area.  Not only he is insuring that the breakfast area is always complete, but he can also provide excellent guidance to visit NYC.","travelDate":"2024-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Will Stay Here Again","lang":"en","publishedDate":"2024-01-18","publishedPlatform":"MOBILE","rating":5,"text":"This hotel is in a great location, in a very safe area, and offers a wonderful breakfast, complimentary. The price was so reasonable for NYC with its above mentioned positives. \n Front desk Micheal and Dilesica were helpful and displayed a positive attitude toward guests.","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Poor Service","lang":"en","publishedDate":"2024-01-18","publishedPlatform":"OTHER","rating":2,"text":"I stayed at the TownePlace Suites New York Manhattan\/Times Square in January 2024. Mixed review. I found the room to be very comfortable and quiet, and the hotel is in a great location very close to Times Square but quieter than any hotel I've ever stayed at in the area. The service was not great, though. I felt like the front desk yelled at me when I arrived because I didn't know the entrance was locked - I didn't have a key yet, since I hadn't checked in before it was locked. A little later in the evening, I noticed the door to the pantry in the lobby was open, so I went to grab an apple. While I was waiting for a friend in the lobby eating the apple, someone from the front desk came over and yelled about the pantry doors being open, telling the other person at the desk how the pantry should be closed. I felt really embarrassed to be eating the apple because there were other people in the lobby - I just didn't know the pantry was off limits because the pantry doors were open when I waiting for my friend. Also, I bought a 5000 bonus points package and the points were never credited to my account. When I called the hotel, they had no ability to add the points and redirected me to Bonvoy's Titanium line. When I called Bonvoy, they seemed confused about why the hotel couldn't add the points, saying it's the hotel's responsibility. Bonvoy did credit the points though.","travelDate":"2024-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Loved the experience!","lang":"en","publishedDate":"2024-01-17","publishedPlatform":"OTHER","rating":4,"text":"We were put in a room on the 6th floor - nice view. Everything was clean and we had a full kitchenette. \nThe staff at the front desk were kind and friendly.\nI loved the fact that we were within walking distance from Times Square.\nThey do have breakfast included but note that there are minimal spaces and a small breakfast. Only had some toast\/bagels, oatmeal, scrambled eggs and turkey patties. I was expecting bacon and pancakes - so the breakfast was the only disappointment.\nAdditionally, there is only 1 elevator so it takes forever to get to your room. \nOverall, would come again :)","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Friendliest Hotel Team in NYC","lang":"en","publishedDate":"2024-01-14","publishedPlatform":"OTHER","rating":5,"text":"From the minute we booked our reservation, to calling before our arrival, at check in, and every interaction with many of the staff here at the TownePlace Suites - Time Square, including checking out with Michael at the front desk…all have been so Friendly and Helpful!  Thanks for the GREAT stay!","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Truly AMAZING, thank you the Staff of the TownePlace.","lang":"en","publishedDate":"2024-01-13","publishedPlatform":"OTHER","rating":5,"text":"Truly AMAZING!!! I would give this place a solid 99% for the attention of the staff and room itself out of 100% (I explain why 1% deduction). We stayed at @211 - the perfect room, except for the drafty window frames. It's more of Marriot's issue for using cheap material, so that is the reason for the 1% deduction. \nNow the amazing 99% - the staff!!! FROM HEAD TO TOE truly dedicated and super friendly. The front desk colleagues - day or night - always greet you with a warm smile and a cheeky chat - ladies you were fab!!! :-). The breakfast area is catered nonstop and choices are sufficient for a good filling breakfast. Just a few feet \/meters away from the NYC Subway station (easy access to JFK on the E-Line), 4 min walk to TimeSquare. FoofEmporium or Target are just a 3\/6min walk as well as CVS for your food and convenience needs. \nTHANK YOU GUYS and looking forward to seeing you again!!!","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great Breakfast Staff!","lang":"en","publishedDate":"2024-01-05","publishedPlatform":"OTHER","rating":4,"text":"The best thing about our stay was the people who managed and worked in the breakfast buffet area. They were very efficient and patient and hardworking. Their up-beat  and polite attitude started each one of our days with a smile!","travelDate":"2024-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Fantastic Townplace by Times Square","lang":"en","publishedDate":"2023-12-30","publishedPlatform":"MOBILE","rating":5,"text":"We thoroughly enjoyed Townolace Hotel. It’s a great Marriott property,  very clean and placed just right 2 blocks from Times Square. I cannot say enough praises about the staff on every shift. The checking in was seamless and the ladies and gentlemen were seriously the best and so nice. The maids were so attentive and from getting us fresh towels to taking the trash off they were on it! Overall great location and amazing staff!","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Awesome staff and management ","lang":"en","publishedDate":"2023-12-14","publishedPlatform":"OTHER","rating":5,"text":"My wife and I stayed here in December 2023. We had stayed for a week and thoroughly enjoyed our stay. Our room was perfect. The staff and management were excellent. The breakfast was good. Excellent location in New York City. We both highly recommend this hotel. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"An easier way to do Broadway","lang":"en","publishedDate":"2023-11-27","publishedPlatform":"OTHER","rating":5,"text":"Perfect location! Got Spot Hero parking a few doors away, were able to check in early- room very well appointed- & then walked one block to see a Broadway show & had quick dinner nearby .....despite being in the heart of theater district, we heard minimal outside noise & slept well.....boutique hotel - free breakfast but we just got coffee & checked out...will definitely stay here again for our next Broadway outing....","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Fantastic customer service, clean and comfy","lang":"en","publishedDate":"2023-11-26","publishedPlatform":"OTHER","rating":5,"text":"Awesome experience at this hotel. The beds were comfy. Free breakfast was well-stocked with a diverse amount of food. \n\nThe first night we were there, there was too much street noise for us light sleepers. I spoke to Michael at the front desk and he graciously offered to move us to a different room. But not only did he just move us, he actually offered to personally walk me around the hotel to show me how the other rooms were configured differently (some had full size couches, some had just a chair, some rooms were less spacious, etc). I was so grateful for his kindness and customer service. \n\nEveryone else at the front desk was also lovely and helpful. I kept seeing staff members checking the breakfast station to make sure they weren’t running out of food, which is so appreciated. The staff really seemed to care about the comfort of their guests. Rooms were very clean. Also, the lobby always has hot water and coffee available at all hours. \n\nMy only tip for parents with young kids, or any light sleepers, is to request a room on the inside of the hotel so that you aren’t facing the street. \n\nThe location was also fantastic. It was very close to Times Square. We would definitely stay here again. ","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Very friendly","lang":"en","publishedDate":"2023-11-26","publishedPlatform":"OTHER","rating":5,"text":"The hotel is brand new and very nice. Very clean and safe. This is absolutely the friendliest hotel I’ve ever stayed at. Everyone is so welcoming, especially Michael and Chanel at the front desk. They always greeted me with a smile and made sure I had everything I needed.","travelDate":"2023-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great staying last week in NY","lang":"en","publishedDate":"2023-11-21","publishedPlatform":"OTHER","rating":5,"text":"Really want to thank the staff, mainly Dileska, Michael, Joel, Kristy and Maria, for the superb service they offer in this hotel. Many hotels have great installations and amenities like this one, but the people here is what makes a great difference. They make your staying in New York an easier and fun experience. Thanks for evrrything guys! 👍👍 Ng","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Amazing stay!","lang":"en","publishedDate":"2023-11-20","publishedPlatform":"OTHER","rating":5,"text":"Such beautiful and clean rooms!! The staff is so amazing and ready to help. We visited with a large group of family and everyone was so friendly and really made our experience great! Special thanks to Joel for making our mornings lovely during breakfast, and Andries and Sante for always having smiles on their faces and being so accommodating for our family. 100% would recommend and return to this hotel!!!","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great location with warm staff","lang":"en","publishedDate":"2023-11-18","publishedPlatform":"OTHER","rating":5,"text":"Excellent location walkable to everything in theater district & Times Square. Wonderful to have well-stocked kitchenette and nice room size. Wonderful staff greeted us each time we entered & left the building. New favorite place to stay in NYC.","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Nice and central place","lang":"en","publishedDate":"2023-11-11","publishedPlatform":"OTHER","rating":5,"text":"Clean and very central place, 5 minutes from Times Square and all the principal attractions in Manhattan…I really love it, you can walk through all the principal avenues.\nDileska at the front desk is very kind, we definitely will return. ","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great place to stay in Times Square!","lang":"en","publishedDate":"2023-11-08","publishedPlatform":"MOBILE","rating":5,"text":"We were in NYC to participate in the NYC Marathon. The location was central to every where we wanted to go. The property was very clean and well maintained. The staff was professional, courteous, and where very helpful! The breakfast was well attended and we enjoyed it every morning.  We were very pleased with our stay and we will definitely be staying here when we visit NYC again!","travelDate":"2023-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Two great stays","lang":"en","publishedDate":"2023-11-04","publishedPlatform":"OTHER","rating":5,"text":"I stayed at this property twice in October 2023 and had a wonderful experience both times. Staff was welcoming and accommodating and both rooms I stayed in were clean.\n\nI had see. Some negative reviews about the elevator and although there is only one and it is maybe slower than you’d like, I never spent more than a few minutes waiting for it either time I went. It truly was a nonissue.\n\nThe location of this hotel is super convenient if you’re spending time seeing Broadway shows (which is usually my purpose for visiting NYC), the price is super fair for the accommodations, and I appreciated that there was complimentary breakfast as an option.\n\nMy partner and I have already decided to make this our Midtown hotel every time we visit to see shows. Thanks to the staff for two great stays!","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great location, welcoming staff.","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"This is a great hotel! Very convenient location, a block or less to a subway station. The front desk staff (Daniel) was outstanding. He made us feel very welcome. The rooms include a kitchen, but, as is typical of New York hotels, the room was fairly small overall. The room was very clean & housekeeping kept it that way. Breakfast was fine, pretty much the typical type of thing that you find at Townplace Suites. The workout room was pretty minimal & had no spin-type workout bike, so I didn't use it. One thing that we were happy to take advantage of was that the front desk had umbrellas to loan out. It poured rain while we were there, so it was great to be able to borrow an umbrella! They must have quite a few, as there were several of us asking to borrow & we all got one. In addition to being close to the subway, this location was within a mile of a Whole Foods, Target, the Barclay Center, the Brooklyn Museum & gardens, as well as lots of places to eat. We will definitely stay here again the next time we're in Brooklyn.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Outstanding New City Hotel Experience","lang":"en","publishedDate":"2023-10-30","publishedPlatform":"OTHER","rating":5,"text":"This hotel is in a fantastic location for touring with easy access to parking, and is in excellent condition!  We stayed at several different Marriotts on this trip and most had great teams and service.  This location has an absolutely fantastic team! Andrise is a shining star on their team, and everyone else was awesome too!  They were extremely welcoming and helpful from check in to check out!  Whether we had questions on restaurants or needed subway directions, they were there to help!  When we would leave in the morning to tour and when we came back at night, it was like we were talking with old friends!  We highly recommend this team and hotel to anyone looking for an enjoyable time in New York City!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Clean, comfortable Hotel in a Great Location","lang":"en","publishedDate":"2023-10-25","publishedPlatform":"OTHER","rating":5,"text":"We stayed here in September 2022 and as we lived the location and room booked for a 5 night stay this year.\nWe weren't disappointed; the hotel is clean and housekeeping every day was a bonus. The facilities in room are excellent- fully equipped kitchen area plus a good shower and comfortable bed.\nWe enjoyed the free breakfast, had no issues with the lift and the staff were friendly and helpful.\nIf we come back to NYC we would stay here again.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great Friendly Staff","lang":"en","publishedDate":"2023-10-23","publishedPlatform":"OTHER","rating":5,"text":"Great Friendly staff at the hotel. Both Michael & Santa were brilliant and extremely helpful. Professionals such as these, makes a stay at any property pleasant. Would love to visit again this week staying at the same property.","travelDate":"2023-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Très bien situé dans Manhattan ","lang":"fr","publishedDate":"2023-10-23","publishedPlatform":"MOBILE","rating":4,"text":"Très bien situé à proximité de Times Square, métro à 150 m, résidence hôtelière moderne, très propre, calme, studio très bien aménagé un peu petit et manque de rangement mais avec tout ce qu'il faut dans la kitchenette, le personnel est disponible, très aimable et efficace, bon petit déjeuner, boissons et café disponibles gracieusement en journée....","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Started off bad but ended well.","lang":"en","publishedDate":"2023-10-21","publishedPlatform":"OTHER","rating":4,"text":"When we first arrived, we were told wlour reservation got bumped and we did not get the room we reserved. This was very upsetting because there were 3 of us and we had 1 small bed to share. I ended up sleeping on a chair (literally) and the AC did t work and it was so hot. I opened a window but there was too much street noise being so close to times square. That first night was horrible and it was frustrating that we reserved a room 6 months in advance and got bumped and didnt get what we paid for. We were told that we would get a partial reimbursement but that never happened.\n\nThe next day, after some confusion about switching rooms  we were eventually placed in a room with a queen bed and a pull out bed and with an AC that worked. This was so much better. The day staff, Michael and Dileska, were very nice and helpful throughout all the confusion and overbooking mess. All of the staff were friendly and professional but we really spent more time talking with Michael and Dileska and they both were really great and helpful!","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"WORST HOTEL EXPERIENCE IN YEARS. DO NOT RECOMMEND.","lang":"en","publishedDate":"2023-10-19","publishedPlatform":"OTHER","rating":1,"text":"The stay was a complete disaster because of a 24\/7 very loud cracking noise coming from the elevator, every time the doors opens on any floor! In busy times, the noise would happen every few seconds. At night, it would happen intermittently but regularly, making comfy sleep impossible even with earplugs. I find it unprofessional and disrespectful to rent an expensive King size room with such creeping problem. It ruined a part of our stay, because after a busy day in the city, we didn't look forward to coming back to our roomnor could properly rest. And we stayed 5 nights. One expects much more from a Marriott hotel, and it is an enormous disappointment with the brand. Management violated all principles of proper hospitality when, despite the horrible circumstances of the rooms close to the elevators, they decided to ignore the well-being of guests and rent those rooms regardless of the utter and absolute discomfort the cracking noise brings to guests. Shame on you. You lost at least two clients.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Wonderful place to stay - Outstanding Customer Serivce","lang":"en","publishedDate":"2023-10-12","publishedPlatform":"OTHER","rating":5,"text":"The customer service at the hotel was amazing.  The front desk greeted us every time we walked in.  The two extremely minor issues were resolved  immediately.  As we ate their included breakfast, staff walked around and picked up our used plates.  The food was fresh and pleasant.  The room was very clean.  The bed quite comfortable.  The warm cookies at the front desk in the late afternoon tasted amazing.  I really cannot say enough nice things about our stay.\n\nIf you are looking for an affordable, comfortable, clean and customer service focused place to stay mere blocks from Time Square you cannot do any better than this hotel.","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great hotel","lang":"en","publishedDate":"2023-10-11","publishedPlatform":"MOBILE","rating":5,"text":"We had 6 nights here to explore New York. \nThe staff are friendly and helpful. \nOur room was perfect nice and quiet. \nBreakfast was good lots of choice and well maintained by staff. \nThe location is perfect for site seeing, so close to Broadway and Times Square. \nWe really enjoyed our stay here thanks.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great hotel for a weekend in NYC","lang":"en","publishedDate":"2023-10-08","publishedPlatform":"MOBILE","rating":5,"text":"So, when I was looking for a hotel, I wanted something centrally located to the various shows we were attending.  I like staying at Marriott Bonvoy hotels because they are generally ver consistent across the board in their offerings.  That said, while the room was small, it worked well for our short weekend trip.  If we were staying longer, the room size might have been a problem.\n\nSome things I really liked about the hotel included:\n- friendly staff; we were greeted each time we entered the hotel\n- nice lobby area with coffee\/tea and a pretty decent little breakfast area\n- the hotel locked the front doors after 7pm and you could only get in with a key","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Séjour à New York ","lang":"fr","publishedDate":"2023-09-09","publishedPlatform":"MOBILE","rating":5,"text":"Hotel à quelques minutes à pied de Times Square mais assez excentré du marasme de la foule. Jolie chambre bien agencée et équipée d'une kitchenette avec tout le nécessaire (plaques, micro onde, lave vaisselle, frigo, cafetière, assiettes, verres et couverts). Ce fut un gros plus lors de notre séjour de 9 jours, après une bonne journée de visite, il est appréciable de pouvoir se poser et manger tranquillement dans sa chambre. L'espace de la chambre est suffisant pour deux personnes, peut être pas pour trois adultes. Le personnel était très accueillant et souriant. Mention spéciale pour Mickael, fort sympathique et agréable. La chambre était nickel, faite chaque jour. Merci également au personnel de ménage pour leur travail.\nLe seul point négatif est l'espace du petit déjeuner, seulement 5 tables pour l'ensemble de l'hôtel. Si vous venez au delà de 7h30, il sera compliqué de pouvoir s'y installer. C'est dommage. Malgré tout, nous sommes très satisfaites de notre séjour. ","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Wonderful hotel, location and staff!","lang":"en","publishedDate":"2023-09-05","publishedPlatform":"OTHER","rating":4,"text":"Love, love, love this hotel!  This was our 2nd time staying here and could not be happier with the hotel itself, the location and the more than excellent customer service!\nUpon arrival we were unfortunately placed in a wheelchair accessible room (not what I booked) due to availability issues.  This room was very uncomfortable and not functional for our needs whatsoever.  We spoke to one of the front desk agents and were told there were no other rooms available which was disappointing, but we held out hope since we had had such a great experience on a previous stay.  We stuck it out through the first night and the next morning my daughter spoke to front desk agent, Santa, who was AMAZING!  She said she would move our rooms as soon as possible but didn't have anything at that moment.  That was absolutely no problem for us as we were going out for the day anyway.  We packed up all our belongings and Santa held our bags for us till later in the day when we returned and we changed rooms.  \nThe room had a King size bed, small kitchenette and perfectly sized bathroom.  The lobby has coffee and tea 24 hours and the buffet breakfast is fantastic.  \nSanta was our saving angel and can't wait to go back to TownePlace Suites Manhattan.  So close to Times Square, subway, eateries, shopping etc.  Perfect location, facility and staff.  \nThank you Santa!  ","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excelente Ubicación y mejor servicio.","lang":"es","publishedDate":"2023-08-30","publishedPlatform":"MOBILE","rating":5,"text":"Excelente ubicación y mejor servicio.  Santa fue un éxito en nuestra estadía, fue muy gentil y ayudadora.  Nos hizo trámites de transportación y nos recomendó restaurantes.  El hotel está muy céntrico a diferentes puntos de interés en pleno corazón de Manhattan, muchos restaurantes cercanos.","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Absolutely abysmal stay","lang":"en","publishedDate":"2023-08-29","publishedPlatform":"OTHER","rating":1,"text":"This hotel is absolutely horrible. Only one elevator and no service elevator, and it was frequently broken. I had to take the stairs to the 7th floor repeatedly. Housekeeping seemed to come only when they felt like it. The room was too hot, AC didn’t seem to work. Would never stay here again.","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Best Bang for Your Buck in NYC","lang":"en","publishedDate":"2023-08-29","publishedPlatform":"OTHER","rating":5,"text":"I have never been made feel more cared for by the staff. Period. I've stayed all over the world and for what this place gives you you will never find a better bang for your buck.The Breakfast is Amaz.","travelDate":"2023-08","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":13449907,"title":"SCONSIGLIO ! FATE ATTENZIONE","lang":"it","publishedDate":"2023-08-26","publishedPlatform":"OTHER","rating":1,"text":"ho prenotato quest hotel con la mia carta, da cui poco prima dell’arrivo è stato giustamente addebitato l’acconto.\nUna volta arrivati in hotel e fatto il check in , mio marito ha deciso di iniziare a saldare tutto il resto dell’importo con la sua carta. (Sono stati presi più soldi del dovuto ma abbiamo pensato fosse una sorta di caparra in caso di bevande extra etc) fin qui tutto ok, una volta rientrati a casa , abbiamo notato che anche nella mia carta usata x la prenotazione è stato tolto il saldo dell’importo, già pagato da mio marito. Ci siamo lamentati abbiamo chiamato scritto e recensito ovunque ma ad oggi nessuno ci ha restituito nulla e ci hanno RUBATO il doppio dell’importo. Prenotate altrove! Allego foto della ricevuta di pagamento con la data e del mio estratto conto da cui hanno tolto acconto e ritolto date (ho cancellato ovviamente i dati importanti)","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Atención Sta. Santa","lang":"es","publishedDate":"2023-08-18","publishedPlatform":"OTHER","rating":5,"text":"Queremos agradecer la atención brindada en la recepción del hotel por la Srta. Santa , quien nos brindo una cordial bienvenida y nos ha orientado el resto de los días y aclarado nuestras consultas tanto del hotel como del resto de la ciudad , por todo esto queremos dejar constancia de su atención para con nosotros .","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Worst hotel I have had the pleasure of staying in","lang":"en","publishedDate":"2023-08-14","publishedPlatform":"MOBILE","rating":1,"text":"On our arrival after a 22 hour flight, we were advised there was no room for us for the night.  I had called and confirmed all our bookings 2 weeks prior to our stay. I had a reference number, no room is no room no matter what I had\n\nWe were advised that they would put us up for the night at a sister company and would pay the Uber, 45 min later we were in an Uber, just before midnight, we were finally in our room.\n\nNext morning we walked back to the hotel only to be told our room was not ready, 1 hour later we could check in only to find our room was on the 7th floor and the lift was out of service.  Frustrations aside the room was small but nice.\n\nI was awoken at 1am to a loud bang, only to realised was a continuous bag, it sounded like something trying to start up but couldn’t, it is now 6am and I have barely slept is an understatement.  It has been the worst experience for us","travelDate":"2023-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"New Yorkkkkkk","lang":"en","publishedDate":"2023-08-02","publishedPlatform":"OTHER","rating":4,"text":"We had a lovely 4 nights here, would go back and stay there again. \nPROS:\ncomfy bed\nvery clean and up to date room\nfriendly staff, who are always greeting you and chatting in general\nmini kitchen and fridge to store any items and easily allowable to make a quick snack or drink throughout the day\nlocation is only 5 minutes walk from times square\nlots of places to eat\/drink\/shop nearby\nbreakfast is complimentary from 6-9am\nCONS:\nbreakfast area was too small every morning so didn't get a chance to have it in the hotel","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"First time to New York","lang":"en","publishedDate":"2023-08-01","publishedPlatform":"OTHER","rating":5,"text":"Stayed at the TownePlace Suites for 8 nights with my son. First time visiting New York, was on my bucket list.  We honestly couldn’t fault the hotel, it’s in a perfect location for Times Square and subways, our room was at the back - 214 very quiet, the room was lovely, my son (26) slept on the bed settee which he said was very comfortable, I had a queen bed, again very comfortable, kitchenette was ideal too, the room was serviced every day and  fresh towels provided.  Shampoo\/conditioner and shower gel is also provided. Buffet breakfast was an added bonus, and coffee\/hot water, tea bags etc are available 24\/7.  I would definitely recommend this hotel to anyone travelling to New York, always someone on reception to help in person or on the phone.  I❤️NY","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"A Challenging Visit","lang":"en","publishedDate":"2023-07-30","publishedPlatform":"MOBILE","rating":2,"text":"The hotel is very clean. The rooms are small but standard size for NYC with a galley kitchen. The elevator is very slow and also used by housekeeping staff. We had breakfast the first day, and it was terrible. We arrived shortly after opening and the hot food was cold. We went elsewhere for the remainder of our three night stay. \n\nThe worst problem we encountered was the AC not working in our room 502. We reported the problem the first night, but nothing was done. They next day, we complained and were moved to another room. However, no one from staff checked that AC wasn't working in the new room as well. We came back late from the theater, and the room temperature was 82 degrees. The third night, we were given a third room that staff checked to make sure the AC was working before moving us.\n\nI gave the two star rating because of the location, and some staff were helpful.\nWe won't return.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Belle location mais pas de confort","lang":"fr","publishedDate":"2023-07-24","publishedPlatform":"MOBILE","rating":2,"text":"L’hôtel était complet et nous avons obtenus une chambre avec lit king plus divan-lit.  Le lit était très dur et le divan-lit, grandeur simple, ne peut accueillir un adulte ou même un ado.  Le plancher était sale, l’air climatisé donnait de l’air froid mais la fan ne poussait pas l’air dans la chambre,   Malgré tout, le personnel était courtois et n’était pas à blâmer.","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Be Warned About Two Issues","lang":"en","publishedDate":"2023-07-12","publishedPlatform":"OTHER","rating":1,"text":"The location is good, very near to Times Square. However, there are two issues that you should beware if you choose to book this hotel.\nThe first is the slow noisy elevator. There is only one and it makes a very loud banging noise at every stop. The sound reverberates through the whole building into the rooms. If you are a light sleeper, be warned.\nThe second is overcharging. When you booked, they will send you a warm welcome email detailing the breakdown of charges for each day. However, they will ignore all that and blatantly overcharge you. The frontline staff are trained to lie and tell you that they will refund the difference in a few days. But they will ignore all your emails you send to ask about it. President Biden has personally condemned such business practices and tries to pass the Junk Fees Prevention Act. So, be warned that this is a dishonest hotel and you will be charged more than what you sign up for. ","travelDate":"2023-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"I will never come again to this brand and hotel","lang":"zhTW","publishedDate":"2023-07-04","publishedPlatform":"OTHER","rating":1,"text":"我們在這邊住了五日， 房間本身非常小， 設備老舊， 同時 會頻繁的發出噪音， 晚上睡眠會有很大的影響， 酒店不提供任何用品 只有提供毛巾， 飯店空調有很大的問題， 房間很悶熱， 我們住的一晚發現空調真的壞了， 所以連夜要求我們換房， 但是換到另一間其實空調問題沒有改善， 應該是他們空調主機冷卻水塔的問題。 酒店服務人員態度散漫 其實給不了什麼幫助。 我們一個晚上的房價約320美金 真的不知道這麼糟糕的房間怎麼會收這麼貴。","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Good hotel, good value","lang":"en","publishedDate":"2023-07-02","publishedPlatform":"OTHER","rating":4,"text":"The hotel is very well situated, only a couple of blocks from Times Square.  The staff were extremely friendly and Marie at reception needs special mention as she went out of her way to accommodate our early arrival.  Rooms are small but comfortable and we had a great two nights.\nAll in all the hotel is great value compared to similar hotels in the area.  Will certainly stay here again when we return to Manhattan.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"A perfect stay!","lang":"en","publishedDate":"2023-06-25","publishedPlatform":"MOBILE","rating":5,"text":"I just finished up an incredible 5 night stay on points at Marriotts TownePlace Suites at Times Square. I can not say enough good things about it! The location is so close to the theaters and right next to a subway stop. Every member of the staff was friendly and helpful. Kitchenette was well equipped, and there was a closet of additional items for loan. Our room had ample room for a queen bed and pull out twin chair\/ bed. Though the carpets were worn, housekeeping did an exceptional job of thoroughly cleaning each day. We were warmly welcomed with cool bottles of water. Breakfast buffet every morning, and cold water and coffee and tea were always available. Robert at the front desk had the room decorated for my birthday. I was able to walk about 10 minutes to Whole Foods to stock up on food supplies, and I ended up making-and-taking most meals. Gym downstairs is well-lit and open around the clock. Any time I messaged the front desk through the app, I received a timely response. I will certainly be back!","travelDate":"2023-06","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Overprice, tiny rooms, and unfriendly hotel staff\/management","lang":"en","publishedDate":"2023-06-12","publishedPlatform":"OTHER","rating":2,"text":"Rooms are rather small even for Manhattan standards, and do not quite match the pictures for the same room types show on the hotel web page.\n\nStaff was very unaccommodating and not helpful during my stay, including the management staff, which is surprisingly not even present at the location for most of the day.\n\nThere are much better options for hotels in the same area, and even at cheaper prices, so I am sure I will not be returning to this hotel for my future stays in Manhattan.\n","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Es una mentira el desayuno","lang":"es","publishedDate":"2023-05-30","publishedPlatform":"MOBILE","rating":3,"text":"Bueno, lastima el desayuno. \nEscogí este hotel por la ubicación y facilidades de poder desayunar. Desafortunadamente el desayuno es un completo DESASTRE. No hay alimentos, cuando se acaban nos los reponen. Ni siquiera reponen las bebidas como el café. Un día dijeron que porque estaba muy lleno, otro día, que porque la cocina estaba dañada. En fin, nunca hubo desayuno y si pagamos este rubro dentro de la tarifa. Las habitaciones del hotel son pequeñas pero limpias, sin embargo el precio es elevado si consideramos  que no incluye el desayuno y toca salir a buscar y comprar. Que mala experiencia. Mejor no ofrezcan algo que no van a cumplir. Es una vergüenza","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great value for money! Nice place","lang":"en","publishedDate":"2023-05-29","publishedPlatform":"OTHER","rating":5,"text":"Great value for money! The room was clean, spacious, nice breakfast and the service was very helpful. I would like to mention Ma Marie L at the front desk who gave us extraordinary service. We will certainly come back.","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excellent place to stay. Good size, good location ","lang":"en","publishedDate":"2023-05-23","publishedPlatform":"OTHER","rating":4,"text":"Very nice for a few days stay. Location about 20 mins walk from Times Square. With New York, really  depends where you want to be near to. Subway underground is literally 3 mins walk on opposite street. Room- very clean and cleaners cleaned to a very high standard. Perfect bathroom with new shower and tiles. Very comfy beds. Didn’t try the breakfast, but did use the coffee and tea in the lobby. Room size was perfect in terms of USA sized rooms and staff friendly. Only 1 big negative- lifts are a nightmare. Plan extra time whenever you need to go somewhere. I do question if they switched off 1 lift for cleaners and staff, would it move quicker for guests. Too many cleaners jumping in lifts stopping at each floor whilst guests are inside it. Not good as you get a lot of guests annoyed by it who just want to get in the lift and exit. Other than that, superb stay and would definitely recommend again.  ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Horrible customer service","lang":"en","publishedDate":"2023-05-18","publishedPlatform":"OTHER","rating":1,"text":"I had a reservation for this past Friday night (5\/12).  I wasn't able to go and cancelled on 4\/29 which is well within the alloted cancelation window to not be charged. I woke up on Sat and checked my emails and there was a bill from the hotel and I was charged for the stay.  I called the hotel directly and after being placed on hold for over 10 minutes I was told that I needed to call back at 10 and speak with the mgr.  I called back at 10:10 when I was told \"she was running late\" and I'd need to call back again.  I had to leave for work so I didn't have time to do that.  I decided to call the 800 number for Marriott and have them help me.  The person I spoke with there took all my information and said he could see the cancellation in the sytem and prepared a case to send to hotel.  He told me to check back on Wed, which I did.  When I called back the person I spoke with said that the person who I originally spoke with shouldn't have taken the info as because this was a special rate I needed to deal directly with hotel.  I had to call the hotel's direct number multiple times as they had it routed to reservation line who couldn't put me directly through.  I finally after being persistent reached a woman named Marie.  I told her the problem and she said she didn't see that I had cancelled the room and that's why I was charged.  Funny that the person at Marriott was able to see it but she couldn't.  She was not a pleasant person to talk to as she condescendingly asked me if I had a cancellation email from Marriott (probably hoping I hadn't saved that.) which I had because I save evrything.  She asked me to email it to her, which I did immrediately while I was still on the phone.  I asked her how I would know it was reversed and she said she's email me.  I heard nothing all day after I spoke with her, not even confirming that she had received my email.  This morning I emailed her again (as trying to reach the hotel directly by phone is a task in itself) just asking her if she could please respond to me and confirm that she received my email and took care of this.  The whole day has passed and once again no response.  I called the Marriott 800 # back to enlist their help.  I was put on the phone with a supervisor who agreed they couldn't do anything because it was the type of rate I needed to take care of with hotel directly.  I reminded her that that is why I'm calling because they are not responding to me.  She called hotel directly for me and gave me the name of front desk person she spoke with who said he will bring it to attention of mgmnt and get it resolved, I'm hoping this happens as I have spent far too much time on trying to resolve an error on the part of the hotel.  I understand that mistakes happen but the fact that there was no effort or communications trying to resolve this has me not very happy.","travelDate":"2023-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Comfortable property !","lang":"en","publishedDate":"2023-05-02","publishedPlatform":"OTHER","rating":5,"text":"Very friendly staff.. helpful and pleasant . Cozy room with comfortable bed. Breakfast was good with great variety. Limited seating but we took our food up to our room one of our four mornings as it was busy. We felt very comfortable and safe here . Ideal location just off 8th street.  Close to restaurants, subway, shops and Broadway Times Square area.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Safe & clean - exceeded expectations","lang":"en","publishedDate":"2023-04-19","publishedPlatform":"MOBILE","rating":5,"text":"I recently took my teen daughter on a girls trip to NY and ended up booking this hotel because: we were taking a red eye into JFK and the hotel guaranteed they could store our luggage, this hotel is extremely close to the Majestic Theater where we planned to see Phantom of the Opera, other reviews commented on how safe this hotel felt which made me feel better as a complete suburbanite traveling with a teen, Well this hotel surpassed our expectations entirely! The lobby team was so friendly and helpful - from the very beginning! When we arrived it was Sunday morning so my only expectation was to have our luggage held since it was so early but we were actually able to get our room! Wow! Never had that happen before and it was so appreciated as the teen promptly fell asleep. The room was clean ( I like to wipe down surfaces on arrival). The kitchenette wasn’t something we needed other than using the fridge but I could see how it’d come in handy for a longer stay. Breakfast was a nice bonus and that too was even better than I expected. Each morning they had a rotation that included some sort of hot carb (French toast, waffle or pancake), some sort of meat (sausage or bacon), some sort of egg (tiny egg bites, egg circles) along with other food options like yogurt and oatmeal. Definitely came in clutch but it was best to get there on the earlier side to have the most options although the staff did refill hit items periodically. Safety wise I felt absolutely fine - they do have someone standing at the door mid afternoon onward to let people in (or you could use your card key). The neighborhood wasn’t terrible either as you’re still very much in a touristy area with Birdland across the street and another hotel next door. Thanks for a great stay!","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great location and staff, but needs life support","lang":"en","publishedDate":"2023-04-16","publishedPlatform":"MOBILE","rating":3,"text":"Hotel rooms were small, as expected in the city. Hotel was conveniently located near Time Square. Staff was very friendly. That said, breakfast was simply dreadful. No toaster for toast or bagel, no butter or cream cheese! The hotel room AC was not working in rooms 214\/216 and they were 78 degrees while we stayed which is not comfortable. There was no pantry to purchase even waters. The breakfast area is tiny and likely won't find a free table but given my experience, eat somewhere else. The parking garage to the right was not good, they valet' us and killed our battery and that was a whole other issue. There was no discount for using them and the staff was terrible. \n\nThat said, I could still recommend the hotel on attitude and location alone. The beds were also comfortable and water pressure was solid.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Will definitely stay here again","lang":"en","publishedDate":"2023-04-15","publishedPlatform":"OTHER","rating":5,"text":"Great location, super friendly staff. Robert checked us in quickly and found a room early so we could get out on the town right away. Offered to keep our bags after checkout while we went to lunch. Clean and spacious!","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Ottima posizione per il resto👎🏻","lang":"it","publishedDate":"2023-04-11","publishedPlatform":"MOBILE","rating":2,"text":"Sicuramente si trova in un’ottima posizione 5 min a piedi da Time Square. Per il resto camera piccolissima x 3 persone . Bisognava scavalcare i letti per arrivare al bagno. Non c’era posto per appoggiare i vestiti.Il bagno invece era abbastanza grande. Struttura pulita. Colazione praticamente nulla abbiamo provato a scendere in vari orari dalla mattina alle 7.30 o alle 9.30 c’era solo caffè latte e acqua calda . dicevano sempre che era finito tutto (alle 8.00 del mattino?!)","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Nice hotel in the Theater and Times Square area.","lang":"en","publishedDate":"2023-04-10","publishedPlatform":"OTHER","rating":5,"text":"Right smack in the downtown area with easy access to the Theater District and Times Square. The rooms are small, as expected, and parking is offsite but close by. We were greeted by Robert at the desk and it was a great start to a great stay. Robert was friendly and knowledgeable about the area. He gave us great advice and was just so pleasant to talk to also. I would stay here again as the rooms were clean and nice, albeit small due to the location. It was priced more reasonably than many of the alternatives and was a win overall.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Enjoyable stay!","lang":"es","publishedDate":"2023-04-09","publishedPlatform":"OTHER","rating":5,"text":"Robert el chico de recepción super amable y encantador, todo el tiempo dispuesto a dar buen servicio.\nEl hotel en si es acogedor y está en una buena ubicación por lo que puedes ir caminando sin problemas. ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":13449907,"title":"Decent Hotel \/ Amazing Staff","lang":"en","publishedDate":"2023-04-08","publishedPlatform":"OTHER","rating":4,"text":"My son and I sent 3 nights at TownePlace. The are is good, close to Times Square and public transportation. The hotel itself was pretty good. There were a few issues during our stay. We had to switch rooms almost immediately as we were giving a room with a locked bathroom that was unable to open. The new room’s bathroom dirt worked well, but the lock for the room door had issues. We had to reconnect our keys almost every time we wanted to enter our room. Lots of trips to the lobby and back. The elevator was also out of order for almost a day while we were there too. All of that said, the staff is so kind and welcoming, they made up for the room\/hotel issues. Robert was very friendly and made us feel like family from the moment we walked in the door. If we ever stay at this hotel again, it will be because of the warm and friendly staff.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Amazing Hotel","lang":"en","publishedDate":"2023-04-06","publishedPlatform":"OTHER","rating":5,"text":"We stayed in this hotel after coming over to NYC from England. Robert and other staff were amazing during our stay, doing everything they could for us. They are always smiling, making you laugh, and being a pleasure to be around, on the last day Robert even asked us for help on where he should plant trees outside, he is a character. Breakfast was delicious and room 607 was perfect too. We will be back as soon as we can.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excellent!!","lang":"en","publishedDate":"2023-04-02","publishedPlatform":"OTHER","rating":5,"text":"This hotel is great , well located and the service is awesome. Robert at the front  desk he  is the best!!! He is well experienced on sights\/ locations and customer service , I loved the stay in this hotel 100% recommended ","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Enjoyable stay, nice location ","lang":"en","publishedDate":"2023-03-31","publishedPlatform":"MOBILE","rating":5,"text":"This hotel is located in a great location for our purpose. Steps away from Times Square and on the same street as a train stop so you can get to the underground metro quickly for exploring other places in the area. The day staff ladies were friendly and courteous. Although our rooms were not ready upon check in, the staff did their best to accommodate us quickly and efficiently so we didn’t lose time waiting around. \nThe rooms are lovely and functional. The nice feature at these suites for someone with a child or staying more than one night is the small kitchenette to prepare a baby bottle \/ food for picky children\/ or a meal. No where to sit and eat! The kitchenette is equipped with almost anything you can think of. Forks \/ knives\/ hot plate\/ skillet\/ wine opener! \nBreakfast was included in the room rate. It was a small breakfast area but very lovely. And because it’s not too big , you know it’s fresh because it’s constantly getting refilled. They have an option to make your own waffles. And coffe and tea service all day. \nIt rained while we were there and the staff was kind enough to lend us an umbrella from the hotel. Very conviene when l","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Wonderful 🙆‍♀️","lang":"en","publishedDate":"2023-03-26","publishedPlatform":"OTHER","rating":5,"text":"Wonderful experience, the hotel is in walking distance from everything, nice room with everything is needed, the crew were so nice, especially Robert that was helpful and kind 😇 \nWith any doubts, I will return to that hotel in the next times\nEnjoy 😊 ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excellent !","lang":"fr","publishedDate":"2023-03-26","publishedPlatform":"OTHER","rating":5,"text":"Excellent ! Accueil, serviabilité, emplacement, équipement de la chambre, propret, tout été parfait. Je reviendrais volontiers. Merci à Robert, Modesto et leur très professionnelle manager pour leur aide et la qualité de leur accueil ainsi qu'à tout le reste de leur équipe pour leur professionnalisme et gentillesse. ","travelDate":"2023-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"The heart of Broadway","lang":"en","publishedDate":"2023-03-25","publishedPlatform":"OTHER","rating":5,"text":"Great location and super close to all things Broadway. Rooms are spacious and comfortable. Staff is over and above especially Robert who was able to get in into our room early after taking red eye. Thank you!","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"15 días en NYC ","lang":"es","publishedDate":"2023-03-19","publishedPlatform":"OTHER","rating":4,"text":"Nuestra estadía fue confortable durante las 2 semanas que estuvimos allí. Muy cómoda la habitación, bien la limpieza y excelente Modesto y Robert quienes con su cordialidad respondían a nuestras requerimientos.\nLa ubicación del hotel permite estar cerca de todo ya sea caminando y con transporte público. \nHablan español. ","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Successful NYC trip","lang":"en","publishedDate":"2023-03-13","publishedPlatform":"OTHER","rating":5,"text":"The room was spacious for what I was expecting of NYC. That was a nice surprise. The front desk was super welcoming. Robert was really helpful during our checkout.  I would definitely return here in the future. ","travelDate":"2023-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Nice hotel, even nicer staff!","lang":"en","publishedDate":"2023-03-03","publishedPlatform":"OTHER","rating":5,"text":"Went to NYC with a group of friends and decided to stay in this hotel. I genuinely think this is a great location if you plan on exploring the touristy areas of Midtown and the surrounding areas. Also if you would like to utilize the Long stay style of the rooms (Kitchenette with microwave, mini-fridge, etc.) and enjoy complimentary coffee throughout the day as well as breakfast in the morning. While the rooms themselves aren't anything the write home about (They aren't bad, just not special), the location is top notch and the hospitality from the staff was out of this world!\n\nA 5 minute walk to Times Square, a short walk to the subway entrance, multiple paths from the subway to Grand Central station as well as Downtown, Brooklyn, etc. A jazz club right outside  across the street as well as a Japanese BBQ place (Gyukaku). There are plenty of local coffee places around as well if the comp coffee at the hotel isn't to your liking. There are Broadway shows a plenty in the surrounding area, activities, you name it.\n\nThe best thing about this hotel for me was the staff though. Robert, Andrise and Yarellyn were fantastic staff members that made us feel welcome every time we came in from our adventures! It all started with Robert who, when we arrived, was able to accommodate my multiple requests at arrival and the whole time conversated with us about what were we planning on doing in New York. It turns out Robert was also from my hometown as well! (Small world). Andrise was a bundle of joy everytime we passed, always greeting us and asking if we needed anything at all. Yarellyn was also very social and really made us feel welcome towards the later nights. All three show absolute professionalism when needed but also showed the casual side for fun enjoyable conversation. Not a single person here at this hotel, made us feel like we were not welcome to be there.\n\nIf I return the NYC, I will definitely consider returning to this property! ","travelDate":"2023-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Uma ótima equipe faz a diferença.","lang":"pt","publishedDate":"2023-02-03","publishedPlatform":"OTHER","rating":5,"text":"Só queria dizer que tive uma ótima estadia. A equipe foi incrível - Iara e Weri. A equipe do hoteis.com também foi ótima - Giovanna e Brenda. Pudemos fazer um check-in antecipado e isso fez toda a diferença. O café da manhã não era muito diversificado, mas bom. O quarto com cozinha foi realmente uma bênção. Mais uma vez agradeço a equipe do hoteis.com e TownePlace Suites. Eu retornarei.","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"The staff","lang":"en","publishedDate":"2023-01-09","publishedPlatform":"OTHER","rating":5,"text":"Just wanted to say i had a great stay. The staff was awesome. The staff was great. Just wanted to say thanks to the following staff that made the stay great. Andise , Natasha, Modesto and Yarellyn. These employees were great. And again thank you very much. I will be back again","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great staff but don't stay on 1st floor","lang":"en","publishedDate":"2023-01-09","publishedPlatform":"OTHER","rating":5,"text":"The front desk personnel were so energetic and friendly, asking everyone what they're going to do that day or if they are having a good time in the city. Unfortunately we got assigned the worst room in the hotel, 105. Every person who is in the left tower has to pass by this room and all the others on the first floor to get to the elevator. What's worse is that there is a tiled ramp near 105, so the noisy rolling of suitcases competes with everyone's loud voices to get the \"keep Room 105 guests awake\" award. We also had family on the 6th floor which was super-quiet. Both rooms had sliding bathroom doors with gaps so you could see in from certain angles, which is awkward when traveling with your children or friends. Anyway, breakfast was good and the location great.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Wouldn’t go back …","lang":"en","publishedDate":"2023-01-04","publishedPlatform":"MOBILE","rating":3,"text":"Great location. Well appointed rooms despite being a bit tight for spaces but we expected this.\n\nLifts were terrible. Often waited 15 mins or more to get down- so ended up walking 22 floors most days. \n\nBreakfast was awful. Paper plates, cups and bowls and plastic cutlery. Everything in plastic. Not a care for the environment! Complete carnage too- very difficult to get a table, and huge queues for the toaster. \n\nFront desk service was hit and miss. \n\nWe did have a view of One World Trade Centre from one room and a partial view of the ESB from the other though!","travelDate":"2023-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great place to stay near Times Square and Theater District","lang":"en","publishedDate":"2023-01-03","publishedPlatform":"MOBILE","rating":5,"text":"We enjoyed spending the night here.  We saw Phantom of the Opera, which was about a 3 minute walk from the hotel - so convenient, and so much more affordable than the Marriott Marquis or the Intercontinental.  Service was very friendly at check-in and check-out.  Rooms were small, but had everything you need.  WiFi worked well and was free.  Pull out sleeper sofa was a chair, not a couch, and so slept only one person.","travelDate":"2023-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Sightseeing Christmas Trip","lang":"en","publishedDate":"2022-12-20","publishedPlatform":"OTHER","rating":5,"text":"Myself & my 17 yr old daughter stayed here for 5 nights (13-18 Dec).  We wanted a hotel that had a great location for a reasonable price without any heafty resort fee that seemed obligatory in alot of NYC hotels.  This was perfect!  Location is super handy for Times Square & subway stations (but we tended to walk everywhere).  Room was completely sufficient for our needs, clean, good hot water, comfy bed & small kitchen facilities, we didnt need anymore than that.  The breakfast was ample, excellent selection of cereals, fruit, drinks & selected hot bits too.  There was always hot drinks available in reception.  Thats brings me to reception - amazing staff, always so helpful, happy & accommodating, especially Natasha who was always interested in what we had been up to - we have travelled alot & your staff are some of the best we have encountered!\nSo in conclusion would stay again - definitely!! (2 very happy Brits!)","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"We had a great time staying here. It was super clean. All the staff was great and super helpful. Breakfast was great","lang":"en","publishedDate":"2022-12-19","publishedPlatform":"MOBILE","rating":5,"text":"We had a great time. The hotel was very clean, staff was very nice. We had a room with a kitchenette. It was nice and spacious. We would definitely stay here again. The hotel was close to everything we wanted to do so we did a lot of walking. Breakfast was great as well","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great location","lang":"en","publishedDate":"2022-12-18","publishedPlatform":"MOBILE","rating":4,"text":"Marriott ambassador elite. The best three things about this  hotel is the location, the friendly staff & the price. Downsides : the elevator is SUPER slow. No extra blankets (called for 2 & after waiting more than an hour, called back we received a thin\nduvet cover — definitely not a blanket. We went to Target two blocks away & purchased a blanket. The rooms (711 & 709) were both noisy.  We had heavy rain for 24 hours during over visit & the window in room 711 was leaking.  The room is on the smaller side without a lot of storage but it was fine for two people. No bathtub (shower only!) but the hot water was super hot = pleasant surprise.","travelDate":"2022-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"Experience Third-World Amenities without Leaving NYC!","lang":"en","publishedDate":"2022-12-12","publishedPlatform":"OTHER","rating":2,"text":"First the good:  The staff were lovely and accommodating and well-organized.  Their place of business was not.    We were booked for a five-night stay and checked out after one.  Our studio (described to us as the best in the hotel) was off a warren of tiny hallways,  so OK, because we had a ground level room with a tiny patio--as reserved.  The room itself had almost no light--just two mismatched bedside lamps, that's it--no ceiling illumination (unless you counted the entry hall light which switched off on a timer very  5 minutes).  The kitchenette was well-equipped, with a tiny oval table, presumably to sit and eat--but not a chair in the room., nor was there a coffee table next to the sofa bed (e.g., to sit and eat there).  No drawers to unpack.  An open bookcase-type 'closet', placed to partly block clear access to the (leaky) patio door furnished with two faded lawn sofas.  Bathroom, actually quite nice for a tiny NYC hotel.  And the 'best' part?  Room rate range of $550- $695\/ night.  Who planned this place???","travelDate":"2022-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"TownePlace Suites New york Times square-awesome","lang":"en","publishedDate":"2022-11-30","publishedPlatform":"OTHER","rating":5,"text":"Very comfortable.  Nice and delicious fully cooked breakfast. Nice hotel staff. It had an apartment feel. Nice kitchenette.  Nice solo stove. Beautiful bathroom. We could get seconds of the food. Nice hotel travelers. Loved the fact you can watch internet TV such as YouTube on your TV free and not have to login to your YouTube account from home.","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Love NYC","lang":"en","publishedDate":"2022-11-20","publishedPlatform":"MOBILE","rating":5,"text":"Very friendly staff, great gym. Staff quickly addressed a problem with our reservation and was luckily able to come later needs.. Nicest rooms have stayed in New York City. Breakfast was not that great but there's plenty of delicious places right outside. Even had a patio 😊","travelDate":"2022-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Overall good stay","lang":"en","publishedDate":"2022-11-10","publishedPlatform":"OTHER","rating":4,"text":"We were given an accessible room in the back of the hotel (facing the 43rd st) looking at a construction site. Since we were out a lot, the view didn't bother us, but we were concerned about possible noise. Luckily, it was quiet maybe because we were there on Sat and Sun only.  The room was clean and modern, but the top kitchen cupboards were hung way too low, making it difficult to access the water faucet or coffee maker. Also, the rod in the wardrobe closet was installed so low that there wasn't enough height for jackets or shirts. I assume these are unique to our room as it was an accessible room but I don't know for sure.\n\nThe breakfast was adequate, not great. I'm not a big fan of pre-packaged breakfast sandwiches and such, but I enjoyed coffee and pastries. Also, the dining area was rather small and definitely didn't have enough tables to accommodate the size of the hotel.  \n\nThere were a few minor issues, but overall I liked  the TownePlace Suites. It is a clean and modern hotel conveniently located near Times Square. The room size isn't too bad for NYC and having a kitchenette is special. It's a great choice for anyone who is looking for a mid-range hotel in a great location for sightseeing.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Find Robert when you get there. He’s the best!","lang":"en","publishedDate":"2022-10-31","publishedPlatform":"OTHER","rating":5,"text":"My stay in New York was very pleasant to say the least. I was very happy with the service at the hotel and I can easily say I will make my way there again soon. Robert made everything seamless! He’s the MVP!","travelDate":"2022-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great location and quiet","lang":"en","publishedDate":"2022-10-29","publishedPlatform":"MOBILE","rating":4,"text":"This hotel has a great location, very close to Times Square but far enough so there is no noise in the rooms.  It is very modern and the beds comfortable and bathroom luxurious for a hotel of this caliber.  The rooms are a decent size for NYC but there is no desk or table.  It’s interesting that there’s almost a full kitchen but nowhere to eat.  I did not have the breakfast as it was all sugary carbs and the hot items were Jimmy Dean sandwiches in packaging.  Staff was very friendly and gave me a late checkout. I would stay here again given what you get for the price.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great everything other than elevator","lang":"en","publishedDate":"2022-10-28","publishedPlatform":"MOBILE","rating":4,"text":"Great hotel for the price. Clean and new and in a nice area. The biggest complaint I have though is the elevator. If you leave around 9am and don’t stay above 40th floor, it will take at least 20 minutes to find a not completely full elevator to come down. Management needs to fix it. Either split the four elevators by floor or find other solutions, but definitely frustrating.","travelDate":"2022-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great hotel in great location!","lang":"en","publishedDate":"2022-10-03","publishedPlatform":"OTHER","rating":5,"text":"Booked at the very last minute and was very happy with my stay. Through no fault of the hotels, I had a small issue when I checked in. Robert J was not only very friendly, he was very understanding and patient while he helped me resolve the problem.  Every employee I encountered during my stay was very friendly and welcoming. \n\nAlthough the rooms are small (as most are in Manhattan) it was clean and comfortable. \n\nThe location is a couple blocks away from Times Square and very close to the Broadway theaters.\n\nThanks Townplace Suites team for a very enjoyable stay!  Hope to see you again soon!","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Incredible Staff and  NYC location ","lang":"en","publishedDate":"2022-10-01","publishedPlatform":"MOBILE","rating":5,"text":"We were given a handicapped accessible room. I was sort of okay with it. However, we didn't realize that across the way there would be construction all night long. I didn't sleep well at all. The next morning, I asked the staff if we could please move. I thought for sure they would deny my request. The front desk staff was absolutely AMAZING! Marie, Natasha, Cristal and Robert were the best ever! They kept our luggage safe until another room opened up. It was nice and quiet and I got a great night's sleep! Everytime we went by the front desk staff, they were super friendly. They were very helpful with all of our tourist questions, too. They went out of their way to appreciate us being there! If I ever go back to NYC, I will always stay here!\n\nThe hotel was SPOTLESS as well as our room. Very comfy bed and roomy shower. \n\nThe location was fantastic...just a short walk to Times Square. \n\nJust up the street was Carmines...Incredible Italian food!!!!","travelDate":"2022-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Que du bonheur 😍","lang":"fr","publishedDate":"2022-08-23","publishedPlatform":"MOBILE","rating":5,"text":"Excellent séjour dans cet hôtel. Notre studio était encore mieux qu'en photo !! Chambre spacieuse, lit douillet, petite banquette, kitchenette bien équipée, salle de bains au top 👍 \nLe buffet de petit-déjeuner était toujours délicieux et varié : yaourts, jus de fruits divers, viennoiseries, muffins, cookies, corn-flakes, granola, porridge, fruits frais, graines, fruits secs, gaufres de Liège, gâteaux, barres de céréales... et même des hamburgers ! On s'est bien régalé chaque matin, c'était toujours un véritable plaisir !\nNous avons été chaleureusement accueillis par le staff, toujours agréable et disponible + mention spéciale pour le personnel d'entretien qui fait son travail avec rigueur !\nIl y a une grande terrasse confortable sur le toit de l'hôtel, avec barbecues high-tech à disposition. C'était très appréciable d'y prendre notre dîner le soir après une grosse journée !\nL'emplacement de l'hôtel est parfait, à deux pas de Times Square, du métro, et de nombreuses attractions.\nEn bref, nous avons adoré ces deux semaines au TownePlace Suites By Marriott, et nous en garderons un très beau souvenir. \nEncore merci à toute l'équipe pour son investissement, sa gentillesse et sa bonne humeur 🥰🙏🙏 \n\nCarla & Jérémy","travelDate":"2022-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great staff & location","lang":"en","publishedDate":"2022-08-03","publishedPlatform":"MOBILE","rating":4,"text":"The staff of this hotel and the location of it is great. A special thanks and appreciation to:\nFront desk: Cristal & Robert\nHousekeeping: Juan, Yohanna\nMany thanks to each of you for being such excellent service to my family and I.\n\nThings to improve and what I found Hotels weakness: pictures and descriptions of their room website are deceiving. They are really in need for update on that. \nTheir breakfast area can be bigger and with a little more variety. \nThey should have all day coffee in the lobby area like the majority of the Towneplace suites. \nThe rooms on first floor should have some kind of sound proof so guests don’t hear every sound from outside and the hallway. \nThe sofa bed should be most comfortable and the bathroom can use more storage space and towel hanger. \nThe elevator is slow\n\nIt would help if you have a mini market at the lobby for sale. \n\nYou have a station bear by\nRestaurants \nBroadway area\nTime square","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Très bien situé","lang":"fr","publishedDate":"2022-07-02","publishedPlatform":"OTHER","rating":4,"text":"Chambre petite mais suffisante, propre et avec un coin cuisine. Personnel très sympathique et disponible. Le petit-déjeuner n´est pas exceptionnel mais offert ! Super bien situé a 2 minutes de Time square !","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Good location","lang":"en","publishedDate":"2022-06-15","publishedPlatform":"MOBILE","rating":4,"text":"We were placed on the first floor in NYC and I was afraid of the street level noise but the room faced a courtyard in the back so noise wasn’t a problem! Tiny room and nowhere for hubby to work remotely or place to put suitcases but great location for plays! Decent breakfast too","travelDate":"2022-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Bon hôtel en globalité ","lang":"fr","publishedDate":"2022-05-25","publishedPlatform":"MOBILE","rating":4,"text":"Les points positifs : \n-L’hotel est très propre, moderne et confortable et le personnel est gentil, accueillant et souriant. \n-La localisation est parfaite pour aller à broadway le soir \n-La chambre est assez grande, propre et on dispose de toutes les nécessités, de plus le ménage est fait sans faute tout les 3 jours. \n-Le petit déjeuner compris dans le prix permet de tenir au corps jusqu’au midi\n\nLes points négatifs : \n-Le petit déjeuner est correct mais il est composé principalement d’éléments assez gras et très sucré dont nous n’avons pas forcément l’habitude en france au petit déjeuner même si c’est le jeu quand on va à l’étranger aussi\n-Le quartier, même si bien pour broadway, reste un peu mal fréquenté et on peut se sentir en insécurité parfois, de plus il est très bruyant même si on s’y attend forcément en étant à times square \n-L’ascenseur est vraiment très lent et il faut s’armer de patience \n\nMalgré les quelques points négatifs cela reste un bon hôtel qu’on recommanderait car il n’y a rien de grave ! ","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Average but clean hotel","lang":"en","publishedDate":"2022-05-22","publishedPlatform":"MOBILE","rating":3,"text":"Average hotel in the Times Square area. All of the hotels in the Bryant Park\/Times Square Area were over $400 per night over the dates I needed. Later found out it was NYU graduation. This was only $239. Room was clean and modern with a kitchenette and floor to ceiling windows . No housekeeping services. Bathroom was small with a small sink area, fine for one person.  No desk or chair so not ideal for a business traveler. Had to sit on the edge of the bed to work on this very small end table, very awkward. Request a room away from the elevator. It was very loud and very slow. Front desk staff was super nice. Breakfast was included.","travelDate":"2022-05","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great location and staff","lang":"en","publishedDate":"2022-05-21","publishedPlatform":"OTHER","rating":5,"text":"Stayed in the hotel right after it was opened for the first time and have warm memories. Very friendly staff who allowed us to change our stay dates with a very short notification time. The breakfast selection was nice, room quiet and clean","travelDate":"2021-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Perfect in every way","lang":"en","publishedDate":"2022-05-08","publishedPlatform":"MOBILE","rating":5,"text":"Excellent location if you love Broadway shows and staying near Times Square.  Check in and out was easy and all the front desk staff should be applauded for their nice, friendly demeanour.  Rarely do you see such lovely welcoming staff especially Cristal.  Breakfast was average but great that its included in the price., a rare find in NYC.\nRooms are small but normal for New York.  Clean and modern with enough towels for all.  Great showers which is important to me with lots of hot water.\nI’ll be visiting again, especially with a fair price.","travelDate":"2022-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"There is better out there","lang":"en","publishedDate":"2022-04-18","publishedPlatform":"OTHER","rating":2,"text":"This is a well located and clean establishment, very convenient for theaters and activities. But the whole experience left us wishing we had booked elsewhere. We are accustomed to small hotel rooms in NYC, and for just two people it would be okay, but we got it because it was a \"suite\" with a fold out sofa bed for our 9 year old daughter. First, the fold out was awful. She managed to sleep without complaint, but there is no way an adult could bear the thin \"mattress\" that is the bed. Second, there was construction (jack hammering?) starting at 7 am and continuing until 6 pm everyday but Sunday. Third, when we flushed our toilet, it made a horrible banging sort of noise. When we informed the staff we were told that maintenance would't touch the toilet, told that by the maintenance person who was standing there. A simple \"We'll look into it\" would have sufficed, but they wanted to argue that we were wrong. We were told upon arrival that we only got housekeeping after three days, and I must say that I never once saw any housekeeping staff during the whole of our three days. So no fresh towels, trash emptying, bed making or even checking in. There were plenty of other hotels with similar prices at which we could have stayed, and we now wish we had chosen better. Not much better than a hostel, I'd say.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Bem legal","lang":"pt","publishedDate":"2022-03-18","publishedPlatform":"OTHER","rating":4,"text":"Hotel bem informal !  Localização muito boa, perto de tudo, metrô, restaurantes, mercadinhos e lojas em geral. \nStaff da recepção super atencioso, sempre com boa vontade em ajudar, destaque para o recepcionista Robert que é muito ágil e querido!\nApartamento bem completo, com cozinha completa , com utensílios, papel toalha e até detergente para lavar louça. \nWi-Fi de alta velocidade grátis. \nCafé da manhã poderia ser melhor, falta algo salgado para comer. \nBanho excelente! Janelas com ótimo isolamento acústico. \nTamanho do quarto também é bom.","travelDate":"2022-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Estupendo!","lang":"es","publishedDate":"2022-03-10","publishedPlatform":"OTHER","rating":5,"text":"Muy recomendable. Habitaciones, baños, cocina y pasillos muy limpios. Todo bastante moderno. Te proporcionan toallas y jabones y te limpian la habitación cada tres días. En la propia habitación hay una mini cocina muy equipada. \n\nA pesar de estar en el centro de la ciudad y a cinco minutos de Times Square no había ruidos. \n\nDesayuno disponible durante tres horas, con muchas opciones: Leche, café, zumos, fruta, magdalenas, croissant, barritas, donuts... \n\nEl trato con los huéspedes es excepcional, siempre atentos y tratando de ayudar en todo. En concreto, José Ariel, muy atento y siempre dando sugerencias para conocer mejor la ciudad. \n\nEl único problema es que hay un único ascensor, pero no nos afectó tanto ya que gran parte del tiempo estábamos en la ciudad.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":3,"locationId":13449907,"title":"This is the place to be It was close to everything Close to Penn station to Macy's  The number 1 train down town  is 400 feet to","lang":"en","publishedDate":"2022-03-08","publishedPlatform":"MOBILE","rating":5,"text":"The hotel was in a great location, close to everything near the train station ,close to shopping,  Breakfast was out of this world staff was amazing friendly  Especially loved the small kitchen in the room and 24 hour fitness center The room was very spacious they even had a toaster in the room I'll definitely be back A quick shout to the  hotel staff thank you 😊 ","travelDate":"2022-03","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":13449907,"title":"Good location friendly people","lang":"en","publishedDate":"2022-02-27","publishedPlatform":"MOBILE","rating":4,"text":"The location is excellent if you are going to musicals.\nPlace is very clean, friendly people and price is ok for New York..\nBut construction noise is bad ( we were in South Tower) hopefully it is temporary!\nOther than that, we enjoyed our stay in NY very much :) \nSmall Italian restaurant 2 mns walking very good :)","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Good choice for this neighborhood","lang":"en","publishedDate":"2022-02-12","publishedPlatform":"MOBILE","rating":4,"text":"Overall I enjoyed my 2 night stay. Rate was a deal and the room had a mini kitchen with coffee. The bathroom\/room was bigger than most in nyc and clean. Staff I encountered were very kind. The negative was construction nearby that had a thudding one of the morning’s by 730 AM that even my white noise app couldn’t wash out. The room was also kind of dim, but manageable. Plenty of great food and bars all around. And of course all the shows are in your immediate vicinity.  Good choice for this area.","travelDate":"2022-02","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":13449907,"title":"Don't stay in the \"Cellar\"","lang":"en","publishedDate":"2022-02-12","publishedPlatform":"MOBILE","rating":3,"text":"We stayed in the Marriott for a Valentines weekend outing. The hotel is located near many Broadway theaters and restaurants. The staff was very helpful but the room we were given was on the C (cellar) level. That is below street level. Despite one wall being almost floor to ceiling glass, the room was very dark. There was a patio outside but there were no chairs in the room so we couldn't sit outside. The room did have a kitchenette and a comfortable bed. The free continental breakfast was very good.\nDue to its excellent location, I'd stay at the Marriott again. Just not in the cellar.","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Bien","lang":"fr","publishedDate":"2022-02-12","publishedPlatform":"MOBILE","rating":4,"text":"Petit hôtel extrêmement bien placé à côté de Times Square. Un personnel agréable, souriant, disponible et gentil.\nChambre propre et bien équipée. Le ménage est fait tous les 3 jours mais il suffit de demander pour que les serviettes soit changée et les poubelles vidées,\nLe seul point négatif est le petit déjeuner…. Il est inexistant ! Pas de gaufres, pas de salé, pas de toast…. Des minis croissants, yaourts, café… ça dépanne mais c est pas un petit déjeuner.","travelDate":"2022-02","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":13449907,"title":"Tiny. Unsafe. Unresponsive Staff. Loud","lang":"en","publishedDate":"2022-02-11","publishedPlatform":"MOBILE","rating":1,"text":"People in room next to us robbed. Stuff stolen out of their room. We were kept up ALL night by police investigation.Asked front desk to move. Manager never contacted us. Stopped by front desk 3 times. They did nothing. Unsafe. Loud. Unresponsive","travelDate":"2022-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Pleasant stay","lang":"en","publishedDate":"2022-02-04","publishedPlatform":"MOBILE","rating":4,"text":"Very well located hotel with many stores near the hotel.\nNice and clean rooms and bathrooms.\nAs there was a construction behind the building, it was a little bit noisy.\nAt the lobby, Isaac and Andrise were very helpful when I needed assistance with my bag the day I checked out.\nTotally recommended.","travelDate":"2022-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great service","lang":"en","publishedDate":"2022-02-03","publishedPlatform":"OTHER","rating":5,"text":"Perfect location  very clean , very friendly stuff also Ask for Isaac he took very good care of me , he was very professional , they have a good breakfast with good croissants , fruits , cereals. The room are equipped with microwave no need to go downstairs and you also have a fridge + a strove. The perfect room to feel like home ;)","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great customer service","lang":"en","publishedDate":"2022-02-03","publishedPlatform":"MOBILE","rating":5,"text":"Isaac was amazing, super friendly, very help and polite, great customer service. The hotels rooms are a little small but it very confortable If it is for a couple.  Very comfortable and clean. The ubicación is great, very close to the tourist areas","travelDate":"2022-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Disapointment","lang":"en","publishedDate":"2022-01-17","publishedPlatform":"OTHER","rating":2,"text":"I was booked to stay 3 nights at Townplaces Suites by Marriott in Times Square, however I was informed that the hotel couldn't accommodate  my reservation a few minutes before check-in, and I was relocated to the Hilton Garden Inn.\n\nFirstly, the check-in took about 35min without the agent at the front desk letting me know what was going on, didn't offer water or explanation, when she finally proceeded to check-in kept talking with the colleague next to her ignoring me and my husband. Secondly I booked a room with a King Size bed and we got a tiny room with 2 double beds, nothing was explained at check-in what was included, if we could take water, how the shop worked, nothing at all. Also the main reason to book the first hotel was the kitchenette so imagine my disappointment when I got to the hotel I didn't book and all we had was a small refrigerator. Lastly, I know this is not a luxury hotel but when I simply asked a gentleman at reception where would be the closest location to do a covid test, his answer was \"Oh I don't know, google it\". \nI work at a front desk myself and I know this behavior is not up to anyone's standards.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excellent stay and friendly staff made it happen","lang":"en","publishedDate":"2022-01-11","publishedPlatform":"MOBILE","rating":5,"text":"\"Isaac was an amazing host. He was very attentive to my needs during my stay. He was well informed of the amenities and services the hotel offered. He also pays attention to detail in assigning the right kind of room suitable to my needs. Isaac's approach to his work is an SI unit of hospitality!","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Top!!! ","lang":"de","publishedDate":"2022-01-09","publishedPlatform":"MOBILE","rating":5,"text":"Das Hotel liegt mit seinen wenigen Gehminuten top zentral dem Times Square und sämtlichen anderen Sehenswürdigkeiten in Manhattan zum Greifen nahe. Wir hatten ein Zimmer mit kleiner Küchenzeile, die gut ausgestattet ist (Kühlschrank, Mikrowelle, Kaffeemaschine, 2 Herdplatten, Töpfe, Teller Besteck, Tassen, etc. ist alles vorhanden!), selbst Bügelbrett und Bügeleisen waren dabei. Den Föhn habe ich dummerweise erst am letzten Tag entdeckt, aber es gibt ihn in einem schwarzen Beutel im Schrank :)\nDas Zimmer lag nach hinten heraus und war dementsprechend erstaunlich ruhig. Einzig die Lüftung war mir etwas zu laut, aber das war mit Ohropax schon nicht mehr hörbar. \nDas Personal war super freundlich und gut gelaunt, und das Frühstück hatte im Grunde alles, was man braucht. Es gab Oat Meal mit Toppings, verschiedene Kelloggs mit Milch, Croissants, andere kleine Backwaren, Muffins, Joghurt und Obst. Das tolle ist, dass sogar kleine Lunchtüten dort bereit liegen, sodass man sich noch Verpflegung für den Tag einpacken kann, ohne ein schlechtes Gewissen zu haben! Der Kaffee schmeckt großartig, und auch Wasser und Orangensaft kann man sich dort abfüllen und für den Tag mitnehmen.\nBesondere Corona Regeln sind wie üblich - Maske in der Lobby, im Fahrstuhl und in den Fluren, Impfnachweis wurde abgefragt und Flächen wurden häufig desinfiziert. \nAlles in allem top Hotel und absolut zu empfehlen, für Menschen die Wert auf eine zentrale Lage legen. ","travelDate":"2022-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Isaac at reception rocks it","lang":"en","publishedDate":"2022-01-02","publishedPlatform":"MOBILE","rating":5,"text":"Arrived at 8am after a red eye flight and Isaac went above and beyond to allow an early check in. I didn’t expect it as the check in time is 4pm - he is a very kind individual and puts his guests first. He acknowledges Marriott Status. The property is very centrally located and offers small studios or other room types with a kitchen. It has a grab and go style breakfast and has locked doors which you access with your key for your protection. It’s people like Isaac who make traveling a pleasure and management needs to recognize his professionalism and hospitality.","travelDate":"2022-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great Location and clean.","lang":"en","publishedDate":"2021-12-23","publishedPlatform":"OTHER","rating":4,"text":"Stayed here for our recent trip to New York. A great location if you want to be in the heart of Times Square. Most attractions and shopping are a 5-15 min walk away.  Clean rooms with microwaves, fridge, 2 electric burner cooktops, dishes, and dishwasher.  No daily room cleaning, however anything you need just ask and, they brought to you.  You can't just walk in off the street.  You needed your room key to enter or someone had to let you in. What you expect from a Marriott brand hotel.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great location and service","lang":"en","publishedDate":"2021-11-30","publishedPlatform":"MOBILE","rating":5,"text":"Hotel is awesome!!!Special kudos to Isaac for an amazing service. He ensured quick checking in process and provided great service over phone later. I would recommend him for any hospitality service!!’","travelDate":"2021-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"perfect location; spacious rooms; awesome breakfast","lang":"en","publishedDate":"2021-11-29","publishedPlatform":"OTHER","rating":5,"text":"We stayed here in November 2021 to visit our daughter, who lives in NYC. You simply cannot beat this location because it is close to everything! Easy to walk to Broadway, Central Park,Columbus Circle (and a Whole Foods on the lower level!),  High Line, Upper West Side, and 5th Avenue! It’s a great value for the money, especially with the breakfast buffet. And how fantastic is it to have a kitchen while in NYC! The staff are all wonderful and very helpful. I had a small issue with the room and they went above and beyond to make sure it got fixed. We will definitely book this hotel again for our next trip to NYC! This is now our “home away from home” when we visit the Big Apple!","travelDate":"2021-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great place","lang":"en","publishedDate":"2021-11-25","publishedPlatform":"MOBILE","rating":5,"text":"Isaac and Ross were super friendly and extremely helpful when we needed assistance. Highly recommend. Great location and the room was very clean.  Walking distance to everything we wanted to do and see.","travelDate":"2021-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"November 2021 Vacation","lang":"en","publishedDate":"2021-11-20","publishedPlatform":"MOBILE","rating":4,"text":"Originally we had a reservation for the new Towneplace Suites in Chelsea but it  was canceled a week before our trip so we switched to Times Square, unfortunately ended up costing us $300 more. The location was good. In the heart of the theater district with 2 coffee shops on the street, shake shack on the corner and a ton more restaurants on 9th street. The room is nice, no real closet and a very small(kinda useless) couch. With a kitchenette you would hope for some kind of table but any meals we prepared were eaten on the bed unfortunately. The bathroom is very nice with a lot of shelf space above the toilet and under the sink. Be prepared for an extremely slow elevator and stairs are not a option(we tried taking them down for breakfast but there’s no lobby stairs entrance, goes to the outside in an emergency exit). Breakfast was a build your own bag breakfast; included oranges, a few oatmeal options, packaged croissants and muffins, yogurts and coffee. House keeping comes every 3 days and lastly no luggage holds so if you have a late flight your check out day be prepared to have your luggage with you around the city or head to the airport early. We were able to request a checkout for 1pm but of course is not guaranteed pending reservations. \n\nAirport tip: flew into Newark and the easiest\/cheapest way to get into the city was taking the Coach USA bus. You can buy a round trip ticket for $30 online or pay $18.50 cash to the bus driver and it drops off\/picks up at the Port Authority which is a few blocks away.","travelDate":"2021-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Exceeding Marriott’s Service Standards","lang":"en","publishedDate":"2021-11-01","publishedPlatform":"OTHER","rating":5,"text":"The rooms were clean and comfortable; the service was perfect, and every request was accommodated instantly.  \n\nThese couple of years has been tough on the hospitality business; travel interruptions, followed by lack of help and the mess in the supply chain, have made life very difficult, if not impossible. \n\nThere are very few hotels like the TownePlace by Marriott at 44th Street that, \ndespite all hardships, keep the ship afloat and operate it smoothly. So my hats off to all employees and the management of the Towneplace. They are doing a fantastic job.","travelDate":"2021-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Phenomenal Hotel","lang":"en","publishedDate":"2021-10-28","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here while visiting to see a Broadway play. The rooms were clean and spacious for NYC. The service was beyond phenomenal. José made sure the breakfast area had everything we needed and it was clean. He even stood in the middle of the street to hail us a taxi. The receptionist and all other staff were respectful and professional. Housekeeping found my iPad and ensured it was safe as they waited for me to reply to their email. So, they are also honest people. The location is minutes from Time Square, Broadway, and wonderful outdoor seated restaurants on the opposite street from Time Square. Everything was just superb and we will be back really soon.","travelDate":"2021-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Convenient, clean and quiet","lang":"en","publishedDate":"2021-10-05","publishedPlatform":"OTHER","rating":5,"text":"Stayed here one night on a trip along the East Coast. The bed was comfortable, everything was clean and in good repair, and the ladies at the front desk were pleasant and friendly. No coffee or food available for breakfast, but for $150 in NYC, I'm not complaining.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great place so close to everything!","lang":"en","publishedDate":"2021-07-23","publishedPlatform":"MOBILE","rating":5,"text":"So conveniently located! 2 blocks from Time Square and steps away from subway station. We couldn’t believe how quiet the room was! Small but well organized room with fridge and kitchen necessities. Wilfredo at the front desk was so helpful and made great restaurant recommendations. He was very friendly and always greeted us with a smile. He is exactly who you want representing the company. Breakfast to go was helpful - juice, granola bar, and yogurt. Price was reasonable and we would definitely stay here again!","travelDate":"2021-07","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"Pleasant stay","lang":"en","publishedDate":"2021-06-20","publishedPlatform":"OTHER","rating":4,"text":"I just completed an overnight stay at the Towneplace Suites Times Square and had a pleasant experience. From check-in to check-out, the staff were courteous and polite.  The hotel is located in a convenient location, about 15 minute walk from Penn Station for those traveling via Amtrak. Some services have been suspended due to COVID-19 but should be available again in the near future. The room was comfortable with a kitchenette which was convenient. I would stay again.","travelDate":"2021-06","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Not a good experience","lang":"en","publishedDate":"2021-06-13","publishedPlatform":"MOBILE","rating":3,"text":"The hotel offers no amenities at this time due to Covid. No housekeeping, no food, essentially no reason to stay here rather than an Airbnb. There is one elevator and it is extremely slow. While there is gym access, it is a tiny room and staff constantly come in and out of it as a storage room is used within in. They often leave housekeeping materials in the middle of the gym. I was told by several staff members to move when I was in the gym because I was in their way. There were a lot of suspicious people in the lobby when I was there over the weekend. One woman was drinking out of a full bottle of whiskey and not dressed in a way that I would have been comfortable with children. There was a large group of drunk and high people who came in asking the front desk for a room to party for the night when I returned to the hotel one night. I found the hotel convenient and the room slightly larger than others I had stayed in while in NYC but I would not return to the location as I felt security and lack of amenities were an issue, and there are simply better alternatives","travelDate":"2021-06","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":13449907,"title":"THANK YOU CRIS AND WILSON!!!","lang":"en","publishedDate":"2021-04-28","publishedPlatform":"OTHER","rating":4,"text":"Stayed at this location for a few nights. The room was everything i expected from what i read in the description and pictures. The staff was amazing and always helpful. CRIS was always on point with how she greeted me and was very attentive. checking up on how my stay was going. WILSON was always available and never took long to deliver whatever i needed. Thank you again for making my stay wonderful. I will be back.","travelDate":"2021-04","tripType":"NONE"}
{"helpfulVotes":3,"locationId":13449907,"title":"Closed roof top","lang":"en","publishedDate":"2021-04-08","publishedPlatform":"OTHER","rating":3,"text":"Stayed here for four days.  The room was clean and the staff was great.  Stayed on the first floor but it was a little loud.  Being a platinum member, we asked for an upgrade but they said there were none.  Even though there were rooms with patios not being used.    My biggest pet peeve is that the roof top was closed.   I asked the person at the front desk and he told me because of COVID.  This makes absolutely no sense.  It's 70 degrees out and I'm forced to have a cocktail in my small room.  Even the lobby is closed.","travelDate":"2021-04","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great Service 🤍","lang":"en","publishedDate":"2021-02-07","publishedPlatform":"MOBILE","rating":5,"text":"The moment we arrived, Wilfredo made my mother and I feel so welcome. He was so nice every time I bother him with my mother requests. He is the best! We travel often to NY and this was the first time we stayed at this location and I can say that the service that we received was one of the best. Will be choosing this location again!","travelDate":"2021-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Amazing Staff","lang":"en","publishedDate":"2020-11-27","publishedPlatform":"MOBILE","rating":5,"text":"Checked in on November 22nd.  Ariel and Darren were amazing. Loved our room and especially loved the friendliness and courtesy I received from the staff. I highly recommend this hotel, and when I return in the summer, this will be the hotel I will be staying at.","travelDate":"2020-11","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"Not desireable","lang":"en","publishedDate":"2020-11-23","publishedPlatform":"OTHER","rating":1,"text":"Noisy room at 2 am staff did nothing about it. Finally asked for room change, reluctantly staff made the change at 2 am !!!  Room flooring was buckling. bedcover dirty, carpet stains. You get 1 towel No breakfast as advertised.","travelDate":"2020-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Room was great, staff was nice but didn't feel safe in lobby or elevators","lang":"en","publishedDate":"2020-10-26","publishedPlatform":"OTHER","rating":4,"text":"For the price, this hotel was a great find. It's in a good location a little out of the fray of the major touristy area, but still a lot of great restaurants nearby and easy access to the subway. The room was clean and well appointed (although the smoke alarm was hanging off the wall). The staff was friendly, but one of them didn't wear his mask over his nose and they were not good about asking guests to wear masks so we were in the *very small and very slow* elevator on 2 occasions with guests who were completely unmasked. I would have preferred to take stairs, but there were no stairs that were accessible to the lobby.  \nI booked the room for 2 people, but we were only given 1 towel and 3 pillows. When I requested additional towels and a pillow on my way out to dinner, I was told they would put them in my room while I was out, but when I returned from dinner, they were not there. There is no way to quickly call the front desk from the room and I didn't want to take the elevator yet again to ask for them (and the police were on the first floor handling some sort of situation), so I waited until the morning and got them directly from one of the women who was cleaning the rooms. \nOverall the price was very right and the room was great, but I wasn't impressed with their COVID-19 rules in public places and the staff, although friendly, wasn't responsive.","travelDate":"2020-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Wonderful location at a reasonable price","lang":"en","publishedDate":"2020-10-13","publishedPlatform":"OTHER","rating":4,"text":"This place is only a couple blocks from Times Square and saying here made it a wonderful experience to do all the Times Square touristy stuff.\n\nPROS: Location, Clean Room, Kitchenette\n\nCONS: SLOWEST ELEVATOR EVER!!","travelDate":"2020-10","tripType":"NONE"}
{"helpfulVotes":4,"locationId":13449907,"title":"Overall disappointing","lang":"en","publishedDate":"2020-10-07","publishedPlatform":"OTHER","rating":1,"text":"I wish I could say much positive, but the only positive I could say is that the lady at front desk on 10\/5 was fairly patient and the room is fairly quiet as I hoped. I can understand that due to COVID many hotels cancelled breakfast, but some still offers pre-packaged simplified breakfast while this hotel doesn't offer anything. Also, most hotels would store luggage but this hotel doesn't store luggage nor allow any early checkin, making it difficult to arrange my plan as I had to take my bag with me before I can check in 4pm. Also, I made some requests to have toothpastes, razors etc in Marriott App. There was nothing when I arrived at my room. It took me 3 phone calls and wait 2 hours to get some toothpastes and none of the other requested items like razor ever come. There wasn't an acknowledgement for marriott member at checkin (not that I care so much). The service is definitely lacking overall and not consistent with other Marriott branded hotels. The experience is mostly disappointing.","travelDate":"2020-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Worst hotel experience ever","lang":"en","publishedDate":"2020-10-01","publishedPlatform":"OTHER","rating":1,"text":"A few weeks ago my husband and I  went to New York City city to celebrate my son‘s birthday. When we got back to our room Friday night the people next-door to us were playing loud rap music and talking loudly, yelling all night long. I attempted to call the front desk multiple times and never got an answer. My husband and I were up all night. The next day he went down and spoke to the front desk person who told him that they were many complaints about those people and that they had been spoken to. We were hopeful that Saturday night would be better. We got back to our room at midnight. The same people next-door were playing loud rap music and talking\/yelling\/laughing loudly.... so loudly that we had noise canceling headphones in and it still sounded like they were having a party in our room. We waited until about 1:30 am to call the front desk. They assured us they were sending security. I’m pretty sure that never happened as the noise level never changed it got worse. We called the front desk again at 2:30 and this time I believe they did send someone as I heard a knock at their door, but again the loud music and yelling went on. We finally got up at 3 am and decided to make our 6 hour drive back to Maine as it was evident we were not going to be able to sleep at all. We stayed at the hotel for two nights and were completely unable to get ANY sleep. The lack of concern shown by staff was disappointing.  Not to mention the fact that despite the no smoking signs posted throughout the hotel the entire place reeked.   When we got home I immediately emailed Marriot.  It took 5 days to get a response from the hotel and it was just a generic apology.  We don't typically complain much but did expect some type of compensation given the fact that we paid for a 2 night stay in a hotel and got zero sleep.  Not at all what we expected from a Marriot.","travelDate":"2020-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Nothing more than a roof on top of your head","lang":"en","publishedDate":"2020-09-29","publishedPlatform":"OTHER","rating":2,"text":"Small room, noisy, most unacceptable is I asked for an extra bath towel since there is only one in the room and my fiancé and I were staying. Manager promised to send one but no one ever showed up. What else do you need to know? InterContiental is next door, treat yourself better next time.","travelDate":"2020-09","tripType":"BUSINESS"}
{"helpfulVotes":3,"locationId":13449907,"title":"Great!! and Reasonable","lang":"en","publishedDate":"2020-09-07","publishedPlatform":"OTHER","rating":4,"text":"I have no idea why  some people made bad review .. Oh well Just a luck!\n\nThis was our second time we've stayed within 2 months. The reason? Affordable. Location is great! . Not that we're interested on Times Square LOL\nWe are New Yorker so we know where to go LOL  \nJust convenient to grab grocery at the store and heat up at our room kitchen .\n\nThis time on August 29 and 30th 2 nights  .. Apparently there are 2 side Like so called North tower or south tower :):)\nWe've gotta smaller kitchen compared to the last time   Last time the room was bit bigger so as the kitchen was bigger . So I kinda disappointed but it was great!\nAs woman I just rather to have bigger kitchen LOL No biggy\n\nRoom is clean Bathroom was clean big enough. Staff was good and friendly .\n\nIt was comfortable .","travelDate":"2020-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"AWFUL NIGHTMARE STAY AWAY","lang":"en","publishedDate":"2020-08-19","publishedPlatform":"OTHER","rating":1,"text":"I usually don't leave negative reviews, but it's my duty to do so in this case. If there was an option of leaving 0 stars, I would do so. This place is terrible! Someone smoked marihuana 24\/7 on my floor.  I could even smell it in my room! I am not against marihuana in the least, but at a free-smoke hotel, this is unacceptable.  Also, I understand that due to COVID some things like breakfast and the gym are closed, but there has got to be a way of making up this inconvenience for the customer, but nothing was done.  As I was checking out, I asked if I could leave a small backpack while taking care of some things uptown. The answer was that due to COVID, they couldn't store anything.  Are they invoking COVID to simply cut off every amenity available to their clients? The customer service is awful. Do yourself a favor and get an Airbnb or stay elsewhere. Also, watch out for the predatory parking garage next to it, it is 55 dollars a night (a few blocks away there is another parking garage that only charges 25).","travelDate":"2020-08","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"SCAM. Card charged double and housekeeping disaster","lang":"en","publishedDate":"2020-08-09","publishedPlatform":"OTHER","rating":1,"text":"I just noticed my card was CHARGED DOUBLE the amount when I booked and nothing has ever been cancelled or refunded after that. So I had to make an international call to check what happened. They said there was a glitch in the system and that they charged me for two nights by mistake when I booked for one night. Honestly, not sure how a Marriott hotel or any hotel for that matter, makes such a mistake. If I had not checked my card details, this would have slipped away.\n\nThe room was GROSS. There was a dead bug in the kitchenette, hair in the coffee brewer, the air filter system said filter had to be changed i.e, it's dirty, there were unknown marks (looked like dead bug marks) on the bathroom wall, and the nightstands were sticky with glass marks.\n\nAbsolutely DO NOT RECOMMEND and I definitely won't be back. \n\nThey are clearly trying to recover profits by scamming guests by secretly charging double the amount and cutting housekeeping staff and serving guests dirty rooms.\n\nI wonder if all the Marriott hotels in NYC are like this.","travelDate":"2020-08","tripType":"NONE"}
{"helpfulVotes":2,"locationId":13449907,"title":"Housekeeping Issues","lang":"en","publishedDate":"2020-08-03","publishedPlatform":"MOBILE","rating":2,"text":"We came for a short stay because the rates were great. The front desk at check in was quick and friendly and the location was great. Kitchen was well stocked with cookware and utensils (the microwave was unusually noisy but that’s a very minor issue.) There is also room service through Butler, which we have used before and think are great, so that was definitely a plus.\n\nThe huge issue we had was that there was pet hair everywhere in the room. It wasn’t something we noticed at first, but after dropping an item of black clothing on the rug, it was covered in pet hair when picked up. We then noticed  it more frequently, and even saw it on the nightstand phone. By the time we left after just two nights, we could see hair flying as we shook the blanket out. The biggest issue it raised for us was how well the room was cleaned prior to us arriving. Based on the amount of hair I don’t think it’s even possible that a vacuum was used on the carpet at all. Had we been very allergic to pets this would have been even worse \n\nOther minor issues was that we were two guests and there was only one set of towels in the room, but we were able to get a second set from housekeeping. Additionally, our refrigerator stopped working the afternoon before we were set to check out. Calls to the front desk went unanswered, luckily we didn’t have much in there to go bad but it did leave a small puddle of water on the floor. There was also a dishwasher in the room with no sign of detergent. \n\nAll in all it was a good value for the location. We had thought about coming back and booking a room with a furnished patio but due to the issue with the pet hair, I don’t think we will be back. ","travelDate":"2020-08","tripType":"NONE"}
{"helpfulVotes":4,"locationId":13449907,"title":"Nightmare. ","lang":"en","publishedDate":"2020-07-19","publishedPlatform":"MOBILE","rating":1,"text":"I don’t usually leave reviews. Especially negative ones. This is not meant to bash the property but to warn others like us who might be considering a stay here in the present conditions. The world, and New York, are changed post COVID. We understand that. This property has beautiful rooms, with an equipped kitchen, were able to kindly check us in early, and the staff seem to genuinely want to help, however I think they are not equipped or trained to handle what is happening here.\n\nMy husband and I, in our mid 30s, were traveling from out of state due to me needing abdominal surgery at Sloan Kettering for a rare cancer, and had a week stay here (had never stayed at this specific property prior). We travel to NYC every 3-4 months for appointments, and typically pay $250-300 per night, and the price now including taxes was less than $100, surely because of decreased tourism and increased vacancy. We were surprised to see the hotel full, and wondered who would be traveling? Maybe medical providers?\n\nThe bad: marijuana smell pervasive through the areas we went in the hotel, and also in our room.  We don’t smoke, and the hotel claims to be smoke free. We stayed in the 6th floor. The smell was not only in the hallways, but in our room as well. We could see a haze when we opened the curtain and sunlight came in. Would usually start in the afternoon and into the night, but sometimes as early as 10 am. We had many conversations with the front desk, asking them to address it. They were certainly tired of us calling, we were also tired of having to call. They stated they couldn’t do much about it, they couldn’t accuse anyone of smoking. I asked if they could knock on doors, check for smell, etc. they agreed to call each room on the floor and remind them of no smoking. It actually did help that day, but started right back up the next day. The staff member told us that the fire alarm in the room should go off if they were smoking, unless they had been tampered with. Clearly likely multiple people were smoking, and the windows do open allowing for some of the smoke to go out, but the thought of rooms with kitchenettes having smoke detectors potentially disabled was disconcerting to say the least. We asked to change rooms, they said they could not as they were full. We then noticed the lobby smelled strongly as well as the first floor of marijuana. So strong. But not outside on the street. There is one HVAC unit for the hotel. \n\nThere were also times of isolated shouting and yelling at night, but I had earplugs so that didn’t bother me as much. \n\nThen there were 2 parties on 2 separate nights lasting until about midnight, the worst with probably 15 or so teens or 20 somethings in one room, with loud music. I don’t know for sure, but the desk alluded that may have been broken up. \n\nThere was also very loud music playing from several rooms on our floor during the daytime. \n\nThen on Saturday night the room next to us developed a shouting match between a male and female at 9 pm, and it shook me up terribly. Banging into the walls, screaming, crying. We called the front desk to report the situation and ask for security, they said they don’t have security. I asked if they could call 911, and they said they would send up the houseman to verify our report first before calling. We waited about 5 minutes, all the while the screaming continued, with more bumping and slamming sounds, and the woman said probably 100 times take your hand off me, leave me alone etc. I was genuinely afraid for her safety so we called 911 ourselves, and called to tell the front desk that. The situation continued while I prayed for a safe outcome and we waited for the police. The gentleman from the front desk called to tell me the houseman confirmed our report and the couple wouldn’t answer the phone or door, and they would be asked to leave after police arrived. Eventually around 930 police arrived and everything seemed to end peacefully. \n\nNow on Sunday, the marijuana smell ramped up again, and just before noon the fire alarm went off. \n\nNow, we move into the realm of conjecture. The gentleman at the front desk did tell us that their clientele has changed since the prices of the hotel dropped so significantly, resulting in new issues they have not had to deal with before. My guess is that many of their guests are using this as longer term housing due to the fact that there is a kitchenette in the room. At less than 100 per night including all fees the “rent” for a month at this hotel would be below average rent in manahattan, and also not include steps of background check, deposit, etc. required in a typical apartment situation. The issue comes in that I don’t think the staff here is capable of making the situation here any different. They seem to be understaffed, and frankly, I agree that they should not have to compromise their personal safety to uphold the usual standards of the hotel. But it is jarring to walk into this situation that feels like a flop house. \n\nWhat did we do? We had many conversations with several different front desk staff who genuinely cared and were trying to help, but were not able to bring about any resolution. We also asked for the manager’s information to reach out and see if they were able to help- we were given the front desk manager’s information rather than the GM (not sure if this was by design), and left a voicemail but were told she was off, so when we didn’t hear back from her we were not surprised, everyone is entitled to their time off. We were not given any other recourse after many complaints. Unable to switch rooms. \n\nWhy didn’t we leave? Several reasons. I had just had a 4 hour abdominal surgery. It was difficult to even walk, I was not allowed to lift. We had had $125 of groceries, water bottles, etc. delivered on the first day by amazon. I was unable to help my husband with moving all this to a new hotel, and it wAs too much for him by himself. Also, we are not sure- it may be like this everywhere in the city right now! So we kept waiting it out. \n\nI know management typically responds to these reviews- I don’t want a response! We reached out many times. I don’t want an apology, or a refund, or a credit, nothing. I understand times are hard and maybe they are just doing what they need to in order to stay viable. I just want to warn people- I wish someone had written a review to warn me. I also think they should hire security to assist their staff.\n\nI understand that these things do not bother everyone- is so the hotel may be a good fit. Would definitely not recommend for families with young children or older people.\n\nAll I wanted was relative quiet and for non smoking rules to be enforced, but alas. ","travelDate":"2020-07","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Disappointed","lang":"en","publishedDate":"2020-07-02","publishedPlatform":"MOBILE","rating":3,"text":"Arrived at 4:10 to check in and my room wasn’t ready .. disappointing considering check in was at 3:00.  I waited  30 minutes until my room available... \nthe next morning I was awaken at 1am to the sound of what I thought was my shower,  but after further investigation, there was water leaking out of the light in my shower from the room above me .  I called the front desk then the next morning showed them a video... they didn’t seem too worried.  I was told it was probably from the guest above me showering??  That’s safe huh?\n\nTo top that off, my credit card I only used at the hotel for them to swipe for incidentals was compromised.  I had to cancel it and am now waiting on a new one.   \n\nBesides all that, my room was clean, no complaints there.","travelDate":"2020-07","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Small, but comfy!!","lang":"en","publishedDate":"2020-03-29","publishedPlatform":"OTHER","rating":4,"text":"We stayed in New York before, but the first time in Time Square.  The hotel is perfectly located, despite the COVID-19 period.  We felt safe, the reception desk staff was friendly and helpful.  No breakfast was served, maybe they could have indicated this beforehand.  Will recommend this hotel if you want to be central.  Unfortunately restaurants and shops were closed, but could be an awesome stay.","travelDate":"2020-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Cancellation due to Corona","lang":"en","publishedDate":"2020-03-13","publishedPlatform":"OTHER","rating":5,"text":"Excellent service provided by Maria & Ariel at the front desk! When I called to ask if it’s possible to cancel my booking they were\nsuper friendly and helped me out in this situation. Would totally recommend !","travelDate":"2020-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Tolles Personal, Tolle Lage!","lang":"de","publishedDate":"2020-03-07","publishedPlatform":"OTHER","rating":5,"text":"Wir waren hier um unseren Urlaub zu verbringen. \nDas Hotel war absolut fantastisch, es war sehr sauber, die Lage ist perfekt, das Personal war unglaublich nett, ein besonderes Danke möchten wir an Marie Lowe, Ariel Enriquez und Wilfredo Morales aussprechen, sie standen uns bei Rat und Tat zur Seite.","travelDate":"2020-03","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Perfect stay","lang":"en","publishedDate":"2020-02-22","publishedPlatform":"OTHER","rating":5,"text":"We stayed for two nights after a 19 day cruise. To rest before flight back home to California and to see a broadway show. This is a great small hotel in a perfect location a few blocks from Times Square and near all the broadway shows.  Rooms are small but very comfortable and new. Bed was comfortable and the tiny kitchen was a bonus with refrigerator, microwave and kitchen items like silverware, pots and pans, etc. Very easy check-in and staff was friendly and accommodating. Breakfast in the morning was pretty good with lots of variety. Hot items are an egg dish (not made on site probably reheated omelette) sausage and self made waffles. It was enough to start the day without having to buy anything until lunch. I’d stay here again. Better than the big expensive hotels.","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"A hotel with hospitality in the heart of NY","lang":"en","publishedDate":"2020-02-20","publishedPlatform":"MOBILE","rating":5,"text":"What a wonderful stay we had at the Towneplace Suites. The moment we arrived, Wilfredo made us feel so welcome with a big hello and smile.  We felt so comfortable like home sweet home in your hotel. What a great location by Times Square, the Broadway Shows and fabulous restaurants. We could walk anywhere or get right on a train. The inclusive breakfast area was clean and spacious always filled with items with an array of foods served until 10:30am! Water was available in the lobby 24\/7. Rooms were clean and fresh with kitchen area and space utilized well for Manhattan.Thank you especially to Wilfredo & Cris at the front desk, what amazing guest representatives, outstanding and warm customer service, personality, professionalism, knowledge about the hotel and area you both had. Appreciate Ariel & Marie too! Everyone went & everything was above & beyond during our stay! Great valve, attentive staff and some special moments that we will never forget!","travelDate":"2020-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great staff!","lang":"en","publishedDate":"2020-02-18","publishedPlatform":"OTHER","rating":5,"text":"Upon checking in, there was a technical issue with the electronic key maker. The staff was very courteous and did everything they could to make check-in easier. (also, there's hot chocolate in the lobby :))","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":2,"locationId":13449907,"title":"Прекрасно ","lang":"ru","publishedDate":"2020-02-17","publishedPlatform":"MOBILE","rating":5,"text":"Локация – лучшая. \nЗавтрак стандартный для Америки. Омлет, да вафли. Но всё вкусно. \nНомера небольшие, уютные и с кухней. \nКофе \/ чай всегда бесплатно. \n\nЛучше брать окна во двор, иначе шумно с улицы. \n\nДа свои $ – один из лучших вариантов. ","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Better than we expected!","lang":"en","publishedDate":"2020-02-14","publishedPlatform":"OTHER","rating":5,"text":"Me and my partner stayed here after seeing a great price on booking.com so we changed our reservation to here and we didn’t regret it! We got a lot more than we expected. \n\nCheck in was great, very quick and front desk staff were very helpful. \n\nOnly one lift which was small and could be quite slow but did not bother us as we just used the stairs too. \n\nRoom was fab! Very clean and quiet, bed was on the small side but very comfortable and the pillows were fantastic. \n\nBreakfast for free was a shock, we got a little plate to start our day and if we wanted breakfast out or was in a rush the hot drinks were great to take on the go. \n\nHot drinks were there all day to be had so we made them when we was popping in and out so that saves a few $ also. \n\nWas better than we thought and if we return to NY we will stay again.","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great Hotel In Times Square!","lang":"en","publishedDate":"2020-02-09","publishedPlatform":"MOBILE","rating":5,"text":"I visit the city at least a couple times a year and have stayed in many hotels in the city. I highly recommend this hotel. It had everything we wanted, Breakfast, Refridgerator, Coffee Maker, and being right in Times Square. The hotel staff was very friendly and helpful, and the rooms were quiet. I heard very little of the honking cars outside. I was pleasantly surprised by how affordable the room was, especially with its prime location.","travelDate":"2020-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great staff, great location!","lang":"en","publishedDate":"2020-02-05","publishedPlatform":"OTHER","rating":5,"text":"VERY helpful staff. They checked us in quickly and made a room available as soon as possible (early). The location was fantastic! Just steps from the metro lines and close to many parking options (no onsite parking). The breakfast was great too.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Awesome Hotel, convenient to everything NYC","lang":"en","publishedDate":"2020-02-03","publishedPlatform":"MOBILE","rating":5,"text":"We just left the TownePlace suites and had an amazing experience. First off, the location is excellent and accommodating to everything you’d want to do while visiting NYC. It’s two blocks from Times Square, the port authority terminal, and tons of great food on restaurant row. Secondly, the staff was incredibly friendly, recommending great restaurants\/things to do. In addition, the hotel was clean and had everything you could possibly want (including a nice continental breakfast and iced water\/coffee at all times in the lobby.) The rooms are fully stocked with coffee maker, refrigerator, iron, microwave, etc. Despite our room facing the street it was even quiet in the evenings. We had a great stay and I would HIGHLY recommend TownePlace Times Square NYC to others.","travelDate":"2020-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Perfect spot","lang":"en","publishedDate":"2020-01-28","publishedPlatform":"OTHER","rating":5,"text":"We came up for the Billy Joel concert and decided to stay over and I chose this hotel since it was a Marriott.  I was not disappointed at all. Everything was exceptional.\nSo close to everything in the Time Square area. Easy walking distance to show, resturants, etc.   I highly recommend the hotel","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":2,"locationId":13449907,"title":"Lo justo","lang":"es","publishedDate":"2020-01-27","publishedPlatform":"OTHER","rating":3,"text":"La habitación pequeña. Nueva espacio muy justo. Poco lugar para guarda valijas y ropa. Microondas, heladerita y hornallas ellectricas todo nuevo.\nBaño nuevo y muy bien, justo.\nEl desayuno que estaba incluido era un poco pobre lo malo fue que no reponian rapido ni nada parecido, se acababan las diversas cosas ya que el hotel estaba lleno.\nPero en general la atención amable y el hotel muy nuevo y limpio.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"New Year's Eve @ NYC","lang":"en","publishedDate":"2020-01-06","publishedPlatform":"MOBILE","rating":5,"text":"I spent New Year's Eve here and had a great day. I did go to the ball drop. For those who are going to the ball drop just note that this hotel does not clear the security gates to Times Square. I was hoping it did but it didn't. Nevertheless it is super close to Times Square. And the staff was great. For New Year's Eve it wasn't too crazy being that it's a quaint Hotel. I never had to wait too much for the elevator and the staff for the nicest staff I met in New York on this trip. I stayed in three different hotels during my stay in New York on this trip this one had the best customer service and newest rooms. I stayed on the 5th floor and had a perfect view of the Port Authority Bus Terminal. I Had A Accessible room but I believe it was more roomy because of it. Breakfast was okay I wish they have pork sausage.","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Pour la situation ","lang":"fr","publishedDate":"2020-01-01","publishedPlatform":"MOBILE","rating":4,"text":"Très bon hôtel, idéalement situé (à 1 rue de Times square) Personnel accueillant, aimable. Chambre propre, bien équipé, literie confortable. Point noir concernant le petit déjeuner pour nous français : choix quasi inexistant au bout du 2ème petit déjeuner nous étions déjà à saturation : en sucré uniquement des yaourts et pancake et en salé (quand il y en a ..) quelques saucisses, œuf, cheddar et baggel mais il faut avoir de la chance pour en avoir ... pas assez de place dans la salle pour permettre à tout le monde de s’assoir même en période creuse ! \nEn bref hôtel confortable, propre, avec un personnel agréable mais à recommander surtout pour l’emplacement ! ","travelDate":"2019-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great Location, Great Service","lang":"en","publishedDate":"2019-12-31","publishedPlatform":"OTHER","rating":5,"text":"Location is very convenient to Time Sqaure and Midtown. We booked this hotel since we were returning our rental car while in the citry. This hotel is on the same block as hertz\/National and perfect for convenience. The staff exceeded our expectation of service, especially Marie and Ariel- THANK YOU!\nThe rooms are smaller than other TownePlace properties but that that should be expected when staying in NYC. The facility is clean and wll kept.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Good Location and Staff","lang":"en","publishedDate":"2019-12-09","publishedPlatform":"OTHER","rating":4,"text":"Located right in the heart of theater district.  Also walking distance to Times Square and other Manhattan attractions.  We had a 5pm flight so Ariel and Chris were able to help with a late checkout so we didn't have to drag our bags around on our last day.  They also help print boarding passed since Spirit doesn't have boarding passes on their application.  Wasn't thrilled getting an accessible room but I guess I could have made more of a stink about it since we are both Elite members with Marriott.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Very bad","lang":"en","publishedDate":"2019-11-30","publishedPlatform":"OTHER","rating":1,"text":"We booked our rooms in august. We called over 2 times and tried to check in early. They never told us they were over booked until we arrived at night. Very poor management. Would not recommend and not good customer service.","travelDate":"2019-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Muy Recomendable","lang":"es","publishedDate":"2019-11-27","publishedPlatform":"OTHER","rating":5,"text":"Muy buen hotel, muy buena la limpieza, el desayuno está bien, el ascensor es rápido, la habitación medio chica pero muy completa y lo mejor de todo es la ubicación, para quienes visitan por primera vez NYC como nosotros es un lugar para parar.\nLas chicas de la recepción muy predispuestas y te hablan en castellano. Marie, Crystal y ariel","travelDate":"2019-11","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great Location-Very Accomodating","lang":"en","publishedDate":"2019-11-24","publishedPlatform":"OTHER","rating":5,"text":"Hotel was just as depicted. Nice rooms, great location near Time Square \/ Theatre District. Hotel Desk Guest Services Rep was Phenomenal.  The rooms were clean, beds comfortable and great price of the modern facility and location. Parking next door was self-park, but plenty of spaces and reasonable for NYC @ $52\/night. Hotel room was well equipped, clean, and beds comfortable. Hotel is situated close to many restaurants, Time Square and a short few blocks walk to many Broadway Theatres.  We were heading into the city for an afternoon matinee on Broadway and a 2nd show later that night. Was going to be getting in early @ 11:00 a.m. to do some sightseeing and grab lunch. Contacted the Hotel Desk on the way, spoke to Marie Lowe (Guest Services Rep) hoping to be able to get checked in early. , and she was very accommodating and was able to get us in 3 hours before check-in so we could freshen up for the 2:00 matinee. She also took the time to recommend a restaurant in the immediate area for lunch so we could be close when the room was done. We were in room at 1:00. Great Service and Marie is a fine rep of the Hotel, great employee, always smiling and personable.  I would highly recommend this hotel for reasonable hotel in NYC Time Square & Theatre District area. I would definitely come back.","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"A Very Pleasant Stay","lang":"en","publishedDate":"2019-11-19","publishedPlatform":"OTHER","rating":5,"text":"The room was clean and modern. The front desk staff (especially Marie & Cris) were very friendly -- top notch and greatly appreciated. The hotel is a close walk to theaters and restaurants. We had such a pleasant stay at this hotel. I would definitely visit again.","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":3,"locationId":13449907,"title":"Great location","lang":"en","publishedDate":"2019-11-19","publishedPlatform":"OTHER","rating":5,"text":"Friendly, professional and excellent staff. Room very neat and has everything could need. Being in the city that never sleeps it is not to noisey. Short easy walk from Port Authority bus station. Adequate breakfast, lift can be slow at times but there is warning about that. Sad to leave and would comeback again next time am in NYC. Thank you Cris and Marie for your excellent service","travelDate":"2019-11","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great location!","lang":"en","publishedDate":"2019-11-11","publishedPlatform":"MOBILE","rating":5,"text":"Great location to the theatre district and Times Square.  Nice clean hotel and a decent breakfast included.  All the front desk staff were very helpful, friendly, and accommodating.  Can’t wait to cone back and stay again.","travelDate":"2019-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"The best staffs at Towne Place Suites","lang":"en","publishedDate":"2019-11-11","publishedPlatform":"MOBILE","rating":5,"text":"The location of this hotel is only a few blocks away from Time Square.  The front desks staffs (Marie and others) went out of their way to make my family feel special.  They found the crib for our 11-month old baby.  Great staffs are what make the experience so special.  On behalf of my family, thank you very much!","travelDate":"2019-11","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Bed bug infested","lang":"en","publishedDate":"2019-11-08","publishedPlatform":"OTHER","rating":1,"text":"As a 30 yr.  Bonvoy Gold\/Silver member this is the first time I have encountered bed bugs at a Marriott property.  I found bugs in my bed in Rm. 609, killed a few and took pictures.  I summoned the Head of Housekeeping to my room and she apologized,and said \"she had not personally inspected this room prior ro my visit\".  I accepted relocation to the 4th floor and after surveying the room I killed and photographed 3 adult bugs in room 402.  I met with the hotel day Mgr. and tried to get him to move me to another Marriott, but he did not.  I was assigned room 202, which appeared bug free for my 2 nd night.  I was astonished that my stay was not comped, Mgr. refused to comp both nights, just refunded one.  I have appealed to Marriott Corp and case is pending.  I had to bag and freeze all my luggage for 24 hrs, then launder and dry clean before bring anything into my home...","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":2,"locationId":13449907,"title":"Small Room But Everything Was Nice","lang":"en","publishedDate":"2019-11-01","publishedPlatform":"OTHER","rating":5,"text":"The room was small but the location large. Service was excellent and the location lacked for nothing. It would have been nice if they partnered with a parking location for a discounted rate, but we are out of towners. The lobby was nice and while the free breakfast was standard for the industry the coffee was quite good. No complaints. I'll stay again for short visits to the theatre district.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":3,"locationId":13449907,"title":"Convenient location near theaters & restaurants","lang":"en","publishedDate":"2019-10-13","publishedPlatform":"OTHER","rating":4,"text":"This hotel offers a kitchenette en suite and clean, modern bedroom & bathroom.  There is a good breakfast in the lobby as an amenity.  The staff is friendly.  The location is close to the theater district and to Restaurant Row and other good dining options.  Bus,\nsubway, and taxis are nearby.  My wife and I were happy with our 5 day stay.\nWhat could improve?  There are only 2 small hooks in the bathroom for clothes and no towel rack. No toilet paper dispenser;  do it yourself.  A desk & chair would be better than the small sofa crammed into a corner.  But the room price was fine and we would return.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Disappointing Stay","lang":"en","publishedDate":"2019-10-07","publishedPlatform":"OTHER","rating":3,"text":"This is NYC, so was expecting small, but it is a stretch to call this a suite. Kitchenette would have been nice if we were cooking, but a 3'x2' slab isn't a couch. Worst part was the door latch sound that happened 2\/3 times a minute all day and all night and the paper thin walls. Staff thought that the sound might be the elevator, but didn't really seem to care. Talked to other guests from the 7th floor and they had the same noise issues. The single elevator is extremely slow.  Free breakfast is a bonus in NYC and does save you some dollars.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":13449907,"title":"Nice","lang":"en","publishedDate":"2019-10-06","publishedPlatform":"MOBILE","rating":5,"text":"Clean, modern rooms walking distance to Manhattan Cruise Terminal and all the Times Square restaurants and theaters. Rooms area bit small but the price for that location more then makes up for the size.  \n\nStaff is lovely and there’s a nice complimentary breakfast served daily.","travelDate":"2019-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"One elevator","lang":"en","publishedDate":"2019-09-30","publishedPlatform":"MOBILE","rating":2,"text":"We just returned from an 8 night stay.  It does have a good location- very close to Times Square.  We had a king sized bed- room was small, but the main problem was one elevator for all- housekeeping and maintenance and guests- and very slow, too.  Who builds a hotel with one elevator!!  Breakfast was ok, except many of the guests use it as a meeting place and take up all the seats just to wait on others.  There is no seating in the tiny lobby.  When we checked in, we inquired about using a cab or an Uber and were told they had a cab service they used and it would be no problem arranging a cab for us.  The next morning, we inquired about a cab and were told that was only for service to JFK, and that we could go out and walk a few streets and hail a taxi.  What!!  So if you want any concierge service, this isn’t the hotel for you- it reminds me of a Super 8. Once during the week, there was a newspaper for guests, and once during the week we got a washcloth.  We never got to use the safe in the lobby as it was always full.","travelDate":"2019-09","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Suficiente ","lang":"es","publishedDate":"2019-09-28","publishedPlatform":"MOBILE","rating":3,"text":"Buen hotel, muy nuevo, habitación pequeña pero bien. No hay casi lugar para valijas y ropa. El baño muy bien: ducha, inodoro y pileta. Ok\nDesayuno muy pobre, no reponen rápido ni nada que se le parezca. Nunca hay jamón, y muchos faltantes. Poco espacio. Bien ubicado.","travelDate":"2019-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"A fantastic hotel perfectly located for the visitor to NYC.","lang":"en","publishedDate":"2019-09-20","publishedPlatform":"OTHER","rating":5,"text":"We arrived at the TownPlace Suites after an 18-hour flight from Singapore and a crazy ride in a taxi from Newark Airport in rush hour. We were met by Chris and Marie, without doubt the two most cheerful and helpful reception staff we have ever encountered in 30 years of travelling. They really looked after us and helped make our stay  memorable, as did the rest of the staff. The hotel itself is perfectly placed near Times Square and close to the Subway. We found it the perfect base for our excursions around the city. Our room was excellent with a very comfortable king-size bed and a big bathroom with walk-in shower. Breakfast is great with good variety and quality. We were very impressed with the TownPlace Suites and would definitely stay there again.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"New find","lang":"en","publishedDate":"2019-09-17","publishedPlatform":"OTHER","rating":4,"text":"Here on Business, so not a great location for me, but very much the ideal spot for tourists.  What makes this Hotel stand out is the Staff, always smiling,always helpful and very caring.  Their best kept secret is that there are a few rooms with a Patio, which can make for a relaxing area after a busy day, what makes it even more special it is quiet, away from the noise and bustle of the streets.  Special mention to the Reception staff and Marie in particular who has been very helpful.","travelDate":"2019-09","tripType":"BUSINESS"}
{"helpfulVotes":4,"locationId":13449907,"title":"Average service in a good location","lang":"en","publishedDate":"2019-09-15","publishedPlatform":"MOBILE","rating":3,"text":"This place is relatively new and this might show through some “teething problems” which prevent me from giving a higher rating. Easily fixed ... but someone needs to step up and do it! \n\nThe location is good and price can be very reasonable for NYC. Walking distance to Times Square, with a radius of a block in any direction you have everything you could want - bars, restaurants, fast food, shops, banks etc. Subway Station on the corner gives access to Port Authority buses and trains, and links to Times Square Station underground. Easy to get anywhere in the city from here. \n\nThe reality is this is a budget hotel. A step up from an Ibis or Econolodge but a big step down from a regular Marriott. Don’t expect too much ... you won’t be disappointed ... but be realistic and don’t ever pay full price! \n\nI should also say at this point I am thankful to Ariel for fixing an issue with our booking. The credit card used for guarantee when booked 8 months ago expired last month ... picked up the day before we arrived and we were given the chance to use a different card to get sorted. Thanks Ariel for your help. \n\nThe rooms were small - but functional enough for three of us. Queen bed and single sofa bed in the room. Sofa Bed was not made up on arrival - even though they knew three of us were coming. Kitchenette has all you need as well. Bathroom was clean and functional. Coffee maker in room and ice machine on ground floor. There is no in room safe available at all. \n\nThe two disappointments which drop this from a 5 circle rating to a 3 ... breakfast and housekeeping! \n\nOn three occasions out of 5 nights our room was not made up before 4pm. Makes it hard to come home from a day out and shower before going to a show if no fresh towels etc! They also point out that unless staying more than 7 days, this service is a “refresh” - so things like beds are made but sheets not changed. However, the coffee filters were never checked and replaced - not the sugar, creamers etc. No general cleaning of bathrooms or floors done - just make the bed, swap towels and toiletries by the looks of things. On two occasions, we were in our room in the afternoon and someone from housekeeping simply scanned their card and walked in - without knocking or announcing themselves! Sure ... we could have put the do not disturb sign on the  door - except we needed to be disturbed to get room serviced ... just not so rudely! Simple solutions perhaps - have a sign to put on the door saying “please make up my room” (rather than simply do not knock or pet napping versions!); get housekeeping more consistent and timely ... and knock before entering any room! They are small fixes in the big scheme of things! \n\nThe second lost dot is for breakfast. We experienced the good and the bad. There are not even close to enough sitting spaces for the guests. Maybe remove the tv cabinet and add in four more chairs? Reconsider the use of the big lounges and see if something smaller would work to allow more tables and chairs. There are no options one full - other than return to your room and eat in your bed! \n\nOn some days, there was a lady on duty who constantly cleaned tables, re-stocked supplies and ensured everything went well. These days were a pleasure and that lady is to be commended. On her days off, no-one did this until I had to go and ask them to! This was met with grunts and a general grumpiness ... but is it really too much to ask someone on staff to open the cupboard below and refill the pastries when they run out? Or top up the fruit ... or make fresh coffee as needed. \n\nSimple solution here too ... every morning we watched two or three staff members come in and help themselves to some breakfast. I have no issue with this ... good on the hotel for supporting their workers. I do have an issue when a guy takes the last beagle for himself back to reception but makes no effort to top supplies up for paying guests. When a staff member gets their food, make a rule that they check everything and top up as needed as part of this process. It’s a very easy thing to do .. and would make a huge difference. \n\nI guess to sum up our experience, it gets back to first impressions last. We arrived at 8pm after almost 30 hours of travel with two flight delays. We stood outside the front doors with a back and carry-on each trying to open the doors manually whilst two guys chatted behind the reception desk. It was not until we had almost finished opening the second door that one of them made an effort to show us where the automatic door button was! We didn’t expect a full bellboy service, but seeing three people struggle with luggage and taking your time to assist in showing the trick to the doors set the tone for the stay ... so much potential ... but just comes up short each time! \n\nWe would stay again ... but would warn others not to expect perfection just because you pay a high price ... it is NYC cheap ... but has it limitations too! ","travelDate":"2019-09","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"You Should Stay Here","lang":"en","publishedDate":"2019-09-14","publishedPlatform":"OTHER","rating":5,"text":"We stayed a week at this hotel. It was lovely and clean. The staff was absolutely professional and courteous. We felt they were genuinely happy to see us each time we arrived back from a busy day. I would highly recommend it.","travelDate":"2019-09","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great for business travelers","lang":"en","publishedDate":"2019-09-01","publishedPlatform":"OTHER","rating":5,"text":"I have spent four nights at this great hotel. It’s a small hotel minutes from Times Square. Each room has a kitchenette which is perfect if you don’t wish to eat at restaurants. Breakfast is free with a variety of food. The room is very convenient for a business traveler. It only misses a desk and a chair, yet the lobby has a space if you wish to work on some files. They offer free coffee, tea and hot chocolate all day long. Front desk staff are very helpful specially the front desk manager, I lost my holy book at the hotel and the manager called to see if I am missing it. How brilliant!!! Thank you for a memorable stay.","travelDate":"2019-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":13449907,"title":"A hidden gem in the middle of Times Square.","lang":"en","publishedDate":"2019-08-27","publishedPlatform":"OTHER","rating":5,"text":"I'm almost hesitant to write this review because the cat will be out of the bag on this great property. \n\nI cashed in Bonvoy points for my family to spend 3 nights here this past week. I'm a frequent Marriott traveler and love that they have properties like this that are good for families, especially in NYC. \n\nThe location just cannot be beat- this saved us so much money in transportation costs as we were right in the middle of everything. Even with a young child, I felt totally comfortable walking from the hotel to\/from many activities, day and night. \n\nThe rooms- okay, it's NYC. The rooms here are small. We were expecting that and it wasn't a huge deal. Three of us fit into a standard room (1 queen & 1 pullout sofa) relatively fine. It did require some side-stepping when using the bathroom in the middle of the night but it was workable given that we weren't in the room very much. \n\nEverything was CLEAN and housekeeping made sure we had everything we needed. The kitchenette was a nice touch and made it easier to store leftovers. \n\nThey contract with a company to provide room service, which was surprisingly good and VERY surprisingly affordable. Charged right to the room and fast delivery. \n\nBreakfast was great. It's more or less your standard hotel-issue breakfast, but to be available every day with hours that extend into late morning was a big bonus for our trip. In NYC, that's probably a $50\/day savings for our family of 3. Hot water seemed to run out frequently and on busy days another waffle machine would be nice, but overall very pleased. \n\nWater is available all day long so we were able to keep our refillable bottles topped off. \n\nWe were in the South tower and overall enjoyed it as there weren't many rooms on each floor so waiting for the (single) elevator) wasn't too bad. When it was bad, it was easy enough to take the stairs in this relatively short (for NYC) property. \n\nBut I need to recognize the staff- they are AWESOME. Our son got sick in the middle of the night on our first night, and the front desk staff was quick to send up new sheets\/towels\/bedding and take the old stuff away so that we could all get back to sleep. It was an adventure in an already tiny room but the team made it a lot less of a problem to have to deal with. \n\nI would have no hesitation in staying here again. It made our quick trip very enjoyable and allowed us to do a lot without spending a ton. Thank you and we will be back!","travelDate":"2019-08","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Muy buena elección","lang":"es","publishedDate":"2019-08-10","publishedPlatform":"MOBILE","rating":5,"text":"Hotel muy bien situado (muy cerca de Times Square y del metro). Habitación triple un poco pequeña pero hemos dormido muy bien. Un plus el tener cocina y lavaplatos en la habitación. El personal muy agradable y servicial. Si volvemos a visitar NY intentaremos repetir hotel. ","travelDate":"2019-08","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"Consigliato ","lang":"it","publishedDate":"2019-08-10","publishedPlatform":"MOBILE","rating":4,"text":"È un hotel nuovo e piccolo. Personale cordiale. Le camere sono un po piccole ma hanno l angolo cottura molto funzionale. La colazione non eccezionale ma cmq buona. Posizione centrale a pochi passi da Times Square. Vicino a fermata metro linea A E C. ","travelDate":"2019-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Weekend Getaway","lang":"en","publishedDate":"2019-08-06","publishedPlatform":"OTHER","rating":5,"text":"The staff at the hotel  were friendly and helpful from check in til checkout. I would like to mention \"Aminata\" she  was very helpful in helping us plan our day. Aminata provided us with printed directions  including  which trains to catch,museums and other sites to see along the way. This hotel is in  great location ! It is  nestled on a quiet  side street that is less than a 1 min walk to 8th ave  where all the hustle and bustle of New York City is happening. It is located a  block or 2 from time square. The  subway,resturaunts and entertainment are within walking distance.  The hotel lobby was clean ,they offer  complementary coffee and water all day.  The room was perfectly compacted to meet all your needs including a kitchenette with dishes, stove,microwave,coffee pot and refrigerator.","travelDate":"2019-07","tripType":"NONE"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great location, terrific service, excellent amenities","lang":"en","publishedDate":"2019-08-04","publishedPlatform":"OTHER","rating":5,"text":"I’m not sure I’d want to do an extended stay in such a small room, but otherwise, for a weekend in New York City, this is a find! Though small, the room is comfortable, with a working kitchenette including pots, pans, utensils, coffee, tea and condiments. The bathroom also is small, but has a marvelous stall shower. Wifi is free and reasonably fast, depending on the hour. Free breakfast includes hot and cold food choices, fruit, coffees, teas and breads, rolls, bagels, muffins and cereal. Quite a spread. The staff is absolutely outstanding: friendly, cheerful, helpful (often without being asked). The price is slightly below average for such a good location near Times Square. Highly recommend this place (in fact we just had a friend commit to a 4-day stay based on our enthusiasm during a phone call).","travelDate":"2019-08","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Surprisingly Spacious New Hotel","lang":"en","publishedDate":"2019-07-24","publishedPlatform":"OTHER","rating":5,"text":"The rooms was much more spacious than I expected. The kitchen area was well stocked and immaculate. The bathroom was well lit and also very clean. Room was surprisingly quiet, considering it's location. Fast WIFI and quiet and effective AC. All the employees at the hotel that I encountered were friendly and helpful","travelDate":"2019-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Independence Day Getaway","lang":"en","publishedDate":"2019-07-23","publishedPlatform":"MOBILE","rating":3,"text":"We decided to stay here for one night after returning from the Hamptons.  The location was very convenient to restaurants and theaters.  We were able to walk to dinner, Times Square and our Broadway play.  However, the rooms were too small and the bathroom was tiny.  The hallways were also narrow and the elevators were slow.  \n\nWe will likely choose another property that has a convenient location but with bigger rooms and bathrooms.","travelDate":"2019-07","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"This Is Why I Am Loyal to Marriott","lang":"en","publishedDate":"2019-07-20","publishedPlatform":"OTHER","rating":5,"text":"I contacted the TownePlace Suites via the Bonvoy App to ask a few questions because our arrival.  Marie was so patient and helpful with all of my questions (I had several).\n\nWhen Delta canceled my flight the night before we were suppose to arrive, I sent Marie another message and told her about the situation.  She helped me so much by telling me not to worry that they would take care of me.  They wouldn't charge me for the room if I wasn't able to arrive but they would have one for me if I was able to arrive in time.  There was so much in the air and Marie just helped me so much with my stress level because it was one less thing I had to worry about.\n\nUpon my arrival to the hotel, Michael provided me all the necessary information (even though it was 1:30 a.m. and I just wanted to go to sleep).  He was friendly and knew about my conversation with Marie.  He was kept up to speed about my situation and welcome my daughter and I to the hotel.\n\nThe next morning we were able to meet Marie in person and she was so friendly and down to earth.  She checked my reservation to make sure everything was correct.  I had some problems with my initial room and she quickly offered to have me change rooms.  She gave me plenty of time to switch and made sure my stay was comfortable and I was happy with everything.\n\nMy daughter and I then enjoyed breakfast and met Aminata who was also amazing.  She was so friendly, started brief conversations with us, assisted us when we needed something, etc.  She was so great and was such a friendly spirit to start our mornings off with.\n\nWe stayed a week and I would definitely consider returning to this hotel just to see these friendly faces again.\n\nAlso, the hotel is so close to Time Square - it's within walking distance.  The subway entrance is only 400 ft away and extremely convenient.  There are grocery stores (Whole Foods, Food Emporium), great restaurants, and dessert places nearby.  If you're going to see Frozen, the theater is on the same street!  Aladdin in just a couple streets over.  We're in the Theater District so it couldn't get any better and more convenient.\n\nOne thing - the rooms are TINY!  I went only with my daughter and we barely had enough space.  There isn't much closet space and no where to store your luggage.  The fridge is a mini fridge but it was sufficient.  Counter space is limited.  Ask for a room that isn't a corner room.  I think there may be larger rooms on the ground level (C1 or C2).\n\nThank you, TownePlace Suites for such an amazing stay!!","travelDate":"2019-07","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great location, clean hotel, fun rooftop","lang":"en","publishedDate":"2019-07-18","publishedPlatform":"OTHER","rating":5,"text":"Perfect location for anything you would want to do in the city. Within minutes walking distance to Broadway shows, within minute walk to subway station 42nd st subway station. The rooftop just opened up and has a nice lounge area with 2 grills you can cook on! Just ask the front desk for utensils to use. The doors were also open to walk along the roof to other locations other than the hang out area. We had a nice night-cap overlooking the city while the blackout happened last weekend. Breakfast was average complimentary hotel breakfast, but had great coffee! Would definitely stay here again","travelDate":"2019-07","tripType":"FRIENDS"}
{"helpfulVotes":1,"locationId":13449907,"title":"Excellent location !","lang":"en","publishedDate":"2019-07-16","publishedPlatform":"OTHER","rating":5,"text":"Close enough to Times Square and theatres, just far enough away from the noise and hustle.  Stayed here for 3 nights and were very happy with our stay, The hotel is fairly new (opened this year I believe) and although the reception area isn't very inspiring, the hotel is nicely furnished and decorated. Our \"suite\" was below ground level at the front, but had it's own little open air courtyard at the back. The room itself was comfortable with a very well equipped kitchen, good TV and wifi, and excellent air conditioning.  There's a lounge\/breakfast room at the front of the hotel where a free budget breakfast is provided, with a changing menu every day. This hotel also has a roof terrace which sadly, was closed for maintenance while we were there.\nThe reception staff were without exception, friendly and helpful. The only criticism I have of this hotel is that there is only one (very slow) elevator, and often we would just walk down the stairs rather than having to wait. That aside, for a short stay in the centre of NYC, this is a great choice and I would happily stay here again.","travelDate":"2019-06","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Prime location; and a just lovely staff","lang":"en","publishedDate":"2019-07-14","publishedPlatform":"OTHER","rating":5,"text":"From the moment that I walked in and was greeted warmly by Yelissa; and subsequently helped by Marie--the stay could not have been more positive.  They were most gracious in working with me with my early arrival.  This hotel is located conveniently in the theatre district; this is why I chose it.  It was very easy for me to walk everywhere.  I was there specifically to see shows; fine dining and visit.  This is why people select the Times Square sea; For breakfast, I trotted up to my most favorite bagel store on 51st and third; but, enjoyed the TownePlace coffee and their flavored creamers.  Every member of the support staff was kind and friendly; and I am only sorry that I did not ask everyones name as I moved throughout the hotel to give further recognition.  My suite was clean; had everything I needed.  This will be my new go to hotel when in NYC.","travelDate":"2019-07","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":13449907,"title":"Super hotel with a couple of serious service flaws","lang":"en","publishedDate":"2019-07-09","publishedPlatform":"OTHER","rating":4,"text":"We stayed at this hotel for one night while in NYC to attend a Broadway show. The front-desk personnel were superb, the public spaces and sleeping rooms were modern and spotless, and we slept wonderfully well on the comfortable beds. Unfortunately, two issues marred what otherwise would have been a first-rate stay. The first is that the hotel's wifi never worked, even in the public spaces, The second is that, 45 minutes into the breakfast period, the egg dish, some of the breads, and the coffee had already run out. Eventually they were replenished, but there was no coffee for nearly 30 minutes and no eggs for at least an hour -- and this despite our notifying the front desk. It was the most poorly maintained breakfast area of any such hotel my husband (who travels for a living) and I had ever encountered. If the hotel corrects these details, then I'd recommend this property wholeheartedly. Great location.","travelDate":"2019-07","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Poor breakfast","lang":"en","publishedDate":"2019-07-07","publishedPlatform":"OTHER","rating":3,"text":"Had slightly mixed feelings about this place. It's ok if you want somewhere really central and close to Times Square - which means it's busy and noisy - but the space and lifts are inadequate and breakfast really poor.\nMy room was ok, with quite a lot packed in such as a coffeemaker, fridge, iron and board, but no safe which to my mind is an essential requirement. I asked at reception to use their safety deposit boxes but they were all in use! My room was at the front, so it was quite noisy at night with traffic and other street noise. But the room was comfortable with a tiny sofa and a firm mattress on the bed. The bathroom was compact and very clean.\nBut limited space in the hotel meant a very limited breakfast selection and insufficient seating. Nothing gluten-free was on offer, so I had to make do with some pretty strange pre-cooked meat and egg items and tea.\nThe lift always took forever to come and was obviously inadequate for the size of the hotel.\nThe promised same-day laundry service actually took 24 hours longer than promised and was the most expensive I have ever used anywhere in the world.","travelDate":"2019-06","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great location","lang":"en","publishedDate":"2019-07-01","publishedPlatform":"OTHER","rating":2,"text":"I stayed at this hotel for 11 nights in May- June. \nI was not impressed with the hotel. Breakfast was terrible! Plastic plates, fork and knives, no fruit at all. Not much to choose food to choose from. \nThere was no safe at the room witch I think is important. \nThe cleaning of the room was not hygienic at all. For 11 nights my bedclothes was not changed once. The bathroom was dirty and the shower terrible! \nMost of the staff was was polite and helpful, but some of the people working in the reception didn't even greet when I meant them. \nWhen I visited the rooftop was not ready and I wasn’t allowed to go up there. \nThe only thing great about this hotel was the location. \nI will not be staying here next time I visit.","travelDate":"2019-05","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":13449907,"title":"Mostly Good","lang":"en","publishedDate":"2019-06-18","publishedPlatform":"OTHER","rating":4,"text":"The hotel is virtually brand new and the location is excellent.  There's a subway entrance just down the street, and Times Square and numerous broadway theaters are within easy walking distance.  All of the hotel staff that we encountered were extremely nice and helpful.  The breakfast options were good, but the breakfast area is relatively small and seating is limited.  The bed in our room was comfortable and the bathroom and shower are very nice, although the shower is a bit cramped.  I didn't care for the room layout, though, which made the room seem even smaller than it already is.  We had a 1 king studio suite, which is basically just a narrow hallway that ends in a bedroom that has a cramped feel to it.  The kitchen area runs along the side of the hallway, which is really only wide enough for one person to pass through at a time.  There's no desk other than a small nightstand and small circular table in the corner of the bedroom, so there's no good place to set up a laptop if you're a techno-dinosaur like me.  I ended up using the ironing board as a laptop desk while sitting on the side of the bed.\n\nThat said, I'd still rate the overall value of the room as very good considering the location, cleanliness and convenience of a kitchen area with dishes & utensils.  We would certainly consider staying again if we ever return to NYC.","travelDate":"2019-05","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Good Room, Great Location","lang":"en","publishedDate":"2019-06-05","publishedPlatform":"OTHER","rating":5,"text":"Towneplace Suites is in a great location, just off 8th Ave in the theater district.  The room is small with an enormous kitchen (why?) but it is new, stylish, clean and comfortable with a good bathroom and walk in shower.  The hotel is close to theater district restaurants as well as the abundance of restaurants in Hell's Kitchen on 9th Ave.  They have a generous complimentary breakfast .It is also near multiple transportation options.","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excellent experience!","lang":"en","publishedDate":"2019-06-02","publishedPlatform":"MOBILE","rating":5,"text":"Absolutely loved our stay here. Our room was spacious (not much of a view though) had a mini kitchen complete with refrigerator, stove top, coffee pot, plates and cooking utensils. Included a smart TV that had hulu and Netflix access. Large heavy shade that went down for total darkness. The bathroom was large with a fabulous shower. Maria at the front desk was friendly and extremely helpful with everything that we needed. There is a continental breakfast included with the stay. Coffee, tea, a selection of cold juices, cereal, bagels, fruit, waffles, eggs and more. There is limited seating to enjoy it but we just took it back to our room. Location is close to everything you could possibly want. We were able to walk to central park and times square. Subway is close to take you to the rest of the city. There are a lot of restaurants, pharmacies, liquor stores and gift shops also in walking distance. Highly recommend this hotel and would definitely stay there again!","travelDate":"2019-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Fantastic Stay","lang":"en","publishedDate":"2019-06-02","publishedPlatform":"MOBILE","rating":5,"text":"We were in NYC to see family and see a show.  Incredibly friendly staff, room wasn’t ready when we arrived but we were very early.  We checked bags and went about our day.  Got a call when our room was ready.  Ready very early.  Adequate breakfast.  New room and very quiet.  Fabulously located near shows and Central Park.  And last but not least, an incredible price.  Would love to come back in the future!","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Great location ","lang":"en","publishedDate":"2019-05-21","publishedPlatform":"MOBILE","rating":5,"text":"This hotel only opened in November 2018 and is so well situated 2 blocks from the hustle and bustle of Times Square. Friendly staff , Comfortable clean room with kitchenette, smallish bed I would say maybe a queen at most. Fab breakfast provided basic but it’s all you need to start your day. Turn right out of the hotel and there is a subway station on the street corner, which has access to most lines. A great New York pizza place ,shake shack, an Irish pub all in the way to Times Square . Turn left out of the hotel ,2 Nice coffee shops and then fantastic Italian restaurants , so you don’t need to venture far for food. There is also a fantastic laundry drop off service on the street opposite the hotel which we utilised with same day pick up !! Extremely handy for those travelling on to other spots. ","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Not awful (for a NYC hotel)","lang":"en","publishedDate":"2019-05-20","publishedPlatform":"OTHER","rating":3,"text":"Small rooms and ridiculously slow elevator (just the one elevator!) but that's typical for NYC hotels. Lots of little problems...room not ready after check in time, noisy employees in the hallways, housekeeping knocking on doors when they shouldn't be. If you get a room on the C level (one level below reception) you will constantly be hearing employees talking and doors opening and slamming EVERY.THIRTY.SECONDS. I had an upgrade and it included an unusable patio (no furniture, no view)...??? But, in NYC it is hard to get a hotel that has it all unless you want to spend $400 a night or more. Front desk staff very friendly I will say that. Also location is great!","travelDate":"2019-05","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":13449907,"title":"A comfortable week","lang":"en","publishedDate":"2019-05-19","publishedPlatform":"OTHER","rating":4,"text":"I recently stayed here with my wife for a week. We were visiting NYC for the first time from the UK and got a good deal on the room rate for this hotel. \n\nIt is in a great location. Close to times square. There is also an entrance to the subway only 30 seconds walk away. There are plenty of good restaurants close by. Mama Mia is worth a look and so is bare burger. \n\nWe had a room in the main building which faced the road. We were on the 6th floor and we could hear the road noise. This could be a problem if you are not use to noise. Drivers in NY like to use their horn at all times of the day and night for very little reason so this can wake you up. There is also a fridge in the room which makes some noise. \nNone of this bothered us after the first night. With all the places we went and things we did we were so tired at the end of the days we slept well. Also make use of the stairs. Its easy for going down to the lobby and as there is only one lift it is often quicker to walk down the stairs than wait for the lift. \n\nThe breakfast is decent. It is best to get down there earlier. A couple of times we went down about 8.30 and it was busy but we still managed to get a seat. \nThe only downside really is the fact is that all the stuff used for breakfast is disposable. Not obvious if they recycle anything. That could do with being looked at! \n\nThe breakfast items were kept stocked up so never had an issue getting anything. \n\nAll the staff were very helpful and could answer any of our questions. \n\nI would happily return to this hotel in the future.","travelDate":"2019-05","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Waited but worth it","lang":"en","publishedDate":"2019-05-13","publishedPlatform":"MOBILE","rating":4,"text":"This hotel is worth the stay. Who would've guessed all three Disney broadway shows were in the same area. Breakfast was decent and it was near a subway station. Bonus. So why a 4? Well elevator was slow and our room was not ready at all and didn't get in till 4pm. Also I dont believe I booked a disabled room. I was given one. I used points so maybe it was whatever was opened. Room was small. All that didn't matter. Will stay again.","travelDate":"2019-05","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"Great hotel, amazing staff","lang":"en","publishedDate":"2019-05-11","publishedPlatform":"OTHER","rating":5,"text":"This is a small but mighty hotel. New in November, 2018, it is clean, offers breakfast and warm afternoon cookies and is conveniently located just steps from the 42nd Port Authority Bus Terminal. We stayed for a week and everything was perfect. Love, love, love the staff who made our stay even better. They were so friendly and helpful. Aminata and Crystal kept the breakfast area spotless, inviting and well stocked. Front desk staff Brandon, Chris and Michael, and security guard Jimi went above and beyond to make us feel welcome and well taken care of.","travelDate":"2019-05","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Walk on by","lang":"en","publishedDate":"2019-05-10","publishedPlatform":"MOBILE","rating":1,"text":"This is a very weird, un-hotel like hotel.  That picture of the lobby is nothing like it looked when I walked in.  It must be a stock picture as are the photos with 2 queen beds. They have no rooms with 2 beds at this property.  We were send down a weird skinny hall on the first floor to our room that had a patio.  It felt more like an alley than a patio.  Don’t patio’s have furniture?  None at this one.  The lock was not operating properly on the door to the weird patio and I was very uncomfortable staying there overnight.  In fact, before we ever used the room, I went back to the front desk and asked if they would let me leave without penalty because I did not feel safe there.  I am a 40 year customer and I assumed they would let me go with no penalty but they did not so we stayed one night and cancelled our next 2 nights.  We are now in a lovely, much less expensive room at a property about 50 feet down the street.  Much better.  Marriott may have lost a long time customer in me.  Disappointed is not a strong enough word to describe how I feel about this property,  and now, about Marriott’s in general.  Thumbs down!","travelDate":"2019-05","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Good hotel stay!","lang":"en","publishedDate":"2019-05-05","publishedPlatform":"MOBILE","rating":4,"text":"We stayed here 5 nights and enjoyed this hotel.\nWe were upgraded to a room with a small patio but it was quite useless to us as there were no furniture there ( yet). So eventually we got an accessible room was spacious and comfortable . The room has a small and well equipped kitchenette and a very small round table BUT there are no chairs in the room so this is again all useless because where can you eat? On the bed...?\nThe room was kept very clean all the time.\nThe breakfast buffet gets very hectic in the morning. The main problem is lack of tables ( one might consider adding foldable tables during breakfast hours). The buffet itself has a nice variety to chose from and was well maintained all the time by the very friendly Aminata.\nLocation: the hotel is centrally located -within minutes walk from Times Square (and so it is quite a busy area all the time), numerous restaurants all around.\nThe staff was very friendly and attentive. We were offered car service to the airport that was much cheaper than all other options and was on time with a great car.\n\n","travelDate":"2019-05","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":13449907,"title":"Where are the chairs?","lang":"en","publishedDate":"2019-05-04","publishedPlatform":"OTHER","rating":5,"text":"First, I have to say that I loved this little hotel.  The staff was wonderful and so helpful with suggestions on where to go and directions on how to get there.  They also called a cab when I was ready to leave which I really appreciated.  (Last year, at the Hampton Inn, they sent me out to the street with my luggage and told me to flag one down on the corner!)  Also loved the chocolate chip cookies offered every afternoon - yum!  Be sure to look for the secret doors that will take you directly out to the street.  Much quicker than waiting on the slow elevator.  The two things I didn't like was the squealing in the pipes or fan (not sure which) that would come and go.  Also, where are the chairs?  There was a nice patio outside the room but no chairs to sit out there.  And there was no chair in the room which made the small table pretty useless and I had to stand or sit in the bed to eat.  Hope this will be remedied because I REALLY liked this place.","travelDate":"2019-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Very Clean - Great Location - Cozy Suites","lang":"en","publishedDate":"2019-04-30","publishedPlatform":"OTHER","rating":5,"text":"This is a great little hotel.  We were in NYC for 6 days and this was the perfect location.  It's 2 blocks from Times Square, a couple blocks from most of the main Broadway plays, and better yet, has a large subway station on the same street for easy access across NYC.\n\nThe suites are small, but most are in NYC unless you want to pay way too much money (frankly for space you don't really need).  It was perfect for our trip, as it was just my wife and I.  The hotel is among the cleanest I've ever been in, and I travel a lot for work.  The staff are excellent.\n\nThe location, cleanliness and friendliness of staff really made this a near perfect hotel stay for 6 days.  The only heads-up I would give is that the mattresses are firm, and had I","travelDate":"2019-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excellente situation","lang":"fr","publishedDate":"2019-04-12","publishedPlatform":"MOBILE","rating":5,"text":"Nous avons passé un excellent moment dans cet hôtel. La chambre était magnifique avec un immense lit, petite cuisine bien équipée, salle de bain fonctionnelle et spacieuse. Le petit + de la chambre : la petite terrasse privative car nous étions au -1.\nLe petit déjeuner est vraiment varié et délicieux, nous avons pu manger à l'Américaine tous les matins.\n\nPetit bémol : le personnel n'est pas multilingue, donc, des difficultés à se faire comprendre.","travelDate":"2019-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"No Rooftop Patio Yet","lang":"en","publishedDate":"2019-04-08","publishedPlatform":"OTHER","rating":3,"text":"The main reason for bringing family to this hotel for their first trip to NYC over the AC (which we love), was the idea of their BYOB rooftop patio.  Unfortunately, we found out that it has not yet been completed despite it being advertised on their website.  This may sound minor, but we could've stayed at the AC for about the same price (on this trip, including parking), which we feel is nicer hotel overall with a great rooftop lounge and restaurant.\n\nNot the fault of this Towneplace, but valet parking at the AC was less expensive than the \"self park\" garage closest to this Towneplace location.  ~$80 w\/ tips vs $134 for ~28hr (SUV) at both.  I'd suggest finding another garage, because we witnessed one driver spin the tires of a Camaro 4 different times as we waited for them to bring ours.  Just imagine what is done when people aren't standing around watching them move vehicles.. \n\nComplimentary breakfast was very basic, but similar to other Towneplace locations that I've stayed.  More pull up tables needed, and people were waiting for staff to restock certain items.  It was incredibly crowded the on the Sunday morning we ate there.  It still adds some value to the hotel.\n\nRooms are on the small side, but clean.  Material choices are generally nice, but we did have a couple problems with our room (shower doors couldn't contain all of the water, and sliding barn door fell part way off).\n\nGood location, with many food choices within two blocks.  Value added.\n\nStaff was exceptional.  Value added.","travelDate":"2019-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"excellent service","lang":"en","publishedDate":"2019-04-06","publishedPlatform":"OTHER","rating":4,"text":"arrived late at night for a reservation that we booked through Airbnb only to find out that this property did not do business with Airbnb and that our host scammed us. The night manager Daniel was exceptional in his efforts to first contact Airbnb on our behalf, then finding us room in another hotel since they were fully booked. As we waited, several other guests arrived, and other hotel occupants who had requests, and all were taken care of in a friendly and efficient manner. Even though we did not stay in this hotel, we have all praise for the staff that was there that evening who went out of their way to make our visit to NYC a pleasant one. And the hotel Daniel found for us (also a Marriott property) was very comfortable and similar in price and still within close proximity to all the attractions we wanted. Thanks Daniel (and Barron too)!","travelDate":"2019-03","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Very Comfortable Stay","lang":"en","publishedDate":"2019-04-06","publishedPlatform":"OTHER","rating":4,"text":"Stayed here for 5 nights at the end of February. The hotel is new so the rooms are very clean, comfortable and modern, so very happy with that. Room size was pretty good, obviously not a huge suite but very spacious by NYC standards. Thee kitchen area was useful and with a refrigerator we could store food and drink too. Free wifi, and TV connects up to Netflix if you want to. Bathroom modern and nicely designed.\nOur room was in the basement, and was probably an accessible room. It was next to a very well equipped fitness room that I used regularly whilst there.\nAs others have mentioned, there are a few issues with the breakfast area in that it is way too small, and it seemed quite often that the food and coffee had temporarily run out. It won't spoil your stay but they really should deal with it. The food quality and variety is good that said.\nLocation wise, it is really close to Times Square and Port Authority Bus Terminal. The Subway entrance is at the end of the block so perfect location if you want to get away from midtown. Loads of eateries nearby.\nWe found all the staff really helpful and very sociable. They are an asset to the hotel.\nNormally i would stay at Hilton properties but thought i'd try Towneplace as there was a deal on. Overall i was impressed and i will definitely look to stay here again when in NYC.","travelDate":"2019-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Perfect for NYC Home Base","lang":"en","publishedDate":"2019-04-01","publishedPlatform":"OTHER","rating":5,"text":"Just returned from a theater weekend in NYC.  This hotel is the perfect location for the theater district and mid-town.  We walked as far south as 30th and as far north as 65th.  Only took the subway once - half block away.  The room is small, but very well laid out.  Had a king room on the 6th floor in the backside of the south tower.  Very quiet.  The oversized chair hid a single bed.  The kitchenette was well equipped including a dishwasher!  The bathroom was good sized for one person at a time.  There is one open closet.  No drawers so your suitcase becomes your dresser.  The gym is huge with plenty of equipment.  The included breakfast has something for everyone. The staff was great especially Chris with local recommendations.  Will definitely return!","travelDate":"2019-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Clean but very small rooms","lang":"en","publishedDate":"2019-03-29","publishedPlatform":"OTHER","rating":3,"text":"Great location for visitors to the Times Square area.  The rooms and lobby were clean.  I would not stay here with another person.  Acceptable for one person, not more.  \n>Small rooms.  \n>No chair, table or desk in the guest rooms.  There's 1 small piece of furniture for the ice bucket.  \n>Rooms have a small refrigerator, microwave oven, dishes, kitchen sink.  If you'd like to eat you could use the ice bucket piece of furniture as a (very small) table and sit on the bed.  \n>The only drawers are in the night stands next to the bed.  The clothing rod for hanging clothing is about 16 to 18 inches long (approx.).  There's a poorly located shelf under the clothing rod which prevents almost everything from hanging freely.  Basically inadequate clothing storage.  \n>I had to get the clock\/telephone replaced due to a non-functional display.  \n>And, even though I told them several times, the lighted sign on the outside of the hotel with the hotel's name was not on during our entire stay.  \n>The breakfast buffet Tuesday morning wasn't properly stocked (i.e., no butter).  \n>On arrival I could not connect to the hotel's wireless network.  I ended up speaking with a tech support person for the organization that supplies the service to the hotel.  After over an hour I was finally successful.  I'm an I.T. consultant and was extremely frustrated by the experience.\n\nKudos to Daniel (?) for his patience and assistance with the network issue.  By the way, I was one of at least 4 people who had this connectivity issue.","travelDate":"2019-03","tripType":"NONE"}
{"helpfulVotes":1,"locationId":13449907,"title":"Vacaciones","lang":"es","publishedDate":"2019-03-29","publishedPlatform":"MOBILE","rating":5,"text":"Muy buena la ubicacion del hotel, muy comoda. Todo limpio, las habitaciones son comodas tambien, lo unico que critico es que tienen un placard muy chico, no entra casi nada. Nosotros nos quedamos siete noches y nos hubiera venido muy bien un placard. Sin perjuicio de ello, limpieza, atencion de los empleados, ubicacion, desayuno fue muy bueno.","travelDate":"2019-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great location!!","lang":"en","publishedDate":"2019-03-24","publishedPlatform":"MOBILE","rating":5,"text":"In the ♡ of midtown, just a couple blocks from Times Square. The staff was great and the room was clean and comfortable. NY prices vary wildly at times, but this was a good value in March. Subway stop a block away.","travelDate":"2019-03","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":13449907,"title":"The place to stay in NYC","lang":"en","publishedDate":"2019-03-23","publishedPlatform":"MOBILE","rating":5,"text":"This is a lovely hotel just off Times Square and around the corner from Hell’s Kitchen. The staff were lovely and very helpful and the room was tidy and quiet. There is a kitchenette, stocked with everything you could want. We also went round the corner to shake shack and took it back to our room. The beds were comfy and the room was clean and tidy. Would definitely stay again. ","travelDate":"2019-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Exceeded Expectations!","lang":"en","publishedDate":"2019-03-22","publishedPlatform":"MOBILE","rating":5,"text":"Our family of 5 were very comfortable in our room, plenty of space, which you don’t expect in NYC!  The staff, in particular, Barron and Daniel, went above and beyond to make sure we had a suitable room for our needs and everything was perfect for our stay.  The hotel was very clean and offered complimentary continental breakfast.  Would highly recommend!","travelDate":"2019-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Hidden Gem","lang":"en","publishedDate":"2019-03-22","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here in Feb and although the Hotel is relatively small ( no bar ), it suited our needs. The rooms are very clean, the staff are friendly and the local is great! We stayed in one of the back room and couldn’t hear any of the road noise. Would definitely stay here again.","travelDate":"2019-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great location and staff! ","lang":"en","publishedDate":"2019-03-17","publishedPlatform":"MOBILE","rating":5,"text":"This hotel was perfect! Great location and a very nice staff. A new hotel with free breakfast and no resort fees. Close to subway entrance. A block away from Time Square. The room has a king sized bed and a small couch as well as a small kitchenette. ","travelDate":"2019-03","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Not for the claustrophobic","lang":"en","publishedDate":"2019-03-15","publishedPlatform":"OTHER","rating":2,"text":"This was the tiniest room I have stayed in in New York (or anywhere else). It is so small, you can't open the kitchen drawer because of the entry doorknob. I felt quite claustrophobic. If you don't need a kitchen, skip this location as the sound from the refrigerator will keep you up all night (plus it takes up unnecessary space). There was not table to eat in the room and no desk for me to get work done. In addition to the small space, the ceilings are quite low, which makes you feel like you're in a doll house. There was no bottled water offered at check-in or recognition for elite status. The only saving grace is its location.","travelDate":"2019-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excellent location and nice clean and spacious rooms.","lang":"en","publishedDate":"2019-03-13","publishedPlatform":"OTHER","rating":5,"text":"Stayed for three nights. Excellent location and nice clean and spacious rooms. Front office staff were very helpful. Great happy hour in Bar. Exercise room onsite. Breakfast available in the restaurant","travelDate":"2019-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Super hotel","lang":"sk","publishedDate":"2019-03-13","publishedPlatform":"MOBILE","rating":5,"text":"Tento hotel odporúčam pre super polohu, výborný personál, vždy nápomocný. Raňajky boli skvelé, dobrá káva, omelety, miešané vajcia, sladké pečivo, wafle.... a hlavne boli až do 10:30. Izby veľmi čisté, každý deň upratovanie. Bola som veľmi milo prekvapená týmto hotelom. Na TIMES Square je to cca 300 metrov, metro stanica kúsok od hotela. Lokalita naozaj TOP! ","travelDate":"2019-03","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great Hotel","lang":"en","publishedDate":"2019-03-13","publishedPlatform":"OTHER","rating":4,"text":"My wife and I just got back from a 4 night stay here. Overally it was a good stay. \nPositives.  Check in went smooth and the agent was very friendly and helpful.  The room itself was nice. There is a small kitchen area if you do want to cook or even reheat something.  Bed was comfortable, the bathroom was nice with good water pressure.  The breakfast in the morning was basic, but was good. At night, they do have some coffee, water, and hot chocolate (which being it was cold during our stay, this was really good.)  The location is great.  You are a few blocks from Times Square and all the action.  We went to see Harry Potter, and the theater was only about 2 blocks away.  Loved that Shake Shack was at the corner, and even though they were busy, we were so close that we went back to our room to eat it. Overall the staff was very friendly and helpful.\n\nMy only negatives\/concerns.\nOur room had a small table, but there was no sort of chair.  We were not sure if this was because we were given a handicap access room or not.  So we just ended up eating our dinner on the bed.  Also, the area that can be used for hanging up your clothes was a little confusing.  There was a bar to hang things up, (obviously being a handicap access room, the bar was lower, so we understood that...however, we found that the bar was useless because the shelf below was so close to the bar that unless you were a child or a little person, the items didn't hang properly. Only other thing was that I had booked my rate way in advance.  Well our plans changed and we ended up being able to stay an additional night.  When I called the hotel I asked if they could honor the rate that I booked originally.  They said no, and that I would just be able to book the additional night at the new rate (rate was almost $100 more.)  So I waited until just before we left and saw that the rate had gone down a little bit, so I did book. I then called the hotel again and got an agent that combined my reservation so that I would not have to change rooms (that was nice).  \n\nOverall I would definitely stay here again and recommend to other friends.","travelDate":"2019-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Perfect location","lang":"en","publishedDate":"2019-03-12","publishedPlatform":"MOBILE","rating":4,"text":"Very good location.\nWithin walking distance from Broadway and Times Square.\nGood price\/quality.\nFriendly and helpfull staff.\nClean.\nHas a small cooking area in the room.\nIt is highly reccomandable to people Wanting to visit by foot midtown NY","travelDate":"2019-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Highly recommended hotel!","lang":"en","publishedDate":"2019-03-10","publishedPlatform":"MOBILE","rating":5,"text":"Just returned from a week long trip for my son's 21st birthday. We had 2 queen rooms on the 5th floor. The hotel was perfect for our needs. Check in was easy and the staff were really helpful. Chris checked us in and was really friendly and couldn't do enough for us throughout our whole stay. The room was perfect and a nice size, this was our third trip to NYC and this was by far the best room for size and facilities. The kitchen area was really useful for making a cup of tea and snacks. The bed was comfy and the room was quiet. The TV was great being able to use your own Netflix was a good touch after a long day sightseeing and shopping. The bathroom was a nice size with a decent shower. Couldn't fault the room at all, it's all brand new and well thought out. I've stayed in the Roosevelt and the Pod previously and this far surpassed both of them on every level. Having breakfast included as well was great because I've found previously that this isn't usually the case with New York. We're not early risers, so usually went down for breakfast between 9 and 10 and found there was plenty of choice- waffles, porridge, bacon, eggs, muffins, yoghurt and it set us up for the day nicely. Being able to come back of a night and grab a coffee on your way back to the room was nice as well. \nOverall our stay was perfect, couldn't fault the hotel in any way. Some people have complained about the lift being slow, but it seriously wasn't a big deal I think people just like to complain about something- first world problems! It was my son's 21st while we were away and Chris and another member of staff (I've forgotten his name sorry) put a balloon, cake, card and voucher in his room while we were out to surprise him and I thought this was such a nice touch and highly unexpected- my son was really made up with this, so thank you so much! \n100% we will stay here again on our next trip to New York, the location was perfect for the days you were too tired to venture far- Times Sq is on your doorstep and we actually used the subway a lot on this trip because there's a station at the end of the block, so was really easy to get about.\nThank you so much for an amazing trip, perfect hotel and lovely staff! ","travelDate":"2019-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Amazing Location, Friendly, Clean, Would Absolutely Return.","lang":"en","publishedDate":"2019-03-02","publishedPlatform":"OTHER","rating":5,"text":"A short trip visiting the city. Check in was quick and easy. Room was perfect, the ability to brew fresh coffee everyday was a godsend when we didn't quite get the body clock on track for the duration of our stay. Super clean as so new. All amenities provided in the room. \nBreakfast was great - always lots of choice and being re-stocked. I made a breakfast bagel or muffin each day but there were yogurts, cereals, make your own waffles, toast, and 2 hot choices each day along with a variety of juices and coffee\/tea. \nCoffee in the lobby was available all day and there was a pitcher of orange infused water which was perfect when returning from a days walking round the city. \nJust over the road was a bar, restaurants, a bring your own Thai (lovely food) and there were takeout places within 2 minutes walk.\nLocated just off Times Square we had no issues with noise at all and although the elevator was occasionally a little slow we (having read the other reviews) just had a little chuckle to ourselves that this was a reason to grumble about for some?!!\nWould absolutely recommend and return to this hotel if we ever re-visit. \n\nOne thing I would say (and this could be a Stateside thing) was that the towels in the bathroom did not need to be replaced everyday, it did seem a bit wasteful energy wise to do so? Maybe a sign on the wall saying if you want fresh towels to leave on the floor but if not then happy to re-use? As I say, might just be 'the done thing' over there and certainly didn't have any effect on our stay!","travelDate":"2019-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Does the job","lang":"en","publishedDate":"2019-03-01","publishedPlatform":"MOBILE","rating":4,"text":"Great convenient location. Nice clean room, comfortable bed but could do with more storage for family room. Breakfast plentiful and good. Was nice to have coffee available all day especially after long days in the cold weather. Staff friendly and helpful and always available in reception. \nWould use again if I’m lucky enough to return to New York City. ","travelDate":"2019-02","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":13449907,"title":"I'll Take Manhattan (Suites)","lang":"en","publishedDate":"2019-03-01","publishedPlatform":"OTHER","rating":5,"text":"Close to all the best attractions NYC has to offer, these small suites are very well equipped (so you don't have to spend a fortune in restaurants every day), spotlessly clean and very comfortable. The staff are FABULOUS - so charming and helpful - and it really feels like a home from home. The only thing I would change are the furnishings. I'd get rid of the big armchair and small round table (that has no seating anyway) and put in a larger desk\/table with seating to eat and a place to work - it would be much better use of space! I'd also add wine glasses to the eating\/drinking crockery and utensils. But I loved it and will 100% return. Great value for money. A real jewel in Marriott's crown.","travelDate":"2019-02","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great location and cheerful staff.","lang":"en","publishedDate":"2019-02-28","publishedPlatform":"OTHER","rating":4,"text":"Location brilliant,staff more than obliging,housekeeping top notch,elevator a pain,table in the room too big and would swop for a bit more storage space,coffee on tap in the lobby a great bonus after a day out in the great city.Would we stay here again?...YES.","travelDate":"2019-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Perfection ","lang":"en","publishedDate":"2019-02-22","publishedPlatform":"MOBILE","rating":5,"text":"We had a great stay in our queen room with sofa, the room was quite compact but the kitchen area was a great addition as was the comfy sofa. The whole hotel was exceptionally clean and our room was cleaned and tidied daily without seeing a maid once, very unintrusive service.\nReception staff are friendly and efficient. Breakfast was good and set us up for the day. If the price was right we would definately stay here again.","travelDate":"2019-02","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Excellent Management","lang":"en","publishedDate":"2019-02-19","publishedPlatform":"OTHER","rating":5,"text":"Hotel management is excellent and professional Though the rooms are kind of small, it's the city and you'll find that anywhere else. The rooms are clean and updated, and the hotel itself is nice and new.  There is coffee\/tea in the lobby, and free breakfast. I highly recommend this hotel as a choice to stay in.","travelDate":"2019-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"TINY ROOM (EVEN BY NY STANDARDS) BUT  GOOD LOCATION IN TIMES SQUARE","lang":"en","publishedDate":"2019-02-18","publishedPlatform":"OTHER","rating":3,"text":"First time staying at this relatively new (3 month old?) hotel.\nI gave 3 stars - really is \"A-OK\" \n\nPROS\n1 - Affordable \n2- Location (Times Square)\n3 -Brand new (rooms were is great condition)\n4 -Friendly staff\n\nCONS\n1-ROOM SIZE - you get what you pay for. There is an oversized round table with ice bucket in corner of queen room. Bottom line - table is too big for the room. In the middle of the night, it's pretty difficult to walk around the bed without hitting the table. (Remove the table and put in smaller table or shelf, or add a nightlight)\n\nI have been to NYC 50 -60 times. 2nd smallest hotel room over 50 times.\n\n2-SLOOOOOOOOOOOOOW ELEVATOR. You are waiting about 4 minutes every time for the one elevator bank. \n\n3-NO DESK\/COUNTER- Less people use desks, but 2 people in a queen studio and there is no place in room to sit & use a computer, except bed\n\n4-STAIRCASE is great - curious that it opens into the street. So if you don't want to wait for the slooooow elevator, and hop downstairs to the lobby, you better put on your winter coat, hat & gloves - because the staircase exits to 44th Street.","travelDate":"2019-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"A greAt find!","lang":"en","publishedDate":"2019-02-17","publishedPlatform":"MOBILE","rating":5,"text":"Nice exterior. Inviting lobby. A comfortable presence of friendly staff. A priceless location and public transportation options steps away and obviously food at every step and turn. (Smith’s Bar across the street is lively good food, with digital Pandora playing. Go ahead and sing aloud, you won’t be the only one, lol). TownePlace has a hot comp breakfast and fast internet. Hotel pics are comparable to actual rooms, a big yay!\n\nI didn’t get everybody’s names but shout out to Ariel, Brandon, Steve, and housekeeping!","travelDate":"2019-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Fantastic Stay","lang":"en","publishedDate":"2019-02-09","publishedPlatform":"MOBILE","rating":5,"text":"This is a great hotel, in a great location with great staff! \n\nMy wife and I came to NYC for the weekend and am so glad we chose to stay at this Towne Place Suites!\n\nThe rooms are new with all the amenities that you would need, including a refrigerator, a microwave, even a stove top and dish washer. \n\nIt also is in a great location, on 8th just off the chaos of Times Square and right in the heart of the Theatre District and Restaurant Row. \n\nBut just as importantly, the staff was fantastic. So friendly and accommodating! It was my wife’s birthday and they helped make it a very special weekend for us. \n\nI would definitely encourage you to stay at this hotel!","travelDate":"2019-02","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"A perfect place for your NYC tour","lang":"en","publishedDate":"2019-02-07","publishedPlatform":"MOBILE","rating":5,"text":"Stayed at the TownePlace suites for 3 nights.\nThe place is perfectly located near the times square. The place is quite new.\nThe rooms are comfortable and relatively large, including a kitchenette.\nThe staff is super friendly, and the breakfast is nice.\nI would definitely go back on my next visit to NYC.","travelDate":"2019-02","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Would definitely stay here again","lang":"en","publishedDate":"2019-02-05","publishedPlatform":"OTHER","rating":5,"text":"New property so everything is nice and clean. Rooms are fairly good size for NYC and have full kitchenettes. Great location a little removed from the craziness of Times Square, but still very convenient for getting around. What really stands out about the property is the friendliness of the staff. Only downside is that there is no in-room safe, but you can lock items up at the front desk where they have a \"safe-deposit box\" system.","travelDate":"2019-02","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Good overall","lang":"en","publishedDate":"2019-02-02","publishedPlatform":"MOBILE","rating":4,"text":"I stayed at that hotel for one night only but I checked in super early.\nIt's a brand new modern hotel in NYC. Noticed a very artsy crowd more than business.\nPros:\n- Location: right in the heart of the action. Theaters, movies, stores, restaurants galore. Any type of transportation right there. Easy to walk to anywhere. Uber safe.\n-Premises: spotless. Very clean. I'm a germaphobe so those things are very important. Nice kitchenette with everything to cook and eat. Small fridge. Nice TV with lots of options (Hulu, Netflux, Youtube included).\nMy room was at the highest floor (7th) and in the back. So zero city\/street noise. Was very pleased. The buildings in the back are not so close and not higher. So that's great for privacy and you have some view of some NY nice buildings! Nice big windows: very luminous room!\n-Friendly and helpful staff (front desk and security) . Come to you and really try to solve your issues. Let me check in at noon.\n\nCons:\n-Room is small but expected from a brand new hotel in NYC.\n-Breakfast: basic at best, not a lot of options at all for a Marriott. But nice\/clean\/modern breakfast area. Served till 11.00 am though!\n-Waiting\/sitting area is not separated from breakfast area.. So during breakfast hours, those eating and not eating are all in the same area.\nIncident:  Because of the Polar Vortex, my plane arrived at 3.00 am in JFK from Paris. I got to the hotel around 8.00 am. I was very exhausted from a long trip and the jetlag. I was told I had to wait until at least 11.00 am to get a cleaned room. Which I understood completely. I tried to hang out and walk around, but it was freezing outside and I could barely stand on my feet (exhaustion). I went to the sitting\/eating area and I just fell asleep naturally (my body was really out of it). I was sitting and I unconsciously fell asleep. An attendant (the somewhat tall, AA, heavy set lady taking care of breakfast) woke me up loudly, abruptly and rudely saying \"Ma'am, you can't sleep here!\". I have never heard that in my life and I travel a lot. If you cater to travelers, this will certainly happen. Exhausted travelers fall asleep even if they are not deliberately trying to, which was my case. So from 9.00 am to noon, I felt literally tortured, because I had to force myself to stay awake. Sorry this is inhumane. The bigger hotels do not have that appalling policy. That attendant treated me like I was some non desired homeless person. It was such a bad experience. Felt very uncomfortable and humiliated. That has to be corrected. This hotel is not cheap, so please do better.\n\nOverall: good hotel (as long as you are not exhausted). They deliver what they are supposed to offer.","travelDate":"2019-02","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":13449907,"title":"Perfect for Theater Visit","lang":"en","publishedDate":"2019-01-31","publishedPlatform":"MOBILE","rating":5,"text":"We spent 3 nights in very cold Temperatures. Two blocks to each of the theaters was wonderful plus plenty of restaurants close. Hotel is new and the staff is very helpful. Marie took great care of us and Daniel was great on checkin.\nRooms are small but good layout, and very clean.\nWe stayed in the South Tower . Only 4 rooms per floor and very quite. Rooms 615 or other floors 15 room has a more open layout with Queen bed and sofa. I found the sofa very comfortable for laptop work or watching TV. The King bed room looses the Sofa.\nNice breakfast with eggs, meat, waffles and other items.\nGreat hotel at this price point. I will be back.","travelDate":"2019-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":13449907,"title":"Excellent stay!","lang":"en","publishedDate":"2019-01-22","publishedPlatform":"MOBILE","rating":5,"text":"We stayed one night here during our last visit to NYC amd I can say I highly recommend! \n\nThe location is perfect, close to the heart of Time Square and the theatre district, great shopping on 5th ave and great restaurants.\n\nThe rooms, while small, were very nice, clean and comfortable. The breakfast was good, lots of options, but it can get quite crowded at the busy times. \n\nMy only criticism was the staff. Some were less helpful and to call them friendly would be a stretch. \n\nOverall I would stay here again, and recommend to anyone who wants a nice, clean place close to attractions.  ","travelDate":"2019-01","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":13449907,"title":"Aún no estaba listo","lang":"es","publishedDate":"2019-01-22","publishedPlatform":"MOBILE","rating":3,"text":"El hotel tiene una ubicación inmejorable. Nos alojamos a fines de noviembre cuando tenía pocos días de abierto. Nuestra habitación estaba en \"la torre\" y había que caminar por un largo pasillo para llegar a ella. A la habitación le faltaba iluminación y se sentía olor a cañería.\nEl desayuno no es muy variado y el lugar para tomarlo es pequeño, pero tener el desayuno incluido es un gran ahorro. La habitación es muy linda y muy completa, y el personal es muy amable. Tiene algunos aspectos por mejorar pero creo que se convertirá en un gran hotel, tal vez me aloje aquí cuando vuelva en abril.","travelDate":"2018-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Great location!","lang":"en","publishedDate":"2019-01-18","publishedPlatform":"OTHER","rating":4,"text":"This is a brand new hotel in a great location!  The room is not huge, but we're use to that.  We stayed here before getting on a cruise and it wasn't far for us to walk to cruise terminal from hotel (20-25mins).  The hotel is approx 5 mins walk from bus terminal and approx 20 mins from Penn Station. We took the train from airport.  It was very busy since it was over the holidays so it was difficult to walk anywhere...you definately need to pack your patience. There are alot of restaurants close by, close to Hell's Kitchen area and having a mini-kitchen in room was great since we could warm up food, make food if you wanted to since they had everything in kitchen, coffee\/tea (provided), including a dishwasher.  The hall ways are small and elevators aren't the fastest, but we didn't have any issues with it.  Breakfast was good enough to start the day, although they did run out of some stuff. Staff at the front desk are friendly and very helpful!  Not alot of room to walk around in the room, not alot of storage and if you do eat there is no table in room. The tv channels are great, including HBO on demand. We would stay here again!","travelDate":"2018-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"They aim to please","lang":"en","publishedDate":"2019-01-14","publishedPlatform":"MOBILE","rating":4,"text":"Conveniently located for both business and leisure activies this recently opened hotel has much to offer. Kitchenette is a definite plus. Quieter than anticipated given the location.  An eager staff aimed to please made this guest feel mist welcome","travelDate":"2019-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":13449907,"title":"Friendliest Staff!","lang":"en","publishedDate":"2019-01-08","publishedPlatform":"MOBILE","rating":4,"text":"Recently stayed one night in this hotel. Had the pleasure of dealing with staff members from three different shifts (arrived early to a room that was ready, was up late). Everyone was very friendly, offered parking assistance, made restaurant recommendations, opened doors for me, said goood morning, good evening and good night! Always asked how we were doing and if we needed anything. And again that was on three shifts with three different sets of staff members! \nRoom was a good size for the city, clean, and the kitchenette is fabulous! Bathroom was a good size, could actually move around. Our room was right next door to elevator and didn’t hear it once, and noise from street was almost non existent, the soundproofing was wonderful for a room in the city! Location is perfect to see a show. With plenty of excellent restaurants and bars in walking distance. \nBreakfast is included and although I didn’t have anything as I had that fabulous kitchenette, everything was well stocked, looked fresh and kept clean. \nBut overall it was the staff that won me over! (and the clean room) I’m bad with names, but honestly it’s not necessary because every person who was on duty from January 6th through January 7th was a pleasure to speak with. \nDefinitely will be returning the next time we are in to see a show.","travelDate":"2019-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":13449907,"title":"Excellent","lang":"en","publishedDate":"2019-01-07","publishedPlatform":"MOBILE","rating":5,"text":"Fantastic services from all staff including Marie, Chris, Brandon and Daniel, all staff make you feel very welcome. Absolutely brilliant service would highly recommend! Rooms were modern, clean and tidy.","travelDate":"2019-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Perfect location ","lang":"en","publishedDate":"2019-01-06","publishedPlatform":"MOBILE","rating":5,"text":"Brand new hotel. The staff are all very friendly and helpful. Our king room had a perfectly appointed kitchen. Not a bad size for NYC. Just blocks from Times Square. Only down side is there is only one elevator. Never really had to wait to long for it. So if you are inpatient try to get a low level room and take the stairs. ","travelDate":"2019-01","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":13449907,"title":"Great hotel in a great location","lang":"en","publishedDate":"2019-01-05","publishedPlatform":"MOBILE","rating":5,"text":"Great hotel in the heart of it all. Within short walking distance of Times Square, Rockefeller Center, broadway theaters, many restaurants & shopping. Metro station is less than a block away to navigate all over the city. The room was clean & comfortable, complimentary hot breakfast was great and the staff was very friendly and helpful (thanks Douglas & Michael). We will def be back for future visits to the city.","travelDate":"2019-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":13449907,"title":"Brand new hotel with prime location","lang":"en","publishedDate":"2019-01-05","publishedPlatform":"OTHER","rating":5,"text":"We stayed here for 3 nights during our recent trip to NYC. Rooms were very clean and in great shape and a decent size for NYC standards. They have mini-kitchens in each room which is convenient for those who may want to have snacks\/small meals in their room. The staff are genuinely friendly and very helpful. We would stay here again. Can't beat the location - right in the heart of the theatre district  with short walk to subway, numerous restaurants and entertainment.","travelDate":"2019-01","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"Nice hotel","lang":"en","publishedDate":"2019-01-01","publishedPlatform":"MOBILE","rating":5,"text":"We stayed here for 4 nights over Christmas holidays. The hotel was really close to everything around Times Square and if you take a left out the door to 9th you will find nice restaurants out of the crazy crowds. The check in was perfect. They even let us check  in before 3 as we arrived early. The hotel room was the queen size and came with a small kitchen. It was clean and a pretty goid size for NY. The staff were very friendly throughout  the stay.  More good was the free hot breakfast. We would definitely stay here again.","travelDate":"2018-12","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":13449907,"title":"Met our needs well","lang":"en","publishedDate":"2018-12-31","publishedPlatform":"OTHER","rating":4,"text":"We were three people in a queen\/sleeper suite for three nights.  We had to pack heavier than normal due to a mixed bag of weather during our trip, and we had just enough storage space for the contents of two roller bags.  Our backpacks were not unpacked. It is a tight squeeze with the twin sleeper pulled out.  We only used the coffee maker and refrigerator in the teeny yet well-equipped kitchen. No desk space if that is a requirement for your stay.\n\nEveryone we interacted with was very friendly and helpful, so service is five stars. The breakfast was good, but if you need to eat a lot of fiber you should bring your own prunes. There's not a ton of space in the breakfast room so there are opportunities to form new friendships at shared tables.  There is some modular furniture in the lounge area, but more table options during breakfast hours would be useful.\n\nThe hotel is constructed in two towers, and we were in the back tower so used the funny little hallway other reviews have referenced.  We didn't find it to be a problem, but it could be for those who have mobility issues or an abundance of luggage.\n\nNoise insulation from outside the hotel is very good, but we found there was a lot of noise from inside the hotel. Between earplugs and active days, the noise didn't keep us up.\n\nLocation is excellent, with lots of great restaurants nearby.","travelDate":"2018-12","tripType":"FAMILY"}
{"helpfulVotes":3,"locationId":13449907,"title":"Nice and new","lang":"en","publishedDate":"2018-12-19","publishedPlatform":"OTHER","rating":3,"text":"We just returned from a 2-night stay.\nTHE GOOD:  Location is a 2-min walk from the subway and many restaurants.  Its all brand new.  The staff are all very nice, requests for extra bedding and bathroom supplies were fulfilled in 5-min.  The room (queen + a sofa bed) is typical NYC small, you will be disappointed if you think you are getting a suite.  The sofa bed was fine for a couple of nights but re-think that if you are staying longer.  Nice bathroom with no hot water problems, towels are plentiful, thick and fluffy, average toiletries.  The windows open, the tv is easy to operate.  There is a pretty well-kitted out kitchen and we appreciated the small fridge.  Nice and quiet room overlooking other rooms and the Intercontinental next door.  The heat worked fine.  There was only one elevator to the second building where we stayed but it was efficient with no long wait times.  The rate I secured was very reasonable.\nTHE BAD: there are apparently two separate buildings here, but they are joined by a very, very, long walkway to the elevators.  This is inconvenient, although of course they are restricted to the existing lot.  The lobby\/breakfast area is far too small.  The breakfast is not that great, although the lady working the area was very pleasant and even came around to take away dirty plates; there was no oatmeal on one of our days, and even though it was only 9:00, it was never replenished.  Plastic cutlery and paper plates should be a big no-no now, I don't know why Marriott is going this route.  Regarding the room, there was no desk area or drawers, just a small little portable table, which was not very useful.  The bathroom has no hooks, not one. There were too many stray hairs (that were definitely not ours) that made their way into the bathroom from the carpeting in the room.\nOverall, it was nice to stay in a new property, and would recommend it.","travelDate":"2018-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"decent budget option","lang":"en","publishedDate":"2018-12-13","publishedPlatform":"OTHER","rating":4,"text":"Good option near many restaurants\/theaters.  Clean.  Room design made good use of space and provided a complete galley kitchen.  Only one elevator in main part of hotel so it can take a while to get to\/from room.  Breakfast options are decent, but while the front desk was well staffed, the food staff seemed to have trouble keeping up with replenishing items.","travelDate":"2018-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":13449907,"title":"These are not Suites - misleading name","lang":"en","publishedDate":"2018-12-13","publishedPlatform":"OTHER","rating":2,"text":"The front desk staff was nice, the hotel itself is brand new so the rooms are all in perfect shape but they are very very small - not suites, more like walk-in closets with a small kitchen.  The elevator is very slow and there is only one so staff is using it most of the day.  Taking the stairs is best option so if you have to book here ask for a room on lower floor.  Location is good if you are going to city for theatre, but there are better and cheaper options around","travelDate":"2018-12","tripType":"BUSINESS"}
{"helpfulVotes":14,"locationId":13449907,"title":"Very promising, but not yet up to speed.","lang":"en","publishedDate":"2018-12-03","publishedPlatform":"OTHER","rating":3,"text":"We knew that a brand new property would not yet be running well, but I expect to see improvement coming quickly.  We found check in running very quickly and our room ready early using the Marriott Mobile Check in through their app. We were in the section called the \"Tower\" separated by a long skinny hallway from the main building. The hallway was way too narrow requiring you to occasionally wait if a cart or service wagon was moving through from the other direction. Unfortunately, this looks like a fault that can not be corrected. Once in the Tower, there seemed to be only 4 rooms per floor so it was very quiet and the elevator waits were very short.  The room itself was very nice in color, lighting and decor. Lots of outlets for chargers and something I have not yet seen in any other hotel, a multi-connector charger located next to the clock just in case you have left yours behind.  We only spent one night, so I have no impression of housekeeping other than the room being clean on arrival.  The quirk is in the bathroom. Spacious and well lit by New York standards, there was no provision for hanging a used towel. No bars, no hooks, nothing.  We provided the desk our comment about this during our quick and effortless check out and they noted it into their system but also indicated that it had been reported many times before and they are working on a solution.  Breakfast also looks promising but is not running well yet.  There were 2 staffers in the room but when we arrived with no apparent crush of business ahead of us, they were nearly out of eggs and breads.  Water pitchers were empty, no napkins were available and I was unable to locate any butter. \n\nI loved the location, only a block from many theatres, yet fairly quiet, and just a few blocks from dozens of Times Square and Hell's Kitchen restaurants.  I would expect that everything except that connecting hallway will be improved with a little experience under their belt and I will absolutely look here again when heading back to the city.","travelDate":"2018-12","tripType":"COUPLES"}
