{"helpfulVotes":0,"locationId":19097786,"title":"Consigliato","lang":"it","publishedDate":"2024-05-12","publishedPlatform":"OTHER","rating":4,"text":"Per la media della Grande Mela è un hotel eccellente. Senza fronzoli, camere abitabili, bella vista sull'Empire. Colazione ottima, possibilità anche di portare il mangiare in camera, sala piccolina, ma noi, svegliandoci presto la mattina, non abbiamo mai avuto problemi di posto. Ascensori efficienti. Pulizia più che buona. Staff gentile e disponibile. La posizione quasi sulla quinta strasa, impagabile, vicino a tutto. Qualità prezzo ottima.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"New York City","lang":"en","publishedDate":"2024-05-09","publishedPlatform":"OTHER","rating":5,"text":"Conveniently located in uptown Manhattan, within walking distance to Times Square, Empire State Building, Rockefeller Building, Grand Central Terminal. Small but cozy rooms & quiet enough to get some rest.","travelDate":"2024-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Location Location Location","lang":"en","publishedDate":"2024-04-25","publishedPlatform":"OTHER","rating":5,"text":"This was an excellent hotel with good location.  We are not used to such small rooms but when you are in New York, you don’t spend a lot of time in your room just like European vacations especially Venice.  We paid less than other hotels so we were very pleased.  Breakfast was exceptional.","travelDate":"2024-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great stay in NYC","lang":"en","publishedDate":"2024-04-24","publishedPlatform":"OTHER","rating":4,"text":"The cleanliness of the hotel was excellent and of utmost importance. The beds were comfortable and the space in the bedroom was very good for having two double beds with adequate closet and shelves. The lighting in the room was very good. Having a refrigerator and safe was important and appreciated. It was quiet, noise from other guests was minimal and although the street outside wasn't busy, there was no noise through the windows. One of which opened slightly which was nice to get some fresh air. The temperature control for the room worked well. \nA downside: The bathroom sink area was way too small especially for two people. Although there were some shelves below the sink, there wasn't much space to put toiletries. But the shower was excellent and there was plenty of hot water. \nThe worst: The included breakfast was very poor. And 15 minutes before it ended they ran out of coffee and wouldn't make more. The space was extremely tiny and we had to wait for seats. I can imagine in high season this would absolutely not be workable. I would advise going out for breakfast. There are a lot of good to excellent choices from 1 to 15 mins walk nearby.\nLocation: Garment District, convenient to Broadway for plays and some good eating in the area. Also close to Madison Square garden and Penn Station. The cleanliness of the hotel was excellent and of utmost importance. The beds were comfortable and the space in the bedroom was very good for having two double beds with adequate closet and shelves. The lighting in the room was very good. Having a refrigerator and safe was important and appreciated. It was quiet, noise from other guests was minimal and although the street outside wasn't busy, there was no noise through the windows. One of which opened slightly which was nice to get some fresh air. The temperature control for the room worked well. \nA downside: The bathroom sink area was way too small especially for two people. Although there were some shelves below the sink, there wasn't much space to put toiletries. But the shower was excellent and there was plenty of hot water. \nThe worst: The included breakfast was very poor. And 15 minutes before it ended they ran out of coffee and wouldn't make more. The space was extremely tiny and we had to wait for seats. In high season this wouldn't  be workable. Advise breakfast out. There's good to excellent choices from 1 to 15 mins walk nearby. Convenient to Broadway, MSG and Penn St. Fifth Ave. Quiet area at nite, no sirens.","travelDate":"2024-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excelente hotel","lang":"pt","publishedDate":"2024-04-19","publishedPlatform":"OTHER","rating":5,"text":"Localização excelente, próximo a metrô e a diversos pontos turísticos. Quarto limpo e confortável. Funcionários muito educados e atenciosos. Café da manhã muito bom.","travelDate":"2024-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Short pleasure stay in New York","lang":"en","publishedDate":"2024-03-20","publishedPlatform":"OTHER","rating":4,"text":"The Wingate is a great little hotel in great location just off 5th Avenue. Easy access to nearby attractions and shopping with others easily accessible with an excellent bus service from both 5th and 6th Avenues. We would definitely recommend this hotel for a short stay in New York and would stay there again on future trips.","travelDate":"2024-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excellent hotel","lang":"en","publishedDate":"2024-03-08","publishedPlatform":"OTHER","rating":5,"text":"I must say I was very surprised and very happy with this property. It is so well located. The room was very clean, the staff was excellent. And there was a very nice breakfast. I would definitely stay there again. ","travelDate":"2024-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Convenient stay","lang":"en","publishedDate":"2024-03-02","publishedPlatform":"OTHER","rating":4,"text":"The staff was kind and the rooms were small but convenient in terms of spaces. Also new and spacious bathrooms. Overall very clean which is greatly appreciated. As suggestions, I would highly advise to renovate the breakfast area as it is a small. The hotel is midtown, very convenient to walk around and I would recommend it.","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Terrible Front Desk Experience","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":1,"text":"Front desk representative,  FREDDY MUNOZ, awful human being; made me very uncomfortable and feel unsafe, a liar threatened  to cancel my reservation because he wanted everyone's id although only my name was on the reservation?  Said was policy ask for the policy said manager said asked for the manager refused to call or verify.  On purpose he assigned me a disgusting room the size of my master bathroom  at home.  Not even a sink in the bathroom, overlooking an alley.  I was suppose to have a queen bed, he assigned me a double bed...The room was smaller than the room I had in Japan.  He is the worst the housekeeping manager had to intervene I would never stay at this place EVER!..To think I am doing a tour of a Wyndham property for an upgrade, and they assign me this dump, with the worse front desk person I ever experienced and interacted.  He is a weird and terrible person....What is worse I received a response from the manager and she advised it was ok that employees can lie and state \"hotel policy\" without having to prove or show anything in writing or even explain?  Be treated like a criminal, so if you bring small children, and whoever make to this property make sure you have their id.  If you do not like it they are given the authority to cancel your reservation.  I guest they think we are in a communist country without due process or accountability.  This is so subjective and bias.  So if you do not like how you are not valued contact the franchisee as Wyndham Hotels & Resorts customer care told me:  Celine Chen @ 929-486-2666.","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excellent choice","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":4,"text":"No frills hotel. Clean facility and very secure. Key card or buzz to get into building and key card needed for elevator. \n\nClose to major attractions and very affordable. \n\nRooms are very small but it is a narrow building. 4 rooms to a floor","travelDate":"2024-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Perfect room for us","lang":"en","publishedDate":"2024-02-22","publishedPlatform":"OTHER","rating":5,"text":"My wife and I stayed in a room with a view of the Empire State Building. Yes, the room is small, but we were able to completely enjoy our 8-night stay. The King bed was comfortable, the room was quiet, all staff members were friendly and very helpful. We were minutes away from Broadway and various train stops.","travelDate":"2024-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excelente ubicación y buena atención del personal!","lang":"es","publishedDate":"2024-02-15","publishedPlatform":"OTHER","rating":4,"text":"Excelente atención del personal, pero debo destacar a Jennifer y a Tenzin que fueron súper amables!\nLas habitaciones son muy pequeñas, pero al estar varias noches nos dieron la de personas con alguna dificultad de movilidad que son más grandes.\nMuy conforme en relación precio y calidad.\nLa crítica es el lugar de desayuno que es muy pequeño y se colapsa en determinados horarios!","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Très bon séjour à New York","lang":"fr","publishedDate":"2024-02-10","publishedPlatform":"OTHER","rating":5,"text":"Personnel sympathique, vue de la chambre sur l’empire state building magnifique, chambre petite mais fonctionnel, ménage fait tous les jours, localisation de l’hôtel parfaite. \nSalle du petit déjeuner petite mais aucun problème si on se lève tôt. ","travelDate":"2024-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Trop bruyant","lang":"fr","publishedDate":"2024-02-07","publishedPlatform":"OTHER","rating":1,"text":"Beaucoup de bruyant du au énorme unité de climatisation au bord des fenêtres de notre chambre qui était minuscule. La salle du petit déjeuner est minuscule par rapport au nombre de personnes dans l’hôtel. Il fallait faire la queues plusieurs minutes pour obtenir une place assise. Certains déjeuner debout !","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Clean affordable small room","lang":"en","publishedDate":"2024-01-15","publishedPlatform":"OTHER","rating":5,"text":"Overall it was a good stay due to the reasonable rate I paid fort the room. The rooms are small which i wasn't expecting and the morning free breakfast was good but lacked sufficient seating for everyone. The waffle maker had a line due to the amount of time it takes to make waffles. But other than that it was new and clean. Going to the basement for water and ice is a little weird too. Maybe you could put them closer to the guests? I gave it 5 stars because the rate i paid was fair for the experience.","travelDate":"2024-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Hotel mediocre","lang":"it","publishedDate":"2024-01-14","publishedPlatform":"OTHER","rating":2,"text":"Non consiglio questa struttura, se non per la posizione. \nInesistente pulizia delle camere, nonostante le aree comuni vengano tenute molto bene.\nServizio colazione buono ma sala non adatta alla capienza dell’hotel.\n","travelDate":"2024-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"tres bonne adresse à New York","lang":"fr","publishedDate":"2024-01-08","publishedPlatform":"OTHER","rating":5,"text":"hôtel très bien situé pour les visites touristiques, petite structure, très propre, chambre confortable et belle salle de bain, copieux petit déjeuner et personnel aimable ; aucun reproche, le séjour était parfait","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great hotel!","lang":"en","publishedDate":"2023-12-31","publishedPlatform":"OTHER","rating":5,"text":"Great clean hotel!!! very small hotel with decent size rooms for NYC.  We had a room with 2 double beds overlooking the Empire State Building.  The bathroom was a modern bathroom with a rain shower (no tub). The room had a small desk, tv, and safe and fridge.  it had only 6 rooms per floor.  IN order to get into the hotel, you needed  room key and in order to use the elevator you needed a room key. The staff were very nice.  It was modern, clean and in a good location between 6th and 5th on 37th. Location was safe overall for NYC.","travelDate":"2023-12","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great property. Greater location.","lang":"en","publishedDate":"2023-12-28","publishedPlatform":"OTHER","rating":5,"text":"This property is in a very good location. My wife and I went there the on Christmas week. We saw everything we wanted to see for Christmas.  The property is centrally located, in the middle of every significant place. Everything was within walking distance. Rooms are a little small but we didn’t stay in our rooms too long: so much to see and do and eat. Will definitely stay there again. ","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"great location and comfortable room","lang":"en","publishedDate":"2023-12-24","publishedPlatform":"OTHER","rating":5,"text":"The location of the hotel is perfect, it takes you less than 5 minutes to get to the 5th avenue and about 10 mins to get to times square, we had a view of empire state building from our window. The staff were friendly, and the room was clean and comfortable. The breakfast could have had more variety, but this did not affect our overall experience. I would recommend the hotel to anyone visiting New York.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great hotel, perfect location","lang":"en","publishedDate":"2023-12-24","publishedPlatform":"OTHER","rating":5,"text":"Perfect for families. Had two rooms with twin queen beds for the 5 of us. Both had fantastic views of The Empire State Building. Immaculately clean. Friendly staff. Breakfast set us up for the day. Location is excellent. ","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"This is the hotel you are looking for!","lang":"en","publishedDate":"2023-12-16","publishedPlatform":"OTHER","rating":5,"text":"My mom and I recently stayed here for a short weekend trip to NYC. I cannot say enough how amazing this hotel was. Every staff member was kind and helpful. They helped us navigate to the subway and made restaurant recommendations when we asked. The hotel felt safe. It’s in a nice area and the doors only open with your key card for added security. The hotel was so clean from the lobby to our room. The bed was so comfortable and so nice after a long day of touring the city! I would absolutely recommend this hotel to anyone! It had everything we wanted! So glad we stayed here!","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great location, clean but small rooms and limited amenities","lang":"en","publishedDate":"2023-12-13","publishedPlatform":"OTHER","rating":3,"text":"The location of the Wingate is convenient, close to midtown Manhattan, the theater district, restaurant row, Rockefeller Center - all are within walking distance. Check in was easy - the front desk stored our bags as we arrived earlier than expected and our room wasn't ready.  This hotel is cash-free - if you're looking for small bills for tipping you'll have to get change outside the hotel.   There are  4 guest rooms per floor in the 18th floor facility, we found elevators to be accessible and uncrowded during our 3 night stay.  We felt very safe at this hotel, the front door and elevators require a hotel key to access guest floors.  There was very little external noise nor was there much in-building noise. We were on the 13th floor and other than the occasional guest room door closing it was quiet. The rooms are clean but tiny, usable for a single occupant, cramped for two or more. The bedding was new and comfortable, the beds themselves are platforms which allowed the mattress to slide around, we discovered this after the first night of sleep.  The included breakfast was served in a somewhat cramped 1st floor area that got crowded at peak times.  The food was acceptable to good, depending on the daily selection, with hot selections of scrambled eggs and either sausage or bacon, DIY waffles, breads and pastries, juices, coffees, yogurts and fresh fruit.  There is no fitness center nor valet parking, although the hotel has a discount program with a parking lot around the corner on 38th street who promptly retrieved our car upon checkout. The only ice machine for guest use was in the basement, meaning you needed an elevator ride to get ice for the room. We were unpleasantly surprised to discover that the weekend NFL schedule was not available on the room television channel selections. As a frequent guest of the Wyndham chain, I rate this facility as average due to its convenient location, cleanliness of the room and facility, but due to the relatively high room rate and small room and limited amenities, I would investigate other options along with this one.","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Comfortable","lang":"en","publishedDate":"2023-12-12","publishedPlatform":"MOBILE","rating":4,"text":"This hotel is in a perfect location. The staff was efficient and personable. The room was clean and comfortable but very small. Great for one night or one person. The only thing we missed was a full length mirror. Select a room in the back on a high floor.We will be back very soon","travelDate":"2023-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Nice hotel","lang":"en","publishedDate":"2023-12-11","publishedPlatform":"OTHER","rating":5,"text":"Very nice, clean and convenient place to stay. Staff are very friendly. I booked one queen bed room which is a little bit small, but big enough for one person stay for one night. No cell phone signal at room.","travelDate":"2023-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great property and location","lang":"en","publishedDate":"2023-12-06","publishedPlatform":"OTHER","rating":5,"text":"This hotel was well maintained and was in a great location. The staff was friendly and the breakfast that was provided was good too. Location was convenient to the train, museums, Rockefeller, and restaurants.","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"It's a closet","lang":"en","publishedDate":"2023-12-05","publishedPlatform":"OTHER","rating":2,"text":"If you like a closet for almost 500 a night. Clean is the best I can say. All the desk staff are great, Manager is not.Seems all the staff are afraid of him. Breakfast was ridiculous. Eggs were gone and by the time the cooking staff was done playing around it was 45 minutes. Common sense, eggs are low, cook then, NOT after they are gone.","travelDate":"2023-12","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Decent Hotel in South Midtown","lang":"en","publishedDate":"2023-11-26","publishedPlatform":"OTHER","rating":4,"text":"Great location in midtown south.  Fairly new hotel; still clean and modern.  Rooms are small -- ours was barely suitable for two persons and lacked adequate space for luggage.  The bathroom lacks shelf space.  The included breakfast was better than expected.  Overall, the hotel is fine for a short stay.","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Fantastic hotel! Clean rooms, helpful staff and a great breakfast buffet.","lang":"en","publishedDate":"2023-11-22","publishedPlatform":"OTHER","rating":5,"text":"We stayed at this hotel for three nights and were very happy. The staff was so nice and friendly. The rooms were very good and clean. The included breakfast was a fantastic addition and we really enjoyed that. ","travelDate":"2023-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Super séjour","lang":"fr","publishedDate":"2023-11-08","publishedPlatform":"OTHER","rating":5,"text":"6 nuits en chambre familiale avec vue sur l empire state building.  Chambre taille très correcte,  très propre.  Personnel très agréable et serviable.  Excellent emplacement.  Seule la salle du petit déjeuner est un peu petite. Je recommande ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Lo esperado por el.precio","lang":"es","publishedDate":"2023-11-08","publishedPlatform":"OTHER","rating":4,"text":"Muy buena atención en la recepción,  el personal habla español  muy limpio, la habitación es muy pequeña pero es entendible para el precio y por ser.en manhatan. La ubicacion es estrategica, cerca a estaciones del metro y bryan park. Por otro lado el desayuno puede ser mejorado,  poca variedad","travelDate":"2023-11","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Inmejorable","lang":"es","publishedDate":"2023-11-05","publishedPlatform":"OTHER","rating":4,"text":"Gran estancia, ubicación y servicios. La habitación es super cómoda, la cama es de lo mejor, descansamos super bien y el desayuno la oportunidad de salir preparados para recorrer la gran ciudad con bastante variedad","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Housekeeping every day!","lang":"en","publishedDate":"2023-11-02","publishedPlatform":"OTHER","rating":5,"text":"The room was reasonably roomy for a Manhattan hotel.  It was very clean and, oh glorious, we received housekeeping every day.  It is the first hotel we've stayed at since COVID that that has happened.  No stinky trash accumulating, the room was always clean and fresh.  Every employee we encountered was friendly and accommodating.  The only less than great experience was the breakfast, it had minimal options, but then they don't have a lot of space to work with.  The location of the hotel close to two subway stations was also a big plus.  ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Tutto perfetto!","lang":"it","publishedDate":"2023-10-29","publishedPlatform":"OTHER","rating":5,"text":"Struttura impeccabile, posizione top, vicinissima a Bryant park e time square. Personale eccellente, servizo di pulizia in camera supertop! Ottima e abbondante la colazione.. Consigliatissimo sotto ogni aspetto!","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Muy buen hotel","lang":"es","publishedDate":"2023-10-26","publishedPlatform":"OTHER","rating":5,"text":"Volvería a reservar aquí sin duda, habitaciones pequeñas pero funcionales cupieron nuestras 4 maletas 2 grandes y 2 chicas. Éramos mi esposo y yo, todo muy cómodo y la ubicación ufff excelente, personal muy amable y hablan español.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Loved this hotel","lang":"en","publishedDate":"2023-10-23","publishedPlatform":"OTHER","rating":5,"text":"Hotel was a great location and value with the continental breakfast (so many options) was awesome. The rooms were clean, comfortable beds and a great bathroom\/shower. The hotel held out suitcases free of change upon signing out. A great place to stay in NYC. ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Perfect Hotel!","lang":"en","publishedDate":"2023-10-20","publishedPlatform":"MOBILE","rating":5,"text":"I cannot say enough positive things about this hotel! \nEverything was always clean and smelled nice. Our room was small, but I am sure that is typical for a NYC hotel. It was just enough space for 2 of us, though. \nWe were on the top floor and our view of the Empire State Building was phenomenal! \nStaff was always so friendly and welcoming. They even had the lobby decorated for Halloween, which was so cute and warm feeling. It really gives you a sense that the employees enjoy what they do. \nThe breakfast area was a little small, but we got there early and didn’t encounter any issues or overcrowding. It was all really delicious, as well. \nLOCATION! The location that this hotel is in is absolutely perfect. It’s off a side-street, so not a ton of city noise. Almost everything is walkable, though, or a short subway ride. \nWe walked to Times Square and Rockefeller center. Empire State is mere blocks away. And the Statue of Liberty was a short walk and subway ride. \nExcellent hotel, would 100% stay here again.","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"tolle Lage, kleine, moderne Zimmer, gutes Frühstück","lang":"de","publishedDate":"2023-10-14","publishedPlatform":"OTHER","rating":5,"text":"Hotel liegt in der 37 W\/ 5 th. und damit eine tolle Lage um NY \/ Manhattan zu erkunden. TimesSquare ist nur wenige Minuten entfernt. Kleine und moderne, sehr saubere Zimmer. Gutes Frühstück. wir kommen gerne wieder ","travelDate":"2023-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great Hotel","lang":"en","publishedDate":"2023-10-12","publishedPlatform":"OTHER","rating":5,"text":"4 nights, fantastic service, super clean, beautiful rooms, great breakfast, excellent location. Walking distance to most major midtown attractions, we also had a view of the Empire State bouillon’s. I’d stay here again without a doubt. ","travelDate":"2023-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Tiny Room","lang":"en","publishedDate":"2023-10-12","publishedPlatform":"OTHER","rating":2,"text":"The room is very small. One needs to climb over the other person in the bed;\nIn the bathroom, there is no place to put any toiletries;\nWhy don't they even have a full length mirror in this room? People going out would like to see how they look before leaving;\nThe breakfast area is so small. Had to wait before there was was an available table;\nThere could also be a little more lighting in this room.\n\nI wish I would have booked next door at the Fairfield Inn.\n\nThe shower was pretty good, and the breakfast selection was was decent. ","travelDate":"2023-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Poor Customer Consideration","lang":"en","publishedDate":"2023-10-02","publishedPlatform":"OTHER","rating":1,"text":"I was not able to arrive due to flooding on Long Island that was reported across all media outlets.  Based on the feedback I would be charged a night because others were able to arrive, which is a ridiculous measure.  Everyone isn’t trying to come from the same location.","travelDate":"2023-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Good for a place to Sleep and Shower ","lang":"en","publishedDate":"2023-09-28","publishedPlatform":"OTHER","rating":4,"text":"This hotel was everything I needed for a weekend break in the city. The room is compact, but clean. With a good shower, comfortable bed and enough storage for clothes. The rooms are small but serviceable. \nBreakfast had a good selection but the room is tiny and I had to eat standing up. ","travelDate":"2023-01","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Monto Retenido en la tarjeta de Crédito en concepto de garantía","lang":"es","publishedDate":"2023-09-17","publishedPlatform":"OTHER","rating":4,"text":"Hotel bien ubicado para alguna de los lugares a visitar Grand Centras Station, Bryan Park, Public Library, buen desempeño del personal de Recepción, pero muy demorada la gestiòn para que liberen de la tarjeta de crèdito el monto retenido como garantìa, estuve en dos hoteles diferentes usando la misma tarjeta de crèdito y a diferencia de este hotel el proceso fue automàtico una vez que hice el check out.\n","travelDate":"2023-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excellent séjour","lang":"fr","publishedDate":"2023-09-16","publishedPlatform":"MOBILE","rating":5,"text":"Nous sommes restés douze nuits dans cet établissement. De notre arrivée à notre départ tout le personnel (réception, ménage, petit-déjeuner) été extrêmement agréable, efficace et serviable.\nNotre chambre avec vue sur l'ESB était très bien avec une taille suffisante (même pour un séjour de 12 nuits). La literie est très confortable. Je regrette simplement que le placard ne soit pas fermé. Le réfrigérateur est tres utile. Le ménage a ete fait tous les jours sauf un. Mais la gouvernante est passée en fin d'après-midi pour renouveler le linge de toilette et s'assurer que nous ne manquions de\nrien.\nComme les avis le disent, la salle du petit-déjeuner est petite, mais avec un peu de patience, il est tres possible de trouver une place. Le petit-déjeuner ottert est complet (sale, sucre, yaourts, cheese cream, céréales, pains, bagels,...) et varie selon les jours (parfums des pâtisseries, bacon ou saucisses accompagnant les œufs brouillés, ...).\nLa bagagerie gratuite à l'arrivée (avant 16h - mais tout a été fait pour la mettre à notre disposition bien plus tôt!) et au départ est tres utile.\nL'estimation à 2,5 étoiles est très au dessous de la réalité. Et bien des hôtels 4 étoiles de New York que nous avons connus pourraient prendre exemple.\nNous reviendrons sans hésitation au Wingate by\nWyndham NYC Midtown south.","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Small space with sweet sleep","lang":"en","publishedDate":"2023-09-15","publishedPlatform":"OTHER","rating":5,"text":"\nProprty always smell sweet &  fresh-  located steps away from Broadway & time Square Breaflkfast satisfying with options of cold\/hot cereals muffins and waffles. At time of visit felt safe to access property at nights . Property located steps away from resturants that stay open late. ENtire state building located near by.Cons: single queen\/king size rooms are small.  No self service laundry facility on premise. WILL COME BACK AGAIN \n","travelDate":"2023-09","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Not a City View","lang":"en","publishedDate":"2023-09-09","publishedPlatform":"OTHER","rating":3,"text":"The hotel staff were lovely and the room was clean. The free breakfast was a plus. The room was a shoebox and the closet was non-existent. It was hard to move around the room with two people. The shower was tiny (I am a tiny person only 5\"0) and I had a difficult time maneuvering. It also had a rainfall shower head which is not condusive for those who don't wash their hair everyday. We chose this hotel because we could get a city view room. The city view was more of an industrial view. I don't think I would stay here again due to the size of the room and the not so city view.","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great hotel. No parking.","lang":"en","publishedDate":"2023-09-03","publishedPlatform":"OTHER","rating":5,"text":"Hotel is great! 5 stars! Front desk staff is amazing! I would have found a hotel with parking if friends weren't already staying there. Parking garage not far, though, so don't let that deter you. Tip: don't bring a car to the City! lol","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"A-","lang":"en","publishedDate":"2023-08-26","publishedPlatform":"OTHER","rating":4,"text":"After a two night stay, here are my views:\n\nPros: cute\/modernize room; very friendly staff; located near the action; complementary breakfast\n\nCons: no access to the rooftop: extremely small room; the closet is a nook; the shower is small and the showerhead is a rainfall style (I don't wet\/wash my hair during every shower); the \"City View\" was best described as an industrial view.","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excellent place","lang":"en","publishedDate":"2023-08-18","publishedPlatform":"OTHER","rating":5,"text":"The place is close to many places of interest. It's in a bustling area with lot of tourists. The place is clean and tidy. Breakfast is great and staff is very friendly and helpful. The rooms are a bit small, though.","travelDate":"2023-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Worst hotel manager I've ever dealt with","lang":"en","publishedDate":"2023-08-17","publishedPlatform":"OTHER","rating":1,"text":"Worst hotel experience EVER!!\nThe hotel manager Selena hung up the phone on me, won't return my calls and won't refund a stay that's four months away. \n\nI'm a travel agent and have done a lot of business in this industry, these people at this hotel have unsavory business practices, IMHO.\nThis is my first negative review\nStay away and go somewhere else, I never plan on doing business with them again. I feel liked I was taken advantage of and the manager refuses to give me the owners name.\n\nAwful and sad to run a business like this!\nNo hospitality here!","travelDate":"2023-08","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Such a lack of courtesy","lang":"en","publishedDate":"2023-08-15","publishedPlatform":"OTHER","rating":1,"text":"I've never experienced a lack of courtesy like that anywhere in the world before. The room was ready and available and they wanted to charge $30 for early check-in before 4 pm. I've always experienced the extreme opposite, if the room is ready and available the property always offered early check-in as a courtesy. The staff was rude and made me feel like a fool. Also, the bathroom door doesn't provide privacy if you're not staying alone and the toilet paper is of poor quality. If you can, don't stay there! ","travelDate":"2023-08","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":19097786,"title":"Bring ear plugs","lang":"en","publishedDate":"2023-08-07","publishedPlatform":"OTHER","rating":2,"text":"Noise Noise Noise !!!  Do not get a room on the street side facing the Empire state building . You will need Tylenol and ear plugs . Noise is so bad that you will not get any sleep ,unless you walk in at 2 am . Room was clean and breakfast was just ok . Elevators beep a lot .Basically this place is not sound proof on all levels. people at the desk were nice and tried hard to make us feel welcome .Manager was useless.","travelDate":"2023-08","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Very good NYC hotel location for reasonable price","lang":"en","publishedDate":"2023-07-25","publishedPlatform":"OTHER","rating":5,"text":"Perfect for a short stay up to 4 days. Location is great and staff is very attentive and polite. Metro access not far away. The prices are reasonable concerning to other NYC locations. We will be back. ","travelDate":"2023-07","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great hotel! Loved it!","lang":"en","publishedDate":"2023-07-11","publishedPlatform":"OTHER","rating":5,"text":"This hotel is super clean! My room was always fresh and welcoming on my return from sightseeing! Cool too which was great as it was very warm out! The location is great, I paid for a Gotham view and loved it. Had a 17th floor room so just superb views! Breakfast was varied and tasty. Was a very small dining area but you could take food to your room so it was manageable. Really enjoyed my 7 night stay and would return. Staff really friendly!","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Nice stay","lang":"en","publishedDate":"2023-07-10","publishedPlatform":"OTHER","rating":5,"text":"Exceeded our expectations, very secure with access cards required, breakfast a little crowded, rooms very small but clean and efficient, no street noise, would recommend to family and friends, look forward to another stay","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"AMAZING","lang":"en","publishedDate":"2023-07-09","publishedPlatform":"OTHER","rating":5,"text":"For starters, the everyone who works there is so nice!! I absolutely LOVED this hotel and would definitely come back. For me, it’s a bit hard to find a hotel because I cannot stay in one where the room has a carpet, but this hotel didn’t have a carpet at all! Everything was very clean and it’s not a far walk to Times Square! Not to mention, there’s places to eat all around! You do not need a car at all because public transportation is all around!! Also, how can I forget the complimentary breakfast?! Such a great experience! I will be coming back for sure.","travelDate":"2023-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great","lang":"en","publishedDate":"2023-07-08","publishedPlatform":"OTHER","rating":5,"text":"Very very clean and comfortable great stay. Would loose a point or 2 for breakfast and location of breakfast too small but staff lovely and very comfortable. Really pleased as clean is important to us ","travelDate":"2023-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Highly Recommended","lang":"en","publishedDate":"2023-07-06","publishedPlatform":"OTHER","rating":5,"text":"This hotel was spotless in every area.  My room was small, but it was perfect for my purpose.  The breakfast was great with a lot of items to choose from. Your room key is required to enter the building as well as the elevator.  This made me feel very safe in New York City.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Urlaubsreise 5 Tage","lang":"de","publishedDate":"2023-07-03","publishedPlatform":"OTHER","rating":3,"text":"Nettes Hotel mit freundlichem Personal, die hinteren Zimmer sind durch Klimaanlagen sehr geräuchbelastet, Bad, Bett und Einrichtung ok, für längere Aufenthalte fehlt ein Kleiderschrank.\nWar mit meiner Frau für 5 Tage dort zum Städtetrip.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Winning at the Wingate by Windham New York Midtown","lang":"en","publishedDate":"2023-06-28","publishedPlatform":"OTHER","rating":5,"text":"We had an amazing time while staying at the Wingate by Wyndham. We arrived by train at Grand Central and it was a short walk to the hotel, where we were greeted warmly and given early check-in. \nOur room was small but very clean and had everything we needed. We were in the back of the hotel, which is quieter, but the view was of some older buildings and a fire escape. It didn't really matter because we were not in NYC to sit in our room. \nThe hotel is just a couple of blocks from Bryant Park and the New York Public Library. Get takeout from the Bryant Park Deli and grab a table in the park to eat like New Yorkers instead of tourists. \nThe New York Public Library has an outstanding free museum. \nIt is only a short walk to Times Square. We saw a Broadway show each night and were fine walking in the neighborhood of the hotel while coming back late. There was always a desk clerk on duty and we could tell that security was a priority.\nThere are only 4 rooms on each floor and two elevators. We never had to wait long for an elevator during our stay. \nThe breakfast room is like the guestrooms, compact. The staff worked hard to provide breakfast each morning featuring waffles, eggs, bacon or sausage and a variety of breads, muffins and pastries. There was also cereal, oatmeal, fresh fruit and a selection of single-serve yogurts. Beverages included coffee, tea and hot chocolate. Breakfast gets crowded, so get there early to get a table.\nKudos to the hard-working staff on their unfailing courtesy and willingness to help. This hotel is very well-run. We have already booked our next visit and highly recommend this for the location, cleanliness and customer service. \n","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Horrible Service","lang":"en","publishedDate":"2023-06-27","publishedPlatform":"OTHER","rating":2,"text":"The location is the only nice thing about this property. The service is horrible. Don't even think that your membership level means anything! Because it does not. They even had us checking out the day before our reservation was to end. ","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Bad management and customer service","lang":"en","publishedDate":"2023-06-27","publishedPlatform":"OTHER","rating":1,"text":"My cousin and I were supposed to visit NYC from August 3rd to August 6th. My cousin is handicapped, and we are both students. Today is June 27th, my cousin had an emergency health issue that made her body freeze and her heart beat like crazy. Her family brought her to the hospital to check. Thus, I canceled this hotel today that I booked through Expedia in June 11th, and no refund appeared even though our trip would be in another month. I talked to Expedia, and they told me to get approval from the hotel. I called the hotel 3 times to ask for that, but they said no. I made a deal that I do not need a refund for myself, but at least please 50% at least of the amount that we paid ($923 for 3 nights) for my cousin's hospital bills. (or even $300 or $400). Their final answer is still a no. They have no heart in this situation.\nTalking about the business side, they have problems with ethics in management. I have been managing 1 restaurant and 1 nail shop for a couple of years, and I am an MBA student in Florida. I just see this hotel is gaining money from visitors without customer service and ethics; related to this, I am not sure whether their room is cleaned or anything else. PLEASE AVOID THIS HOTEL.\nThank you for your reading.","travelDate":"2023-06","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great stay","lang":"en","publishedDate":"2023-06-27","publishedPlatform":"OTHER","rating":5,"text":"Midtown is the best place to stay if your in Manhattan and the Wingate by Wyndham made it so. Our family had a great time the hotel was quite and clean. They have a great breakfast to get the day started.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Bien situé, Petit déjeuner compris, Chambre trop petite. Accès PMR ok","lang":"fr","publishedDate":"2023-06-23","publishedPlatform":"MOBILE","rating":3,"text":"*Cet hôtel est hyper bien situé : proche des transports (bus + metro) , dans le centre, à quelques  minutes de marche de Bryant  Park - de Grand central - Times Square \n* Séjour de 13 nuits dans cet hôtel conçu pour recevoir des touristes de passage (2-3 nuits maximum) qui se déplacent avec peu de bagages.[ce qui n'était  pas notre cas puisque long séjour + 4 valises)\n* Petit déjeuner à partir de 6h00 en semaine et 7h00 le week-end.  Propreté, choix : - sucré  (viennoiseries +cakes + gaufres + pain) -  salé : oeufs\/ Saucisses ou lard- fruits - yaourts - jus \/ café\/thé.  Salle trop petite comparativement à  la capacité de l'hôtel ---> y aller des l'ouverture  pour avoir de la place .\n\"Big up \" à  la dame qui gère le petit déjeuner en semaine (extra , gentille, bosseuse).\n* Accueil : tout le personnel n'est pas hyper sympathique. +++ à la réceptionniste qui attendait un bébé.\n(La nuit il y a eut dans la chambre à côté de la nôtre à 4h30 du matin une  grosde dispute de couple dans  la chambre  voisine qui a réveillé les 3 autres chambres. Je suis descendue à la réception, suis remontée avec le réceptionniste de nuit venu constater les cris ... qui est redescendu aussitôt et n'a pas agi. Nuit suivante idem...). \n* Chambre : j'avais prévenu l'hôtel  via un mail que je suis PMR (déplacements avec difficultés en béquille...). Mais nous avons reçu une chambre \"mini\" au 14ème étage. Impossible de se mouvoir. Tout est à collé, évier dans la chambre, pas de place dans le placard...\nImpossible de vider nos valises (manque de places) , impossible d'entreposer nos valises (manque de place...\nChambre : lit Queen size ( pas grand) mais très confortable + machine café (capsules) + sèche cheveux + defroisseur vêtements + produits mini (salle de bain).\nMénage chambre : lit fait tous les jours, produits sdb + café remplacés, ménage (laisse à désirer...tâches non nettoyées pendant nos 13 jours sur place.\nAprès une demande, une longue  discussion, des menaces, ... et un supplément de 250$ nous avons obtenu le lendemain une chambre  plus grande adaptée à  mon handicap au 4ème étage. (Chambre pour personne à mobilité réduite) avec espace  + salle de bain séparée + rangements  +++ \nCet hôtel n'est pas fait pour les longs séjours. \n* A notre arrivée nous avons réglé en plus une somme de 200$ comme garantie (récupérée quelques jours après notre retour).\n* L'hôtel vend des boissons fraîches à l'accueil (moins chères en achetant à l'extérieur)\n*** nous y retournerons si notre prochain séjour est plus court et si je reçois une chambre adaptée à mon handicap \n*** langues parlées : anglais + espagnol ","travelDate":"2023-05","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"New York New York","lang":"en","publishedDate":"2023-06-17","publishedPlatform":"OTHER","rating":5,"text":"Great location, make sure you book a top floor room for the view of the Empire State Building.\nClean, modern, comfortable.\nRoom size was great (1803). However we did ask to move from 1304 as it was too small.\n\nBreakfast room is chaos. Worth getting there early and not on the hour when everyone else arrives as there are only about 14 seats for a 70+ room hotel.\nBreakfast cost included though was a bonus.\n\nOne disappointment. Scaffolding was assembled on the face of the hotel at 6am one morning. It was extremely noisy and woke us up.","travelDate":"2023-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Good location; not a good room to do anything but sleep","lang":"en","publishedDate":"2023-06-15","publishedPlatform":"OTHER","rating":3,"text":"The location was good and staff were nice--but the room was lackluster and not well set-up to do work. Everything was extremely cramped. If you just need to sleep and value the location, this is a fine option. Otherwise, you can likely find better value-for-money elsewhere.","travelDate":"2023-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Terrible Service","lang":"en","publishedDate":"2023-06-14","publishedPlatform":"OTHER","rating":1,"text":"The management at this hotel is non existtent . They charged us for the stay even though the trip was prepaid. After checking the charges on our Visa we told them what had happened nobody could reverse the charges. We were told they could not see charges in their system . There was no manager on site .It's been 5 days things are still not sorted.\nWould not reccomend this Hotel to anyone\nGary","travelDate":"2023-06","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Clean, safe, convenient","lang":"en","publishedDate":"2023-06-03","publishedPlatform":"OTHER","rating":4,"text":"Excellent location right at 5thAve.  Easy walk to Broadway shows and Times Square.  Convenient city bus to Metropolitan Museum of Art.  Nearby German and Irish restaurants.  Easy stay! Made some new friends at breakfast as many European travelers were there at the same time.  We arrived early, but the front desk was very accommodating to check our luggage and we were able to walk to a nearby museum.","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Friendly and helpful","lang":"en","publishedDate":"2023-05-28","publishedPlatform":"OTHER","rating":5,"text":"The hotel was well presented and the people were very helpful, the issue I would say was breakfast, very busy and little seating area, in all great value for money. You were in the center of NY and seemed very safe, not an issue the hotel can fix but NY smells bad of all the ganja being smoked.","travelDate":"2023-05","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Good value for price","lang":"en","publishedDate":"2023-05-25","publishedPlatform":"OTHER","rating":5,"text":"This was a Useful location for our activities. Every staff member we observed or communicated with were friendly and competent. Attractive room. Attractive lobby and patio.  We appreciated being able to leave our bags after check in as we had an evening flight","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Definitely recommend","lang":"en","publishedDate":"2023-05-14","publishedPlatform":"OTHER","rating":5,"text":"Most comfortable hotel bed I have ever slept it. Clean property, friendly and helpful staff. Only problem was you can hear the elevator buzzing\/beeping as it goes past every floor all day\/night. Not too loud, but enough to wake you up. Would absolutely stay again. ","travelDate":"2023-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"The wingate at club Wyndham","lang":"en","publishedDate":"2023-05-10","publishedPlatform":"OTHER","rating":3,"text":"The stay was quite &. The check in process was good..no microwaves in the rooms was a big deal for me the internet was slow to connect..the over all stay was a good business trip.the key card however.","travelDate":"2023-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Hotel consigliato","lang":"it","publishedDate":"2023-05-07","publishedPlatform":"OTHER","rating":4,"text":"Hotel di nuova costruzione, buona posizione, colazione inclusa abbondante e soddisfacente sia nel dolce che salato. A due passi da Time Square ma comunque in zona tranquilla. Camere pulite con letti comodi.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excelente experiência ","lang":"pt","publishedDate":"2023-05-03","publishedPlatform":"MOBILE","rating":4,"text":"Excelente localização, banho e café da manhã. Os pontos fracos são o espaço do café da manhã que é muito pequeno, a água do chuveiro que se espalha pelo banheiro e a limpeza que que tem que ser solicitada, mas tudo dá para ser muito bem contornado!","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Room was clean, staff was friendly","lang":"en","publishedDate":"2023-05-02","publishedPlatform":"OTHER","rating":3,"text":"The room was very small but very clean, bathroom also. Bed was very comfortable, as well as the pillows. The elevator noise drove me crazy, and I didn't get room service in any of my three nights stay there. \nBreakfast was just ok. ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Good place to stay!","lang":"en","publishedDate":"2023-04-30","publishedPlatform":"OTHER","rating":5,"text":"The establishment was incredibly clean with a secure hotel entry.  The front rooms have an absolutely AMAZING view of the Empire State Building.  The hotel staff were all really friendly & accommodating.  The location was fabulous for our NYC visit including the late evening returns (the environment felt safe).","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Close to everything!","lang":"en","publishedDate":"2023-04-29","publishedPlatform":"OTHER","rating":5,"text":"I am tempted to give it only 1 out of 5, so the rates don't go up and we can stay there next time!\n\nIt was my 3rd time in NY, and this is easily the best hotel I stayed in.\nWe had a very pleasant stay as a family of 4. \n\nEvery member of staff was really nice and professional and did their utmost to help. \nThe room was rather small (it's in Midtown Manhattan!), but had a wardrobe as well as a place for 2 suitcases. The shower itself was quite spacious.\nIf you come as a family, be aware that the beds are more queen than king.\nPrevious reviews mentioned the breakfast room being too small, but we never had to wait that long to find seats. There was a good variety of choice, too.\nThe location was just perfect: 5 minutes from Times Square and 5 minutes from the Empire State Building, 10 minutes from MSG, with many places to eat and drink in the area. \n\nWe would love to stay there again.\n\n ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Stedentrip NewYork","lang":"nl","publishedDate":"2023-04-28","publishedPlatform":"MOBILE","rating":4,"text":"Kleinschalig hotel in Manhattan, dicht bij het  OV en alle bezienswaardigheden. Hotelkamer is goed, klein maar uiterst functioneel. Goede bedden, goed sanitair, alleen de ontbijtruimte is niet berekend op het aantal gasten. Vroeg ontbijten en je mijdt de drukte. Probeer een kamer zo hoog mogelijk te krijgen en kamers die eindigen op 3 of 4 hebben zicht op het iconische Empire State. Net hotel met vriendelijke gastheren en gastvrouwen.","travelDate":"2023-04","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":19097786,"title":"NYC getaway","lang":"en","publishedDate":"2023-04-24","publishedPlatform":"OTHER","rating":5,"text":"Location is great for Broadway shows and museums.  Property is clean, staff is friendly and helpful.  Rooms are small but well appointed with shelves and hooks on the wall, sort of reminds me of an entire room of IKEA  furniture.  Bathroom is good with the sink actually in the room.  ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"A good hotel for a citytrip","lang":"en","publishedDate":"2023-04-24","publishedPlatform":"OTHER","rating":4,"text":"If you wanna have a hotel nearby than this hotel is a good place. The rooms were good, the bathroom was excellent. The breakfast could be better if there was more place. The staff is very friendly and always with much patience helpfunctie. Value for money and if there is a next visit than i choose again. ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Buen hotel. Desayuno incluido (no muy bueno).","lang":"es","publishedDate":"2023-04-24","publishedPlatform":"OTHER","rating":3,"text":"El hotel esta bien en relacion al precio. \nLa ubicacion era muy buena, cerca de Bryant park y empire state. Habitaciones son chicas, el desayuno era rico pero muy poco variado y el espacio muy pequeño.","travelDate":"2023-04","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Vacations in new york next to the empire state","lang":"en","publishedDate":"2023-04-17","publishedPlatform":"OTHER","rating":5,"text":"Good comfortable hotel, very clean, and very friendly staff in the center of Manhattan, very close to places of interest. And with normal breakfast. Good quality price, this is your hotel if you travel to new York for the first time","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Wonderful!","lang":"en","publishedDate":"2023-04-12","publishedPlatform":"OTHER","rating":5,"text":"I took a quick weekend trip to NYC and stayed at this hotel. It’s one of the best hotels I’ve stayed at! The staff were very very kind. The room is a little small, but it has everything you need, and the bathroom is a great size! Breakfast was good too. I will also say the location is great! Easy to walk to attractions and restaurants. Next time I’m in town, I would definitely stay here again! ","travelDate":"2023-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"cute and close to time square","lang":"en","publishedDate":"2023-04-11","publishedPlatform":"OTHER","rating":3,"text":"it was ok a cute little hotel with breakfast and an amazing shower head. it was near time square as well as the public library.  however, it was a little bit claustrophobic I wish they offer medical rates for longer stays. overall best stuff and best location. ","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"A gem in mid-town","lang":"en","publishedDate":"2023-03-29","publishedPlatform":"OTHER","rating":5,"text":"I was so happy with everything about my stay including its great location! The staff was friendly, helpful and provided a welcoming setting. The breakfast was incredible with a range of selections for everyone’s needs.","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Nice hotel in Midtown","lang":"en","publishedDate":"2023-03-24","publishedPlatform":"OTHER","rating":5,"text":"Small room, but big and really beautiful bathroom. The bed was very comfy. The room was clean and very quiet - and it has a small fridge and a safety box. Good breakfast. Great location in Midtown. Easy check in and check out. I will definately come back.\n","travelDate":"2023-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Worst Place I never stayed at — EVER ","lang":"en","publishedDate":"2023-03-24","publishedPlatform":"OTHER","rating":1,"text":"Excited but left homeless, disgusted and disappointed \n\nOn my last vacation in Vegas, I checked out a Wyndham Resort and got their credit card. This was going to be the first time I said at their hotel\/property. \n\nUpon arriving, they ask for a credit card. I explained in a rush, I left my purse and could provide either cash or a digital credit card. They explained they took neither. I ask to speak to the manger, she was even MORE unhelpful then the front desk clerk. \n\nI understand they have limits, at least they could have helpful suggestions on alternative. They could have commiserate with me and my situation. Good customer service isn't just renting someone a room. It's going the extra mile. All three of the next hotels that I tried, really tried to help me. \n\nIf I could, I'd give this property less than three stars -3. As a New Yorker, born and raised I know we don't have to be mean, nasty and uncooperative. The service I received was the negative stereotype others have of our city. I suggest they do better and retrain their staff. Maybe, highlight the types of payments they can receive, not just some unread footnote.","travelDate":"2023-03","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Hotel bien situé","lang":"fr","publishedDate":"2023-03-20","publishedPlatform":"OTHER","rating":4,"text":"Hôtel très bien situé et très calme à 10 mm de Briant Park . Bien que les chambres soient petites il y a tout le confort . Literie impeccable. Seul bémol le petit déjeuner avant une salle vraiment trop petite.","travelDate":"2023-03","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excelente hotel","lang":"es","publishedDate":"2023-03-01","publishedPlatform":"OTHER","rating":5,"text":"Excelente ubicación, cercano al metro de NYC, cercano a TIME SQUARE, excelente vista al EMPIRE STATE (nuestra habitación era en el piso 15), buen desayuno, pero el comedor y la sala de estar son pequeños, la atención del personal excelente. Muy buen hotel. ","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"voyage à 2","lang":"fr","publishedDate":"2023-02-27","publishedPlatform":"OTHER","rating":5,"text":"Hotel propre\n4 chambres par palier\nNous étions au 13 eme étage avec vue sur l'ESB\nChambre petite mais assez pour 2 personnes dans notre cas\nLiterie impeccable lit Kingsize pour 2 \nToutefois le ménage n'était pas fait tous les jours mais le nombre de serviette suffisait pour 2 jours \nEmplacement à proximité du métro sur la 37 (Metro sur le 35 eme à Herals Square en face du MAcy's et pas loin du MSG)","travelDate":"2023-02","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":19097786,"title":"One night","lang":"en","publishedDate":"2023-02-16","publishedPlatform":"OTHER","rating":4,"text":"Excellent location for an overnight stay in midtown especially for after show on Broadway. Staff were pleasant and efficient. We had of view of Empire State but would have been more spectacular on the higher floor.","travelDate":"2023-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Hotel excelente","lang":"pt","publishedDate":"2023-02-10","publishedPlatform":"OTHER","rating":5,"text":"O hotel é  excelente com ótimo atendimento, além de um café maravilhoso. O hotel esta próximo da estação de metro 34st, além de conseguir fazer uma grande parte dos passeios à pé. Ficamos em quarto perfeito com vista para Empire, o quarto tem o tamanho ideal para duas pessoas. Certamente, ficaria hospedado neste hotel outras vezes.","travelDate":"2023-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great choice for NYC","lang":"en","publishedDate":"2023-02-06","publishedPlatform":"MOBILE","rating":4,"text":"Breakfast is decent but the restaurant area is a little too small for the size of hotel meaning you often struggle to get a seat.\n\nGreat location for walking to a number of sites and accessing the subway for everything else.\n\nStaff were friendly and welcoming and the check in and check out were speedy and easy. \nThey have luggage storage if you arrive\/leave at an inconvenient time for check in\/out.","travelDate":"2023-02","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Perfect room for a weekend away","lang":"en","publishedDate":"2023-02-03","publishedPlatform":"OTHER","rating":5,"text":"I usually stay in the New Yorker when I come up for a weekend show, but my friend and I decided to try out the Wingate.  We were blown away.  The servce was fabulous - thank you Jennifer for your help with the tickets.  The hotel is near enough to be an easy walk to Broadway, but far enough away to be quiet.  We swung into breakfast in the morning and grabbed a coffee and scone.  There was a good sample of pastries, coffee, and I think even a waffle maker.  It is really the best Wyndham hotel I have stayed at in NYC. ","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Exceptional Hotel and Staff","lang":"en","publishedDate":"2023-01-31","publishedPlatform":"OTHER","rating":5,"text":"Our trip was a mothers and daughters weekend to see the Phantom of the Opera. This hotel location was so centrally located to everything that we wanted to do or see. We felt safe the entire time we were there even though we were out and about all over the city. The Hotel Staff is the absolute best that i've ever encountered. The Coffee Maker in the room was a priority as well as the variety of breakfast items each morning. We were totally satisfied with this Hotel. 5 Stars!!!!!","travelDate":"2023-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great value","lang":"en","publishedDate":"2023-01-23","publishedPlatform":"OTHER","rating":5,"text":"Needed a hotel on 5th Avenue and this was the first time saying with Wingate. \nThe price was very reasonable and the room was great.  \nCheck in was very friendly and fast. I will definitely stay there again in the future.  ","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Hôtel très propre et bien situé","lang":"fr","publishedDate":"2023-01-22","publishedPlatform":"OTHER","rating":4,"text":"Nous avons beaucoup apprécié la situation de l'hôtel à proximité de Time square et de l'Empire state building. Les lits sont confortables, le personnel compétent et sympathique. Le rapport qualité prix est excellent.","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Avoid at all cost: the most terrible customer service and rude manager with zero concern for customer satisfaction","lang":"en","publishedDate":"2023-01-18","publishedPlatform":"OTHER","rating":1,"text":"They do not honour prepaid reservations made by travel agents and do not let you know about this. I had a room booked via a travel agency that books any work related trips for the company I work with. They send a prepaid hotel voucher in the name of the person travelling. I have never had any issues with this, including other Wyndham hotels. Wingate is a franchise (I contacted the Wyndham group abut this) and this means they have their own rules and do as they please.\nI contacted the hotel prior to arrival to enquire about the room and got a message back from Esteban who advised I will not be able to check in because the credit card used and its cardholder must be present during check-in along with a photo ID for verification. Obviously this is not possible when booking via a travel agent and having the hotel stay paid in advance. I followed up on that email asking for clarification to be met with complete silence. After being ghosted, finally someone else responded saying this is their policy, which, as far as I am concerned, cannot be found anywhere on their website. Sadly, I have no crystal ball to foresee what policies they have or invent as they go. Long story short, they cancelled my reservation and as a gesture of goodwill (!) issued a refund. Had I not contacted them prior to my arrival, I would have been left with no accommodation in NYC. They never meant to contact me or the travel agency advising the booking is not valid. They just wanted to keep the money and not allow people to check in. This is utterly unacceptable and unreasonable and beyond shocking.","travelDate":"2023-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excellent Hotel","lang":"en","publishedDate":"2023-01-18","publishedPlatform":"MOBILE","rating":5,"text":"Stayed for a week in January 2023, the place was faultless from start to finish. All the staff are friendly and helpful. Rooms were small as expected but had everything you need (including a fridge and coffee maker) and we're spotless cleaned and serviced regularly. Free breakfast was a bonus and had an excellent variety of items , we were up early and never had any issue however did observe big queues towards the end of breakfast time as the room is quite small. For the price and location a definite 10\/10. Hope to come back soon 👍","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Amazing Hotel and Staff","lang":"en","publishedDate":"2023-01-13","publishedPlatform":"OTHER","rating":5,"text":"The Hotel seems new with really nice installations and is amazingly located. The room had a beautiful view of the Empire State Building. The breakfast was life-saving, but the best was definitely the staff, always willing to help, every single one of them. I would totally stay there again!","travelDate":"2023-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Soggiorno fantastico","lang":"it","publishedDate":"2023-01-07","publishedPlatform":"OTHER","rating":5,"text":"La struttura si trova in una posizione ottima, a pochissimi minuti a piedi da Times square, Bryant park e Fifth Ave, nonostante sia centralissimo è silenziosissimo. Camere belle e fornite di frigo e macchina del caffè. Letto comodissimo e pulizie delle camere effettuate ogni giorno. Struttura molto pulita, personale gentilissimo e colazione ottima e abbondante composta sia da dolce che salato. Se tornerò a New York sicuramente soggiornerò di nuovo qui! Consigliatissimo a tutti!","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excelente servicio","lang":"es","publishedDate":"2023-01-04","publishedPlatform":"OTHER","rating":5,"text":"El hotel está muy bien localizado, cerca de todo y las personas son muy amables, la habitación un poco pequeña pero para una persona ok, todo muy limpio, el desayuno muy bueno y suficiente, definitivamente volvería a hospedarme.","travelDate":"2022-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Totally enjoyable stay","lang":"en","publishedDate":"2022-12-31","publishedPlatform":"OTHER","rating":5,"text":"The hotel staff made our stay quite enjoyable. Our room was very adequate, clean and quiet. Front desk personnel were helpful and accommodating. Our luggage was held for us until check-in as we were early into the city.  In addition, after our check-out, a package was safely kept for \ncollection by our friend.\nAlex was a source of fun and jovial conversations.","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great stay","lang":"en","publishedDate":"2022-12-29","publishedPlatform":"OTHER","rating":5,"text":"We enjoyed staying here. Had a view of the empire state building which was nice. Thought that the price was reasonable and the location was good. We got a breakfast in the morning. I remember the lobby being very heavily scented, gave me a bit of a headache. So that is maybe something they could cut back on.","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Empire Views and amazing staff! Must stay.","lang":"en","publishedDate":"2022-12-26","publishedPlatform":"OTHER","rating":5,"text":"The rooms are small so be prepared but you can’t beat the Empire State Building views and the staff make the experience amazing. They also provide a simple breakfast. The value is totally worth the stay. ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"All things it set out to do and done right","lang":"en","publishedDate":"2022-12-16","publishedPlatform":"OTHER","rating":5,"text":"Staff was super nice consistently. Yes, rooms are small but they look recently renovated so they are fine and cozy. Bed was amazing. Everything seemed very clean. The room had all we needed, really. GREAT location! Perhaps this is its biggest positive. We will probably stay here again when we visit NYC net time as it proved to be a safe bet. Would definitely recommend it!","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Small but mighty","lang":"en","publishedDate":"2022-12-10","publishedPlatform":"OTHER","rating":5,"text":"I was so pleasantly surprised. Staff was extremely friendly. Room was small but all we did was sleep. The bed was amazing. Breakfast was great, waffle maker was great!! Would definitely stay again. Glad I found this deal!! It was right in the heart of where we wanted to be!! ","travelDate":"2022-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"GREAT Location HOWEVER Rooms TOO SMALL ","lang":"en","publishedDate":"2022-12-04","publishedPlatform":"OTHER","rating":3,"text":"The location is excellent. However the rooms are TOO SMALL. To put things in perspective… outside cruise ship cabins are bigger than the room we had. I’ve stayed at Wyndham Wingate Midtown prior to 2019.. apparently the location changed. So, I was caught off guard when I found out this was a different midtown location. In the prior location the rooms were much bigger. \n\nWe were only there for a weekend. If my stay was longer I would have had to change hotels.\n\nI’m giving it 3 stars due to the size of the room otherwise it would be 4 stars.\n\nOn a more positive note, the rooms are nice and customer service was EXCELLENT.","travelDate":"2022-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Sliver Hotel In Mid-Town NYC","lang":"en","publishedDate":"2022-11-30","publishedPlatform":"OTHER","rating":3,"text":"Not a bad stay at all. Except, that for most, this room would be considered pretty small. There's a small cubby for shower and toilet but the sink was in the bed area. Nevertheless, the place was clean, well-lighted, with only 4 rooms per floor. The higher floors have some views, especially of the Empire State tower if you're facing south. Room had a mini fridge and a small breakfast was served downstairs. Wonderful location, too. Just behind Bryant Park and the NY Public Library. and Macy's and the 34th street shopping is the same distance heading south.","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":19097786,"title":"Great value very central hotel, with clean, comfortable bedroom\/bathroom and friendly staff","lang":"en","publishedDate":"2022-11-29","publishedPlatform":"MOBILE","rating":5,"text":"Great location - near to both Penn Staton (so easy from JFK on Airtrain and then LIRR), and Grand Central from where I was getting a train to Connecticut. But it’s also near lots of shops, Bryant Park, Empire State and Chrysler Building etc.\n\nThe reception staff were really friendly and helpful. The room and bathroom were very clean, it was modern and new, the bed was comfortable and the TV worked (and was showing the World Cup!). \n\nI was worried that for the price it wouldn’t live up to the pictures, but it did and was probably better. Great little tea\/coffee machine, a microwave, and a fridge. The breakfast room isn’t huge and everyone leaves it later (though reception had warned me about that). But I grabbed a coffee, some fruit and a croissant and went back to my room to have.\n\nVery happy and would stay again. Even had a view of the Empire State from my bed!","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Lo straconsiglio!!!!","lang":"it","publishedDate":"2022-11-29","publishedPlatform":"OTHER","rating":4,"text":"Hotel in buona posizione per raggiungere tutte le principali attrazioni a piedi. Ottima l accoglienza. Camera piccola ma pulita, letto molto comodo, con vista sull empire. Le pulizie vengono effettuate dal 3gg in poi causa covid,cmq viene avvisato. colazione salata e dolce buona e sempre rifornita. Consiglio di andarci sulle 7.30, perché il posto è piccolino e dopo non trovi il tavolino. Consiglio vivamente questo hotel. Voto 9","travelDate":"2022-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"A gem in the city","lang":"en","publishedDate":"2022-11-28","publishedPlatform":"OTHER","rating":5,"text":"A gem in the city with a PERFECT location to see the Macy’s Thanksgivings Day Parade. It goes down the street less than a block from the hotel. Their owners\/staff are awesome…Selena, Alex and Esteban were all amazing. Selena was welcoming and gave us tips about the parade. She treated us like family. Esteban always had a smile on his face and was very kind and Alex was the comic relief.  The rooms are small but well suited for my bestie and I. We had an amazing view of the Empire States Building. The hotel was clean and the bed was comfy. Highly recommend.!!!!  Go get amazing cookies and coffee at Expresso Culture around the corner while you are there. ","travelDate":"2022-11","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Best hotel great price","lang":"en","publishedDate":"2022-11-25","publishedPlatform":"OTHER","rating":5,"text":"I enjoyed the location the price the quality of the room and the breakfast! Cant be better. No need to think twice. Just go and stay there! The price is as low as you can get in NYC and the quality is better than twice cost hotels!","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great location; SMALL room","lang":"en","publishedDate":"2022-11-18","publishedPlatform":"OTHER","rating":3,"text":"Great for a weekend stay either solo or with a CLOSE friend.  There is not enough room to walk to the other side of the bed, NO privacy and not enough room for more than a backpack.  A shelf in the bathroom would be SO helpful.  The countertop is pretty much the size of the sink so there isn’t even room for a toothbrush.  No microwave.  On the plus side, there is a small refrigerator, you are mere steps to 5th Avenue, a quick 15 minute to Amtrak \/ Penn Station, and all of the other fabulous things NYC has to offer.  Yes, the rooms are SMALL, but a couple of extra shelves would be an easy fix and make a stay even better.  The desk people are really nice and very helpful!","travelDate":"2022-11","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Sehr angenehmes Hotel.","lang":"de","publishedDate":"2022-11-09","publishedPlatform":"OTHER","rating":4,"text":"Genau die richtige Wahl für eine Woche in New York. Alles war zu unserer Zufriedenheit. Besonders positiv ist die Lage des Hotels zu bewerten. Die Verwendung von Einweggeschirr und Einwegbesteck beim Frühstück ist aus ökologischen Gesichtspunkten zu überdenken, ansonsten ist das Frühstück ausreichend.","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":19097786,"title":"Good location and friendly staff","lang":"en","publishedDate":"2022-11-07","publishedPlatform":"OTHER","rating":4,"text":"The hotel is in an excellent location being close to the Empire State Building, 5th and 6th Avenues and Times Square.  Staff were helpful and friendly on my arrival and I was able to get an early check-in (at ~2pm) which was ideal.  My room was on the 14th floor and I slept soundly with no noise issues.  I should point out however that the rooms are pretty small, with there being very little storage space (no wardrobe or chest of drawers).  The room and bathroom (shower only-no bath, with the wash hand basin being in the bedroom area) were clean and included a fridge, coffee machine and room safe.  Note that on check-in you are told that there is no daily room cleaning service.  This only occurs after the 3rd day although you will be provided with clean towels if needed.\n\nThe complimentary breakfast buffet was of a good standard with cereals, hot offerings (eggs, bacon and sausage etc.), breads, pastries and you could also make your own waffles courtesy of the waffle machine.  However, the breakfast area was pretty small with seating being limited and the area was often very crowded.\n\nOverall, I enjoyed my stay but would probably consider other hotel options in future as a result of the space issues previously mentioned.","travelDate":"2022-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Perfect location in NYC","lang":"en","publishedDate":"2022-10-30","publishedPlatform":"OTHER","rating":5,"text":"We felt comfortable and safe! The entire staff is phenomenal. The property is very clean and the breakfast is scrumptious! The location is perfect for downtown New York City; walking distance to shops and restaurants. We will be checking in again real soon.","travelDate":"2022-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Decisamente no!","lang":"it","publishedDate":"2022-10-24","publishedPlatform":"MOBILE","rating":2,"text":"Hotel in pieno centro, camera piuttosto piccola ma completa di tutto. Personale gentile e collaborativo. Ci sono però un paio di punti deboli, ovvero: 1) colazione decisamente povera e da consumarsi in un luogo angusto, con solo una ventina di posti, cosa che costringe ad alzarsi ad orari assurdi e a mangiare decisamente stipati; 2) pulizie effettuate solo al terzo giorno e solo su richiesta ( condizione però che non vedrete segnalata da nessuna parte). Ritengo questo secondo punto decisamente inaccettabile ed immotivato, ma a nulla sono servite le mie recriminazioni. In una città come New York c'è sicuramente di meglio.","travelDate":"2022-10","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Non e’ tutto oro…","lang":"it","publishedDate":"2022-10-15","publishedPlatform":"MOBILE","rating":1,"text":"Certo, un ottimo prezzo ma a quali condizioni… pagamento immediato al check-in insieme alla firma di vari documenti compresa l’informativa che verrà addebitata una penale in caso di fumo in stanza. Si dimenticano però di dirti che la stanza viene pulita al 3’ giorno di soggiorno causa covid e poi su richiesta (se si ricordano di scriverlo: in sette notti ci è stata pulita solo due volte). Stessa cosa la sostituzione degli asciugamani che, eventualmente, su richiesta vengono comunque forniti.\nColazione a buffet con pane, vari tipi di bagel, qualche marmellata monodose, burro, uova, salsicce, yogurt, latte, cereali e frutta.\n\nIn parole povere…. Chi spende poco avrà poco! Sicuramente non tornerò in questo hotel.","travelDate":"2022-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Pulizia camera questo sconosciuto","lang":"it","publishedDate":"2022-10-09","publishedPlatform":"OTHER","rating":3,"text":"La pulizia giornaliera delle camere è fatta solo su espressa richiesta in fase di check in. Noi non avendola richiesta avendola data per scontata ( era indicata in fase di prenotazione hotel) non è mai stata fatta durante la nostra permanenza di tre notti. Consiglio se la volete chiedetela espressamente ( assurdo). Per il wi fi è stato possibile collegare un solo telefono!!","travelDate":"2022-10","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Poorly designed and maintained room","lang":"en","publishedDate":"2022-10-06","publishedPlatform":"OTHER","rating":3,"text":"Bed was comfortable. Price was relatively low. \nAC\/heat was the only way to get air circulation in room.  If temperature was right, it was very stuffy with no \nfan. Bathroom door slid open every time you closed it, no privacy. Only took 2 days to fix that, everything else was not fixed. Refrigerator made a high piercing noise so we had to turn it off. By design, there were no drawers or shelves in bedroom or bathroom.  ","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Awesome","lang":"en","publishedDate":"2022-09-23","publishedPlatform":"OTHER","rating":5,"text":"Had Awesome time at this hotel and the rooms n staff were great. I would definitely stay here again can’t wait to come back at this hotel in the near future and the price was right thank you so much for a wonderful stay see you soon. ","travelDate":"2022-09","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Wingate by Wyndham","lang":"en","publishedDate":"2022-09-22","publishedPlatform":"OTHER","rating":3,"text":"Hotel is centrally located. Alex the manager is nice and helpful but the GM was condescending and rude despite being unavailable to address our problems during our stay. The handheld shower didn’t work and wasn’t fixed. Our room was only cleaned on the third day despite our repeated requests. We were not informed at time of booking that our room would not be cleaned and the room could bit be canceled upon check in when we learned about this issue. We were told we would have fresh towels and soap and beds made daily but that was not the case until day 3.","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Tiny rooms no hot water","lang":"en","publishedDate":"2022-09-21","publishedPlatform":"OTHER","rating":1,"text":"These rooms are small. Like climbing over your partner to get out of bed small. No closet, a rack screwed into the wall above the coffee maker. 5 shirts max. No hot water in the shower. No way I’d pay the price for this again ","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Don’t bring anything that can’t fit into a small carry on","lang":"en","publishedDate":"2022-09-15","publishedPlatform":"MOBILE","rating":1,"text":"Smallest rooms I have ever seen. No place to move. Couldn’t unpack bc there is no place to do so. Only room for one small bag to be open. The only positive was the staff was nice and the room was clean. However housekeeping only comes every third day so it’s a good thing it is. Would never stay here again .","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":19097786,"title":"Good location, helpful staff","lang":"en","publishedDate":"2022-09-12","publishedPlatform":"OTHER","rating":4,"text":"The rooms are not large, but the location is pretty central Manhattan so I suppose space is at a premium. The bed, though, was large and comfortable, and the bathroom was spacious and stylish (though without an actual bath, only a shower). Staff on the front desk were friendly and did their best to accommodate my requests (e.g. for early check-in). Overall, I was happy with my stay and will certainly consider using this hotel again. ","travelDate":"2022-09","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Overnight Stay for Concert Trip","lang":"en","publishedDate":"2022-08-31","publishedPlatform":"OTHER","rating":5,"text":"It was a pleasant stay with great service and a good view. The hotel was located right in the middle of everything and was a great price. I would go back anytime and recommended to anyone who wants to enjoy a new york weekend away from home ","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Molto buono","lang":"it","publishedDate":"2022-08-16","publishedPlatform":"OTHER","rating":4,"text":"Sono stato in questo hotel nell'ultimo weekend di Luglio, la posizione è ottima, moderno e di recente costruzione,  stanze piccoline ma c'è tutto il necessario,  molto pulite, lo consiglio per soggiorni brevi ! Tutti gentilissimi ","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Nice short stay","lang":"en","publishedDate":"2022-08-09","publishedPlatform":"OTHER","rating":5,"text":"We stayed here overnight. This is a new & centrally located hotel. The room is typical New York size but has everything you need, microwave,  refrigerator and microwave. Would definitely stay here again!","travelDate":"2022-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Better than expected","lang":"en","publishedDate":"2022-08-06","publishedPlatform":"OTHER","rating":4,"text":"The brown bag breakfast is gone.  The breakfast room is open as of end of July, 2022 for coffee, tea, yogurt, pastries, cereal, oatmeal and fruit.  The rooms are small but I hear that about all NYC rooms.  It was perfect for a couple but I don't know how a family would fit.  Staff was all very friendly.   The housekeeping is only supposedly every 3 days but if you ask for something the response is very fast.  I think both times we requested something it was less than 10 minutes.  Would stay again.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Un hotel perfecto para Nueva York","lang":"es","publishedDate":"2022-08-05","publishedPlatform":"OTHER","rating":5,"text":"Hotel con una excelente ubicación, con varias opciones para comer en los alrededores. Con una habitación muy limpia y en excelentes condiciones. Me encanto que había un conector usb para cargar los teléfonos celulares y\/o Tablet!","travelDate":"2022-07","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Incredible experience","lang":"en","publishedDate":"2022-07-24","publishedPlatform":"OTHER","rating":5,"text":"I had 2 rooms booked for 8 of my friends and we absolutely loved this hotel! The staff were phenomenal and extremely accommodating. Rooms were what is expected of new York Hotel but beautiful and very clean. Would highly recommend this hotel","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great Staff","lang":"en","publishedDate":"2022-07-22","publishedPlatform":"OTHER","rating":5,"text":"We truly enjoyed our stay.  The hotel staff was very accommodating and helpful.  Alex was outstanding.  Even though the rooms are small but they were comfortable and clean.  Bottom Line...I would stay at this hotel if I was on a quick getaway.  ","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Not exactly as advertised","lang":"en","publishedDate":"2022-07-19","publishedPlatform":"OTHER","rating":3,"text":"First off, no cleaning service for 3 nights “for your short stay.” We were given only two towels. The second night we had to wait over 30 minutes in our dirty, sweaty clothes after a long day before they brought towels and toilet paper upon our request. \n\n“Breakfast” …. is a brown bag of inedible stale packaged food. We didn’t even bother after throwing away the first bag. \n\nOur toilet kept gurgling and regurgitating throughout the stay. I almost wonder if there’s a plumbing issue in the whole hotel. Our room began to smell of sewage but we could not identify exactly where it was coming from. We’d grow immune to the smell only to rediscover the stench when we would leave and come back in. \n\nRoom itself was clean when we arrived. Small but adequate space.","travelDate":"2022-07","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Muy buen servicio","lang":"es","publishedDate":"2022-07-19","publishedPlatform":"OTHER","rating":5,"text":"Habitaciones limpias y cómodas con espacio razonable baño privado con todas las comodidades. Ubicación inmejorable está cerca de todo !! Y el personal muy amable y servicial a toda hora. El desayuno ligero y balanceado ","travelDate":"2022-07","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Hotel ótimo, com café da manhã sofrível...","lang":"pt","publishedDate":"2022-07-16","publishedPlatform":"OTHER","rating":4,"text":"Ótima localização, equipe atenciosa, estrutura no jeito.\nMas, o café da manhã...\nUm saco com as coisas para você comer no quarto. Sem sentido, pois nesta fase da Pandemia já há muito contato interpessoal (os funcionários do hotel, inclusive, não usavam máscara durante nossa estadia). Estivemos em outros dois hotéis nesta viagem (em grandes cidades e sempre com Buffet no café da manhã).\nFoi o único pecado!\nNosso quarto era com vista pro Empire State Building!  Inesquecível!","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Very friendly staff, clean and newer accomodations","lang":"en","publishedDate":"2022-07-08","publishedPlatform":"OTHER","rating":5,"text":"Wow, first of all... greeting upon arrival by Alex Rosado was amazing!  Thank you for the hospitality (great suggestions, friendly with family as we came and went, etc.).  About the hotel:  Rooms are modern and clean.  Fast response to any housekeeping needs.  There are not many rooms on each floor which is nice so you do not have constant \"neighbor\" noise.","travelDate":"2022-07","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great hotel","lang":"en","publishedDate":"2022-06-24","publishedPlatform":"OTHER","rating":5,"text":"This is a great place to enjoy a nice visit to NY, they will make your stay amazing and safe. Thanks Celina and Alex we definitely going to visit you guys next year, you made this trip remarkable for us, we recommend this location, you will be nearby for your convenience transportation and more importantly, you can really have a resting place to enjoy the time.","travelDate":"2022-06","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Small but Clean, Comfortable Accommodation, Excellent Front Desk Service","lang":"en","publishedDate":"2022-06-23","publishedPlatform":"OTHER","rating":4,"text":"The room is small but clean and comfortable.  Service staff at the front desk were courteous, efficient, friendly, helpful.  They are a credit to Wingate.  The facility could do with more hand sanitizers, for instance, where the elevators are.  It could also do with some patio furniture at the location.","travelDate":"2022-06","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great stay thumbs up!","lang":"en","publishedDate":"2022-06-07","publishedPlatform":"MOBILE","rating":5,"text":"Front desk was extremely courteous, professional, and helpful. Hotel room was very clean, breakfast was terrific. Perfect location!!!  General manager Selina was very accommodating and the price was very reasonable.\n    I would highly recommend this place, I would have to give a perfect 10!","travelDate":"2022-06","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Enjoyed My Stay There in April\/May, Would Stay Again","lang":"en","publishedDate":"2022-06-06","publishedPlatform":"OTHER","rating":4,"text":"I enjoyed my stay there and think it deserves to be ranked  higher on here.  Suspect it’s low because it might be new.  I paid a little over $3000AUD\/$2228USD for 9 nights.  Room was clean and in pretty good condition.  I booked a King Room with a large double bed through Booking.com.  Not huge but I think hotel rooms tend to be small in NYC.  There was room for everything, I just couldn’t open my large suitcase and leave it open without it being in the way, not the end of the world.  See photo attached.\n\nRoom had a safe, TV, mini fridge, ice box, marble top desk with lamp and chair, open closet space (with electric steamer) next to the bed for hanging jackets and shirts and 4 shelves above the bed so I used the shelves for folded clothes and as bedside table space.\n\nOn arrival, I was given a choice of two rooms.  A room on the street side that had a nicer view or a room at the back without a nice view, nice touch that they gave me a choice, went with the back one to avoid street noise and for the slightly bigger bathroom.  My room had the bathroom sink in the bathroom, not in the room like others do.  \n\nFloor was nice – wood or vinyl that looks like wood, I prefer that to carpet.  \n\nBed was comfortable.  \n\nBathroom was nice and one of the selling points for me to book this hotel.  Marble walls in the long stand up roomy shower enclosed with well designed glass wall and door to keep the water in.  Large overhead rain shower head as well as a detachable alternative shower head to switch to.  Decent water pressure and great temperature.  There was an air vent, no switch to turn it on but the bathroom never got steamy\/fogged up.  Not much room around the sink to put toiletries but two shelves under it so I used those.  \n\nBlock out curtain kept the light out.  Lighting wasn’t super bright, but was decent.\n\nRoom was fairly quiet.  Only 4 rooms on my floor.   I didn’t get any street noise.  The walls are thin, you do hear other people in their rooms and in the hall.  But I guess the people on my floor were quiet and considerate as it wasn’t an issue for me.\n\nThe staff were very nice.\n\nI’ve read reviews of other hotels in NYC where people have to wait a long time for lifts.  Never the case here.  Only 4 rooms per floor and lifts always came right away.\n\nOnly issue was the WiFi.  I was given a password for it but I got low security warnings for it on both my phone and laptop so I didn’t use it.\n\nI read reviews complaining about the breakfast.  Not an issue for me as I wanted to eat out.  There's a couple of Fresh & Co locations nearby so I went there.\n\nBeyond Sushi a couple of blocks down is excellent if you don’t mind eating plant-based sushi.  There's a good vegan Korean restaurant called Franchia Cafe on Park Avenue about 3 or 4 blocks away too.  Location was pretty good, fairly central but enough of a distance from Times Square.  Broadway theatres are about a 12 minute walk away.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"So-So \/ just by the means","lang":"en","publishedDate":"2022-05-25","publishedPlatform":"OTHER","rating":3,"text":"Look, staff is really great and the hotel has this wonderful clean aroma. \n\nBut other than that, rooms are super cramped. good luck if its 2 people. I was by my self and it was already cramped. House keeping is every 3 days so I had trash piled up in the garbage for days. I will give the rooms are somewhat \"modern\".\n\nI need a sepreate passage for the breakfast.. covid is almost done and they're still using covid as an excuse to not have a real breakfast. At the moment it is grab a paper bag and go, inside ... stuff you would find in a middle school. I'm sorry.  Plus why does it end at 9 am ? I missed the breakfast almost everyday because it was so early. For the price you're paying ... you can find better.\n\nHotel is really simple, no amenities like gym\/pool, or outdoorspace.\n- This is a hotel that really is just to get by your means.","travelDate":"2022-05","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excelente para pasar unos días. Excelente atención de los empleados. Lugar en el centro","lang":"es","publishedDate":"2022-05-07","publishedPlatform":"OTHER","rating":5,"text":"Excelente. Con las comodidades básicas. Excelente lugar para salir y estar a poca distancia de lugares especiales del centro \nEl desayuno y la limpieza diaria de la habitación quizá esté afectado por el protocolo COVID. Se podría re ver\n","travelDate":"2022-04","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Ewa&Jim in NYC","lang":"en","publishedDate":"2022-05-07","publishedPlatform":"OTHER","rating":4,"text":"Small hotel in convenient location. Breakfast ends at 9:00am. Since we were in the hotel about 12:30pm, we were asked and we agreed that for additional $25.00 we can check in earlier than the typical check-in time.\n\n","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Super nice staff, nice room, breakfast was a bummer","lang":"en","publishedDate":"2022-05-05","publishedPlatform":"OTHER","rating":4,"text":"The staff was incredibly helpful, and we felt right at home in our room. But we'd seen recent reviews that regular breakfast had started back up, but while we were there, they were handing out grab-and-go breakfast in a sack, and it was basically just all cheap sugar - otis spunkmeyer muffin, quaker oats s'mores granola bar, tropicana orange juice, and a fruit-cup (which is obviously packaged in sugar). I mean, that sack had to have 80 grams of sugar. It's a lot of stuff, I'll give them that, but no protein so for me anyway, it's not worth much in terms of energy when I'm about to go walk all day. Aside from that, the stay was awesome... hotel was very easy to access, very centrally located, very courteous and helpful staff.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Hotel Needs Work!","lang":"en","publishedDate":"2022-05-03","publishedPlatform":"OTHER","rating":3,"text":"Hotel refuses to serve breakfast following Covid-19 virus and only provides a “Grab and Go.“\n\n4 Day stay with no housekeeping.\n\nThus, no cream of any kind for coffee.\n\nRooms have no drawers of any kind for clothing.\n\nEmpire State View is top 20% of building with obsubstructed view while climbing over the bed with no opportunity to stand.\n\n","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Ottima struttura e posizione eccellente!","lang":"it","publishedDate":"2022-04-26","publishedPlatform":"OTHER","rating":5,"text":"Centrale ma silenzioso. Pulito e letto king molto comodo. Da non perdere le camere con vista sull’Empire State Building (un bel modo per coricarsi e per iniziare la giornata)! Personale gentile e discreto. Peccato solo per la colazione nel sacchetto da mangiare in camera a causa delle restrizioni Covid. Ma arriveranno tempi migliori! ","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Regular","lang":"es","publishedDate":"2022-04-21","publishedPlatform":"OTHER","rating":2,"text":"El hotel está muy céntrico.\n\nEn cuanto al desayuno buffet que pague, No lo hay. Deberian decirlo por adelantado que no disponen de buffet, ya que te dicen que es por el Covid y luego les ves a ellos sin mascarilla, mucho sentido no tiene. \n(Tienes que bajar cada día a pedirles el “desayuno” y te dan una mini bolsita con 1 muffin de plátano, agua, mini copa de fruta en almíbar y un yogur: malísimo).\n\nEn cuanto a a habitación, hay que decir que está limpio todo, lo único, que se les olvidó hacernos la habitación en 2 ocasiones. Lo dijimos. Y qué además, hay que decirles cada día, eso no me gusta mucho, no es cómodo.\n\nPor último, pese a que la habitación está bien limpia y decorada, recomendaría que cambiasen la habitación o al menos, a mi pareja y a mi no nos hizo mucha gracia. \nEstá por un lado el baño con solo una ducha y el bater, y por otro lado, en la habitación, junto a la cama, el espejo con el lavabo. No es nada cómodo y qué además, cada vez que te vas a lavar lo dientes o maquilar, te ven los vecinos, ya que las cortinas tampoco tapan. \n\n*Tampoco hay persianas, pero de esto no me quejo, ya que en EEUU quizás no las hay. ","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":19097786,"title":"Great Location","lang":"en","publishedDate":"2022-04-21","publishedPlatform":"OTHER","rating":5,"text":"So this little hotel is right in the middle of everything.  20 meters from 5th avenue and access to a lot of sights.\nIt is a small hotel, the room service is done every third day but you can access towels etc when ever you want.\nThe breakfast is a grab bag - due to Covid and this is a muffin, nut bar, yogurt, fruit and a drink. Coffee machine in your room with coffee and tea pods at your request and as many as you want. The room we had was not huge but a big comfortable bed and very nice sized bathroom. Free WiFi which was good.\nReally friendly staff and clean hotel. I would recommend and would visit again.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Avoid this Hotel","lang":"en","publishedDate":"2022-04-20","publishedPlatform":"OTHER","rating":1,"text":"The hotel owner\/manager is the most unkind and unfriendly manager I have ever encountered in a hotel. There is no concern for the customer's needs. Breakfast is a joke inside a paper bag you have to collect from reception and in a week the room was cleaned once. The only good thing is location, but there are several hotels around. I will never return to this hotel. ","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Localização ótima e confortável, café da manhã horrivel","lang":"pt","publishedDate":"2022-04-18","publishedPlatform":"OTHER","rating":3,"text":"Café da manhã horrivel, muffin de terceira, barra de cereal, um yogurt e uma aguá. Voce tem que pegar na recepção e levar p quarto, mesmo tudo funcionando normalmente em NY. Limpeza do quarto tem q pedir senão nem o lixo retiram, e check out é as 11 AM, paguei 50 dolares para ficar até as 2 e queria ficar até as 5 mas queriam me cobrar mais uma diária de 179 dol. Guardam as malas mas não tem banheiro \"utilizavel\", somente um no subsolo em área de lavanderia.","travelDate":"2022-04","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Very comfy.  Close to everything.","lang":"en","publishedDate":"2022-04-15","publishedPlatform":"OTHER","rating":5,"text":"The hotel is very well located. My friend and I feel very safe in the area. It is 1 block from the Empire States building and 7 minutes from Times Square. There are at least two metro stations nearby.\n\nThe room is small, but modern, comfortable and clean. The mattress is super comfortable.\n\nThe personnel is very friendly.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Short walk to Broadway!!","lang":"en","publishedDate":"2022-04-09","publishedPlatform":"OTHER","rating":5,"text":"Got in Friday morning, taxi to Hotel ($$$+tip) but, I would not have attempted to rent a car and drive us over an hour from JFK in NYC traffic!!  Consider it a worthwhile cost.  Hotel arranged a taxi to get us back to JFK, also (less$$+tip) but worth it.  Plenty of restaurants, walk down the block to 5th Avenue . . . short walk to Broadway . . . .  Hotel staff knowledgeable about the local restaurants, room was small, but sufficient for 2 people.  I did not like having the bathroom sink in the room, but heck, for 2 nights it was ok.  Saw the Lion King!  Spectacular!! Breakfast was \"bagged\", go to the lobby and request your bag!  Water, fruit, muffin, yogurt, coffee\/tea in room.  Free WIFI, good TV channel selection. oh, I forgot to mention,  the king bed was too big for the room, the side near the windows was so close to the wall that person had to shimmy down to the foot of the bed to go to the bathroom.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excellent Location","lang":"en","publishedDate":"2022-04-09","publishedPlatform":"OTHER","rating":5,"text":"I came into New York to visit family and friends. The hotel is excellent excellent location in Midtown not far from a lot of tourist destinations. Walking distance down to Rockefeller Center, Saint Patrick’s Cathedral  and of course the Empire State building and if he really want to do a little bit of shopping you’re not too far from Macy’s. It’s a subway ride over to Washington Square. You’re not too far from Times Square.","travelDate":"2022-04","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Hôtel datant de 2019 ! Vraiment bien","lang":"fr","publishedDate":"2022-04-07","publishedPlatform":"OTHER","rating":4,"text":"Chambre très propre. Petite mais confortable. Le cabinet de la salle de bain était dû côté de la chambre. Internet pas le plus rapide et mise à jour de la connexion sécurisée date de plus d'un an. Bien situé et bon rapport qualité\/prix. Idéal pour 1 nuit, max 2.","travelDate":"2022-04","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":19097786,"title":"THE WORSE HOTEL EVER TRIED IN 50 YEARS","lang":"en","publishedDate":"2022-04-07","publishedPlatform":"OTHER","rating":1,"text":"If you want to stay in a nice hotel in NYC, better to stay away from Wingate. Room was advertised in Booking.com as a 27-square meters one, it was not even a 20-square maters one.\nThey do not do room cleaning, with the excuse of Covid. They give you the breakfast in paper bags, to be eaten into the small room, with awful elements. Last but not least, they keep the luggage till 2 pm, forcing you to go around the city with bags in the afternoon. The worse hotel ever tried in my life.","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Small room without proper breakfast","lang":"en","publishedDate":"2022-04-06","publishedPlatform":"OTHER","rating":3,"text":"The staff was really nice and they kept our luggage safe both the first day before the check-in time and the last day after we checked out. The building and the room were modern, just a little tiny but I assume that's probably common in this part of the city. If you are lucky as we were and you get a room pointed south on one of the higher floors, you will have a great view of Empire State Building directly from your bed.\n\nWe chose this property because our reservation at another hotel was cancelled and this one was in the same location and promised similar experience (e.g. breakfast included) for just slightly higher price.\n\nHowever, we were very disappointed by what they advertise as \"breakfast\". Every morning, we could pick up a bag at the reception which included some light snack. It was something you could take with you when going for a walk in Central Park but definitely not something that would fill you up in the morning. A pandemic is not an excuse for this because we stayed in a different hotel a few days before and we had a buffet breakfast there. So just add $40 per day for breakfast for two to the price of this hotel if you really want to have breakfast every morning. (Andrews Coffee Shop is great by the way.)\n\nAnother problem was that they didn't clean our room during the whole stay. This would be ok if they at least picked up the trash because it was really smelly the very last day.\n\nAlso expect no sound isolation from the corridor and no wardrobe in the room.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Good hotel, great people.","lang":"en","publishedDate":"2022-04-02","publishedPlatform":"MOBILE","rating":5,"text":"Wingate New York is a wonderful small business hotel. Four rooms per floor, and maybe two dozen floors stacked to the sky.\n\nTiny but clean rooms are updated with comfy beds and resilient flooring. They do a nice job of maximizing space. Housekeeping service is every third day, so don't expect fresh sheets and towels every night. That's fine. I don't require it, and the front desk can accommodate any interim requests.\n\nIncluded breakfast comes in the form of a brown bag to-go - a granola bar, fruit cup, muffin and yogurt. Don't look for a waffle iron, at least until the pandemic subsides a bit more. It was small but perfectly adequate.\n\nEsteban at the front desk made the stay great. He was kind, helpful, and knowledgeable - the sort of hospitality professional one does not frequently encounter. Cheers to him. He's outstanding.\n\nSide note: If you're a Wyndham diamond member looking for perks and upgrades, Wingate is not a perk-y upgrade-y sort of place. I don't know if they even have suites. Still, the location can't be beat, the price is good, and the people are great. A-plus experience. Don't hesitate to book.","travelDate":"2022-04","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Modern and clean BUT zero flexibility","lang":"en","publishedDate":"2022-03-14","publishedPlatform":"OTHER","rating":3,"text":"I travel a lot for business between NY\/NJ and Europe. Several times a month. Been doing that for years so I've been to a LOT of hotel I'm the area.\nPros: very modern, newly renovated, clean everything, sleek & minimalist decor. Great view of the Empire State building.Very safe area close to everything touristy and business. Polite staff.\nCons: small room, no microwave (but fridge), no breakfast. They also charge 25$ for a checkout at noon (one hour later) which is completely outrageous. No other hotel does that. It's always complimentary!\n\nMy major issue is the lack of flexibility when it comes to the check-in rules. I had a prepaid reservation via Expedia but I had a last minute major issue on my business credit card caused by my previous hotel. Being overseas it was very impossible to solve the issue. They require 100 $ a night for incidentals and I was only staying one night. So I offered Selena (front desk agent) to make copies of my credit card infos and passport to let me check in. She refused and was willing to see me (also pregnant) go somewhere else despite me having a prepaid reservation.Zero willingness to work with the client and see what would benefit both of us.It had to be their rule or nothing. Never seen a hotel being that stuck and not willing to work with me despite the circumstances. Just for that I will never go back ever again. Better hotels with better customer service in NYC","travelDate":"2022-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Excelente ubicación","lang":"es","publishedDate":"2022-03-12","publishedPlatform":"OTHER","rating":5,"text":"Todo perfecto y habitaciones limpias. Muy amables en la atención. Destaco  las habitaciones con vista al Empire. Internet rápido. Excelente ubicación, cerca de todo. El desayuno es un poco chico pero no está mal. \n","travelDate":"2022-03","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":19097786,"title":"Excellent hotel with great staff and location","lang":"en","publishedDate":"2022-03-11","publishedPlatform":"OTHER","rating":5,"text":"This is a small hotel with a great staff, room, bathroom, location.  If you are visiting the Big Apple and you have to stay in a hotel with no need to spend a lot of money on your stay, this is the place to stay in.","travelDate":"2022-03","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"No es lo que dice en la web","lang":"es","publishedDate":"2022-03-10","publishedPlatform":"OTHER","rating":2,"text":"No linpieza de cuarto y venden la habitacion con desayuno y lo que te dan es algo NO saludable (muffin chocolate,jugo de naranja, mini mini granola, cocktail de frutas que es hiper dulce , ahh incluyen en bolsa (tenedor cuchillo sal pimienta🤷) y NO creo que el recepcionista tenga el permiso que exige sanidad para embolsar esos alimentos.  Deben advertir que es el desayuno para uno prepararse y es mas NO cobrar desayuno.","travelDate":"2022-03","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"New, clean, great location","lang":"en","publishedDate":"2022-03-03","publishedPlatform":"OTHER","rating":5,"text":"My room, with one bed, was very small, but laid out efficiently and fine for someone visiting mid-town.  The hotel is new, very clean, and the staff was exceptional.  You will not beat the price for this general area.  There was a bag continental breakfast, more than adequate.  Highly recommended.  ","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great Place at a Budget","lang":"en","publishedDate":"2022-03-02","publishedPlatform":"OTHER","rating":4,"text":"My stay here was great. Very good pricing for a few nights of stay. Place looked modern and was mostly clean. All of the concierges were amazing, especially Esteban. They always answered our questions, accommodated us in many ways as well. We are thankful that we picked this place. ","travelDate":"2022-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Buena opción para parar en pleno Midtown","lang":"es","publishedDate":"2022-02-05","publishedPlatform":"MOBILE","rating":4,"text":"Es un hotel chiquito, con ubicación excelente. En pleno Midtown. \nLas habitaciones son para dos personas, pequeñas pero bien aprovechadas. Camas muy cómodas. El hotel es súper pulcro, siempre perfumado.  \nRecomiendo las habitaciones que dan al frente. Desde el piso 5 hacia arriba se ve parte del Empire State. \nLas del contra frente, sobre todo los pisos bajos, son muy oscuras.","travelDate":"2021-09","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Eccellente hotel per visitare new york","lang":"it","publishedDate":"2022-01-27","publishedPlatform":"OTHER","rating":5,"text":"Ottima struttura, recentemente rinnovata e molto comoda per raggiungere il centro città a piedi, personale gentile e disponibile che ci ha addirittura permesso di fare il check-in e entrare in camera alle 12:30, all'interno delle camere pulizia perfetta, amenities come sapone e shampoo di ottima qualità e addirittura prodotti come crema corpo e balsamo a disposizione. letto comodissimo e vista ottima","travelDate":"2022-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great view of the Empire state Building","lang":"en","publishedDate":"2022-01-16","publishedPlatform":"OTHER","rating":5,"text":"The best experience was the professionalism of the front desk. Thank you to Esteban and Wilfredo for welcoming me and my family. The hotel is modern and very clean. The hotel is also in a great location for shopping, Broadway plays and Time Square.","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great Relaxing Stay","lang":"en","publishedDate":"2022-01-16","publishedPlatform":"OTHER","rating":5,"text":"Checked in Early with an Extra fee,Staff was Absolutely Wonderful Very Respectful and Helpful,Asked for a Room on the Upper Floor for some Quietness Since this was a Business\/Personal Trip Was Granted,Rooms are a Nice size for Two People,The Beds are Sooo Relaxing Pillows and Mattress are Soft and Comfortable,I booked an Extra Day because I felt Relaxed ,Great Choice I will be back soon ","travelDate":"2022-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Times Square ","lang":"en","publishedDate":"2022-01-14","publishedPlatform":"MOBILE","rating":3,"text":"Location is good, Not a good family size room when you have children 12 and 16. Plenty to see and do in the Garment District with sights and nostalgia within minutes walk. Customer service was very nice and helpful the room had a view of Empire State  Bldg, just smaller room than expected but it's in the heart of city so it makes sense","travelDate":"2022-01","tripType":"FAMILY"}
{"helpfulVotes":1,"locationId":19097786,"title":"Frozen hotel and no client service to help","lang":"en","publishedDate":"2022-01-08","publishedPlatform":"MOBILE","rating":1,"text":"There was snow outside and the room, with windows at ground level was frozen. There was only an air heater that was off until we arrived. We had to sleep with our coats. The bathroom had no heating installation at all. Really a nightmare. There was a guy at the reception completely overwhelmed with the situation and more people was complaining about for different reasons","travelDate":"2022-01","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great Location with comfortable stay","lang":"en","publishedDate":"2022-01-01","publishedPlatform":"OTHER","rating":4,"text":"Close to city attractions particularly Times Square, rooms although small but comfortable, clean bathroom with good utilities, breakfast needs to be looked into, hotel great for those who have not come with their car as it is close to convenient transportation. ","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Unfriendly Staff","lang":"en","publishedDate":"2021-12-26","publishedPlatform":"MOBILE","rating":1,"text":"Unfriendly rude staff. Regret for booking for a week. Great location and clean room but bad service.  Not a pleasant welcoming hotel.  Not worth for the money.  Room service every fourth night. Cheap grab and go breakfast. Most of the information online does not match. I regret my decision.","travelDate":"2021-12","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Très bon hôtel,très bien situé pour se balader dans New York,personnel accueillant et très agréable","lang":"fr","publishedDate":"2021-12-25","publishedPlatform":"OTHER","rating":5,"text":"Pratique car proche d’une ligne qui dessert tout le centre,propre et bien tenu,un bon rapport qualité -prix,Je remercie tout particulièrement José pour son accueil,notre séjour a été grandement facilité par sa gentillesse et sa disponibilité","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great location","lang":"en","publishedDate":"2021-12-23","publishedPlatform":"OTHER","rating":5,"text":"I was very impressed by the condition of the hotel and the location.  Very pleasant surprise for the price and availability. Staff was very friendly and the hotel was perfect for a night in the city. I would definitely recommend to others.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Do not stay here","lang":"en","publishedDate":"2021-12-22","publishedPlatform":"OTHER","rating":1,"text":"Rooms the size of Harry Potter’s closet under the stairs, No amenities including exercise venues, No real breakfast.  Extra charges for anything\/everything.  Unhelpful & grouchy staff.  I do not recommend this hotel","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Location and value","lang":"en","publishedDate":"2021-12-16","publishedPlatform":"OTHER","rating":5,"text":"Booked the Wingate by Wyndham using miles and money. The location was perfect for seeing all the Midtown Christmas sites. None of the \"must see\/do\" activities were more than a 15 minute walk. Front staff was very friendly. The building was very secure and we felt safe at all times.","travelDate":"2021-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Best choice for business on a budget near Times Square","lang":"en","publishedDate":"2021-12-12","publishedPlatform":"MOBILE","rating":5,"text":"Small hotel with small rooms but all renovated and modern rooms.  The hotel staff very friendly and responsive. In the grand scheme of hotels, I’m giving a 5 because it was clean, modern, had a decent sized bathroom with nice shower and great water pressure. Also a convenient short walk to Times Square. And when I think about the other hotels in and around Times Square, some of which I haven’t heard of, and some disgusting and old, this one wins by a long shot. Also the price a much better too. I’ll be back.","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":19097786,"title":"Terrible Customer Service - forced to pay even though cancelled","lang":"en","publishedDate":"2021-12-07","publishedPlatform":"OTHER","rating":1,"text":"The hotel blatantly refused to acknowledge expedia's 24 hour cancellation window. They also refused to acknowledge the trip insurance purchased through Expedia. They went ahead with a full night charge that I had to contest with the bank despite a cancellation over a day and a half in advance. There is such an abundance of quality hotels in Manhattan that honor same-week changes during these unprecedented times. Do not waste your time on this one.","travelDate":"2021-12","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":19097786,"title":"Great Stay!","lang":"en","publishedDate":"2021-11-10","publishedPlatform":"MOBILE","rating":5,"text":"Just had a two night stay but will definitely search for availability here on return trips.  Loved the small hotel concept with just four rooms to each floor of an 18 floor building.  They maximize the space and have updated it to be modern and chic.  I appreciated even the luxury vinyl flooring that will prove durable and more sanitary over time than carpet.  Loved touches like the abundant lighting and bonus was ample window with great sunlight and a view of the Empire State Building which was lit up to celebrate the reopening of international travel with colors of UK flag.  This brings up how centrally it is located in midtown with ability to walk down to Herald Square, the Empire State Building(checked out their new higher 100 something lookout) and  Koreatown where I had great Korean bbq outdoor complete with DJ!; then \nup to Bryant Square and over to Times Square and Broadway facilitating my seeing the fantastic Tina! The Tina Turner musical.  Finally and should have started her, the staff was wonderful, friendly and informative whether helping me to understand and navigate the city’s COVID protocols, printing out directions or just offering a friendly smile or even gentle reminder to wear my face mask when I neglected to from coming off the street.\n\nOverall a fantastic stay.  One con that seem to find at all hotels is the thin walls, doors or I think it might be ducting connecting the rooms because I hear the other people across the hall so much that thought they were in front of my door.  But it was generally quiet and I was so exhausted from all day excursions I slept like a baby on the very comfortable bed.","travelDate":"2021-11","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":19097786,"title":"Tiny rooms great location","lang":"en","publishedDate":"2021-11-09","publishedPlatform":"OTHER","rating":3,"text":"The hotel’s location is so great and the price we got was pretty good relative to other hotels nearby.\n\nThe room was tiny, so much so that when we bought an extra suitcase we had to store it in the bathroom.\n\nThe bed was comfy and the hotel was clean. There were only 4 rooms per floor so it was never a long wait for the elevators.\n\nThere is no full length mirror in the room and absolutely no space around the bathroom sink to put things down. We had to pick something out of the toilet that accidentally fell in because there is no place to put stuff.\n\nHot showers tend to be hit or miss depending on when you take them. Never a problem in the evening but  only lukewarm in the morning.\n\nAll of the above is minor and I probably would’ve still recommended the hotel, but we stayed  4 nights and never had maid service. We ran out of toilet paper, clean towels and constantly had to carry our garbage downstairs. They told us if we wanted a late checkout it would cost us $50 and they refused to hold our luggage because of covid.  Wyndham, you can do better than that.","travelDate":"2021-11","tripType":"FAMILY"}
{"helpfulVotes":0,"locationId":19097786,"title":"Hands down the best hotel","lang":"en","publishedDate":"2021-10-20","publishedPlatform":"MOBILE","rating":5,"text":"Everything was super clean. Very modern decor. Excellent customer service. Lovely staff. Definitely recommend. Easy access to all the tourist areas in midtown. Safety measures taken by the hotel is also a plus. Made me feel safe at all times","travelDate":"2021-10","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Comfort and Convenience","lang":"en","publishedDate":"2021-10-18","publishedPlatform":"MOBILE","rating":5,"text":"This is an excellent location to stay. The hotel is clean and recently remodeled. Rooms are small but this NYC.  The mattress is very comfortable and the room is easy to  organize for sight seeing and sleeping. Close to the theaters and Bryant Park and it has a view of the Empire State Building out the front door. Selena is the manager and is very helpful and competent. Great service!","travelDate":"2021-10","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Buena locación","lang":"es","publishedDate":"2021-10-15","publishedPlatform":"MOBILE","rating":4,"text":"El hotel está bien ubicado. Las habitaciones son pequeñas y están nuevas, la cama no es sommier pero aun así, muy cómoda. El desayuno, no es desayuno… meten un par de cosas en una bolsa y arréglate. ¿Sos vegano? sorry. ¿Sos celiaco? sorry ¿Alérgico a la lactosa? sorry.\nTampoco tiene microondas.\nEs ideal si viajas solo porque 2, se vuelve incómodo en la habitación.","travelDate":"2021-10","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":19097786,"title":"Great value gem for those who appreciate convenience and comfort","lang":"en","publishedDate":"2021-10-07","publishedPlatform":"OTHER","rating":4,"text":"As of Sep 2021, the place is PRISTINE. Friendly and helpful staff.\n\nThe rooms are small, but well configured. MINOR glitches include a TV that was NOT a smart TV and a lackluster continental breakfast.","travelDate":"2021-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":19097786,"title":"No lo recomiendo","lang":"es","publishedDate":"2021-08-29","publishedPlatform":"OTHER","rating":2,"text":"El hotel tiene buena ubicación . Nada más . Pero por mismo precio o un poco más fui a hoteles mucho mejor en la misma zona . La habitación es demasiado pequeña . No tienen limpieza diaria y el día que nos tocó (una vez cada 4 días )tuvimos que ir a recordar porque no habían realizado la limpieza y cuando la hicieron, fue muy superficial. Ni sacaron la basura . También vi un bicho en la cama . El desayuno es para  llevar con la excusa del covid hoteles d la zona si lo sirven ) . El día que llegamos no nos pudieron guardar el equipaje hasta la hora del check in , primera vez que me pasa eso. Poco amable el señor que nos atendió al llegar  y los otros dos señores si fueron muy amables. En resumen, no lo recomiendo .","travelDate":"2021-08","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Fine stay. Wifi doesn't work.","lang":"en","publishedDate":"2021-08-19","publishedPlatform":"OTHER","rating":4,"text":"Besides the wifi not working (on any of the four devices we tried) and a very weak signal for phone service since the room faced the backs of many buildings, we found the very small yet modern room 402 to be plenty for one night.  The room and all found in it appeared to be well-cleaned.  I appreciate the nice thermostat which had great A\/C for a day and night of excessive humidity.  The fridge was also a plus to store water, etc.  Well-stocked with towels and nice soap\/shampoo, etc.  We'll look into staying here again based on the low price, location, and clean\/modern feel inside.  Check-in was allowed just after 3pm (although it says it's supposed to be 4pm).","travelDate":"2021-08","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Loved it!","lang":"en","publishedDate":"2021-07-27","publishedPlatform":"MOBILE","rating":5,"text":"The experience was great! The staff was very helpful, the room had everything you need for a nice stay in the middle of Manhattan. Loved that they had a water fountain and all the measures to avoid spreading COVID-19. If I go back and the fares are still good, I’ll probably stay at the Wingate by Windham Midtown again.","travelDate":"2021-07","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":19097786,"title":"No Properly Working A\/C!","lang":"en","publishedDate":"2021-06-09","publishedPlatform":"OTHER","rating":1,"text":"I reserved a room using 60,000 of my Wyndham Rewards points to reserve a room for my daughter and her friends for her birthday from June 4, 2021 to June 6, 2021.  Upon checking in on Friday, June 4th and getting settled in their room, around 9:00 pm they called the front desk to inform them that the a\/c was not working properly.  Maintenance came to the room, did a temporary fix and all was fine until the middle of the night when the a\/c stopped working properly again.  The next day after being out in approximately 90 degree weather all day, they returned to their room around 8:30 pm to find the a\/c not working properly again.  They again called the front desk and maintenance came and did another temporary fix.  They were told that if it did not cool off in 30 minutes to call the front desk back.  They were told by the front desk that maintenance was no longer on the property.  So apparently, there is no on-call maintenance.  They requested another room with working a\/c but were told the hotel was completely booked for the night.  I also called the hotel to complain and was given the same information.  I requested a call from the manager for the next day, which I did not receive.  I called the hotel on Monday morning and spoke with Selena, the manager and told her about the issue and requested some sort of compensation for my daughter having to spend an entire weekend in a hotel room that did not have proper working a\/c.  She stated she would look into the matter and call me back the next day, however I did not receive a return call.  I called again and was told she was not on the property and that I would receive a return call.   I have still not received a return call.  I had to get my daughter and her friends another room in another hotel late Saturday night so that they would not have to spend another night in a room that was over 85 degrees!  So not only am I out of 60,000 reward points, I also am out $250 for another room in another hotel. I am completely dissatisfied with the service my daughter received and I am receiving in trying to resolve this issue.  I am a Club Wyndham Access owner and I expected better service and a better quality hotel and stay.  I am not sure if the service they received was due to them being three young black women and the assumption was made that they don't deserve a certain level of care, service and dedication but I am very unhappy with the service or lack of service we are receiving.  I would appreciate it if someone contacts me concerning this issue.","travelDate":"2021-06","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Great Hotel","lang":"en","publishedDate":"2021-04-10","publishedPlatform":"MOBILE","rating":5,"text":"I stayed at the Wingate as a long-term guest this winter while my apartment was being renovated. I can’t say more positive things about my stay. All of the staff made me feel comfortable and safe during this stressful time. They were very professional and helpful. Temperature was taken each time I entered the premises, rooms were very clean. Housekeeping was not daily but you could request as often as needed. Beds were very comfortable and it was quiet. Slept very well. Location is very convenient to shopping and transportation. I recommend this hotel and would happily stay here again.","travelDate":"2021-01","tripType":"SOLO"}
{"helpfulVotes":2,"locationId":19097786,"title":"No storing luggage before\/after checking out","lang":"en","publishedDate":"2021-03-19","publishedPlatform":"MOBILE","rating":2,"text":"I have been coming to NY almost every other week and trying out different hotels. Every hotel let me keep my luggage there after checking out....except this hotel. Very inconvenient. \n\nI stayed Made hotel and AC hotel two weeks ago. I arrived early both hotel but they let me check in early for free. That was very nice of them! Well... but Wingate hotel charged me $25. I guess I can’t complaint, the receptionist was just following rules. \n\nThe room was super small but clean. ","travelDate":"2021-03","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Amazing Place! Highly Recommended, Great Staff and Rooms","lang":"en","publishedDate":"2021-02-27","publishedPlatform":"OTHER","rating":5,"text":"This Hotel has been amazing for me, great area, great staff, very friendly, they made me feel safe. Truly recommend you staying at Wingate, the location is awesome, the Room is modern, clean, comfy, you can definitely rest and have a comfortable stay.\n\nI cannot stress more how much I recommend you staying at this place!!!\nAmazing!","travelDate":"2021-02","tripType":"BUSINESS"}
{"helpfulVotes":4,"locationId":19097786,"title":"Good spot.","lang":"en","publishedDate":"2020-11-18","publishedPlatform":"OTHER","rating":4,"text":"Like most of the hotels in this area, it's pretty cramped. But the space is well economized, as you'll see in the pics. There's really not much to speak of for amenities but it's lockdown in NY and it's tough to come by this kinda value. Also the walls are kinda thin, which is problematic if you are staying besides a loud drunk couple with mood swings. That being said, the staff breaks their humps to keep the place clean. \n\nBonus: You're right next to a German bier hall so go enjoy that while you're there.","travelDate":"2020-11","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Wonderful Experience Great Staff!","lang":"en","publishedDate":"2020-09-17","publishedPlatform":"OTHER","rating":5,"text":"I am a Platinum Member of Wyndham Hotels and Resorts. Also, I am a returning guest at Wingate by Windham New  York Midtown. I absolutely enjoyed my stay at this property as usual. The staff is very friendly and accommodating. The property is modern and immaculate. Very conveniently located. Several restaurants and convenience stores just blocks away.  I can't say enough great things about my experience at Wingate Midtown Hotel. I am certainly looking forward to staying there again.","travelDate":"2020-09","tripType":"NONE"}
{"helpfulVotes":2,"locationId":19097786,"title":"Terrible Service\/ Stay","lang":"en","publishedDate":"2020-07-24","publishedPlatform":"OTHER","rating":1,"text":"I Stayed at Windgate in midtown for 5 days no house keeping was available, my linen, and towels were never changed or restocked unless I called down and had to get them myself.It took 2 hours to ever get new towels, and sheets when I called for them. I got charged $54 for wiping my makeup on a towel when cleaning my makeup off in the shower. I was told I damaged the towel with makeup\" even though that's what towels are for to clean your body! Very unacceptable I have never had terrible service like this. I will be contacting cooperate their isn't a policy for Wingate saying \"you will be charged for towels if using them\" I WOULDN'T EVER RECOMMEND STAYING HERE! ESPECIALLY WHEN HOUSE KEEPING ISN'T AVAILABLE TO KEEP UP THE ROOM. I made sure to also take pictures of everything before I left which so glad I did.","travelDate":"2020-07","tripType":"NONE"}
{"helpfulVotes":3,"locationId":19097786,"title":"Cleanest hotel I’ve seen in the NYC ","lang":"en","publishedDate":"2020-07-07","publishedPlatform":"MOBILE","rating":5,"text":"Small room but clean, and comfortable. bathroom was amazing & the view was nice. Near two hot spots 42nd Street & 34th Street. Lady at the front desk was very nice and accommodating. Would definitely recommend. ","travelDate":"2020-07","tripType":"FRIENDS"}
{"helpfulVotes":2,"locationId":19097786,"title":"Hotel Excelente","lang":"pt","publishedDate":"2020-02-24","publishedPlatform":"OTHER","rating":5,"text":"Hotel novo, localização ótima, atendimento impecável, café da manhã muito bom, cama muito confortável, quarto com frigobar, microondas e cafeteira, poderia ter uma cadeira a mais, restaurantes para refeições rápidas e com bom preço próximo, na sexta avenida.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Amazing place","lang":"en","publishedDate":"2020-02-22","publishedPlatform":"OTHER","rating":4,"text":"The hotel staff are very attentive, polite and helpful, they made sure my check in was successful and were willing to help when I asked for any support. They went above and beyond for me! The hotel is extra clean, smells nice, and it has complimentary breakfast.","travelDate":"2020-02","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"cleaning just not happened","lang":"en","publishedDate":"2020-02-17","publishedPlatform":"OTHER","rating":3,"text":"we stay there 10 days and there no cleaning. The breakfast is just ok, and the room is good, in general we really like the hotel but the cleaning is a such of problem for 10 days, they just make the bed, nothing more.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"New Years in NYC","lang":"en","publishedDate":"2020-02-13","publishedPlatform":"OTHER","rating":5,"text":"We booked a Empire View Deluxe King room which I highly recommend. It wasn't huge but it was enough space for two people. The room was clean and the hotel has a great location. The breakfast area is small but we just took our breakfast to our room and it was no problem. Staff is friendly and helpful. It is very quiet. We never heard anyone else in the hotel.There is a bar next door and a CVS around the corner if you need anything of convenience.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Wonderful location near Empire State Building.","lang":"en","publishedDate":"2020-02-12","publishedPlatform":"OTHER","rating":5,"text":"Hotel stay was quiet and the room comfortable.  Perfect lite morning breakfast and friendly staff.  Checkin and checkout were very easy and staff thoughtful  and courteous.\n\nCould not have a better place near both Penn Station and Theatre District.","travelDate":"2020-02","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great location","lang":"en","publishedDate":"2020-02-09","publishedPlatform":"OTHER","rating":5,"text":"Nice hotel and very reasonably priced for the standard of property. Good range of breakfast items and cant fault anything about our stay. All the staff and management were friendly at all times and I would highly recommend this hotel","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":2,"locationId":19097786,"title":"Hotel is poor, people are nice","lang":"en","publishedDate":"2020-02-09","publishedPlatform":"OTHER","rating":3,"text":"Tiny rooms, VERY tiny breakfast hall, no lobby at all. Honestly disappointing. Breakfast is nice if you are the first sitting by one of the 5 tables: F-I-V-E. At least ppl working there are nice and with a good knowledge of the city.\n","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Estadía impecable","lang":"es","publishedDate":"2020-02-09","publishedPlatform":"OTHER","rating":5,"text":"Las habitaciones justas, pero el hotel es muy nuevo y esta ubicado en una zona inmejorable. El personal fue muy amable, siempre atentos al huesped. Lo unico que mejoraría es el desayuno, y el espacio ya que era pequeño. ","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":19097786,"title":"New York Experience","lang":"en","publishedDate":"2020-02-05","publishedPlatform":"OTHER","rating":5,"text":"Great, friendly staff. Rooms were on the small size, but very updated and clean. Staff was extremely helpful in holding our luggage until our room was ready and at checkout. Staff was very helpful in directions to various locations, subways and taxi service.","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Nytt hotell med sentral beliggenhet, rett ved 5th Ave.  Rent og pent.","lang":"no","publishedDate":"2020-02-04","publishedPlatform":"OTHER","rating":4,"text":"Beliggenheten var veldig grei og sentral - uten støy. Hotellet var nesten helt nytt og alle fasiliteter fungerte. Ikke de største rommene, men til å ligge på Manhattan, så var det helt greit. Resepsjonen var betjent hele døgnet, noe som gjorde at det var veldig trygt. God service av betjeninga. Og lukta, det var ei nydelig lukt når du kom inn i hotellet. Da vi kom ut av hotellet, kan du faktisk se øverste del av Empire State Building - som ligger 2 gater bortforbi.","travelDate":"2020-01","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Valuta för pengarna","lang":"sv","publishedDate":"2020-02-04","publishedPlatform":"MOBILE","rating":4,"text":"Vi bodde på hotellet i två nätter och var väldigt nöjda. Rummet var litet men nytt och fräscht. Utsikten var inget att hurra över inåt mot ett shakt, men det var åtminstone tyst. Sängen, lakanen var ypperliga. Duschen hade bra tryck och vattnet var mer än tillräckligt varmt. Frukosten helt ok och servicen fungerade fint, speciellt Franklin var glad och hjälpsam. Pga att hotellet var litet behövde man aldrig vänta på hissen. Till sist men inte minst; läget var perfekt!\n\nKommer gärna igen! ","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"I highly recommend this hotel to all my friends and family.","lang":"en","publishedDate":"2020-01-31","publishedPlatform":"OTHER","rating":5,"text":"Comfortable pillows and king size bed. This is a brand new hotel. Everything smells good and sparkling shiny in here! Wooden floor room - not carpeted (I actually prefer it that way). I got the regular room ($95\/night) and it has a substantial size TV, microwave, fridge, coffee maker, hair dryer and garment steamer!! Free strong WiFi signal and decent breakfast. Attentive, knowledgeable & friendly staff. This was my first time staying in this hotel chain. I’m kind of a hotel snob (my husband and I are Marriott Bonvoy Lifetime Elite and Hilton Diamond Elite). I truly did not expect much because of the price but I’m completely blown away! I tried this hotel because of other good reviews. And, I must say that I will definitely be back again whenever I’m in NYC! Thank you! And good job! ","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Vacaciones Enero New York","lang":"es","publishedDate":"2020-01-27","publishedPlatform":"OTHER","rating":4,"text":"Me he alojado con mi amiga durante 9 dias, el hotel esta muy bien ubicado, buen desayuno y habitaciones nuevas y limpias.Lo mejor del Hotel es Franklin,uno de los trabajadores; nos atendio de forma extraordinaria, muy amable, servicial y gracias a el tuvimos una estancia estupenda.\nMuy recomendable","travelDate":"2020-01","tripType":"FRIENDS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Mini break","lang":"en","publishedDate":"2020-01-20","publishedPlatform":"OTHER","rating":4,"text":"The hotel staff were very welcoming. The location was excellent. The rooms were clean and beds comfort but be aware that the rooms are very compact. No separate wardrobe only hanging space. There was no comfy chair in the room only an office chair","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Private Sachen sind aus dem Zimmer verschwunden nachdem die Reinigungskräfte drin waren","lang":"de","publishedDate":"2020-01-16","publishedPlatform":"OTHER","rating":1,"text":"\nNachdem am dritten Tag die Reinigungskräfte in unserem Zimmer waren, ist meine private Decke die ich mit gebracht habe verschwunden. Und wurde nicht wieder gefunden, es wurde keine alternative angeboten. \n\n","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":2,"locationId":19097786,"title":"Our NYC stay","lang":"en","publishedDate":"2020-01-14","publishedPlatform":"OTHER","rating":5,"text":"Very unusual Hotel.  18 floors with only 4 rooms per floor.  veru clean.  Friendly staff that went out of their way to make our stay enjoyable. Hotel near all of the main attractions, Tmes Square, Harolds Square(Maceys).","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":19097786,"title":"Ottimo rapporto qualità\/prezzo in Nyc","lang":"it","publishedDate":"2020-01-11","publishedPlatform":"OTHER","rating":5,"text":"Posizione eccezionale in piena Midtown tra la 5a e la 6a. Broadway comodissima Metropolitana a 2 min.\nLa struttura è bella e pulita.\nLe stanze sono piccole ma complete di tutto.\nIl personale è molto cordiale e disponibile.","travelDate":"2020-01","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"Amazing location","lang":"en","publishedDate":"2020-01-08","publishedPlatform":"MOBILE","rating":4,"text":"Amazing centrally located hotel; nice staff, clean rooms and brand new facilities. \nWe could easily walk everywhere and the rooms were quiet and the beds super comfortable.\nWe didn’t like the lack of a hall, common space where we could relax and spend some time with our friends at the end of our busy days...the rooms are too small to let people in or just relax. They could have let us use the breakfast room, but refused every time we asked. Given the lack of a hall\/common lounge space they really should reconsider leaving the breakfast room open at all times, no effort at all for the hotel to allow that and the guests would highly appreciate.\nThe breakfast room is too small and several people are forced to take breakfast to their rooms.\nThey should consider giving up a floor of rooms in order to give space to a decent-sized breakfast room and a lounge area\/hall","travelDate":"2020-01","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"Wingate is a Winner","lang":"en","publishedDate":"2020-01-07","publishedPlatform":"OTHER","rating":5,"text":"Our most recent trip to NYC was for the New Year's Eve celebration. We were able to book four nights at this hotel for a reasonable cost, considering the time of year. The hotel is brand new, from the bottom up, and has only been open for a few months. It was very clean and modern, and smelled wonderful! The room was small, but having stayed in other hotels in NYC, we expected this. After a long day and evening out, the amazing shower (rain shower head) and the incredibly comfortable bed was very  relaxing! The hotel does not have a restaurant or bar, but there are many within an easy walk. The hotel was conveniently located, close to metros and many of the popular stops. The staff was friendly and helpful, especially Esteban, who always seemed to be at the front desk when we returned in the evenings!","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":3,"locationId":19097786,"title":"Very near to Times square NYC","lang":"en","publishedDate":"2020-01-02","publishedPlatform":"MOBILE","rating":5,"text":"Very near to Times square NYC, i like this hotel, because of the location, near to the shopping center, also near to Times square NYC, very comfort and clean. I stay at the room which has terrace in it, so i can see the view of NYC city.","travelDate":"2019-05","tripType":"SOLO"}
{"helpfulVotes":0,"locationId":19097786,"title":"Dec 25th","lang":"en","publishedDate":"2019-12-25","publishedPlatform":"OTHER","rating":5,"text":"This hotel has moved to 37th st and has been open only 3 months. This facility is excellent, only 74  ultra modern rooms in a great location. The breakfast was above average. They have arrangements for parking  on 38th st  garage for a fee. Close to everything by walking. Definitely staying here on my next trip to NYC.","travelDate":"2019-12","tripType":"NONE"}
{"helpfulVotes":2,"locationId":19097786,"title":"Holiday in NYC","lang":"en","publishedDate":"2019-12-20","publishedPlatform":"MOBILE","rating":5,"text":"Found this hotel online convenient location off fifth Avenue short walk to Times Square. What we were expecting was an outstanding staff, very clean and delicious morning breakfast, which is included. Yes the rooms are small but very clean. The staff is over-the-top friendly. A sidenote it is right next-door to a very nice German beer Hall good food and beer.","travelDate":"2019-12","tripType":"COUPLES"}
{"helpfulVotes":0,"locationId":19097786,"title":"AMAZING SERVICE!","lang":"en","publishedDate":"2019-12-09","publishedPlatform":"OTHER","rating":5,"text":"We stayed for a long weekend in December and this hotel exceeded our expectations. We flew in on a red eye from California they were able to allow us to leave our bags, tour the city and check in hours early. The staff was beyond helpful especially Esteban. He went above and beyond to answer all of our questions, provide us with restaurant recommendations and allowed us to check out late. The room was spotless, beds were beyond comfortable and it was very quiet. The location is ideal half a block from 5th Avenue numerous eateries within walking distance. We will absolutely stay here again. Thank you Esteban for your exceptional service!!","travelDate":"2019-12","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":19097786,"title":"Beware","lang":"en","publishedDate":"2019-12-05","publishedPlatform":"OTHER","rating":1,"text":"Due to the snow storm over the last several days we were unable to travel to airport in order to get to NY and therefore had to cancel our flight and hotel reservation. The room charge of $426.93 for one night was non refundable. I requested a refund from the hotel, due to extenuating circumstances, completely out of our control, yet they refused to issue a refund or even a credit.  This type of customer treatment unprofessional and insulting at best.","travelDate":"2019-12","tripType":"BUSINESS"}
{"helpfulVotes":2,"locationId":19097786,"title":"Best service","lang":"en","publishedDate":"2019-12-04","publishedPlatform":"MOBILE","rating":5,"text":"Great location. Very clean.\nThe stuff were very helpful but especially Franklin did his very best to answer many questions and supported us very much.\nPeople like him make me want to come back to this hotel!\nI recommend this hotel very much.","travelDate":"2019-12","tripType":"FRIENDS"}
{"helpfulVotes":3,"locationId":19097786,"title":"NEW YORK","lang":"en","publishedDate":"2019-12-03","publishedPlatform":"OTHER","rating":1,"text":"Hi everyone, my wife and I stayed at the hotel from 11\/20\/19 to 11\/28\/19 I booked a double room for 8 nights at the modest price of $ 1681.00 including breakfast, the room  it was supposed to be 28m2 and when I arrived there were two suitcases, measured the room was 10.21m2 less than half and think that I had chosen specifically for the size, sink in the room, bathroom and separate shower, air heating  not modulable little comfort dry air, non-existent common spaces only at the reception sofa for 3 people, room for small breakfast, and from 07.00 to 08.00 impossible to sit breakfast even if abundant poor.  How does a hotel not have a thermometer, a paracetamol for fever or an anti-inflammatory?  An umbrella?  Before booking, ask for the size of the room and see if you like it.  Friendly and helpful staff.  Reception boys forced to stand without a chair all night for 8 hours.  Don't be fooled by the photos.","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":2,"locationId":19097786,"title":"My new go to in midtown Manhattan","lang":"en","publishedDate":"2019-11-28","publishedPlatform":"MOBILE","rating":4,"text":"I've now stayed twice at this new hotel in mid-town Manhattan.  Great location for offices and Bryant Park, reasonably priced for NYC, nice (albeit small) rooms and wonderful staff.   Only 4 rooms to a floor so elevators are quick and never crowded and the free breakfast includes real eggs. A few new hotel wrinkles to iron out like navigating the TV and turning the shower on but those are minor.  And some of the rooms have a view of the Empire State Building.","travelDate":"2019-11","tripType":"SOLO"}
{"helpfulVotes":1,"locationId":19097786,"title":"Fabulous","lang":"en","publishedDate":"2019-11-21","publishedPlatform":"MOBILE","rating":5,"text":"Stayed at this relatively new hotel for 5 nights. Can’t praise the staff highly enough for their professionalism and friendliness. \nBedroom was small however had everything we needed. The bed was super comfortable. The hotel and room were spotlessly clean. Would highly recommend. \nLocation is excellent near all of the main sites yet on a quieter street. \nNo nasty hidden charges and complimentary breakfast every morning. \nBest of luck to the staff who are doing an excellent job.","travelDate":"2019-11","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":19097786,"title":"Family","lang":"en","publishedDate":"2019-11-12","publishedPlatform":"OTHER","rating":5,"text":"Selina was incredible! The customer service was outstanding. Friendly, clean, so helpful! Amazing staff and great rooms! Wonderful breakfast. We’ll stay here again and again!! This hotel is small but it makes us fill at home as a result!!!!!!","travelDate":"2019-11","tripType":"FAMILY"}
{"helpfulVotes":2,"locationId":19097786,"title":"Consigliato! 2 passi dal centro della Big Apple ...","lang":"it","publishedDate":"2019-11-06","publishedPlatform":"OTHER","rating":5,"text":"Struttura nuova e accogliente. Le camere piccole ma complete di tutto ciò che serve per il soggiorno (oltre la macchina del caffè e il ferro da stiro) e nonostante la centralissima posizione molto silenziose. Posizione ottima vicino alla metro e alle principali attrazioni (Time Square, Empire State Building, Fifth Avenue, etc). Colazione inclusa nel prezzo essenziale ma buona e completa per iniziare la giornata. Personale gentilissimo e disponibilissimo. Consigliato soprattutto per ottimo rapporto qualità-prezzo","travelDate":"2019-11","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great Location","lang":"en","publishedDate":"2019-11-01","publishedPlatform":"OTHER","rating":5,"text":"Position was amazing, and hotel staff were very welcoming and friendly. Rooms were clean and I had no problems with it. Everything seemed very new. I had a late flight and hotel staff had no problems accommodating me.","travelDate":"2019-09","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Hotel novo","lang":"pt","publishedDate":"2019-10-23","publishedPlatform":"MOBILE","rating":4,"text":"Este hotel não é suntuoso, mas é novo, muito bem localizado , quartos pequenos porém funcional. Cama e banho bons, box de tamanho razoável. Café da manhã de cortesia muito bom. Se você é daquelas que viaja com malas grandes , vai achar o quarto apertado . Para mim, achei perfeito.","travelDate":"2019-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":19097786,"title":"good location and comfortable hotel for price","lang":"en","publishedDate":"2019-10-18","publishedPlatform":"OTHER","rating":4,"text":"We arrived  before our room was not ready so went out to enjoy the city and we got back to the hotel around 8 PM.  As we checked in I confirmed that we are in our requested king deluxe but for some reason we were in queen. Fortunately I booked through the Wyndham website, showed him our reservation details and after several minutes of waiting they put us in the correct room The king deluxe was a nice size room  for NYC and well designed. Bedding and mattress are very comfortable; air conditioning was quiet (compared to other hotels). The two areas that I would not give a high grade to were the shower and the breakfast. Maybe because we were on a high floor but we had to wait and wait for hot water to come out of the shower head. In addition there are two controls that are exactly alike - one for the temperature and one for the two shower heads ,  so it took a while to figure out which one worked which and which direction to turn- just poorly designed. As for breakfast, during the week it ends at 9 AM. Why?? I don’t know but it is not worth  rushing down for. Pastries look like they were industrially made, fruit was not ripe, coffee tasted burnt. Being a former NYer I knew if I wanted to get a healthy breakfast to walk to the corner to the deli and get an egg on roll and toasted corn muffin. Best part of the hotel is the location. If you have any business in midtown or want to be near Times Square but away from the crowds this is a great location. Subway stops are close by, there is a City Bike rack on the corner (only advise to use if you are extremely confident in riding though city streets with trucks and taxis making turns and suddenly stopping).  I would recommend this hotel for the right price. When I did research  depending on the night pricing can go from $159- $469. At anything less than $325 you re getting a good deal for a NYC hotel room.","travelDate":"2019-10","tripType":"BUSINESS"}
{"helpfulVotes":0,"locationId":19097786,"title":"A Good Stay","lang":"en","publishedDate":"2019-10-17","publishedPlatform":"OTHER","rating":4,"text":"My Daughter and myself had a good time in NY staying at the hotel \nNew and very efficient although the rooms are on the small side.\nThe Staff make a big difference to the overall experience and Special mention to Dawnovan and the breakfast lady who always serves us with a smile.\nHotel tried to meet our needs and Dawnovan Front office manger is an asset to the Hotel\nKeep up the good work!","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":1,"locationId":19097786,"title":"Great hotel","lang":"en","publishedDate":"2019-10-13","publishedPlatform":"OTHER","rating":5,"text":"The staff at this hotel are amazing, kind and so accommodating.  The rooms are small but still flow.  I could see the empire state building from my room.  It is located between 5th and 6th ave and is close to the subway, food and Bryant park.  We will definitely stay here again.","travelDate":"2019-10","tripType":"COUPLES"}
{"helpfulVotes":1,"locationId":19097786,"title":"New Favorite","lang":"en","publishedDate":"2019-10-09","publishedPlatform":"OTHER","rating":5,"text":"I stayed at the Wingate by Wyndham on 37th.  This hotel is BRAND NEW!!!  The rooms are small but truly efficient for the seasoned traveler.  The rooms are played out in such a way that you can easily sleep and not bump into things at night.  And the room amenities are easily accessible; Keurig machine, safe and fridge all are new and fully functional.   The staff are amazing as well, Estabon and Selina are very welcoming and wanting to assist in any way.  I will definitely stay here again without hesitation.","travelDate":"2019-10","tripType":"BUSINESS"}
{"helpfulVotes":1,"locationId":19097786,"title":"Customer service is the worst i've ever experienced","lang":"en","publishedDate":"2019-10-08","publishedPlatform":"OTHER","rating":1,"text":"I booked last minute while waiting to board my flight at Chicago airport. Unfortunately my flight to New York was cancelled due to bad weather. I thought, Wyndham is a good brand, they will understand the unfortunate situation and provide a small concession given the circumstances.\nI was dead wrong... They refused to communicate and when they finally got around to me they charged me the full $159. I only held a booking for about 2 hours before cancelling!\nIn addition the general manager was very rude and dismissive. I would not expect this terrible service at a 1 star hotel, and definitely not an established brand, extremely disappointed to say the least.","travelDate":"2019-10","tripType":"NONE"}
{"helpfulVotes":0,"locationId":19097786,"title":"Great Hotel for Solo Traveler","lang":"en","publishedDate":"2019-10-02","publishedPlatform":"OTHER","rating":5,"text":"The Wingate just opened the last week in September 2019.  As the hotel is brand new, all furnishings are immaculate.  Typical NYC hotel room (small), but thoughtfully laid out. I was in town for 4 days on business and this hotel was perfect for me.  Free wifi\/high speed internet, so no issue with streaming or working on a laptop.  Excellent location close to subway stops\/Times Square\/Bryant park.  Staff was very attentive.  Will definitely come back!","travelDate":"2019-09","tripType":"BUSINESS"}
